[{"company": "adklix", "job": "Junior Art Director", "city": "Raanana", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=00000186313a3a8c93fc7385b1893cab&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e7fd3c0f&cb=1676382560464&jobListingId=1005649432555&jrtk=3-1-1gp82vo1kitm9801-1goojkema28d0000-d08c57b228bd4a82-", "description": "Responsibilities:\nWe are seeking a Junior Art Director to join our team and assist with the development of advertising assets for a wide range of industries. The candidate will have 2-3 years experience and must be conceptual, collaborative, strategic, and capable of crafting big ideas and experiences, and executing them across all channels (direct mail, digital print, video, social media).\nIn addition, the ideal candidate will possess a true passion for, and understanding of, what drives consumer behavior.\nThis will be a full-time position.\nRequirements:\n\nGreat design skills with a sense of design, composition and color\nAbility to work quickly and create many different looks\nProficiency in Photoshop, Illustrator, and other design tools\nBachelor’s degree (four-year degree) from a well-known institutio\nCandidates must submit a link to their work when applying.Show more Report"}, {"company": "", "job": "Digital Management Assistant", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186313a3a8c93fc7385b1893cab&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_560f874e&cb=1676382561719&jobListingId=1007163581270&jrtk=3-1-1gp82vpc3itlo801-1goojkema28d0000-a3a17fbbefe2138a-", "description": "Want to get in on the ground floor with a small but growing art marketing company that is launching another exciting business line? Because you are an organized self-starter, a quick learner, and have a knack for internet and social media, we want you to help us methodically grow the business. You have other time-consuming things going on in your life right now, which is just perfect for us. You will start with a limited number of hours with maximum flexibility as you work from home.\nAs our Digital Management Assistant, you will:\n\nTake care of our internet sites and social media platforms.\nLead the creation of our visual and textual materials for organic and paid promotions.\nCreate and manage our campaigns with social media and Google.\nOrganize and manage sales leads and follow-up.\nProvide executive assistance and administrative support.\n\nRequirements:\n\nStrong organizational skills\nExcellent internet and social media competencies\nMother-tongue English (no Hebrew is required)\nFlexible hours\nSuitable Work-from-Home environment\nGood to have: Sales/customer service background, graphic design or content writing experience, other languages, and/or familiarity with CRM programs\n\nDetails :\n\nInitial Hours: 2 hours/day, expected to grow quickly to a 20 hours/week and more. Israeli daytime hours, with some evening hour work.\nBase Salary: 31 NIS/hour + incentives that should more than double your base after a few months of excellent performance.\n\nSend your CV today to: avinoamcohen99@gmail.comShow more Report"}, {"company": "Mobileye", "job": "Junior C++ Developer", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186313a3a8c93fc7385b1893cab&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4f78c3ec&cb=1676382562999&jobListingId=1008356388344&jrtk=3-1-1gp82vqjskclr801-1goojkema28d0000-a0b3d33cf9e0999b-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhich team will you join?\nMobileye is the world leader in automotive and driving assistance systems, developing the world's most advanced software technologies and hardware architectures.\nOur group is located in Haifa and is responsible for enabling deep learning and computer vision algorithms on the Mobileye platform.\nWe develop the software architecture system and tools to enable state-of-the-art algorithms to run efficiently in vehicles – contributing to saving lives and enabling autonomous vehicles.\nWe use cutting-edge technology stack and design methodologies, to achieve optimized and robust solutions in order to support different customers across the globe.\nCheck out our technology in action: https://www.youtube.com/watch?v=50NPqEla0CQ\nWhat will your job look like:\nAs a C++ developer, you will join the Mobileye Application team, a new forming team in Haifa. This is an exciting opportunity to write and design an application from scratch!\n\nThe car application controls the main execution flow of various software components running of Mobileye chip, in addition it also controls many sensors and manage their inputs, sensors such as camera, lidar, radar, car signals (speed, etc.)\nThe application combines all the different inputs and feeds them into the different algorithms, in order to create a worldview for the car.\n\nThe project is challenging both in its real-time complexity of a system with multiple various sensors and being of part of overall automotive car system architecture.\nDoing all of that while working on highly optimized and well-designed software.\nThe main application is developed in C++ for Linux.\nAll you need is:\nBSc/MSc in Computer Science/ Electrical Engineering with computer science chain\nKnowledge of C/C++ with practical experience - significant Advantage\nOOP basics\nGit/Linux basics\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "CPS Jobs", "job": "Junior c/c++ Developer!", "city": "Southern", "date": "30d+", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186313a3a8c93fc7385b1893cab&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9a43c02b&cb=1676382564387&jobListingId=1007017790874&jrtk=3-1-1gp82vrv8i6gs801-1goojkema28d0000-634f71f95edbe888-", "description": "תחום:\nA leading company is looking for an exceptional university graduate, born to develop the system, to join one of the development teams.\nThe main challenge in this position will be to quickly and thoroughly understand new technologies and systems.\nResponsibilities:\nUnderstanding the product/system requirements.\nIntegrating state-of-the-art and innovative solutions.\nArchitecture and design of the solution.\nDeveloping the solution in C/C++.\nTesting and integration.\n\nדרישות:\nBSc in Computer Science or equivalent.\nGood knowledge of C/C++.\nGood knowledge of operating systems concepts.\n\nאיזור: השפלהShow more Report"}, {"company": "InspHire", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "5.0", "link": "", "description": "A TLV-based startup that’s on a mission to change the work experience for 80% of the world’s global workforce is looking for a talented, experienced and creative Art Director with managerial experience to build creative capacity at scale within the company.\n\nApply here to help shape the future of work!\n\nAbout This Role:\nAs an Art Director you will develop and execute a creative strategy to meet the company’s business goals and support its growing marketing efforts. This includes establishing the studio in-house to support all creative needs. Focus areas cover motion graphics, directing photo and video shoots, illustrations, website, landing pages and the creation of digital assets at scale, OOH marketing and traditional marketing.\nOwnership & Responsibilities:\nRecruit and operate an in-house studio\nCraft a creative business strategy aligned with business goals supporting an ever-growing marketing budget across multiple channels (acquisition oriented)\nLead the marketing creative team and manage the creative process from A to Z, collaborate with the Content, Marketing and Product teams\nSet the visual tone/direction of campaigns to build concepts and bring them to life\nResponsible for delivering marketing assets at scale for a variety of channels: banners, landing pages, video ads, newsletters, blogs, social posts, etc.\nTurn creative briefs into beautiful marketing assets\nPrioritize projects and work on tight deadlines\nBe on top of the marketing assets performance, initiate data-driven AB tests and always strive to improve conversion rates\nWork closely with external vendors, stakeholders and partners\nQualifications:\nProven experience in building and managing a studio / a significant creative team\n5+ Years of experience as a designer or related positions in a marketing agency - a must\nExperience with motion graphics, directing video shoots, and digital marketing assets\nTeam player with the ability to work with strategists, data scientists and account teams in a fast-paced environment\nUnderstand how to scale ideas for global deliverables\nExperience designing for different audiences (B2B, consumer, enterprise)\nPossess strong art direction/design skills\nFollow brand guidelines and work within a design system\nProven experience working across teams, both in leading projects, and collaborating on work\nAttention to details and high sensitivity to aesthetic\nCritical thinking and storytelling skills\nExcellent communication skills, both verbal and written\nFamiliarity with online marketing metrics\nPortfolio of beautiful, compelling digital and brand-oriented workShow more Report"}, {"company": "Clarivate", "job": "", "city": "Jerusalem", "date": "", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=343&guid=00000186313a3c7690f91a7a01e5c880&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_8bf19306&cb=1676382567062&jobListingId=1008430435452&jrtk=3-1-1gp82vuivi3b6801-1goojkfiii7l8800-aee013221725c25b-", "description": "EX LIBRIS– Who are we?\nEx Libris, Part of Clarivate, is a global EdTech (Education Technology) industry, leader. We serve some of the most prestigious academic institutions and research Universities around the world, with a total of over 7,500 customers in 90 countries.\nOur SaaS solutions help universities transform academic libraries, maximize the impact of research activities, enhance teaching and learning, and drive student engagement and success. For more information about Ex Libris, see our website, and join us on Facebook, YouTube, LinkedIn, and Twitter.\nWe are looking for a Product Manager to join our Cross Products Team in Jerusalem. This is an amazing opportunity to work on bringing Linked Data into the Top Academic Libraries in the world. The team consists of five people and is reporting to the Director of Cross Product and Operations. We have a great skill set in SaaS products and we would love to speak with you if you have skills in building data-driven products.\nAbout You – experience, education, skills, and accomplishments\nBachelor’s degree in one of the following fields: Information Science, Data Science, Computer Science, Industrial Engineering, or Exact Science or equivalent education\nWork experience in your field, plus 1-2 years as a product manager\nStrong understanding of complex computers systems in a cloud environment\nStrong orientation for all aspects of data – analysis, modeling, scale, advanced processing\nExperience managing basic customer questions and concerns for their product(s).\nAbility to collaborate across teams to manage product development.\nExcellent English\nHas a working understanding of business drivers and key issues.\nMust possess the ability to gain domain knowledge in the position.\nIt would be great if you also had . . .\nProfessional experience in a library setting.\nMBA\nMLIS - Master of Library and Information Science\nWhat will you be doing in this role?\nProduct Requirements – Provide clear and measurable product requirements and make trade-off recommendations between implementation and functionality.\nProduct Delivery – manages the development and launch of new features and functionality through the entire product development lifecycle process from concept through implementation and release. (For full product, or significant product features)\nCustomer Research – Participate in leading focus groups, customer surveys, and user testing to inform product priorities. Monitors key product analytics to inform development priorities.\nProduct Roadmap – Under direction, understands market priorities and works with Engineering to identify trade-offs. Drives activities/user store products and deliver the product to market t, according to product roadmap. Prioritizes and sequences product features to meet market demands.\nProduct Strategy - Internalize product strategy such that it informs market requirements and feature prioritization.\nThe product you will be developing\nLinked Data is a new technology we would like to leverage across the core products of Ex Libris, Alma, and Primo. Using this technology, we want to provide a whole new end-to-end experience from a global collaborative cataloging platform through the best-in-class library management system over the cloud (Alma) to the robust discovery system (Primo). We aim to utilize this new way of working with the data as a graph database, integrated with new AI services.\nThis is a long-term area that is at the core of Ex Libris's strategy.\nAbout the Team\nThe cross-products and operations team has five people working with multiple product managers and development teams in various areas such as UX and Accessibility, Analytics, Security and Privacy as well as core features of the Higher Education Platform. These people are veterans in their areas and work collaboratively within the team and externally including other groups from the wider cooperate of Clarivate. The people on the team are based in Israel.\nHours of Work / More important information for you:\nOur base is in the Jerusalem, Israel office, working in a hybrid model\nThis is a full-time position.\nOccasional travel is required.\nWhy Ex-Libris?\nAt Ex Libris, we value our employees and are striving to create the perfect balance between work and home life. Join us to be part of a family-like environment; enjoy our unique culture and benefits. Be part of a thriving, productive community helping change the future of higher education with the state-of-the-art technology from Ex Libris.\nAt Ex Libris, we work hard and have fun doing it!\nAt Clarivate, we are committed to providing equal employment opportunities for all persons with respect to hiring, compensation, promotion, training, and other terms, conditions, and privileges of employment. We comply with applicable laws and regulations governing non-discrimination in all locations.Show more Report"}, {"company": "CytoReason", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "4.2", "link": "", "description": ""}, {"company": "adklix", "job": "", "city": "Raanana", "date": "", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=343&guid=00000186313a3c7690f91a7a01e5c880&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_733c0d86&cb=1676382570644&jobListingId=1005649432555&jrtk=3-1-1gp83022akcmp801-1goojkfiii7l8800-d08c57b228bd4a82-", "description": "Responsibilities:\nWe are seeking a Junior Art Director to join our team and assist with the development of advertising assets for a wide range of industries. The candidate will have 2-3 years experience and must be conceptual, collaborative, strategic, and capable of crafting big ideas and experiences, and executing them across all channels (direct mail, digital print, video, social media).\nIn addition, the ideal candidate will possess a true passion for, and understanding of, what drives consumer behavior.\nThis will be a full-time position.\nRequirements:\n\nGreat design skills with a sense of design, composition and color\nAbility to work quickly and create many different looks\nProficiency in Photoshop, Illustrator, and other design tools\nBachelor’s degree (four-year degree) from a well-known institutio\nCandidates must submit a link to their work when applying.Show more Report"}, {"company": "Natural Intelligence", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "4.1", "link": "", "description": "Founded in 2009 and 100% self-funded to this day, Natural Intelligence is a leader in online multi-vertical marketplaces. Our global brands, Top10.com and BestMoney.com, help millions worldwide make informed decisions every day. Our proprietary platform, xMatch, harnesses AI and ML technologies in order to help consumers make easier choices, and find the right products and services tailored to their needs.\nWe are seeking a highly talented & motivated Creative Art to join our Growth Department. This is an exciting opportunity for an experienced creative person who is in love with creating unforgettable images and holistic concepts that make a powerful impact.\nResponsibilities\nDesign unique images in the social media field (Facebook, Instagram, Snapchat, TikTok, etc.).\nCreate storyboards for UGC and Commercial videos.\nManage A/B testing processes from A to Z by working closely with campaign managers.\nConstant analysis of trends in the social media field and ability to implement these insights in the design you create.\nWork closely with the Copywriter, Design Studio, and Video Studio while creating sharp and data-driven creatives.\nMaking a vertical-based overview and utilizing creative data in order to monetize the creative assets results.\nRequirements:\n\nEnglish proficiency, both spoken and written.\n3 years of experience as an art director in a big advertising agency.\nPrevious experience in creating storyboards and social images.\nExperience in creating a campaign for social media such as Facebook and Tik Tok.\nAbility to work in a large team.\nExperience in growth/performance marketing - a big plus.\nWorking with a fintech customer - a big plus.\nOnly suitable CVs will be considered.Show more Report"}]