[{"company": "Ermetic", "job": "Senior Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "", "description": "Ermetic's mission & Culture\n\nErmetic is a dynamic, fast-growing startup with $100M in funding in just under two years, and our 2021 business results will knock your socks off! We grew revenues by 800%, increased our customer base by 6X and quadrupled our headcount. We are unstoppable.\n\nOur product helps companies answer the number one question in cloud security today: \"Who can access my data?\" With Ermetic, organizations can now secure their cloud environment and protect their data and their customer's data to make sure they are safe from malicious attacks.\n\nAt Ermetic, we're constantly challenging ourselves to climb higher, go further and do more. We believe that a company is built by its people. We strongly believe that every person is a leader of her / his domain - so if you thrive in an ecosystem where you can influence, where you work as part of an amazing global team, enjoy brainstorming and executing, love to see how your work contributes directly to the company's success and you see the value in a true partnerships - this is the place for you!\nJob Overview\n\nErmetic is looking for an experienced Product Manager to help us build a cloud-native security product with state-of-the-art architecture and cutting-edge technology.\n\nThe Product Manager will play a key role in the product life cycle with an emphasis on customer requirements and generating and defining the product vision. The Product Manager will work closely with multiple departments including product management, engineering, UX/UI, sales, customer support, finance and marketing to ensure customer requirements are met.\n\nThis is an exciting opportunity to join a fast-growing and innovative startup, and be part of a strong team with the chance to lead a product that solves a high-profile problem in the Cloud Security space. You will join the company's product team and work directly under the CPO.\n\nResponsibilities\n\nAs a Senior Product Manager, you will lead the full product life cycle by directing, productizing, and prioritizing features, performing market and customer analysis, and understanding the customers' needs to build the problem statement analysis and feature requirements. You will be in charge of a significant segment of our wide product.\n\nYou will also be responsible of:\n\nDefining product strategy and roadmap\nUnderstand the cloud ecosystem, markets, competition and user requirements in depth\nConduct market research, and analyze and gather relevant information about market trends\nPerform product demonstrations for customers\nLaunch new products and features\nDevelop innovative solutions to hard problems by collaborating, as needed, across regions, product areas, and functions\nQualifications\nBachelor's degree in a technical field or equivalent practical experience\n6+ Experience developing and launching products and technologies within Cloud, SaaS, enterprise or B2B products\nExperience in creating strategic product roadmap(s) from conception to launch\nExperience in leading the product vision, go-to-market strategy, and design discussions\nExcellent English, both written and verbal, including great presentation skills\nProven experience with Cyber Security products or Cloud-based products – strong advantage\nExperience managing day-to-day technical and design direction – advantage\nAbility to influence multiple stakeholders without direct authority – advantage\nErmetic is committed to equal employment opportunity regardless of race, color, national or ethnic origin, age, religion, disability, sexual orientation, gender, gender identity and expression, marital status, and any other characteristic protected under applicable State or Federal laws and regulations. By fostering a diverse business environment, Ermetic welcomes opportunities to learn from each other, our customers, investors, suppliers, and business partners.\n\nErmetic respects your privacy and is committed to protecting the personal information you share with us, please refer to Ermetic's Privacy Policy for more details.Show more Report"}, {"company": "Palo Alto Networks", "job": "Sr. Product Manager (Cortex XDR)", "city": "Tel Aviv-Yafo", "date": "14d", "rating": "4.2", "link": "", "description": ""}, {"company": "D-ID", "job": "Full Stack Team Leader", "city": "Israel", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=303&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d9f0da55&cb=1676382677281&jobListingId=1008272434290&jrtk=3-1-1gp833a6skuha801-1goojmeb9ghp4800-507c369f59242cf5-", "description": "D-ID is on a mission to help businesses and creators put their best face forward. With our self-service studio and API, we enable users to generate videos featuring an endless selection of AI-powered presenters for a wide range of uses.\n\nFounded in 2017, D-ID is a global leader in utilizing Deep Learning technology to animate the human (as well as not-so-human) face, capable of creating moving and talking avatars based on a single still photograph or illustration and a few lines of written or recorded text.\n\nA rising force in the Generative Tech space, clients use D-ID’s platforms for anything from elevating online courses by adding digital instructors, to putting a friendly face on customer service chatbots, to crafting new forms of storytelling, all while dramatically reducing the time and cost of video production.\n\nWe are looking for an exceptional full stack team lead to join our world-leading team in building high-impact products using state-of-the-art technology.\n️ Role & Responsibilities\n\nLead a team of full stack developers\nAgile design & planning together with product managers of sprints\nDevelop the backend of a public RestAPI for auto video production using AI\nDevelop video production studio WebAPP that use our public API\nBuild & monitor AWS cloud infrastructure at big scale\n\n️ Needed Skills\n\nSystem design skills\nReact.js\nNode.js / Typescript\nSetup maintain & operate cloud environments\nContainerized microservice apps & orchestration\nPython- advantage\nServerless framework – advantage\nDynamoDB, Elastic stack – advantage\n\n️ You Are\n\nHands on\nLeader\nTeam player\nSelf-learner and a researcher\nIndependent and self-motivated\n\n️ Background Required\n\nB.Sc. in Computer Science or equivalent experienceShow more Report"}, {"company": "ADASKY", "job": "Image Processing Team Leader", "city": "Israel", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e15cd490&cb=1676382678588&jobListingId=1007234605555&jrtk=3-1-1gp833bfgi14l801-1goojmeb9ghp4800-2b87a8a874dfb2e2-", "description": "For our Smart Sensing Group that develops state of the art image processing techniques to build Adasky’s disruptive thermal camera that enables advanced driving , we are recruiting an Image Processing Team Leader.\n\nJob responsibilities include:\n\nLeading the research and implementing advanced image enhancement algorithms utilizing state of the art techniques including deep learning.\nDevelop offline and online calibration methods for thermal cameras.\nGuidance of VLSI, SW and Real-Time embedded implementation teams.\n\nJob Requirements:\n\nB.Sc. (or higher) in electrical/software engineering from known university\n5+ years of relevant image or signal processing experience\nStrong programming skills in Matlab or Python\nExcellent communication and interpersonal skills\nRelevant technical lead experience\nKnowledge of state of the art Image Processing algorithms\n\nAdvantages:\n\nExperience with sensors/imagers\nExperience with thermal imaging\nExperience with software or hardware image processing pipeline design\nFamiliar with Computer Vision algorithms\n\nLocation: YokneamShow more Report"}, {"company": "Egis", "job": "Lead Rolling Stock Expert FM", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=305&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ec61decc&cb=1676382681374&jobListingId=1008301342012&jrtk=3-1-1gp833e6lkhqv801-1goojmeb9ghp4800-a70f2e118c5e0249-", "description": "General information\nOrganisation\nEgis is a global consulting and engineering firm working in construction, transport and mobility services. Our mission: create and operate intelligent infrastructure and buildings to further the transition to a low-carbon economy and contribute to more balanced and sustainable territorial development.\n\nTo support our growth dynamic, we offer a wide variety of career opportunities in more than 120 countries.\n\nJoining our Group and its 16,000 employees means, above all, sharing our values as a people-first company, strongly committed to sustainability and innovation.\n\nReference\n2022-7865\nPosition description\nJob title\n\nLead Rolling Stock Expert FM\nContract type\n\nPermanent contract\nJob description\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\n\nBased in Jerusalem, you will be part of our Urban Railway / LRT projects in Jerusalem and our other future transportation projects in Israel. You will lead the area of rolling stock, providing high-level advice and be responsible for the supervision of implementation of new rolling stock on the Blue Line.\nUnder responsibility of the Project Director, your activities will include but not be limited to:Review the design documentation produced by the contractor for Rolling Stock works and construction activities to verify their consistency with the Tendering specifications, the international standards and the state of the art. Prepare Documents Review Sheets (DRS).Follow up the construction, delivery and tests of the whole fleetProvide regular support to the public transport client regarding project activities.Participate and coordinate the meetings regarding rolling stock activities such as design reviews, interfacing and testing supervision at contractor/sub-contractors and customer’s sites.Prepare and issue Minutes of Meetings.Coordinate with other services for interfacing and commissioning activities of the rolling stock.\n\nProfile\n\nTo be considered for this position as Lead Rolling Stock Expert we have the following requirements:Graduate professional and have a professional license.A systemic vision, be a team player, organized sensitive to customer service.Experience of minimum 10 years in Rolling Stock, ideally including experience with Light Rail Vehicles.Knowledge of railway rolling stock structuresExperience in root cause analysis for mechanical issues on rolling stock in service.Knowledge and management of railway test environments.Good knowledge of materials and electrical and pneumatic systems and structural analysis is required (HVAC, Brake systems, TCMS, FEA, Welding).Fluent in written/spoken English\n\nPosition location\nJob location\n\nMiddle-East/North Africa, Israel\nCity\n\nJerusalem\n\nCandidate criteria\nMinimum level of education required\n\n6-Engineer’s degree\nMinimum level of experience required\n\nOver 10 yearsShow more Report"}, {"company": "Gong", "job": "Senior Product Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=306&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22e6b143&cb=1676382683787&jobListingId=1007399156772&jrtk=3-1-1gp833gghnced801-1goojmeb9ghp4800-11d2508bb813ebea-", "description": "Gong is one of Israel’s most valued private software companies. Our solution uses machine learning and AI to automate big parts of customer-facing roles. Over 3000 innovative companies like Google, Amazon, AT&T, Linkedin, Novartis, Appsflyer, Monday, Walkme, Taboola, trust Gong to power their customer reality.\n\nAt Gong, we’re building new-generation, machine-learning based software that automates big parts of customer-facing roles by “understanding” their conversations and related work.\n\nOur solution guides sales professionals, coaches them on how to become better, performs tasks for them, and directs them to the best actions.\nWe’re seeking a highly motivated & experienced product analyst to join our product group in building our product.\nAs Sr. Product Analyst, you’ll play a key role in ensuring our platform and processes work smoothly and at scale.\nYou will:\nInfluence change by presenting product and customer data-driven insights to product management and senior leadership; confidently present the outcome of your analysis and make recommendations to executives and team leaders\nBe the right hand of product and business leaders in building business cases for new product functionality, and tracking the effectiveness of the functionality over time; monitor key metrics, identify business trends and generate forecasts\nLead deep-dive analysis that will frame product strategy and product roadmap decisions\nFoster our data-centric, continuous learning culture with your passion for telling stories with data; grow our best practices around reporting quality, data hygiene, and data governance\nOwn the design, development, and maintenance of ongoing dashboards and their underlying data sets\nWork collaboratively with product managers and engineers to ensure that the right data is generated and collected\nYou have:\nBA degree in a quantitative field (Math, Statistics, Industrial Engineering, Engineering, Economics, etc.) ; MBA preferred\n4+ years of demonstrated experience working in a quantitative or analytical role, preferably at a startup or management consulting firm\nConfirmed ability to surface key insights and/or predictive forecasting models that subsequently drove business changes with measurable lift in performance\nFluency in common statistical analysis methods; and specifically, the ability to quickly separate data from noise\nProficiency using SQL and Excel for data querying and manipulation; comfortable using additional data access and analysis tools\nExperience with product analytics methodologies\nPassionate about producing high-quality accurate analytics deliverables\nIdeally, you are experienced in creating and maintaining dashboards using data visualization tools such as Tableau, Sisense, or similar\nIdeally, have programming experience using languages such as Python\nSelf-motivation, proactively going beyond the call of duty\nCreativity and strategic thinking\nThe ability to work comfortably in a constantly evolving environment\nYou'll get:\nAn opportunity to play a major part in the company's product strategy and operations\nAn opportunity to work with other top talents to solve complex challenges\nTo experience building a state-of-the-art SaaS product used by top business professionals\nTo be part of a high-profile, well-funded company with access to top US customers.\nTo analyze complex, non-trivial data generated in a fast-moving product, which is used by tens of thousands of users on a daily or weekly basis\nTo lead and own momentus projects and tasksFirst-hand entrepreneurial experience\nHere at Gong, we encourage our employees to express their personality and identity (whether gender, ethnic, religious, or sexual), and we ensure fairness and equal opportunities.\nWe follow a hybrid working model that combines working from home, on the go, or at the office. This allows us: flexibility, autonomy, positive work relationships, and effective work habits\nIf these considerations are important to you when choosing a work place, we'd love to see you with us.Show more Report"}, {"company": "Meta", "job": "Computer Vision, Software Engineering Manager", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=307&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_dbc63066&cb=1676382685163&jobListingId=1008458339414&jrtk=3-1-1gp833hrtgsq5801-1goojmeb9ghp4800-f675b4d1787c8757-", "description": "We are seeking an Engineering Manager to join the Meta Reality Labs team, an organization focused on productizing novel technologies in AR and VR devices. In this role, your job will be to both manage and partner with groups working across the full spectrum from research to product development, managing our technical investment portfolio supporting multiple products across different timelines. You will oversee and be responsible for a broad array of state-of-the-art technology areas, spanning Mixed Reality, Computer Vision, Contextual AI, Deep Learning, and Machine Learning, and designed to run on low-power client devices. Prospective candidates should have sufficient technical depth and breadth in the associated set of technologies to make portfolio management, resourcing and roadmap decisions.\n\n\nComputer Vision, Software Engineering Manager Responsibilities:\n\nLeading an organization comprised of technology leaders, applied scientists and engineers from prototyping across development and integration of advanced systems relying heavily on Computer Vision and Machine Learning technologies\nOwning the development of system requirements, and collaborating with respective teams to mature and integrate technologies necessary to create product architectures that can deliver these requirements\nEngaging cross-functionally with other technology leaders and engineers to develop concepts that advance the entire product pipeline (hardware, software, integration, infrastructure, and applications)\nRecruiting world-class talent and providing mentorship to team members\nWorking closely with various organizations to define and execute long-term roadmaps\nCoordinating with research, user research, legal, privacy and business development teams to both define and execute technology development with key partners & suppliers\nDeveloping and communicating technology development strategies and status\nFacilitating and working with teams to proactively alleviate project bottlenecks\nPartner with leadership to influence and drive org design, contribution and prioritization\n\n\nMinimum Qualifications:\n\nBS degree in Engineering, Physics, Computer Science or equivalent\n4 + years of people management experience in multi-disciplinary global teams at the intersection of tech and product, including building performing teams and organization\n1+ years of experience developing, coaching and managing engineering leaders\nDemonstrated experience in recruiting and managing technical teams, including performance management\nExperience in managing teams productizing Computer Vision or AI/Machine Learning technologies from conception to end\nLeadership and interpersonal communication experience in working across many disciplines, driving best engineering practices, and mentoring team members\nTechnical experience in leading teams/projects in one or more of the technical domains of machine perception (e.g., machine vision, deep learning, sensors and robotics)\nFlexibility and resilience in a dynamic environment\n\n\nPreferred Qualifications:\n\nPhD in Computer Vision, Computer Graphics, AI/Machine Learning or related field\nExperience in leading teams interfacing with HW teams (e.g., sensors, silicon) in setting requirements and product tradeoffs\nExperience managing joint hardware-software development and associated rapid prototyping projects in Computer Vision and/or AR/VR\nExperience in leading teams developing Computer Vision technologies such as 3D Mapping, SLAM, people tracking, virtual try-on, or pose estimationShow more Report"}, {"company": "FUNDGUARD", "job": "Backend Team Leader", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=308&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ea218e1b&cb=1676382686343&jobListingId=1008238350829&jrtk=3-1-1gp833j21jcbj801-1goojmeb9ghp4800-7ba1b7f9622f8776-", "description": "DESCRIPTION\nFundGuard is the new generation investment accounting utility for asset managers and their service providers. Our cloud-native, AI-powered operating system and technology platform are transforming investment operations. FundGuard existentially changes asset servicing to enable reduced fees and the ability to offer new and innovative products, including crypto-asset services, at scale, today and tomorrow.\nThe company is led by an experienced team with successful exits and has raised more than $55 million, backed by strategic partners including Citi and State Street Corp, venture firms Blumberg Capital, LionBird Ventures, and Team8 Capital among others.\nRead more about our latest achievements\nFundGuard Named “Tomorrow’s Top Growth Company” by Qumra Capital\n﻿We offer an exciting work opportunity where you’ll:Use cutting edge cloud technologiesDevelop one of the more robust enterprise applications with deep financial enginesWork with massive sets of dataBuild a highly performant application to serve leading global financial institutionsCollaborate with highly experienced engineering and product team members\nJoin FundGuard at the forefront of innovative financial technology. Work with us!\nVisit us: fundguard.com/careers\nFollow us: linkedin.com/fundguard\nWe are located in Azrieli Center Tel Aviv.\nYour mission is to lead and expand a team of talented developers, collaborate with colleagues in solving complex problems, prioritize and overcome design challenges. Own features from design and development to production. Drive technical excellence, high product quality, innovation and timely delivery in an agile environment\nWork closely with Product Management, R&D and other stakeholders from ideation to real customer value.\nREQUIREMENTS\n3+ years of experience in leading R&D teams in fast paced environments\n5+ years of experience in software engineering\nSolid proficiency in modern Java/C++/C#\nExperience developing large, scalable, distributed information systems using a microservices architecture\nMastery of high-performance, reentrant and efficient code\nCompetency working with state-of-the-art source control management and CI tools\nExperience with Agile/Scrum development methodologies\nTeam player, mentor, strong communication and problem-solving skills\nComputer Science degree(s) from leading universities or/and technological intelligence units graduate\nNice to have skills:\nJava and Spring (boot) proficiency\nExperience with cloud frameworks such as Kafka, Cassandra, Redis, Elasticsearch and S3/Blob\nFamiliarity with “supporting” languages like Python, shell scripting\nFinancial understanding or qualifications\nExperience with open-source frameworks such as Docker, Kubernetes, Prometheus and GrafanaShow more Report"}, {"company": "BigID", "job": "Senior Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "Who we are:\n\nBigID is an innovative tech startup that focuses on solutions for data security, compliance, privacy, and governance. We're leading the market in all things data: helping our customers reduce risk, drive business innovation, achieve compliance, build customer trust, make better decisions, and get more value from their data.\n\nWe are building a global team with a passion for innovation and next-gen technology. BigID has been recognized for being one of CNBC's Top 25 Startups powering the economy, we're on Built In's 2023 Best Places to Work, #21 on the 2022 Deloitte 500 (most innovative, fastest-growing companies in North America) and we're on the 2022 Inc 5000.\n\nAt BigID, our team is the foundation of our success. Join a people-centric culture that is fast-paced and rewarding: you'll have the opportunity to work with some of the most talented people in the industry who value innovation, diversity, integrity, and collaboration.\nWho we seek:\n\nWe're looking for a Senior Product Manager to be a core member of the Data Security Product Management team, helping envision, design, develop, and deliver state-of-the-art products to the market.\n\nWhat you'll do:\n\nLead the product activities for our rapidly growing Data Security application suite - from vision to implementation, defining the product roadmap, working with engineering to build new solutions, and communicating with various internal stakeholders to ensure product success\nCollect, prioritize, and create product requirements for new features\nPerform ongoing analysis and research of customer requests, competitor capabilities, and industry trends in order to define the next product capabilities\nConduct regular customer calls deriving customer insights and tie those insights to business plans, product roadmaps and to prioritization process\nWork with our UX designers to create the optimal user experience for your products\nLead sprint planning sessions, establishing clear goals for the development teams' forthcoming sprints based on the organization's priorities\nWork closely with the engineering teams to make sure they understand the requirements and help drive execution\n\nWhat you'll bring:\n\n4+ years of experience in Product Management roles from a leading B2B company\nExperience in managing enterprise-grade produc\nStrong technical orientation and understanding\nAnalytical capabilities and strong problem-solving skills\nAccountability, self-motivation, and ability to work autonomously\nAbility to uncover and understand customer needs and translate them into requirements\nTeam player. A can-do attitude and ability to thrive in a fast-paced, startup environment\nBusiness-minded and able to incorporate user and business needs into the decision-making process\nExcellent presentation and written and verbal communications skills, in both Hebrew and English\n\nAdvantages:\n\nBackground of a meaningful development experience\nBachelor's degree in CS, Engineering, or related experience preferred\nExperience in the cyber-security industry\n\nWhat's in it for you?!\n\nOur people are the foundation of our success, and we place a high priority on offering a wide range of benefits that make our team happier and healthier.\n\nEquity participation - everyone shares in our success\nFlexible work arrangements - for parents, for remote work days, etc.\nMentoring, Knowledge training & Career development tracks\nOffice perks: dog-friendly environment, fully-stocked fridge, gym and exercise classes, weekly Happy Hours, free parking, evening meals\n\nOur Values:\n\nWe look for people who embody our values - Care, Do, Try & Shine.\n\nCare - We care about our customers and each other\nDo - We do what it takes to make a positive impact\nTry- We try our best and we don't give up\nShine- We shine and make it our mission to always stand out\n\nBigDiversity: We're committed to creating a culture of inclusion, diversity, and equality – across race, gender, sexuality, disability and neurodiversity – where innovation and growth thrives, every voice is heard, and everybody belongs.\n\n#LI-ON\n\n#LI-Hybrid\nCPRA Employee Privacy Notice: CAShow more Report"}, {"company": "OwnBackup", "job": "Principal Engineer", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "3.4", "link": "", "description": "The Job\n\nOwnBackup is one of the fastest growing global SaaS companies. With nearly 5,000 customers, we are ranked on the Forbes Cloud 100 as one of the world's top private cloud companies and have raised over $500 million in funding from AIkeon Capital, B Capital Group, BlackRock Private Equity Partners, Insight Partners and others.\n\nWe are seeking an outstanding Principal Engineer to join our Tel Aviv office. This is a great opportunity to join a young, VC-backed, fast-growing start-up that encourages its employees to innovate and implement their ideas. In this role, you will guide and lead significant development efforts for both existing products and new ones\n\nOur tech stack is Python, React and we are migrating our webapp framework from Rails to Django. As a SaaS platform we operate in a cloud native environment. Our products are developed on AWS and we support AWS and Azure. Our plans include containerisation (Docker, Kubernetes) of our product to help us scale and meet demand from a fast growing client base. We aspire to remain cloud agnostic to support a varied client base. We believe in a culture of continuous improvement and constant refactoring.\n\nAbout You\nAre a curious engineer who loves to discover how things work and determine how to improve them\nEnjoy learning new technologies with a view to defining optimal solutions\nEnjoy taking ideas from conception from delivery\nAre self motivated and have excellent analytical, problem solving and trouble-shooting skills\nEnjoy working collaboratively with product and engineering teams to deliver value to clients\nYour Day-to-Day Role\nTechnically leading the development of features end to end (From requirements to code in production)\nPromoting engineering excellence, code quality and principles of software design and development in the team\nHelp translate our business vision into state of the art software and efficient development processes\nSupporting our customers and troubleshooting production issues\nBeing part of cross R&D engineering initiatives\nYour Work Experience\n10+ years of experience as a Software Engineer\nExperience using Python or any other Backend languages\nOutstanding architecture and design skills in large SaaS systems\nExperience working with large scale systems\nKnowledge of Linux / Unix\nBS in Computer-science or equivalent degree\nStrong background and experience with:\nDatabase systems\nSecure-coding/infosec principles\nScalability & performanceImportant Details\nImportant Details\n\nThis is a full-time position. The ideal candidate will work out of our Tel Aviv office to maximise collaboration and interaction with the business. Travel may be required.\n\nOwnBackup is dedicated to creating an environment where employees thrive. It's why we provide every employee with unlimited holiday, meal tickets for lunch, and a pension plan.\n\nCreating an environment where employees thrive also means making sure every employee feels accepted. As we scale to help all types of companies protect precious data, our team must reflect the diversity we serve. OwnBackup is an equal opportunity employer and we believe that every employee in the company brings a unique perspective that they can and should contribute in order to make an impact every day. We strive to be one team and one culture that builds trust through transparency. We do not discriminate based on race, colour, religion, sex, sexual orientation, gender identity, age, national origin, protected veteran status or disability status.\n\nA Bit About Us\n\nOwnBackup is a leading SaaS data protection platform for some of the largest SaaS ecosystems in the world, including Salesforce, Microsoft Dynamics 365, and ServiceNow. Through capabilities like data security, backup and recovery, archiving, and sandbox seeding, OwnBackup empowers thousands of organisations worldwide to manage and protect the mission-critical data that drives their business.\n\n#LI-OnsiteShow more Report"}, {"company": "", "job": "A Marcom Content Design Associate role", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=311&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b6c36ce8&cb=1676382692772&jobListingId=1007157453602&jrtk=3-1-1gp833paf2gpu001-1goojmeb9ghp4800-95dbc660f72e4b33-", "description": "A Marcom Content Design Associate role\nCompany that is developing and manufacturing flexible compostable packaging. Our vision is that flexible plastic packaging will have the same end-of-life organic waste cycle; yet also offer consumers and brands the durability and shelf life they have come to expect of ordinary plastics.\nWhat we are looking for:\n\nWe are looking for a Marcom Content Design Associate role; on a full-time basis with the ability to hand in extra hours, too. We expect former experience in content writing and content creation, aside excellent English, preferably, a native speaker.\nThese are the characteristics of the topics:\nContent |\nHigh level of content creation in different media outlets: website content, newsletters, landing pages, collaterals\nExcellent English, preferably, a native speaker\nFormer experience in global content creation\nCreative |\nCreating a high level of creative online artwork: presentations, videos, campaigns, photo shooting, collaterals\nGuiding and working with the art design studio\nFormer experience in Graphic Design\nFormer experience in Marketing & Presentations\n\nRole Requirements are:\n\nIf you are an environmentalist, curious, creative, highly sharp & focused, good energy a fast-learner and a definite go-getter, especially independent and hard-working, then, we are looking for you!\n\nMandatory – at least 3 years’ experience in global content writing, in English\nMandatory – Excellent communications skills\nMandatory -The ability to work a full-time role + extra hours\nMandatory - Fluency in OFFICE tools (Excel, Word, PPT, etc.)\nA valuable preference - Former experience in social media\nA valuable preference- former experience in CRM systems\nA valuable preference- former experience in creative social media tasks projects\nA team player\nHigh level of service orientation.\n\nRESUMES TO JOBS@NBN.ORG.ILShow more Report"}, {"company": "INTEL", "job": "Technical Leader for Pre-Si Verification", "city": "Jerusalem", "date": "30d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=312&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22444787&cb=1676382694112&jobListingId=1008394765089&jrtk=3-1-1gp833qkbjfn9801-1goojmeb9ghp4800-94765d4a25241ee6-", "description": "Job Description\nAny processor, in the past 10 years, that you worked on - we developed it.\nJoin us in creating the future processors of Intel.\nOur Team ensures the logic correctness during the development of each new Intel CPU product before it is being shipped to production.\nThe role includes developing dedicated verification environments and tools, while driving a complex process of exercising the design to verify its logical correctness. These environments are developed using unique, state-of-the-art languages and tools, and advanced software engineering methodologies.\nVarious validation techniques are used while offering a unique Hardware-Software experience.\nIn addition to various tools, languages (UVM, Python) and verification methodologies, you will develop expertise with Intel Architecture and Micro Architecture and will be deeply involved in the process of defining new Intel features.\nQualifications\nAt least 5 years of experience in pre silicone verification\nProven experience in leading project \\ team\nIMPORTANT: Please be informed that Intel is proactively trying to find candidates for a FW Validation Team Lead position and that this position may not be available at this time.\nInside this Business Group\nThe Core and Client Development Group (C2DG) is a worldwide organization focused on the development and integration of SOCs, Core ™, and critical IPs that power Intel's leadership products, driving most of the Client roadmap for CCG, Delivering Server First Cores that enable continued growth for DCG and invest in future disruptive technologies.\n\nPosting Statement\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\n\nBenefits\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://www.intel.com/content/www/us/en/jobs/benefits.html\nJobTypeShow more Report"}, {"company": "8BIT sp. z o. o.", "job": "Product Manager (mid/senior)", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=313&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bf7a829a&cb=1676382695805&jobListingId=1008395241738&jrtk=3-1-1gp833s8emfph801-1goojmeb9ghp4800-d2140524577cb932-", "description": "Our client is a leading gaming studio on the $50B Metaverse Roblox\nTheir games are played by millions every day and they are seeking to expand the team and reach new heights! They’re a female-founded, female-led, non-traditional gaming studio united by the belief and desire to dream up their own stories, their own worlds, and create inclusive shared experiences on the metaverse.\n\nAs a Product Manager, you will report to the VP of Product, defining and executing on our product roadmap, focusing on strategic partnerships with the biggest media, music, and lifestyle brands coming to the Metaverse.\nProduct management is both challenging and rewarding. As part of their product team, you’ll be focused on enabling the players and the Roblox Community to have fun while creating meaningful friendships that persist across many games and experiences. This important pursuit requires empathy for our players as well as an analytical approach towards their actions.\nAt this point, the position is open to Israeli and European-based PMs.\nRESPONSIBILITIES\nResponsible for design and spec new and existing features for our Roblox Experiences across various products and games (including 3rd party)\nCollaborate with design and development teams to ship new experiences.\nAnalyze and define change across features, product roadmap, UX/UI and all other aspects of a F2P entertainment product.\nEstablish KPIs for product analytics that influence future roadmaps.\nEstablish, guide, and modify product documentation.\nTranslate technical terms, art and wireframes to working PRDs / GDDs\nFind new opportunities, shifting points and easy solutions in order to impact the product in meaningful ways\nREQUIREMENTS\nBachelor’s degree or four or more years of work experience in the games industry.\nHistory of successful product launches, product requirements, feature delivery and trade offs of a product, end to end product delivery and/or deal executions.\nPRD / GDD writing experience.\nAnalytic tools monitoring and analyzing experience.\nExperience with global teams and internationally operated services.\nVoice of the player and the Roblox Community – explore and learn how and why players engage with THEIR experiences and other experiences on Roblox. Become their voice and represent their needs throughout the development process.\nExtraordinary at building presentations, documents and presenting them at all levels of the organization.\nDeeply value attention-to-detail and believe that an extraordinary product is the sum of an inordinate number of small, thoughtful decisions.\nAble to use data and insights to align people on which problems to prioritize and tackle in order to deliver what’s best for customers.\nNot your time for a move? Recommend a friend and earn 700 EUR! Contact: jobs@8bitplay.com\nIMPORTANT: We will never, absolutely never send your CV and/or personal data to any of our clients without your direct consent. Submitting your CV is not equal to giving us consent to share your details with our external partners- we will always contact you upfront and ask for your agreement.\nBy submitting this form you give your consent for the information provided on this form to be held on computer or other relevant filing systems belonging to 8Bit Studio one and to be shared with other accredited employees in accordance with the GDPR 2018.\nBy submitting this form you agree that 8Bit Studio, NIP 9570949266, REGON: 36386962 processes your personal data contained in the recruitment documents supplied by you, including but not limited to your image, for the purposes of the current recruitment processes. 8Bit Studio confirms that your consent may be withdrawn anytime.\nFor more insight about game jobs and recruitment for game industry visit our homepageShow more Report"}, {"company": "AlignTech", "job": "Algorithm Tech Lead", "city": "Petah Tikva", "date": "22d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6a5dd920&cb=1676382697093&jobListingId=1008410213598&jrtk=3-1-1gp833ti6itng801-1goojmeb9ghp4800-9a0625e631f0f12a-", "description": "Join a team that is changing millions of lives.\n\nTransforming smiles, changing lives\nAt Align Technology, we believe a great smile can transform a person’s life, so we create technology that gives people the confidence to take on whatever’s next. We revolutionized the orthodontic industry with the introduction of the Invisalign system, and we have never lost sight of that spirit of innovation. Our diverse and collaborative teams are constantly pushing the boundaries of what’s possible.\nReady to join us?\nAbout this opportunity\nWe are looking for an Expert Algorithms Researcher and Tech lead who will drive and lead innovation and concept development to advance the state of the art in Computer Graphics, Vision, and AI for our next generation iTero scanners.\nIn this role, you will…\nAs tech lead, you will define and develop imaging, 3D modeling, surface reconstruction, image processing and high-performance computing algorithms, integrate them into our software stack and mature them to production quality\nPlay a pivotal role in determining our algorithmics approach, and the performance outcomes, Including Identifying risks and proposing solutions in algorithms designs.\nProvide guidance and coach our algorithms teams to deliver on multiple projects.\nYou will design the overall software architecture for a particular feature or component\nYou will understand the products and the customer needs.\nYou will research and analyze the underlying problems using real data.\nDesign and test algorithms in C++ and Python.\nImplement algorithms in C++ and integrate them into the application.\nWork closely with other members of the algorithms team and members of other groups such as physics and electronics\nParticipate in design reviews and code reviews of co-developers.\nIn this role, you’ll need …\nAt least M.Sc. in one of: Computer Science, Mathematics, Physics, Electrical engineering\n10 years' experience in one or more of the following fields: 3D computational geometry, Computer stereo vision or structured light, image processing,\nExperience in Structure from Motion, 3D reconstruction, Point Clouds, Multiview Stereo, Depth from Shading - advantage\nExperience in 3D computer graphics, Machine Learning, high performance computing - advantage\nHigh proficiency in C++, Python\nStrong publication record (papers / patents / reports)\nAbility to drive development of new functionalities from concept to production\nAbility to think analytically and solve technical problems in a compute constrained system\nAbility to multitask and prioritize in a fast-paced environment\nInquisitive fast self-learner\nExceptional interpersonal and communication skills, good team player, open to innovative ideas\nSound like a good fit?\nGreat! Click the \"Apply\" link to let us know you are interested. Not the right fit? Don’t worry, Align is quickly growing so we are creating more opportunities to expand our Align family. Please consider joining our Talent Network to receive notifications about future jobs or sharing this opportunity with others in your network.\nAbout Align\nAlign Technology is a publicly traded medical device company that is transforming smiles and changing lives. Our global team of talented employees develop innovative technology, tools and treatment options to help dental professionals worldwide achieve the clinical results they expect. Our digital ecosystem combines the power of technology to create beautiful smiles through the integration of AI and machine learning, digital imaging and visualization, biomechanics and material science to develop the Invisalign system, the most advanced clear aligner system in the world; iTero Intraoral Scanners and OrthoCAD digital services. Did you know? Align is the world’s largest manufacturer of custom 3D-printed materials.\nBy joining Align, you will be part of a global, fast-growing company in one of the most dynamic industries. Great people, innovative technologies, and meaningful work – these are just some of the things employees say make Align Technology a great place to work.\nWe respect your privacy. Please review our Applicant Privacy Policies for additional information.\nGlobal Diversity Statement:\nAt Align, we believe in the power of a smile, and we know that every smile is as unique as our employees. As we grow, we will continue building a workforce of diverse cultural backgrounds and life experiences and fostering a culture of open-mindedness and compassion for all our employees. We live our company values by promoting healthy people and healthy communities. All with the intent of changing millions of lives, one unique smile at a time.\nEqual Opportunity Statement\nIt is our policy to provide equal employment opportunity in all of our employment practices without regard to race, color, religion, sex, national origin, ancestry, marital status, protected veteran status, age, individuals with disabilities, sexual orientation or gender identity or expression or any other legally protected category. Applicants for positions with Align must be legally authorized to work in the country which they are applying for and verification of employment eligibility will be required as a condition of hire.Show more Report"}, {"company": "Boston Consulting Group", "job": "Associate/Consultant - Cybersecurity", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=315&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ee433f3e&cb=1676382698243&jobListingId=1008225414108&jrtk=3-1-1gp833umd2a81001-1goojmeb9ghp4800-3d0b557e99ca2365-", "description": "Who We Are\nBoston Consulting Group partners with leaders in business and society to tackle their most important challenges and capture their greatest opportunities. BCG was the pioneer in business strategy when it was founded in 1963. Today, we help clients with total transformation-inspiring complex change, enabling organizations to grow, building competitive advantage, and driving bottom-line impact.\n\nTo succeed, organizations must blend digital and human capabilities. Our diverse, global teams bring deep industry and functional expertise and a range of perspectives to spark change. BCG delivers solutions through leading-edge management consulting along with technology and design, corporate and digital ventures—and business purpose. We work in a uniquely collaborative model across the firm and throughout all levels of the client organization, generating results that allow our clients to thrive.\nBCG has a long history of driving growth by embracing innovation and new ways of thinking. Through DigitalBCG, we bring together a diverse mix of consultants and digital specialists to ensure that we are supporting our clients throughout their digital transformation journeys. We work with our clients to fully understand the impact of digital on their business and set priorities that will transform their vision into value. Whether it be developing new technologies to support their core business, making better use of their data, or pursuing entirely new sources of revenue, our aim is to achieve radical improvements in productivity, flexibility, and speed. We are innovating how our clients are using artificial intelligence, robotic process automation, internet of things, personalization, blockchain technologies, and more to gain competitive advantage.\nDigitalBCG encompasses a broad set of data, digital, and technology capabilities from BCG consulting teams and practices, along with our business units such as BCG Digital Ventures, BCG Platinion, and BCG GAMMA.\nPractice Area Profile\nBCG's Tech and Digital Advantage (TDA) practice focuses on helping clients deliver competitive advantage and business superior performance through the use of data, technology and digital. TDA is the fastest growing practice at BCG and at the heart of the strategic impact we have with our clients. Our consultants and experts globally work across all industries and provide deep experience and expertise across a number of topics including: * Digital Transformation * Data & Digital Platforms * Software & Agile * Digitizing the Tech Function\n\nWhat You'll Do\nAre you a problem solver? Are you passionate about developing ground-breaking recommendations across a wide range of industries and topics? Would you like to make a difference and to have a tangible impact on the society?\nOur Tel Aviv office is currently looking for motivated, open-minded and success-driven young professionals to join the team within our Tech and Digital Advantage Practice Area. We seek talented individuals with cybersecurity experience, strong analytical capabilities and a passion for the world of digital & technology and for cybersecurity topics.\nYou will work with and learn from some of the best minds in the business, on a wide range of challenging client engagements.\nYou will be able to make an impact from day one, gaining further expertise in Cybersecurity, which will enable you to advise BCG’s clients on how to identify information assets and protection needs, and help them design appropriate holistic measures.\nYour responsibilities:\nAdvise clients on executive level across industries (multinationals, governments, NGO’s, etc.) and topics supporting them to improve or transform their businesses and achieve excellence;\nWork in small but high impact consulting teams on select Cybersecurity topics;\nDevelop client-tailored Cybersecurity strategies – setting the vision and identifying security related opportunity areas;\nSuggest and perform specific analyses – develop, and deploy state-of-the-art security concepts and apply them to business problems;\nObtain data, performing analysis, testing and improving outputs, presenting results;\nCreate tailored implementation or transformation plans for Cybersecurity initiatives;\nOwning project modules, content and day-to-day client interactions.\nWhat You'll Bring (Experience & Qualifications)\nWe are looking for professionals with cybersecurity expertise to join us. You would typically:\nHave superior problem-solving skills and ability to work well in a demanding environment;\nBe familiar with a selection from a broad base of Cybersecurity practices;\nHave exceptional drive and commitment, striving for excellence;\nBe highly self-driven, well-structured yet ﬂexible, able to think strategically / end-to-end;\nBe eager to develop new skills and areas of expertise;\nHave a high level of adaptability to a frequently changing professional and social working environment;\nHold a BA’s Degree;\nBe fluent in English.Show more Report"}, {"company": "Fireblocks", "job": "Senior Frontend", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": ""}, {"company": "Ibex Medical Analytics", "job": "In house Senior Pathologist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "About Ibex:\n\nIBEX is a well-funded start-up with global presence and headquarters in the USA and Israel. Ibex develops state-of-the-art artificial intelligence solutions for cancer diagnostics. Our cutting-edge technology is transforming the diagnosis of cancer, leading to rapid and accurate decision making and providing new diagnostic insight to enable precision medicine.\n\nOur world class team of researchers, engineers and medical experts is growing. If you are an outstanding professional, passionate about your work, a team player and want to make a difference in the lives of millions of people – come join us. You will get the opportunity to work on novel and challenging problems and help us fight cancer while doing it!\nResponsibilities:\n\nWe are looking for a Senior Pathologist to join our team. As an in-house pathologist, you will work closely with our R&D team on new applications for our cancer diagnostics platform as we expand it to additional tissues and indications, acting as subject matter expert and advising on all clinical matters. You will further work with our AI experts, scientific researchers and other pathologists on tasks such as:\n\nAnnotate (mark and label) various cell types and structures in whole-slide images\nAnalysis of algorithmic performance and clinical data\nDesign and execution of clinical research and case studies\nAdvise on improvements to our platform, workflow and user-interface\nWriting clinical, scientific and other pathology-related papers\nHelp the commercial team engage physicians and improve adoption of our solution by customers\nProven experience as a licensed pathologist\nExperience in conducting clinical studies and clinical writing – an advantage\nExperience in a Medtech company – an advantage\nWilling to work in a dynamic and intense start-up environment\nFluent in English\nGreat communication skills\n\nWe are an equal opportunity employer and committed to creating a friendly, inclusive environment that is a pleasure to work in, and where there is an unbiased acceptance of others.Show more Report"}, {"company": "VAST Data", "job": "QA Automation Team Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "VAST Data is looking for a Quality Automation Team Lead to join our growing team!\n This is a great opportunity to be part of the fast-growing infrastructure company in history. In just a few short years, we’ve shaken up the industry by challenging traditional architecture models and introduced a revolutionary set of storage possibilities through our Universal Storage platform.\n Our success has been built through incredible leadership and motivated employees who want to leverage their skills & experiences to make a real impact. This is an opportunity to be a key player at a pivotal time in our company’s growth.\nCome join the disruption, make your mark, and be a part of the amazing team introducing the new era of data storage!\nRequirements:\n\nWe are looking for a talented, \"hands-on\" QA Manager to join us, specializing in the areas of Storage, Clustering, Networking and System-integration.\nKey Responsibilities\nLead a team responsible for Test Automation Development, design automation tests and pipelines integrating with SW tools from the ground up, interfacing to various systems and tests (Python-based).\nWork closely with developers to create and maintain a state of the art system tests.\nDefine, develop and execute automated testing plans with deep system knowledge and understanding.\nThis position also requires hands-on work.\nDesired Skills & Experience\nAt least 3 years experience as a team lead of 3+ engineers, 2+ years experience in development of product testing, automation tools.\nExperience with Linux, Python, bash. - Must\nExperience in analyzing large and diverse systems, understanding QA processes and procedures.\nDemonstrated testing experience (Test Definition & Execution) in the following fields: Integration, Performance, Stress.\nBackground in developing test automation infrastructure and/or automating tests on a combination of Linux and Windows servers.\nA deep understanding of Computer systems / Operating systems (Unix, Linux, Windows) - must\nKnowledge of File Systems (NAS) / Block-level Storage/storage networking protocols- Big Advantage.\nB.Sc./B.A. degree in computer science, engineering, or related discipline – an advantage\nAdvantage\n Experience with virtualization, cloud, networking, or storage technologies\n Experience with tools like Jenkins and GitShow more Report"}, {"company": "Placer.ai", "job": "Fullstack Team Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=319&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e8ed13bf&cb=1676382703450&jobListingId=1007951433755&jrtk=3-1-1gp8343ovma4q801-1goojmeb9ghp4800-06ad3c44e6fb1212-", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\nSUMMARY:\n\nBuild end-to-end features in our main product, a data-driven product that provides, in near real-time, insights that relate to physical places and entities.\nDesign, develop and implement complicated web applications based on heavy data processing and data analytics, GIS, reach UI modules, and complicated algorithms.\nWork closely with our business product teams and architects\nRecruit, mentor, and lead a FS R&D team\n\n\nRESPONSIBILITIES:\n\nManage a team of talented Full-stack and Frontend developers\nCreate state of the art web applications based on heavy data processing and data analytics, GIS, reach UI modules, and complicated algorithms.\nDevelop and own micro-services, features and components\nCollaborate with other teams (data, backend, analytics, data scientists, …)\nDefine implement and improve monitoring KPIs, performance, stability and overall quality of infrastructure and functional modules\nREQUIREMENTS:\n\nAt least 2 years experience as a Team Lead (a group of +4 developers)\nAt least 4 years experience as a Full Stack Developer\nAt least 2 years experience working knowledge of React 16.8+\nDeep understanding in at least one: Node.js / Python\nDeep understanding of at least one of Redux, MobX, NgRx, Akita, GraphQL\nCS degree or relevant experience\n\nOTHER REQUIREMENTS:\n\n2+ years experience with Pandas, Celery, RabbitMQ, MongoDB - advantage\nExperience with microservice architecture\nExperience with Docker & Kubernetes advantage\nExperience with Cloud (experience with Google Cloud Platform - advantage)\nExperience with large scale data pipelines - advantage\nExperience with different Mapbox/Google map solutions - advantage\nA leader and a mentor, self-initiating, self-motivating, self-learner\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.Show more Report"}, {"company": "Palo Alto Networks", "job": "Senior Product Manager (Cortex XSOAR)", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=320&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_50e2e0e2&cb=1676382705124&jobListingId=1008415856730&jrtk=3-1-1gp83457qm6rj801-1goojmeb9ghp4800-65481f0bf39a775a-", "description": "Company Description\nOur Mission\nAt Palo Alto Networks® everything starts and ends with our mission:\n\nBeing the cybersecurity partner of choice, protecting our digital way of life.\n\nWe have the vision of a world where each day is safer and more secure than the one before. These aren’t easy goals to accomplish – but we’re not here for easy. We’re here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.\nWe’re changing the nature of work. Palo Alto Networks is evolving to meet the needs of our employees now and in the future through FLEXWORK, our approach to how we work. From benefits to learning, location to leadership, we’ve rethought and recreated every aspect of the employee experience at Palo Alto Networks. And because it FLEXes around each individual employee based on their individual choices, employees are empowered to push boundaries and help us all evolve, together.\n\nJob Description\nYour Career\nCortex XSOAR leads the Security Orchestration, Automation and Response market by delivering a comprehensive Security Operations Platform that combines full case management, intelligent automation, and collaborative investigation. Our teams focus on innovating the most advanced SOAR platform, expanding its rich integrations marketplace, covering more automation use cases as well as expanding the threat intelligence capabilities within XSOAR.\nIf you are highly motivated, competitive, and do not shy away from tough challenges, come join our XSOAR product management group and join some of the best minds in the world to shape the future of security operations.\nYour Impact\nHelp drive an existing market leading product, and grow it to new horizons by bringing innovative and disruptive approaches\nBuild a strong product strategy and business case, in addition to working with marketing on product brand, positioning and collateral materials\nGrow and manage a strong product management team that will deliver the entire product life cycle - collect customers’ feedback and hear their need, prioritize features and trade offs, write the product requirements and work closely with engineering group to deliver the roadmap\nBuild and launch enterprise class products and services\nWorking effectively with all areas of the organization in a global company, from engineering to sales\nWork closely with UX/ UI experts to create an intuitive and state of the art user interface\n\nQualifications\nYour Experience\n5+ years experience as a product manager or similar\nInherent passion for cybersecurity and solving problems\nDrive to design new, innovative and disruptive solutions\nPreferred, BS/MS in Computer Science, or another engineering/technical degree or equivalent military experience required\nStrong desire to take ownership of new technology products and their full life cycle\nAbility to manage multiple tasks, projects, priorities and deadlines\nExcellent analytical, written and verbal communication skills in English\nExperience in speaking in front of partners and major customers\nTeam player with a can do approach\nExcellent people skills, team & culture mentality\nAdditional Information\nThe Team\nWe are the global cybersecurity leader, known for always challenging the security status quo. Our mission is to protect our way of life in the digital age by preventing successful cyberattacks. This has given us the privilege of safely enabling tens of thousands of organizations and their customers. Our pioneering Security Operating Platform emboldens their digital transformation with continuous innovation that seizes the latest breakthroughs in security, automation, and analytics. By delivering a true platform and empowering a growing ecosystem of change-makers like us, we provide highly effective and innovative cybersecurity across clouds, networks, and mobile devices.\nOur Security Operating Platform is built for automation. It is easy to operate, with capabilities that work together, so customers can prevent successful cyberattacks. They can use analytics to automate routine tasks so they can focus on what matters. We are known for continuously delivering innovations.\nOur Commitment\nWe’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.\nWe are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.\nPalo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.\nAll your information will be kept confidential according to EEO guidelines.\nCovid-19 Vaccination Information for Palo Alto Networks Jobs\nVaccine requirements and disclosure obligations vary by country.\nUnless applicable law requires otherwise, you must be vaccinated for COVID or qualify for a reasonable accommodation if:\nThe job requires accessing a company worksite\nThe job requires in-person customer contact and the customer has implemented such requirements\nYou choose to access a Palo Alto Networks worksite\nIf you have questions about the vaccine requirements of this particular position based on your location or job requirements, please inquire with the recruiter.Show more Report"}, {"company": "Forter", "job": "Senior Software Engineer, Events Infra", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.7", "link": "", "description": "About us:\n\nDigital commerce is built on trust. At every point along the eCommerce journey, businesses must make a critical decision: Can I trust this customer? Answering this simple question accurately and instantly is powerful—it can accelerate revenue growth and strengthen a company's connection with its customers. How do we do it? Forter was founded on the insight that it's not about what is being purchased, nor where— but who is behind the interaction.\n\nThe Forter Decision Engine finds patterns across more than one billion identities in our dataset. We isolate fraudsters and protect customers—ensuring everyone gets the experience they deserve. Given that trust is central to how we operate, Forter is very much driven by a defined set of values. We attract remarkable talent and have retention and engagement levels that are well above benchmarks. We're meticulous about strengthening our culture as we grow and ensuring this is an environment where people can have outsized impact.\n\nAbout the role:\n\nForter is looking for a Software Engineer with broad experience building state-of-the-art services and systems to join our Event Streaming team.\n\nThe Events Streaming team is focused on building and maintaining the libraries and services that power our event sourcing system. We're creating an event processing platform with Kafka as the backbone, using a mix of home-frown commercial and open-source solutions.\n\nWhat you'll be doing:\n\nDesign, build, monitor, and maintain event and streaming infrastructure and services used by all of Forter's engineering teams\nBuild a great developer experience for engineers that will use your tools and services\nHelp manage a multi-cloud, geo-distributed high throughput systems with a 99.999% availability SLA target\nWork with a variety of programming languages and platforms\nTackle scalability, performance, usability, and reliability challenges\nBe part of a highly professional team tasked with building Forters next generation streaming systems\nWhat you'll need:\n2-5+ years developing complex software projects and distributed systems in production (Python / Java / etc.)\nBe a good communicator and a good collaborator; be passionate about technology; enjoy solving challenging problems\nSolid experience of working in the various stages of the Software development life cycle - from requirements to deployment (extra bonus if you've led some of these yourself)\nExperience with AWS or other public cloud services\nFluent in written and spoken English\nProjects you could work on:\nDesign and implement features as part of a self-service streaming platform for Forter's event pipelines. Including DX, future plans and education\nCreate tools and applications that enable Forter engineering team to quickly and efficiently deploy streaming applications\nFacilitate the migration of many systems (thousands of servers) to cloud-agnostic technologies (like Kafka instead of SNS, etc.) with no downtime\nImprove the dev experience around existing event-infra tools, create new tools to improve client productivity\nProvide users with visibility and alerting capabilities over their production critical event processing pipelines\nIt'd be really cool if you also:\nHave experience with Kafka or other streaming engines\nExperience with considerable scale (100s of millions to billions of events/transactions per day)\nExperience working on DX or Infrastructure teams\nExperience with standard software engineering practices: proficiency in writing tech docs, testing and observability stacks (prometheus, grafana, tracing)\nLove communicating about technical subjects (comments, docs, announcements, presentations, you name it)\nLife as a Forterian:\n\nWe are a team of over 500 Forterians spread across 3 different continents. Since 2013, we've raised $525 million from investors such as Tiger Global, Bessemer, Sequoia Capital, March Capital and Salesforce Ventures. We're on a mission to bring trust to global digital commerce so that companies like Nordstrom, Priceline, Instacart and ASOS can block fraud, drive revenue and improve customer experience.\n\nAt Forter, we believe unique people create unique ideas, and valuable experience comes in many forms. So, even if your background doesn't match everything we have listed in the job description, we still encourage you to apply and tell us why your skills and values could be an asset to us. By welcoming different perspectives, we grow together as humans and as a company.\n\nForter is an Equal Employment Opportunity employer that will consider all qualified applicants, regardless of race, color, religion, gender, sexual orientation, marital status, gender identity or expression, national origin, genetics, age, disability status, protected veteran status, or any other characteristic protected by applicable law.Show more Report"}, {"company": "Apple", "job": "Senior RT SW Engineer - WiFi MAC", "city": "Herzliya", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=322&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fcbfd133&cb=1676382709726&jobListingId=1008372347490&jrtk=3-1-1gp8349s8kuhv801-1goojmeb9ghp4800-9a0a0b55daa8a7bb-", "description": "Summary\nPosted: Feb 1, 2023\nWeekly Hours: 42\nRole Number:200000408\nDo you imagine what you could do here? At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple products. Apple is looking for an extraordinary FW engineer to drive state of the art technologies for Apple products. In this role, you will work with a variety of disciplines and products, developing software and firmware at the WiFi MAC Level. You'll ensure that every aspect of our products works both on its own and together. It’s our goal to make Apple products smarter and more efficient than ever before. Join us, and you’ll directly impact the functionality of devices people use worldwide.\nKey Qualifications\n5+ years of Low Level Embedded software/firmware development - Mandatory\nExperience and proficiency in C development - Mandatory\nExperience with communications protocols and host I/F such as TCP/IP, UDP, USB, PCIe, UART et\nPreferable - Experience with developing mobile products and protocols, WiFi, BT, Cellular, etc\nPreferable - Experience using other common programming languages, such as Objective- C, Java, C++, Python\nPreferable - Experience with ARM micro-controllers\nPreferable - Experience with development in OSX and iOS environments\nExceptional problem solving and debugging skills\nIndependent, highly motivated, with good interpersonal skills\nDescription\nAs a senior WiFi MAC Software Engineer, your contributions will include the following: Writing design documents. Designing and implementing software and firmware for WiFi and 802.11 MAC Level features at the MAC. Optimise and fine-tune the firmware and MAC Level algorithms. Involvement in firmware architecture design, and system level requirements from top-level down to block level. Develop and support OSX development tools and kernel drivers. This role requires high sense of responsibility and ability to work in team. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our practices — strengthening our commitment to leave the world better than we found it. You should join us if you want to help deliver the next amazing Apple product!\nEducation & Experience\nB.Sc or higher degree in Computer Science or technically equivalent field is required\nAdditional RequirementsShow more Report"}, {"company": "ironSource", "job": "Senior Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "ironSource Aura, a revolutionary large scale mobile platform, is looking for an outstanding and passionate data scientist to join our team.\nYou'll have an opportunity to research, design, implement, and evaluate a variety of advanced ML algorithms using the latest technology.\n\nRequirements:\n\nMSc or PhD in Data Science, Computer Science or Engineering\nAt least 7 years of experience as a data scientist\nExperience solving complex business problems using state of the art algorithms\nStrong knowledge of Python\nSolid background in algorithms, data structures, and programming\nGood understanding of probability and statistics\nExperience in leading data science projects from idea to production in various domains and using various ML solutions\nAbility to mentor others, work in teams, teach and learn from peers\nTeam player, ability to handle several tasks simultaneously\nIndependent, out of the box thinker\nRole:\n\nApply cutting edge solutions while leveraging our vast amounts of data\nDevelop on-line and scalable models and tools using machine learning, deep learning and NLP techniques\nTake on projects end-to-end from business question all the way to production\nWork alongside machine learning experts, big data engineers, product managers and developers from across the organization to solve complex problems\nContribute to continuous learning and knowledge sharing within the data science group, in order to stay ahead of the curve\nLead innovation initiatives and stay in tune with the latest technologies and algorithms\nBusiness Unit:\n\nData & Analytics\n\nAdvantages:\n\nExperience with working with ML frameworks (e.g., Sagemaker)\nExperience working on an applied recommendations system solution\nExperience in NLP and deep learning techniques\nExperience with machine learning tools such as Tensorflow, Keras and Pytorch\nExperience with big-data frameworks (e.g. Kafka, Spark)\nSkills - Technical 3:\n\nKafkaShow more Report"}, {"company": "RYB Technologies", "job": "Full Stack Team Lead 555226", "city": "Jerusalem", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=324&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d15bf2e2&cb=1676382713018&jobListingId=1008010249210&jrtk=3-1-1gp834d3vk27b801-1goojmeb9ghp4800-f65048b9c1b5b083-", "description": "Exciting Fintech company creating the most current technologies seeks a Full Stack Team Lead.\n\nYou are:\nA passionate developer, and Team Lead. You think big and enjoy finding solutions to issues and having input on architecture design decisions. You proactively learn new technologies and find the best ways to implement them. You’re able to thrive in fast-paced high-performance environments and enjoy the challenge.\nYou enjoy managing a team, in a personable and friendly manner, guiding and mentoring. You’re passionate about ensuring best practices are met, while not compromising on creating beautiful, clean code. And are able to bring your team along with you.\nYou value flexibility in order to prioritize your personal life without giving up on the technical challenge that drives you to love your career. You’re self-disciplined enough to work remotely and deliver results on time. You strive for perfection and want to improve bad code when you see it.\nYou have a high level of Hebrew (both written and spoken) and conversational English to communicate with both Israelis and international teams.\n\nWe are:\nA Full Stack team responsible for the company’s leading product in the marketplace lending space. Our team is the first to explore and integrate new technologies and tools. We are responsible for creating API-driven cutting-edge solutions that are disrupting the way Fintech is done. Our microservice-based architecture provides a complex asynchronous distributed system needed for time-critical payment processing and other services, with thousands of transactions per day. Our team is fully autonomous with complete responsibility for the product pipeline, employing Agile methodology alongside state-of-the-art CI/CD principles.\n\nYou will:\nLead a team in developing end-to-end robust enterprise systems for the Fintech sector using leading frameworks and technologies, with a strong focus on the back end.\nBe part of exploring and integrating new technologies and tools, such as AWS and big data.\nDevelop microservices and build multithreaded enterprise applications end-to-end.\nDesign, develop, test, deploy, maintain, and improve our systems and services.\nWork closely with other developers to create the tools that will help our partner’s clients grow their businesses\nMentor and guide other team members when necessary\n\nYou have:\n\nMinimum 8 years of similar experience with our stack (or similar technologies)\n\n3+ years team leading experience\n\nBuilding multithreaded enterprise applications end-to-end using\n\nThis is a back-end heavy role\n\nExperience working in an Agile\n\nHigh level of Hebrew and English (both written and spoken)\n\nThe Tech we work with:\n\n.Net Core,\n\nWeb APIs,\n\nMicroservices approach\n\nAngular 2+,\n\nRabbitMQ (or another messaging system)\n\nDocker\n\nUnit testing using Jira\n\nNServiceBus and Elastic Search (a plus)\n\nAWS is an advantage\n\nThis role is based in Israel - from home or from the Jerusalem office.\n\nPlease send CV to jobs@rybtech.comShow more Report"}, {"company": "Perion Network Ltd", "job": "Senior Data Engineer", "city": "Holon", "date": "9d", "rating": "4.7", "link": "", "description": "Perion is a global advertising technology company delivering solutions to the biggest brands and publishers around the globe across search, social media and display, video and CTV.\n\nHome to an award-winning technology solution –– with our unique data-driven AI/ML based technologies, we deliver and optimize hundreds of terabytes of data and billions of events per day. We're working with dozens of sources to provide a superior experience across screens and platforms, including mobile, video, social and native.\nUndertone, A Perion Company, is at the forefront of digital advertising, working with the top brands, advertisers and publishers in the world. We're creating memorable ad experiences by thoughtfully orchestrating solutions across video, advanced TV, rich media, and social, to drive unmatched brand lift and audience engagement on virtually every screen, and every device.\n\n\nUndertone applied the award-winning product, SORT™ –– the only privacy-first cookieless targeting solution that enables advertisers to reach their audience at the exact moment they are most receptive to seeing an ad without invading users privacy. For more information on SORT, visit perion.com/sort-mini-site.\n\n\nWe are looking for a highly skilled Senior Data Engineer to join our group to the journey of leveraging Big Data to revolutionize our offering, business operations and decision making across the company's ecosystem.\n\nJob Responsibilities:\n\nDesign, build & deploy complex backend data solutions to prod, starting from research and design to development and testing.\nBeing able to process Terabytes of data while providing the best possible performance and SLAs using the most state of the art big data technologies\nWork closely with product, architects and other R&D teams to deliver the best solutions to the business.\nMonitor the solutions in production to make sure they are fully stable, scalable and performant at all times.\nWork closely with data sciences experts\n\nProfile and Experience:\n\n+3 years of proven experience in building complex backend data solutions end to end – mandatory\n+3 years in working with big data tools, processing and transferring large amount of data between systems - mandatory\n+3 years in working with Scala & Spark - mandatory\nProven ability of writing complex SQL queries – mandatory\nStrong analytical and problem-solving skills with attention to details - mandatory\nSolid knowledge in Python and Linux operating systems – mandatory\nExperience with Amazon Redshift, Pentaho, Tableau – a big advantage\nExperience with Apache Airflow and AWS tools (EMR, Docker, K8S) – a big advantage\nFamiliarity with the Ad Tech industry and RTB – a big advantage\nExperience with data science algorithms – an advantage\nExtensive experience in OOP, Unit testing/TDD, continuous Deployment – an advantage\nFamiliarity with at least one of the following technologies: Java , NodeJS - an advantage\nFluent verbal and written English skills requiredShow more Report"}, {"company": "CEVA Inc", "job": "SW Automation & Validation Team Leader", "city": "Herzliya", "date": "30d+", "rating": "3.6", "link": "", "description": "CEVA Software department is looking for an experienced and highly motivated SW Automation & validation team leader to join us and be part of CEVA’s next generation state-of-the-art AI and deep learning processors and accelerator development.\nThe group design, develop, validate and release processors modelling and simulations using C++, and takes an active role in the design of future architectures.\nThe SW Automation & validation team leader is responsible for aspects of Software verification, validation and release.\nRoles:\nLeading automation verification and validation activities that are required to release the product for customers\nCoaching engineers with automation test design and writing, procedures and methodologies\nReview specifications and technical design documents to provide timely and meaningful feedback\nCreate product verification and validation test plans and manage the tests execution.\nLeading the design and develop of new automatic tests for new features and products.\nConsistently, review, analyze, Improve and maintain test automation infrastructures and reports\nTight collaboration with architects, development teams, other validation teams and business units\n\nRequirements:\n\nBSC in computer science\n3 years experience in leading V&V team/s based on automation\n4 years experience as validation engineer\nExperience with V&V activities in large or medium organizations\nFormal and practical knowledge of testing methodologies\nHands on experience in test writing and automation (C++, C, Python, Perl)\nExperience with Agile methodologies\nExperience with Simulators, Compilers, processors and AI related product validation – big advantageShow more Report"}, {"company": "Beach Bum", "job": "Senior UI designer", "city": "Raanana", "date": "30d+", "rating": "4.3", "link": "", "description": "You're invited to Join Beach Bum, the greatest gaming family that brings a new twist to classic games by introducing them to the world of online casual games.\nWe’re looking for a highly motivated and talented UI/UX designer to join our team and to one of our top products. In this role, you will be responsible to single handedly create new amazing visuals for our game, influence its UI, and have a personal effect on the product from top to bottom.\n\nResponsibilities:\nCreate, influence and design, fun engaging features and in-game events for our wonderful and diverse content.\n\nWork in upbeat dynamic environment, making quick decisions within tight deadlines.\n\nCollaborate with product management and developers to implement your art into the game.\nJob requirements:\nAt least 3 years of experience in game UI, and extended understanding of gaming principles.\n\nExcellent knowledge of Adobe creative suite (Photoshop, Illustrator, etc.)\n\nStrong design, composition, conceptual ideation abilities and strong understatement in typography.\n\nA multi-task personality.\n\nKnowledge of 3D - a bonus.\nWe regret that only shortlisted candidates will be notified.Show more Report"}, {"company": "Imperva", "job": "Software Engineering Team Leader, Data Security", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Imperva is a multi-billion dollar cybersecurity company, protecting the world’s largest organizations from cyber-attacks. We work in a Hybrid Model from home and from the office (Rehovot, Tel Aviv) and we have been recognized as one of the Best 50 high-tech companies to work for in Israel 2022 by Dun & Bradstreet!\nhttps://www.duns100.co.il/Imperva_%D7%90%D7%99%D7%9E%D7%A4%D7%A8%D7%91%D7%94\nWe are looking for an Software Engineering Team Leader to join and lead a team in our Data Security Agents group.\nThe team is responsible for developing & testing Data Application Monitoring solutions, and specifically the Agent product that runs on multiple platforms. As a Software Engineering Team Leader, you will be leading a team that develops our state-of-the-art product and be responsible for different technologies and projects end-to-end while maintaining high-quality standards.\nYou will be involved in high profile projects and gain a unique perspective into Imperva’s Data Security solution.\nResponsibilities:\nLead a team of software engineers and test engineers in a challenging agile environment\nLead feature development end-to-end\nBecome an expert in the Data security components\nSupport Imperva’s customers with Data Security product\nSubstantial hands-on work\nProfessional growth of the team members\nProduce quality products that meet high security, stability and performance standards\nRequirements:\nB.Sc./M.Sc. in Computer Science or equivalent from a known university\nStrong understanding in C\\C++ – Must\nAt least 2 years of \"Hands On\" leading a team of developers - Must\nHigh technical capabilities\nExcellent design and analytical skills\nVersatility\nGreat interpersonal skills\nStrong background in Linux systems – Must\nExperience with different operating systems - Advantage\nLegal Notice\n\n\nImperva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, ancestry, pregnancy, age, sexual orientation, gender identity, marital status, protected veteran status, medical condition or disability, or any other characteristic protected by law.\n#LI-OK1Show more Report"}, {"company": "Placer.ai", "job": "Fullstack Tech Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai's platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai's customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world's top-10 retailers, 2 of the top-10 CPG firms worldwide, a world's top hospitality firm, 2 of the world's top-10 commercial real estate (CRE) firms and 2 of the world's top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\nSUMMARY:\n\nBuild end-to-end features in our main data-driven product.\nDesign, develop and implement complicated web applications based on heavy data processing and data analytics, GIS, rich UI modules, and complicated algorithms.\nInvolve and lead functional and infrastructure modules architecture and design\nWork closely with our business product teams and architects\nTechnically mentor, and technically lead frontend and full stack developers\n\n\nRESPONSIBILITIES:\n\nTechnically lead and mentor a team of talented Fullstack and Frontend developers\nDesign and create state of the art web application and UI and data oriented modules and infrastructure\nDevelop and own micro-services, features and components\nCollaborate with other teams (architects, data, backend, analytics, data scientists, …)\nDefine implement and improve monitoring KPIs, performance, stability and overall quality of infrastructure and functional modules\nREQUIREMENTS:\n\nAt least 4 years experience as a Fullstack Developer\nAt least 2 years of experience as technical leader / software architect\nAt least 2 years working knowledge of React 16.8+\nDeep understanding in at least one: Node.js / Python\nDeep understanding of at least one of Redux, MobX, NgRx, Akita, GraphQL\nDeep understanding in unitest in React (Jest - advantage), Node.js\nUnderstanding of WebPack\nCS degree or relevant experience\n\nOTHER REQUIREMENTS:\n\n2+ years experience with Pandas, Celery, RabbitMQ, MongoDB - advantage\nExperience with microservice architecture\nExperience with Docker & Kubernetes advantage\nExperience with Cloud (experience with Google Cloud Platform - advantage)\nExperience with large scale data pipelines - advantage\nExperience with CI/CD flow under Jenkins\nExperience with different Mapbox/Google map solutions - advantage\nA leader and a mentor, self-initiating, self-motivating, self-learner\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai's applicants are considered solely based on their qualifications, without regard to an applicant's disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai's Human Resources Department to make the need for an accommodation known.\n\n#LI-AC1Show more Report"}, {"company": "Magic Leap, Inc.", "job": "Senior Embedded Engineer", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=330&ao=1136043&s=58&guid=00000186313b391fb432b32c63b9f3d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c306f4a4&cb=1676382721991&jobListingId=1008438361221&jrtk=3-1-1gp834lrujca7801-1goojmeb9ghp4800-73d7a7a9c726e428-", "description": "Job Description\nBeing a part of a real-time embedded development team that works on cutting edge technology. Developing software for an in-house designed ASIC and complex system controlling several real-time sensors. Debugging, bringing up and integrating new hardware\nResponsibilities:\nDeveloping end to end features in an embedded system including drivers, services and host support tools for a complicated state-of-the-art system.\nBringing up, debugging and integrating new ASICs.\nInterface with hardware VLSI team for design, implementation and debug of internal IP.\nWorking on bare-metal processors and integrating with an RTOS.\nWriting tests to verify the hardware in several stages of development.\nBeing a part of one of a kind technology that involves new hardware development.\nQualifications:\n5+ years programming experience in C/C++.\n5+ years of working with embedded systems.\nExperience working on bare-metal without an operating system or with an RTOS.\nDeep knowledge of the internals of processor execution and ability to debug software in a low-level manner.\nKnowledge in scripting languages such as Python / Perl.\nEducation:\nBSc/MSc in computer science or Electrical Engineering\n\nAdditional Information\nAll your information will be kept confidential according to Equal Employment Opportunities guidelines.\n\n\n#LI-REMOTEShow more Report"}]