[{"company": "Palo Alto Networks", "job": "Product Line Manager- Cortex XSIAM", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.2", "link": "", "description": ""}, {"company": "Deloitte", "job": "Service Management Consultant", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1110586&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_74739a80&cb=1676382401804&jobListingId=1008148357587&cpc=8795CF9063CD573D&jrtk=3-1-1gp82qt68khrt801-1goojgdmaia1a800-03303249ce9d8c58--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDhjmyhCvKeEsfP4xf4bhrqpmMRhjZeb0yapDxgCdfiMme5X1YKHqYYJmM2JUxpyefIyx1Ne1yYfoJB8dPa6qYKeNhqLkjEzUaG_Ag0XohwZ4WYVaHeDRk4OvheNC6n7hlECPDCVJTeqShB8fQAlvPT7a6EF92lthcR1HWT4cj0bH1WFtomJVMVzpY2x_cZeCygDeYJi_GK07WAyvXz2cKDru7NTvE-ne13lDo200opLPy8EF3CFO7o8JNzRIHJ_Wh1UcUKPfKL8EJjqZyBVuKSrjK0NHip0K0VwZkEiWT5UvzIh6F8YFrJHl708FPG7aOjyUX7FLtOND4rgC9tLdtNzStQlkT63sm970-3aPXcxlTCjqef3ObYMLrp7iXa-2eOToRWY62Galm8SiQdhlRdddMaDlJeZWElhswq7DcYPEy3leZWBGv3YSuapUG2zhq8qS5SfnpQWTu7CzkLaV54P7_4strC3-4Gp_VfKtjVrlhzxNl9T3dM5ZaUsTnJaImuEnZtb0E_mNwxgewATnd5jej_FE918ZQaVMoB81MG6O6hQhdSxgwsddn5vUmaY-ML1lD6E0fa0BwJK1T2Vdrr-zgUhq1nHFFxxCMacZvaEmUmKFPdAa-9lowEavsrJWlv5cLvC26tZuBbB0mL1vOZ", "description": "We seek our next service management consultant for our growing service management practice in Deloitte, the world's leading consulting firm. We combine methodology and technology and design, develop and deliver art of the possible solutions. We are looking for a passionate consultant who seeks to understand tech-related service and operations and make a true impact on our customers by guiding then on best practices. Job Description: -Conduct assessments and provide professional guidance and advice based on industry best practices -Help our customers craft processes and procedures around service management practices support with implementing them -Assist our customers implementing continual improvement practices (management routines, measurement and reporting, service level targets, metrics and KPIs) -Lead design workshops, craft design documents and provides guidance to the technical staff on customizing the service management platform -Educate and train the customer’s employees on the new processes and procedures Bachelor’s degree in information systems, or industrial engineering and/or master’s in business administration Excellent verbal and oral skills, high-end presentation skills Experience in tech-related service management functions (e.g.\n\nIT service desk, IT operations, customer support) Experience in leading implementation projects (requirements, testing, training) Knowledge of ITIL/ITSM – advantage Knowledge of ServiceNow - advantage At Deloitte, we believe that an inclusive mindset and diverse workforce are two of our greatest competitive strengths. That's why we continue to reinforce our commitment to foster inclusion.Show more Report"}, {"company": "AIRLIFT One", "job": "Head of Autonomous Flight", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f8f450b8&cb=1676382403164&jobListingId=1006733218955&jrtk=3-1-1gp82qugckbns801-1goojgdmaia1a800-dc6a6cbf812ef2c1-", "description": "TEL-AVIV, ISRAEL ENGINEERING FULL-TIME\nAbout AIRLIFT One\n\nBased in the heart of Startup Nation, at the intersection of aerodynamics, autonomy, and electric propulsion - we are changing personal aviation.\nAIRLIFT One enables you to travel 5 times faster than a car by introducing the world’s most efficient all-electric vertical take-off and landing aircraft: an air taxi for 2-5 people. You won’t have to own one, you will simply pay per ride and call it with a push of a button.\nIt’s our mission to make air taxis available to everyone and as affordable as riding a car.\n- Take-off and Land Anywhere -\n\nQuiet electric vertical take-off and landing (VTOL) is the technology that will change travel forever.\n\nIt enables you to access city centres with an aircraft. Leaving the city after a stressful day will soon be transformed into a thrilling ride. By travelling through the air you’ll be able to avoid time-consuming traffic jams, while enjoying a magnificent view.\nAbout the Role\n\nWe are looking for an outstanding Leader who will set up our Autonomous Flight Department to join our innovative team and thus shape the future of aerial e-mobility.\nYou will have the unique opportunity to work on our Autonomy System for the AIRLIFT One, essentially teaching our planes how to fly on their own.\nShape things from scratch, from concept definition and evaluation to hardware selection, integration. Coordination with the authorities regarding the legal and operative framework is a vital part of this role.\nYou will design and develop state-of-the-art Deep-Learning-based computer vision, perception and decision-making algorithms that enable an autonomous aircraft to analyze, understand, and interact with its environment.\nImplement the above algorithms on high-performance on-board computer platforms within a scalable autonomy software architecture.\nSupport the validation of the above algorithms using real-world and synthetic data from autonomous aircraft.\nTasks may include:\nDevelop and evaluate the autonomy concept and manage the complete development life cycle from requirements definition to Qualification and Certification.\nDeveloping systems for probabilistic sensor fusion and data association using cameras, LIDAR, RADAR, IMU, GPS, …, etc.\nWriting multi-threaded and GPU applications, estimation & Localization applications and probabilistic factor graphs; applying Computer Vision techniques - Classical and Deep Learning.\nReview and selection of suitable sensors and integration into the autonomy sensor suite\nSetup and rollout of processes and tools for the department\nIntegration of autonomy components into the avionics and flight control systems\nOver time build, train, develop a local time\nCoordinate with potential partners and authorities\nActively help shape processes of the respective department\nWork on any ad hoc projects or tasks\nQualification:\nExpertise related to Deep Learning for computer vision, perception and decision-making\nM.Sc./PhD in Robotics, Computer Science, Aerospace Engineering or similar degree\nExtensive experience with autonomous systems, preferably aerial robotics\nExperience with environmental perception and self-localization algorithms\nSound knowledge of current AI concepts and their capabilities\nKnowledge of sensor fusion techniques and demonstrable experience of their application\nClear communicator and team player\nHigh level of self-reliance and an autonomous target-oriented work style is a must\nTarget-oriented, driven work style with analytic problem-solving skills required\nFluent English language skills are essential\nYou can Shape your future and Leave your footprint with usShow more Report"}, {"company": "אומניסיס בע''מ", "job": "Algorithms researcher", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "InspHire", "job": "Art Director", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "A TLV-based startup that’s on a mission to change the work experience for 80% of the world’s global workforce is looking for a talented, experienced and creative Art Director with managerial experience to build creative capacity at scale within the company.\n\nApply here to help shape the future of work!\n\nAbout This Role:\nAs an Art Director you will develop and execute a creative strategy to meet the company’s business goals and support its growing marketing efforts. This includes establishing the studio in-house to support all creative needs. Focus areas cover motion graphics, directing photo and video shoots, illustrations, website, landing pages and the creation of digital assets at scale, OOH marketing and traditional marketing.\nOwnership & Responsibilities:\nRecruit and operate an in-house studio\nCraft a creative business strategy aligned with business goals supporting an ever-growing marketing budget across multiple channels (acquisition oriented)\nLead the marketing creative team and manage the creative process from A to Z, collaborate with the Content, Marketing and Product teams\nSet the visual tone/direction of campaigns to build concepts and bring them to life\nResponsible for delivering marketing assets at scale for a variety of channels: banners, landing pages, video ads, newsletters, blogs, social posts, etc.\nTurn creative briefs into beautiful marketing assets\nPrioritize projects and work on tight deadlines\nBe on top of the marketing assets performance, initiate data-driven AB tests and always strive to improve conversion rates\nWork closely with external vendors, stakeholders and partners\nQualifications:\nProven experience in building and managing a studio / a significant creative team\n5+ Years of experience as a designer or related positions in a marketing agency - a must\nExperience with motion graphics, directing video shoots, and digital marketing assets\nTeam player with the ability to work with strategists, data scientists and account teams in a fast-paced environment\nUnderstand how to scale ideas for global deliverables\nExperience designing for different audiences (B2B, consumer, enterprise)\nPossess strong art direction/design skills\nFollow brand guidelines and work within a design system\nProven experience working across teams, both in leading projects, and collaborating on work\nAttention to details and high sensitivity to aesthetic\nCritical thinking and storytelling skills\nExcellent communication skills, both verbal and written\nFamiliarity with online marketing metrics\nPortfolio of beautiful, compelling digital and brand-oriented workShow more Report"}, {"company": "Surprise.com", "job": "Product Owner", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.0", "link": "", "description": "Surprise.com is a technology company on a mission to build the world’s first entertainment super app – combining videos, social, games, and shopping in a delightfully gamified, thoroughly enjoyable single app experience. We do this today for the same reason we began with on day one: to turn the magical, uplifting experience of Surprise into a daily, weekly, and monthly life event – because it makes people happy.\nWhat we are doing has never been done before, and like any innovator, we face challenges on a daily basis that require top minds in their fields to break through. So, we have been steadily building an international team defined by courageous ideation, relentless drive for impact, and meritocratic leadership. We are asking you now to envision yourself as a valued member of our winning team, on this inspiring mission.\nSurprise is looking for an experienced, and extremely motivated, B2C Product Manager from the gaming or social industry, with an entrepreneurial spirit and passion for building products 0-to-1, from inception to product-market fit. A problem solver – an inventive thinker that will provide insightful, innovative solutions to any problem. As a Product Manager, you’ll get the chance to make a direct impact on the core Surprise user experience, help scale our product strategy and the success of our features. You’ll also have a great impact on the company’s business performance.\nWhat will you be doing?\nLeading the success and growth of the product/feature by developing a product vision, strategy, roadmap and lifecycle management framework;\nSeeking opportunities for key initiatives to improve the customer experience;\nWorking with our designers to develop hyper-engaging user flows, from wireframes to highly polished UI;\nCollecting and analyzing requirements, writing clear and detailed PRDs, defining A/B tests, for an effective handoff to engineering;\nWorking with all relevant cross-functional teams (R&D, Design, BI/BA, Art, Engineering etc.) to guarantee fast delivery to our users;\nOwning the success of the feature once it’s released to production by running tests and optimizing performance and business results.\nWhat are we looking for?\nAt least two years of experience as a Product Owner or Product Manager in the gaming or social fields;\nA proven record of shipping impactful games, or features on live games;\nGoal-oriented, highly motivated, and comfortable taking extreme ownership of projects;\nDeep knowledge of design principles and an expert Figma user;\nStrong organizational and analytical skills, with obsessively high attention to detail;\nTechnical chops to understand the architecture of a complex app/feature, and an ability to engage in meaningful discussions with engineers;\nAdapts well to a dynamic and rapidly changing work environment;\nExceptional communication skills and can clearly convey messages in English (written and oral).\nBenefits\nWork on interesting and challenging projects, while building a pioneering app category;\nModern office in the heart of Tel Aviv;\nGreat atmosphere, with the vibe and energy of a high-growth tech company;\nCompetitive salary and equity;\nAn immersive English-speaking work environment (we have a lot of native speakers at the office);\nDrinks and fresh fruit;\nPaid time off and Public Holidays.Show more Report"}, {"company": "Klips", "job": "Senior Product Designer", "city": "Ramat Gan", "date": "24h", "rating": "2.0", "link": "", "description": "Klips is a fast-growing innovative Fintech company, creator of next generation Financial Hub including Crypto trading, CFD trading, Digital Banking facilities, Shares dealing, Payments, and CRM, using cutting-edge technologies to bring a new era in financial freedom terms.\nWe solve real day-to-day problems by unifying financial services and making them accessible while reducing the friction caused by using multiple service providers. We are now recruiting the Klips core team! This is your opportunity to take part in changing the financial world.\nKlips is a global company with offices in Israel, Cyprus, Romania, and South Africa.\nWorking in Klips means enjoying the flexibility, personal growth, and professional development.\nJOIN US!\nRequirements:\n\nStrong UI and UX design ability\nFluent English communication capability is required\nBachelor or Master degree in Art/Design, or equivalent professional experience\n8+ years of professional user experience/product design experience\nGlobal design project experience is nice to have\nExperience on branding design is nice to have\nWorking experience in big companies is nice to have\nExperience in trading, crypto, banking & finance is a big advantage\nResponsibilities:\n\nResponsible for the product design of Klips(UX/UI), improving user experience of all products.\nDiscovering design optimization points, improving design standards, and promoting implementation.\nUnderstand and respond to user problems and data (measurement tests, usability studies) to provide design decisions and recommendations.\nWork with a cross-functional, cross-regional team of designers, product managers, developers and other stakeholders.\nBalance user needs with technical constraints to help realize the team’s ideas, translating these ideas into extraordinary visuals.\nJoin projects at varying stages of production, ranging from prototyping to providing scalable production resources, to polishing and optimizing UI assets for shipping, working closely with engineering to ensure a high-quality product.\nParticipating in Design System building.\nWhat we offer:\n\nWorking at Klips\nDo something meaningful; Be a part of the future of finance technology and one of the leading company in the new industry vision\nFast moving, challenging and unique business problems\nInternational work environment, flat organization, flexible working hours\nGreat career development opportunities in a growing companyShow more Report"}, {"company": "InspHire", "job": "Game Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "A global leader and original creator behind a gaming blockbuster series with over 250,000,000 downloads is looking for a talented experienced Product Manager . To put it simply - they make natural gaming evolution come to life and they're growing like crazy! The company's reach is made possible by the expertise of experienced teams in the Web3 gaming space . Want to be part of a fast-paced company that lands in the top of app stores charts and of of the world's leading mobile games in its category.\nSee more details below!\nJob Role and Responsibility:\nOversee the execution of the project’s roadmap and whitepaper, to bring the game’s concepts and features to life as an end-to-end product owner\nLead and supervise the design and the development of in-game features and mechanics.\nManage and oversee the game’s design documentation.\nIdentify the weak area and monitor the on-going health of the games, while spotting potential pitfalls in the design and the execution of the company's games\nCollaborate with other team members such as; game producer, game designers, game developers, Art department and QA specialists\nWorking in a dynamic, flexible and constantly evolving environment to maximize efficiency while using creative solutions\nAnalyzing and interpreting data and making meaningful conclusions to provide insights on game features\nQualifications:\n3+ years of experience in product management or equivalent role in gaming\nMathematical and analytical skills with critical thinking\nStrong data analysis skills with ability to leverage data based decisions with fast implementation of these decisions\nExperience being part of building successful games, drive planning, development and official game’s launch\nAbility to explain your ideas clearly and logically while understanding technical subjects, new technologies and their relevance to our innovating project and space\nExcel knowledge allowing you to build complex models for team presentations\nComputer science, Economics, Business, Game Development or related degree\nExcellent English to communicate with the international team.\nExperience with web 3.0 games – Nice to haveShow more Report"}, {"company": "AudioCodes Limited", "job": "Full Stack Developer", "city": "Central", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_83c4805c&cb=1676382412304&jobListingId=1008435459430&jrtk=3-1-1gp82r7ep2ths001-1goojgdmaia1a800-08b15e65ddb8d412-", "description": "Description\nAudioCodes is a leading vendor of advanced communications software, products and productivity solutions for the digital workplace. We are a dynamic engineering department that designs and develops cloud-based, SaaS enterprise solution enabling to capture, organize and share meeting content using state-of-the-art Voice.AI technology.\nWe are looking for a long-term relationship with a Software Front End Team Leader, who is passionate to investigate, learn and implement new technologies, as well as be happy to think out-of-the-box going beyond the immediate job description.\nResponsibilities:Design client-side and server-side architectureIntegrate 3rd party servicesDevelop and design RESTful services and APIsDesign and implement flexible, scalable and resilient Software Product according to UX design best practicesDesign and make technical decisions based on research and POCsAnalyze requirementsImplement Test Driven development practicesEnsure high performance\nRequirementsBS degree in Computer Science or Software Engineering3 years of complex Software products developmentProven experience in managed languages, strongly preferred C#, .NET CoreSystems thinking and good analytical skillsTeam player, confident and enthusiasticHigh Self-Learning ability and Outside-Of-The box thinkingFamiliar with testing frameworks\nBig Plus:Proven experience with ReactJSFamiliar with Cloud architecture and microservicesFamiliar with Cloud security principlesExperience with AI based implementationsShow more Report"}, {"company": "JobInfo", "job": "AI Researcher", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a66986a9&cb=1676382413650&jobListingId=1008366372894&jrtk=3-1-1gp82r8onjm5i801-1goojgdmaia1a800-e2610cbf8d087c99-", "description": "Job Description:\nWe are looking for a passionate AI Researcher with solid software engineering skills to help our growing machine learning team to face the biggest challenges in the fields of search & digital advertising. As an AI Researcher at CodeFuel, you'll work with huge volumes of data to solve real-world problems using state-of-the-art machine learning technologies at scale.\n\n\nJob Responsibilities:\n\n\nYou will train and serve cutting-edge machine learning models.\nYou will design & code end2end ML pipelines at a high scale.\nYou will dive deep into CodeFuel data to explore, identify & communicate key insights.\nAdditional Positions:\nCategory:\nSoftware\nJob Qualifications:\nB.Sc. in a quantitative discipline (Computer science/ Software Engineering/ Electrical engineering/ Applied mathematics or equivalent ).\nAt least 2 years of industry experience or academic experience (M.Sc.) with ML algorithms.\nmsc in cs/ee\nSolid programming skills in Python.\n\nExperience with machine learning algorithms & techniques.\nExperience with deep learning frameworks (Tensorflow/PyTorch).\nExperience with Natural Language Processing techniques.\n\nUnderstanding of statistics and optimization techniques.\nCuriosity and a strong motivation to learn and improve.\nCompany Occupation:\nInternet related\nCompany Size:\nLarge (150+)Show more Report"}, {"company": "Optimove", "job": "R&D Team Leader", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "Optimove is a global marketing tech company, recognized as a Leader by Forrester and a Challenger by Gartner. We work with some of the world's most exciting brands, such as Papa John's, Staples, and Entain, who love our thought-provoking combination of art and science. With a strong product, a proven business, and the DNA of a vibrant, fastly-growing startup, we're on the cusp of our next growth spurt. It's the perfect time to join our team of ~300 thinkers and doers across NYC, LDN, TLV, and other locations, where 2 of every 3 managers were promoted from within. Growing your career with Optimove is basically guaranteed.\nBased in central Tel Aviv, our R&D operation is a dynamic environment, where every developer can impact the flow of technology – from introducing the smallest library to making significant infrastructure changes. We welcome open-minded developers who like to share knowledge and help each other to push Optimove forward to the cutting edge of today’s tech. We are looking for a brilliant TL Engineer to join our amazing team and work on the company's core system. We are looking for a leader that wants to mentor and create the best team. Also, you will lead in designing and building our cloud-based solutions and be part of breaking the monolith to scale. You will handle challenges of performance, scalability, and availability with a chance to develop and work in top-notch technologies\nResponsibilities:\nTo lead a scrum team of developers.\nEmpowering team members with skills to improve their confidence, product knowledge, and communication skills.\nCreating a pleasant working environment that inspires the team and maximizes team potential.\nDelegating tasks to team members.\nWork in Agile process with Product Managers, UX Designers, and other TLs.\nExcellent knowledge of software design and scalable web architecture.\nIdentify and implement improvements to data quality, reliability & efficiency at the level of the whole system.\ncreate a productive work environment for the team using gamification, trust, and other appropriate strategies\nRequirements:\n\nB.Sc. (or higher) in computer sciences, or equivalent.\n2 years of experience as a Team Leader\nHands-on experience developing .NET/NodeJS backend services - minimum 5 years\nPeople person with strong leadership skills who can motivate and build a winning team.\nOutstanding communication skills, interpersonal skills, and ability to resolve conflicts\nExperience with GCP or an equivalent cloud platform.\nworking with micro-services architecture\nGood Knowledge of SQL and other no-SQL databases\nExperience with Web development (advantage - Angular framework )\nAdvantages\nExperience with event-driven solutions.\nExperience working in a global organization or with offshore teams\nSite:\n\nIsraelShow more Report"}, {"company": "AudioCodes Limited", "job": "Product Manager, Voice.AI", "city": "Central", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_06e00328&cb=1676382416307&jobListingId=1008255192675&jrtk=3-1-1gp82rbbjj4it801-1goojgdmaia1a800-6998718d52be7f54-", "description": "Description\nAudioCodes (NASDAQ, TASE: AUDC) is a leading vendor of advanced communications software, products and productivity solutions for the digital workplace, enabling enterprises and service providers to build and operate all-IP voice networks for unified communications, contact centers, and hosted business services. Our innovative products, solutions and services are used by large multi-national enterprises and leading tier-1 operators around the world.\nAudioCodes Voice.AI focuses on voice, the most fundamental form of human communication, to help enterprises automate workspace collaboration and customer experience by leveraging state-of-the-art conversational voice and bot technologies.\nWe are currently looking for an enthusiastic Product Manager to join the Voice.AI Call Recording and Productivity team.\nResponsibilities:\n Make sure that the team builds and ships products that create both customer value and business value.\nContribute to our vision and strategy.\nExpertly analyze the competitive landscape from both the technical and commercial aspects.\nParticipate in continuous product discovery, including customer interviews, tracking customer needs and selecting solutions that are valuable, feasible, usable and viable.\nBuild and maintain the product backlog and roadmap, prioritize features for delivery and define user stories and requirements.\nWork closely with development and UX/UI teams to estimate features, define requirements and collaborate on release plans.\nCreate documentation and release notes.\nCommunicate product values and benefits internally and externally, to both partners and customers.\nRequirements\nBachelor's degree in a technical field or equivalent practical experience.\n3+ years in product management or R&D team leadership, or in a product-adjacent discipline, with a record of successful delivery of product values in collaboration with development and business teams.\nExperience developing and launching cloud and SaaS enterprise products and technologies.\nExperience in creating product roadmaps from conception to launch.\nExperience in leading the product vision, go-to-market strategy and design discussions.\nAbility to work collaboratively with geographically dispersed teams in different time zones.\nA “get things done” attitude.\nExcellent communication and presentational skills.\nAdvantages:\nSpecific experience in one or more of the following: AI, voice recognition, conversational bots, contact center solutions, cognitive services, unified communications, Voice over IP or telephony, call recording.\nProduct discovery and agile product delivery.\nKnowledge of multiple functional areas such as product management and project management engineering.Show more Report"}, {"company": "אנטריפוינט", "job": "Backend Developer", "city": "Raanana", "date": "30d+", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1110586&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ece9665b&cb=1676382417956&jobListingId=1008383052165&cpc=8795CF9063CD573D&jrtk=3-1-1gp82rcs7kclr801-1goojgdmaia1a800-55b04d2b4ffc8124--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HL-5mTRHumcybNgXRg0YNRYDIxMutFEKOc9ODiVN3eVmucpZ8fKMW67zHHQ4X6nb_3Hj-9nDerd8trcw7sZmFRq1WHiNzLy-dB162LButb--7jfB9Snqs_P8bsS4x4tqCvS7NVUVH-mMNtctOW8BtGT4bsLcTWny5fzc7WwB4faabTiUBg9GW1SyhXNpfq2P9Z2ei5ytfvP9O1Nu7v7BaVmHu_mSpPcqy-MLsBuSBzeXUNg9KZ7-O2RXK3c6CxeClGtXsP_kYt0cwnAXF_MABUQEoJKYpu9wu3nuZRmLWXWno3w_btuWjguffVl5y8g--SM224f00n195oI0kW5YNrsLAP7LJ5gU-R02HdF46x1Prf_ne-tkCAnlLSwb-9H3TL3Uk4G3_BM_J8Lt4a6ZoK-6xfFcN-lsAAUGi71Xpf0WH0XTiF7B2zuMuuTWORyd_y8xggLrpqIjrD4fGlBbdWSTatJB3i1GTk8uDop4CbMzDfKy4keTdDteSFbyUZvhG8MRHmNKBY6V2UO5IbM7iLEhQ3O8WWC2rbvSXg9ZH9mfPjMwtyxLBoejj924GZ7toTnWTLmQLSFKqBOfMcayYLNffHgA73Bz08MwhgPfTympzozaDjKpFEXmPXc14rb4HMs14dVF57hRd8TTRhUVR-TKNPNyHKhXBg%3D", "description": "A leading Fintech company is looking for exceptional software developer. you will: Design and develop infra services such as Message Broker, API management, Real-time data stream and other integrations. Apply Event Driven Architecture, serverless approach and implement new frameworks and technologies to deliver state of the art software product The position is located in Netanya 5+ years’ experience with developing and designing modern applications. Experience with Test Driven Development(TDD) – a must.\n\nEvent-driven architecture savvy with hands-on experience. Best Practices knowledge of serverless development AWS lambda.; Extensive knowledge in Event streaming platforms, Apache Kafka / Confluent or AWS MSK, SQS/SNS. Practitioner of microservices approach, decoupling and Saga design patterns. Experience in SQL and NoSQL DB platforms.\n\nStrong C# .net core skills is a must. Proven experience in developing Financial Systems. Familiar with modern CI/CD, ECS/EKS, Git, SonarQube. Enthusiastic agile developer, pair programmer, and team player.\n\nB.Sc in Computer Science is a plus, you’re codding like a beast.Show more Report"}, {"company": "אומניסיס בע''מ", "job": "Senior Web Developer", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1110586&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c9d44f9&cb=1676382419218&jobListingId=1006768798885&cpc=8795CF9063CD573D&jrtk=3-1-1gp82re5pj45o801-1goojgdmaia1a800-656a734591e1f1ad--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBuSwuR2ypQEK41R8_DMolrNJ-9wQtZ1XlnOD2MMhl1zFrkS07G9cq3V2f71wFZTu4bx3CFe1Yn1JGX8-8N0yPONm7GoSysHyf0GoV4dkwunanUNK2Mk0qhh0Lzvdrrc4ff4lpcwMe-AoFIxxCOy71b-1toSQgS-g0jvPfxmb0LGFkSXS6e37ZJqmKYeLZ6X4TOR7uMswzR1PxdeSlVLjeIa8lKznd60hzHknwc_8rVTD02IQ-mDHJkKjnBsxjyLDufvd6gD0rpiprl5I5HX16AgrHXJg9ra6T_XnnBL_fdGSYtDVKpT7-Crs-9rQ8wzsyK_EupbfjCF7Z9k7abYjsFdNKWhlFLpmCDDswylxgQPujWqkDcIaznzIVDWc9PJF51Dd5-9Ujd_qFnpFymt9UDc5PBORqUAvUR6MySVB9-QiIvzH4IJ_g0AikA0DX_SiZeeCpZ7_5yaKwu1aGXsNHjK72AmAyqKIkBPvqz5Y7CL80OxNQ8mkSKWaPZfp-mBfuIoJvWBtUIZNSWIBeca2oIn1JDviKrylexRQruboAbwC3XsNP_ojdwc3mb0q-E8GsrRfCgL-4HF5NLKGkE8Nl1-T0zfGRqbHetcCkEhgPu3QtOWsffxSk7IJ8QfhKGS5mbhJ1Lfi0Dfch4jDRrYSNH", "description": "Are you driven to develop state-of-the-art software for advanced defense systems? Omnisys is looking for a talented Web Developer to join our R&D team. Must Have: Solid experience with Web development using JavaScript, HTML, CSS and HTTP. Strong experience in Angular2+.\n\nStrong Experience in Node.js / C#. Familiar with common databases: PostgreSQL, Mongo. Experience in API design and best practices. Advantages: Familiar with Cesium (G.I.S System) Good Devops understanding.\n\nSecurity ClearanceShow more Report"}, {"company": "Egis", "job": "Track Expert FM", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1ae3e8a7&cb=1676382420602&jobListingId=1008323646984&jrtk=3-1-1gp82rfhpj4gi801-1goojgdmaia1a800-bb22a15caeb904ed-", "description": "General information\nOrganisation\nEgis is a global consulting and engineering firm working in construction, transport and mobility services. Our mission: create and operate intelligent infrastructure and buildings to further the transition to a low-carbon economy and contribute to more balanced and sustainable territorial development.\n\nTo support our growth dynamic, we offer a wide variety of career opportunities in more than 120 countries.\n\nJoining our Group and its 16,000 employees means, above all, sharing our values as a people-first company, strongly committed to sustainability and innovation.\n\nReference\n2022-7980\nPosition description\nJob title\n\nTrack Expert FM\nContract type\n\nPermanent contract\nBusiness Line specific context\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\n\nJob description\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\nBased in Jerusalem, you will be part of our Urban Railway / LRT projects in Jerusalem and our other future transportation projects in Israel. You will lead the area of track engineering and construction, providing high-level advice and be responsible for the supervision of track design and construction on the LRT Blue Line.\nUnder responsibility of the Project Director, your activities will include but not be limited to:Review the design documentation produced by the contractor for track works and construction activities to verify their consistency with the Tendering specifications, the international standards and the state of the art track.Prepare Documents Review Sheets (DRS).Review track design and advise on improvements to track alignment and equipment design.Provide regular support to the public transport client engineer regarding project activities.Participate and coordinate the meetings regarding rail track activities such as design reviews, interfacing and testing supervision.\n\nProfile\n\nTo be considered for this position as Track Expert we have the following requirements:Graduate professional in civil or mechanical engineering and have a professional license.A systemic vision, be a team player, organized sensitive to customer service.Experience of minimum 15 years in rail track / civil engineering,A minimum of 5 years’ experience in Light Rail / tramwayKnowledge of international railway track standardsExperience in a design and build context of railway in an international environment is highly valued.Fluent in written and spoken English\n\nPosition location\nJob location\n\nMiddle-East/North Africa, Israel\nCity\n\nJérusalem\n\nCandidate criteria\nMinimum level of education required\n\n6-Engineer’s degree\nMinimum level of experience required\n\nOver 10 yearsShow more Report"}, {"company": "Fortinet", "job": "Full-Stack Developer", "city": "Israel", "date": "10d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cdc680bc&cb=1676382421789&jobListingId=1008435374880&jrtk=3-1-1gp82rglmkcm2801-1goojgdmaia1a800-7732d801cbd7d30e-", "description": "We are looking for a talented full-stack developer to join our Fullstack team.\nYou’ll be joining a team of talented full-stack developers, developing the management server which empowers organizations to discover Advanced targeted attacks in their network.\nThe process is centered on users’ needs, resulting in intuitive interactions and providing a pleasant and smooth user experience.\nYour job will be working on React/Angular based single-page web applications, implementing pixel-perfect components and screens, and working on expanding the platform’s architecture and capabilities.\nResponsibilities include:\nBe part of the EDR Platform group responsible for the development of the management application, including business critical components and processes, technological challenges, and more.\nDevelop Java based state of the art management platform which orchestrates the control path of the system.\nPrototype and develop new features end to end\nInnovate with new UI structures, front-end capabilities, platforms, and technologies\nRequirements:\nHighly skilled Java Full-stack developer with 3 or more years of experience in development of complex, enterprise-grade systems.\nExcellent user experience, intuition, and skills.\nExperience coding in Java using Spring, Hibernate, and additional infrastructures.\nAbility to work and learn independently as well as in a team environment.\nDevelopment experience in Angular, AngularJS, and Javascript.\nFluent in English (written and verbal) and has excellent communication skills.\nAdvantages\nBSc/BA in Computer Science (or equivalent).\nHands-on experience with major web frontend frameworks: React, gulp, yarn, node, etc\nFamiliarity with d3.js.\nBackground in UI design / graphic design\nGO developmentShow more Report"}, {"company": "Palo Alto Networks", "job": "Support Enablement and Escalations Engineer (Cortex XSOAR)", "city": "Tel Aviv-Yafo", "date": "15d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_228f4a8e&cb=1676382422950&jobListingId=1008425353199&jrtk=3-1-1gp82rhqkkcmj801-1goojgdmaia1a800-88c978888e62aea1-", "description": "Company Description\nOur Mission\nAt Palo Alto Networks® everything starts and ends with our mission:\nBeing the cybersecurity partner of choice, protecting our digital way of life.\nWe have the vision of a world where each day is safer and more secure than the one before. These aren’t easy goals to accomplish – but we’re not here for easy. We’re here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.\nWe’re changing the nature of work. Palo Alto Networks is evolving to meet the needs of our employees now and in the future through FLEXWORK, our approach to how we work. From benefits to learning, location to leadership, we’ve rethought and recreated every aspect of the employee experience at Palo Alto Networks. And because it FLEXes around each individual employee based on their individual choices, employees are empowered to push boundaries and help us all evolve, together.\n\nJob Description\nYour Career\nThe team is an exciting crossroads between Support/TAC (Technical Assistance Center) and Engineering. The team is empowered to drive decisions and to be the thought leaders within the Global Customer Services organization at Palo Alto Networks. On any given day members of the team may work with new products and software very early in the new product lifecycle, provide training, assist a support engineer with a customer issue, replicate a complex issue in our lab, evaluate customer network design or help improve features for supportability and usability.\nWe are a relatively small global team and will only consider the top people from a support or engineering background. You are a good candidate if you are excellent at working with many cross-functional teams such as developers, product management, sales and also customers. In particular, you will be engaging with XSOAR –The industry’s most comprehensive SOAR platform. (More information about XSOAR can be found Here)\nYour Impact\nEnablement of the TAC teams - assist with ad hoc Q&A and structured training throughout the year\nOwnership of critical issues - This doesn’t always mean being responsible for the case, the focus is on the technical driver of the case the customer calls about - This usually means working with the TAC case owner and engineering on a replication or verification, sending guidelines and communicating updates\nNew product development - combine the responsibility of continuing our state-of-the-art technical knowledge and skills learned from prior technical support, an Enablement engineer will identify supportability and usability requirements for new products during the design phase as well as post GA via enhancement requests\nDevelop and deliver training materials for TAC - Training is a key component of the day-to-day success of support - An Enablement engineer is responsible for staying up to date with technical details on Palo Alto Networks new products and industry in general and sharing those details with TAC via white papers, BBLs, or TOIs\nDevelop tools for TAC – For better visibility and troubleshooting\nFilling in the gaps - Sometimes there are opportunities to “catch” a problem before it escalates - Our team is positioned to identify or help in these unplanned projects that result in a better customer experience, cost reduction or better security\n\nQualifications\nYour Experience\n5+ years of experience in Support roles, working directly with large global customers and partners in addition to internal teams (such as DevOps, Engineering, QA, and Product managers)\nExperience with Linux\nStrong scripting skills (JS/Python/Powershell)\nThe ability to read source code (C/C++/Python..)\nExcellent written and verbal communication skills\nRequired basic networking knowledge - Ability to independently debug broad, complex, and unique environments with mixed applications and protocols\nExperience with Windows OS-based applications (Installation, troubleshooting, Debugging) - an advantage\nExperience as an Enablement Engineer or an Escalations Engineer - an advantage\nPrevious experience with Endpoint Security software - an advantage\nExperience with MS Server solutions (SCCM, GPO, AD, MSSQL, IIS, Exchange) - an advantage\nExperience training internal technical teams - an advantage\nAdditional Information\nThe Team\nOur technical support team is critical to our success and mission. As part of this team, you enable customer success by providing support to clients after they have purchased our products. Our dedication to our customers doesn’t stop once they sign – it just evolves. Our technical team provides the behind-the-scenes support to meet our customer’s needs. As threats and technology evolve, we stay in step to accomplish our mission. You’ll be involved in implementing new products, transitioning from old products to new, and will fix integrations and critical issues as they are raised – in fact, you’ll seek them out to ensure our clients are safely supported. We fix and identify technical problems, with a pointed focus of providing the best customer support in the industry.\nWe’re a fast-growing, immensely successful organization because of our people and products (built and supported by our people). We work the frontlines against cyberthreats and attacks, protecting everyday transactions in the digital environment. It means we’re good at scaling quickly to new threats, get fulfillment from resolving new problems, and think about things just plain differently.\nOur Commitment\nWe’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.\nWe are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.\nPalo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.\nAll your information will be kept confidential according to EEO guidelines.\n#LI-MS2\nCovid-19 Vaccination Information for Palo Alto Networks Jobs\nVaccine requirements and disclosure obligations vary by country.\nUnless applicable law requires otherwise, you must be vaccinated for COVID or qualify for a reasonable accommodation if:\nThe job requires accessing a company worksite\nThe job requires in-person customer contact and the customer has implemented such requirements\nYou choose to access a Palo Alto Networks worksite\nIf you have questions about the vaccine requirements of this particular position based on your location or job requirements, please inquire with the recruiter.Show more Report"}, {"company": "Mobileye", "job": "Junior C++ Developer", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_13e1fa10&cb=1676382424689&jobListingId=1008356388344&jrtk=3-1-1gp82rj8ljm51801-1goojgdmaia1a800-a0b3d33cf9e0999b-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhich team will you join?\nMobileye is the world leader in automotive and driving assistance systems, developing the world's most advanced software technologies and hardware architectures.\nOur group is located in Haifa and is responsible for enabling deep learning and computer vision algorithms on the Mobileye platform.\nWe develop the software architecture system and tools to enable state-of-the-art algorithms to run efficiently in vehicles – contributing to saving lives and enabling autonomous vehicles.\nWe use cutting-edge technology stack and design methodologies, to achieve optimized and robust solutions in order to support different customers across the globe.\nCheck out our technology in action: https://www.youtube.com/watch?v=50NPqEla0CQ\nWhat will your job look like:\nAs a C++ developer, you will join the Mobileye Application team, a new forming team in Haifa. This is an exciting opportunity to write and design an application from scratch!\n\nThe car application controls the main execution flow of various software components running of Mobileye chip, in addition it also controls many sensors and manage their inputs, sensors such as camera, lidar, radar, car signals (speed, etc.)\nThe application combines all the different inputs and feeds them into the different algorithms, in order to create a worldview for the car.\n\nThe project is challenging both in its real-time complexity of a system with multiple various sensors and being of part of overall automotive car system architecture.\nDoing all of that while working on highly optimized and well-designed software.\nThe main application is developed in C++ for Linux.\nAll you need is:\nBSc/MSc in Computer Science/ Electrical Engineering with computer science chain\nKnowledge of C/C++ with practical experience - significant Advantage\nOOP basics\nGit/Linux basics\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Oski Technology", "job": "Formal Verification Engineer", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e21be35c&cb=1676382425807&jobListingId=1008415067695&jrtk=3-1-1gp82rkicp6dn801-1goojgdmaia1a800-6437d60342e7d637-", "description": "We are looking for a Formal Verification Engineer for our NVIDIA Networking team!\nThis is an exciting opportunity to join a hardworking Pre-Silicon design and verification team, working on groundbreaking Switch technologies. We deploy state-of-the art formal verification tools and methodologies to prove design correctness. Working in our formal verification team will expose you to a wide range of cutting edge design and technologies. Our Switch team delivers world class Bridge and router solutions for HPC, data-center, network, and storage markets. We micro-architect, verify, and deliver smart and high bandwidth multi port switches. NVIDIA has the most sophisticated formal tools and methodologies in the industry, which help us achieve A0 design tapeouts. As part of this team, you'll enjoy a versatile work environment, which is educational, dynamic and ambitious.\nWhat you'll be doing:\nIn this position you will use formal verification algorithms to formally prove the correctness of complicated logic problems.\nYou will work on ambitious designs along with our Pre-Silicon team and take part in developing the next generation of NVIDIA's core technology.\nWhat we need to see:\nBSc in Electrical/Computer Engineering or MSc in Mathematics\n2+ years of relevant experience.\nExcellent analytical, logical reasoning and problem-solving skills\nStrong debugging and analytical skills.\nStrong communication and interpersonal skills are required\nWays to stand out from the crowd:\nFormal verification work experience.\nKnowledge of digital logic\nNVIDIA has some of the most forward-thinking and hardworking people in the world working for us. Are you a creative and autonomous engineer who loves a challenge? Come join our team and help us build the future HPC and data centers.Show more Report"}, {"company": "Mobileye", "job": "Signal Integrity Engineer", "city": "Haifa", "date": "8d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e7728a69&cb=1676382427900&jobListingId=1008438104786&jrtk=3-1-1gp82rmll2dh9001-1goojgdmaia1a800-6493d22c3e3566e8-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhich team will you join?\nYou will join a relatively small team of talented and experienced Electrical Validation & Signal/Power Integrity engineers with wide scope of responsibility, from Pre-Si SI/PI simulations to Post-Si Electrical validation and debugging, covering all High-Speed interfaces and Power Delivery of Mobileye EyeQ products.\nWhat will you do?\nYou will deal with design, optimization and debugging high-speed interfaces - like LPDDR4/5, PCIe Gen4/5, C/DPHY.\nYou'll deal with the state of art signal & power integrity simulation tools and methodologies, advanced results analysis, optimization/verification of Mobileye and customers' PCB designs, etc.\nThis is a dynamic work environment that requires interfacing with Silicon & Hardware design engineers, IP providers, Electrical and System Validation teams, Customer Application Engineers, EDA tools vendors, and product managers.\nThe proximity to Electrical Validation activities - we are a single SI/EV team - is another powerful advantage, enabling joint simulation-measurements efforts.\nAll you need is:\nBSc or MSc in Electrical or Computer engineering\n2 years of proven experience in SI/PI simulations\nKnowledge in SI/PI simulation tools, including 2.5D/3D extraction\nKnowledge in transmission line theory, electro-magnetics\nExperience in custom digital/analog circuit design and transistor level simulations is an advantage\nExperience in Electrical Validation is an advantage\nExperience in High-Speed PCB design is an advantage\nExperience with DDR and/or PCI and/or MIPI high-speed interfaces is an advantage\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Radware", "job": "Cloud DevOps TL", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_42456c32&cb=1676382428996&jobListingId=1008446919109&jrtk=3-1-1gp82rnoeihn6801-1goojgdmaia1a800-010685aa5ecbaa6d-", "description": "Cloud DevOps TL - (2300001K)\nRadware, a world leader in the cybersecurity field, is looking for a talented DevOps Team Leader to join its Cloud R&D Team. Radware’s Cloud-based security services combines Big Data analytic, machine learning technologies, and behavioral analysis for cyber threats detection, assessment and mitigation.\nAs a DevOps Team Leader in our team, you will have the opportunity to lead and work with cutting edge cloud technologies and best-in-class DevOps practices.\n\nWhat will you do?\nBe in charge of complex, distributed, high-scale production cloud systemsDevelop and maintain modern state-of-the-art CI/CD pipeline to improve R&D processesTake responsibility and implement automated build and deployment processesManage and create automated configuration for our Cloud environmentsIntegrate test automation into the CI/CD cycleTake part in building cloud-based big data solutionBuild cloud-based monitoring and alerting capabilitiesMaintain overall industry knowledge on latest trends, technology, etc.Act as the coach and mentor to team members and technical staff\nWhat do you need to succeed\nBachelor's Degree in Software Engineering, Computer Science, Information Technology, Information Systems, or similar.Experience as a Devops lead in cloud-based environments (Minimum 3 years).Experience in building CI/CD processes and pipelines (Jenkins, k8s etc.)Experience with Linux and networkingExperience with monitoring, maintaining, and optimizing production systemsStrong Shell/Bash/Python scripting skills and experienceProven hands-on experience with Containers (Docker) and Orchestration tools (Kubernetes).Experience with infrastructure as code, ideally TerraformStrong working knowledge of AWSStrong working knowledge of GCP (advantage)Experience with version control systems (Git, Bitbucket)Ability to use a wide variety of open source technologies and toolsAbility to clearly articulate design and implementation choicesTeam player and excellent interpersonal skills\n\nPrimary Location: IL-IL-Tel Aviv\nWork Locations: Radware Israel, Tel Aviv 22 Raoul Wallenberg Street Tel Aviv 69710\nJob: Cloud and ManagementShow more Report"}, {"company": "InspHire", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a product data analyst to join an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is responsible for enhancing the business success of the company by ensuring excellence in the performance on all business aspects including marketing, games & product design, retention, monetization, etc. The department builds, operate, and optimize the processes across the entire company through the top of the art analytical capabilities & product understanding.\nResponsibilities\n• Leverage data to understand the company's products in depth, identify areas of opportunity, and execute projects to drive growth and engagement of the company's users\n• Work closely with the product teams to analyze existing features and ensure a successful implementation of new features.\n• Use data to fine-tune and balance the game’s economy, providing economy analysis and drive metrics for revenue optimization\n• Evaluating and measuring A/B testing results and trends among players\n• Build and maintain reports, dashboards, and metrics to monitor the performance of products\n• Be an expert on industry trends and the competitor landscape to evolve the company's thinking\nWhat we expect\n• 2+ years of experience in product analytics in the Online/Gaming industry\n• BA/B.Sc. in Statistics / Math / Engineering / Economics or other quantitative fields\n• Strong SQL with experience in querying large, complex data sets.\n• Strong Excel skill\n• Advanced knowledge in statistical tools and models- advantage\n• Proven experience leading data driven projects from definition\n• High level of analytical and problem-solving skills with strong attention to details\nDesired\n• Experience working with Qlikview – advantage\n• English: Advanced\n• Core competencies: Professionalism, Responsibility, Collaboration and Teamwork, Initiative and Creativity\nPersonal Requirements:\n• Ability to collaborate with colleagues across different disciplines and locations to achieve results\n• Passion for gaming\n• High level of verbal and written English.Show more Report"}, {"company": "InspHire", "job": "Art Director/Graphic Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a creative Art Director/Graphic Designer who enjoys working in a fast-paced environment and loves the challenge of discovering what makes consumers “click” to join An online casino company founded by three entrepreneurs . You will cooperate with a design-savvy team to devise an overall concept.\nThe goal is to translate marketing and branding strategies into innovative and impressive campaigns that stimulate targeted audiences.\nResponsibilities\nGenerate clear ideas and concepts in tandem with the copywriter\nProduce sketches, storyboards, roughs to visualize ideas\nUnderstand marketing initiatives, strategic positioning and target audience\nCooperate with the rest of the creative team across different types of media\nTake work from concept to final execution within deadlines\nPresent completed ideas to management and marketing team\nStay on top of all trends and maintain best practices\nRequirements\nProven working experience as Art Director/Graphic Designer\nHands-on experience with logo design, typography, color, web layout design, image selection and graphic design\nProficient use of InDesign, Photoshop, Illustrator or other visual design and wire-framing tools\nDemonstrable graphic design skills with a strong portfolio\nIncorporate feedback and take/give direction well\nTeam player with strong communication and presentation skills\nRelevant education or trainingShow more Report"}, {"company": "Palo Alto Networks", "job": "Sr. Product Manager (Cortex XDR)", "city": "Tel Aviv-Yafo", "date": "14d", "rating": "4.2", "link": "", "description": ""}, {"company": "InspHire", "job": "ASO Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "The biggest up-and-coming social gaming start-up is looking for passionate ASO (App Store Optimization) Managers!\nNow is a great time to join this Marketing team for a very key role. As an ASO manager, you will be developing an ASO strategy to ensure the company's game will appear at the top of the search results in all applicable App stores. Your objective will be to support organic downloads and the user acquisition strategy by being an ASO guidelines expert on Key app stores and proactively implementing them in the company's product pages.\nResponsibilities\nPerform keyword research in multiple languages.\nClosely work with the Head of Content and VP Marketing on app descriptions.\nProvide graphic requirements to the Art team for new icons & screenshots.\nResearch, plan, run and analyze ASO tests.\nMonitoring and tracking app store rankings and conversion rate, using the latest analytical tools.\nRequirements\nAt least 2 years of experience in ASO/SEO – must!\nAn excellent understanding of the different App stores and their processes.\nUnderstanding and passion for mobile games.\nStrong English skills (additional languages are an advantage).\nExcellent research and analytical skills.\nExperience in graphics design – a big advantage.\nOrganized, creative and detail-oriented.\nHigh proficiency in Microsoft Office/Google Spreadsheet.\nGood people skills,Show more Report"}, {"company": "Mobileye", "job": "Physical Design Engineer", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_eb56e515&cb=1676382436286&jobListingId=1008091616414&jrtk=3-1-1gp82rurikhqa801-1goojgdmaia1a800-ea19ac7610e9f0bb-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhich department will you join?\nEPG is a fast-paced, dynamic, and startup-like group responsible for researching, incubating and developing next-generation technologies and ideas, with a strong orientation towards computer vision, machine learning, data, and AI.\nThe group hosts a diverse team of scientists, engineers and developers to research, realize, and bring to market innovative new products, leveraging cutting-edge technologies, skills and capabilities.\nWe’re looking for a Backend expert to join the growing Physical Design Team, responsible for state of the art SoC design from definition to Tape-Out.\nWhat will your job look like?\nHands-on physical design block owner from RTL to GDS.\nFloorplan exploration with guidance and collaboration with front-end and architecture teams.\nSTA: work with FE and floor planner to manage block and top level constraints and 1st level of timing analysis.\nSynthesis exploration and final synthesis netlist: Scan insertion @ synthesis, clean checks from Lint, UPF & Spyglass.\nPlace & Route: from Synthesis netlist to final layout and signoff verification with target to achieve best power performance and area.\nAll you need is:\nBSc or MSc degree in Computer Engineering or Electrical Engineering.\nExperience in scripting languages like Tcl/python/Perl/tcsh.\nTeam player with excellent communication skills, customer orientation, and a “can-do” attitude.\nExperience in relevant domains - Advantage.\nBuilding or maintaining implementation tools and flow – Advantage.\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Egis", "job": "Lead Rolling Stock Expert FM", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fa12e624&cb=1676382438149&jobListingId=1008301342012&jrtk=3-1-1gp82s0lkih4s801-1goojgdmaia1a800-a70f2e118c5e0249-", "description": "General information\nOrganisation\nEgis is a global consulting and engineering firm working in construction, transport and mobility services. Our mission: create and operate intelligent infrastructure and buildings to further the transition to a low-carbon economy and contribute to more balanced and sustainable territorial development.\n\nTo support our growth dynamic, we offer a wide variety of career opportunities in more than 120 countries.\n\nJoining our Group and its 16,000 employees means, above all, sharing our values as a people-first company, strongly committed to sustainability and innovation.\n\nReference\n2022-7865\nPosition description\nJob title\n\nLead Rolling Stock Expert FM\nContract type\n\nPermanent contract\nJob description\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\n\nBased in Jerusalem, you will be part of our Urban Railway / LRT projects in Jerusalem and our other future transportation projects in Israel. You will lead the area of rolling stock, providing high-level advice and be responsible for the supervision of implementation of new rolling stock on the Blue Line.\nUnder responsibility of the Project Director, your activities will include but not be limited to:Review the design documentation produced by the contractor for Rolling Stock works and construction activities to verify their consistency with the Tendering specifications, the international standards and the state of the art. Prepare Documents Review Sheets (DRS).Follow up the construction, delivery and tests of the whole fleetProvide regular support to the public transport client regarding project activities.Participate and coordinate the meetings regarding rolling stock activities such as design reviews, interfacing and testing supervision at contractor/sub-contractors and customer’s sites.Prepare and issue Minutes of Meetings.Coordinate with other services for interfacing and commissioning activities of the rolling stock.\n\nProfile\n\nTo be considered for this position as Lead Rolling Stock Expert we have the following requirements:Graduate professional and have a professional license.A systemic vision, be a team player, organized sensitive to customer service.Experience of minimum 10 years in Rolling Stock, ideally including experience with Light Rail Vehicles.Knowledge of railway rolling stock structuresExperience in root cause analysis for mechanical issues on rolling stock in service.Knowledge and management of railway test environments.Good knowledge of materials and electrical and pneumatic systems and structural analysis is required (HVAC, Brake systems, TCMS, FEA, Welding).Fluent in written/spoken English\n\nPosition location\nJob location\n\nMiddle-East/North Africa, Israel\nCity\n\nJerusalem\n\nCandidate criteria\nMinimum level of education required\n\n6-Engineer’s degree\nMinimum level of experience required\n\nOver 10 yearsShow more Report"}, {"company": "Guesty", "job": "Art Director", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Guesty is looking for an Art Director with outstanding conceptual and visual design skills as well as a strong understanding of digital marketing across multiple channels. You will be responsible for elevating and maintaining the artistic level of the creative team’s delivery, while being hands-on and executing on your own projects.\nThis is a huge opportunity to join Guesty at a pivotal time in the company’s successful history. The Art Director will be part of Guesty’s brand repositioning project and help define the new visual identity of the company.\nRequirements:\n\nInspirational creative leader who can drive and influence a new culture for design within Guesty.\nPassion for design and creative marketing.\nExperience in a broad range of marketing design disciplines including branding, motion, lead generation, social media, and events.\nAbility to oversee creative execution by other team members while keeping up with your own deliverables.\nTalent for pitching creative concepts to marketing teammates and senior management.\nExperience working on a performance-driven marketing team.\n10+ years of experience in marketing design.\n2+ years as art director at a SaaS/product-centric company.\nHigh level of English written and verbal communication skills.\nDegree from a top-tier design school or equivalent experience.\nGuesty is proud to be an Equal Opportunity Employer. We provide equal employment opportunities to all employees and applicants regardless of any characteristic protected by law.\nResponsibilities:\n\nTake artistic ownership of the creative team’s projects and work closely to guide & mentor them through creative vision.\nElevate the creative team’s execution by bringing your talent and expertise to every aspect of the creative process.\nContribute to the conceptualization, design direction, and development of marketing initiatives.\nClosely monitor and assure the creative quality for projects of different disciplines - From product videos and social media content to web design elements and campaign creative.\nExecute at a high level and on tight timelines while maintaining the highest standards of design.\nWork on multiple projects in a team-oriented environment.\nMaintain excellent communication both internally with the team and externally with other stakeholders.\nProactively identify key areas for optimization from both a UI and UX perspectiveShow more Report"}, {"company": "Gong", "job": "Senior Product Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=0000018631383679b6a69ff296536dfe&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_acf3eb74&cb=1676382441479&jobListingId=1007399156772&jrtk=3-1-1gp82s3srp6df801-1goojgdmaia1a800-11d2508bb813ebea-", "description": "Gong is one of Israel’s most valued private software companies. Our solution uses machine learning and AI to automate big parts of customer-facing roles. Over 3000 innovative companies like Google, Amazon, AT&T, Linkedin, Novartis, Appsflyer, Monday, Walkme, Taboola, trust Gong to power their customer reality.\n\nAt Gong, we’re building new-generation, machine-learning based software that automates big parts of customer-facing roles by “understanding” their conversations and related work.\n\nOur solution guides sales professionals, coaches them on how to become better, performs tasks for them, and directs them to the best actions.\nWe’re seeking a highly motivated & experienced product analyst to join our product group in building our product.\nAs Sr. Product Analyst, you’ll play a key role in ensuring our platform and processes work smoothly and at scale.\nYou will:\nInfluence change by presenting product and customer data-driven insights to product management and senior leadership; confidently present the outcome of your analysis and make recommendations to executives and team leaders\nBe the right hand of product and business leaders in building business cases for new product functionality, and tracking the effectiveness of the functionality over time; monitor key metrics, identify business trends and generate forecasts\nLead deep-dive analysis that will frame product strategy and product roadmap decisions\nFoster our data-centric, continuous learning culture with your passion for telling stories with data; grow our best practices around reporting quality, data hygiene, and data governance\nOwn the design, development, and maintenance of ongoing dashboards and their underlying data sets\nWork collaboratively with product managers and engineers to ensure that the right data is generated and collected\nYou have:\nBA degree in a quantitative field (Math, Statistics, Industrial Engineering, Engineering, Economics, etc.) ; MBA preferred\n4+ years of demonstrated experience working in a quantitative or analytical role, preferably at a startup or management consulting firm\nConfirmed ability to surface key insights and/or predictive forecasting models that subsequently drove business changes with measurable lift in performance\nFluency in common statistical analysis methods; and specifically, the ability to quickly separate data from noise\nProficiency using SQL and Excel for data querying and manipulation; comfortable using additional data access and analysis tools\nExperience with product analytics methodologies\nPassionate about producing high-quality accurate analytics deliverables\nIdeally, you are experienced in creating and maintaining dashboards using data visualization tools such as Tableau, Sisense, or similar\nIdeally, have programming experience using languages such as Python\nSelf-motivation, proactively going beyond the call of duty\nCreativity and strategic thinking\nThe ability to work comfortably in a constantly evolving environment\nYou'll get:\nAn opportunity to play a major part in the company's product strategy and operations\nAn opportunity to work with other top talents to solve complex challenges\nTo experience building a state-of-the-art SaaS product used by top business professionals\nTo be part of a high-profile, well-funded company with access to top US customers.\nTo analyze complex, non-trivial data generated in a fast-moving product, which is used by tens of thousands of users on a daily or weekly basis\nTo lead and own momentus projects and tasksFirst-hand entrepreneurial experience\nHere at Gong, we encourage our employees to express their personality and identity (whether gender, ethnic, religious, or sexual), and we ensure fairness and equal opportunities.\nWe follow a hybrid working model that combines working from home, on the go, or at the office. This allows us: flexibility, autonomy, positive work relationships, and effective work habits\nIf these considerations are important to you when choosing a work place, we'd love to see you with us.Show more Report"}, {"company": "AWS EMEA SARL (Israel Branch)", "job": "2023 Research Science Internship - Quantum Computing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "", "description": ""}]