[{"company": "אומניסיס בע''מ", "job": "Senior Web Developer", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "", "description": "Are you driven to develop state-of-the-art software for advanced defense systems? Omnisys is looking for a talented Web Developer to join our R&D team. Must Have: Solid experience with Web development using JavaScript, HTML, CSS and HTTP. Strong experience in Angular2+.\n\nStrong Experience in Node.js / C#. Familiar with common databases: PostgreSQL, Mongo. Experience in API design and best practices. Advantages: Familiar with Cesium (G.I.S System) Good Devops understanding.\n\nSecurity ClearanceShow more Report"}, {"company": "Egis", "job": "Track Expert FM", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=202&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0ff3de61&cb=1676382445826&jobListingId=1008323646984&jrtk=3-1-1gp82s854pke0801-1goojgr4kh7hd800-bb22a15caeb904ed-", "description": "General information\nOrganisation\nEgis is a global consulting and engineering firm working in construction, transport and mobility services. Our mission: create and operate intelligent infrastructure and buildings to further the transition to a low-carbon economy and contribute to more balanced and sustainable territorial development.\n\nTo support our growth dynamic, we offer a wide variety of career opportunities in more than 120 countries.\n\nJoining our Group and its 16,000 employees means, above all, sharing our values as a people-first company, strongly committed to sustainability and innovation.\n\nReference\n2022-7980\nPosition description\nJob title\n\nTrack Expert FM\nContract type\n\nPermanent contract\nBusiness Line specific context\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\n\nJob description\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\nBased in Jerusalem, you will be part of our Urban Railway / LRT projects in Jerusalem and our other future transportation projects in Israel. You will lead the area of track engineering and construction, providing high-level advice and be responsible for the supervision of track design and construction on the LRT Blue Line.\nUnder responsibility of the Project Director, your activities will include but not be limited to:Review the design documentation produced by the contractor for track works and construction activities to verify their consistency with the Tendering specifications, the international standards and the state of the art track.Prepare Documents Review Sheets (DRS).Review track design and advise on improvements to track alignment and equipment design.Provide regular support to the public transport client engineer regarding project activities.Participate and coordinate the meetings regarding rail track activities such as design reviews, interfacing and testing supervision.\n\nProfile\n\nTo be considered for this position as Track Expert we have the following requirements:Graduate professional in civil or mechanical engineering and have a professional license.A systemic vision, be a team player, organized sensitive to customer service.Experience of minimum 15 years in rail track / civil engineering,A minimum of 5 years’ experience in Light Rail / tramwayKnowledge of international railway track standardsExperience in a design and build context of railway in an international environment is highly valued.Fluent in written and spoken English\n\nPosition location\nJob location\n\nMiddle-East/North Africa, Israel\nCity\n\nJérusalem\n\nCandidate criteria\nMinimum level of education required\n\n6-Engineer’s degree\nMinimum level of experience required\n\nOver 10 yearsShow more Report"}, {"company": "Fortinet", "job": "Full-Stack Developer", "city": "Israel", "date": "10d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=203&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c7ebd1d6&cb=1676382450828&jobListingId=1008435374880&jrtk=3-1-1gp82sd2jkhq4801-1goojgr4kh7hd800-7732d801cbd7d30e-", "description": "We are looking for a talented full-stack developer to join our Fullstack team.\nYou’ll be joining a team of talented full-stack developers, developing the management server which empowers organizations to discover Advanced targeted attacks in their network.\nThe process is centered on users’ needs, resulting in intuitive interactions and providing a pleasant and smooth user experience.\nYour job will be working on React/Angular based single-page web applications, implementing pixel-perfect components and screens, and working on expanding the platform’s architecture and capabilities.\nResponsibilities include:\nBe part of the EDR Platform group responsible for the development of the management application, including business critical components and processes, technological challenges, and more.\nDevelop Java based state of the art management platform which orchestrates the control path of the system.\nPrototype and develop new features end to end\nInnovate with new UI structures, front-end capabilities, platforms, and technologies\nRequirements:\nHighly skilled Java Full-stack developer with 3 or more years of experience in development of complex, enterprise-grade systems.\nExcellent user experience, intuition, and skills.\nExperience coding in Java using Spring, Hibernate, and additional infrastructures.\nAbility to work and learn independently as well as in a team environment.\nDevelopment experience in Angular, AngularJS, and Javascript.\nFluent in English (written and verbal) and has excellent communication skills.\nAdvantages\nBSc/BA in Computer Science (or equivalent).\nHands-on experience with major web frontend frameworks: React, gulp, yarn, node, etc\nFamiliarity with d3.js.\nBackground in UI design / graphic design\nGO developmentShow more Report"}, {"company": "Palo Alto Networks", "job": "Support Enablement and Escalations Engineer (Cortex XSOAR)", "city": "Tel Aviv-Yafo", "date": "15d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=204&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_379f7c48&cb=1676382452229&jobListingId=1008425353199&jrtk=3-1-1gp82seclih5h801-1goojgr4kh7hd800-88c978888e62aea1-", "description": "Company Description\nOur Mission\nAt Palo Alto Networks® everything starts and ends with our mission:\nBeing the cybersecurity partner of choice, protecting our digital way of life.\nWe have the vision of a world where each day is safer and more secure than the one before. These aren’t easy goals to accomplish – but we’re not here for easy. We’re here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.\nWe’re changing the nature of work. Palo Alto Networks is evolving to meet the needs of our employees now and in the future through FLEXWORK, our approach to how we work. From benefits to learning, location to leadership, we’ve rethought and recreated every aspect of the employee experience at Palo Alto Networks. And because it FLEXes around each individual employee based on their individual choices, employees are empowered to push boundaries and help us all evolve, together.\n\nJob Description\nYour Career\nThe team is an exciting crossroads between Support/TAC (Technical Assistance Center) and Engineering. The team is empowered to drive decisions and to be the thought leaders within the Global Customer Services organization at Palo Alto Networks. On any given day members of the team may work with new products and software very early in the new product lifecycle, provide training, assist a support engineer with a customer issue, replicate a complex issue in our lab, evaluate customer network design or help improve features for supportability and usability.\nWe are a relatively small global team and will only consider the top people from a support or engineering background. You are a good candidate if you are excellent at working with many cross-functional teams such as developers, product management, sales and also customers. In particular, you will be engaging with XSOAR –The industry’s most comprehensive SOAR platform. (More information about XSOAR can be found Here)\nYour Impact\nEnablement of the TAC teams - assist with ad hoc Q&A and structured training throughout the year\nOwnership of critical issues - This doesn’t always mean being responsible for the case, the focus is on the technical driver of the case the customer calls about - This usually means working with the TAC case owner and engineering on a replication or verification, sending guidelines and communicating updates\nNew product development - combine the responsibility of continuing our state-of-the-art technical knowledge and skills learned from prior technical support, an Enablement engineer will identify supportability and usability requirements for new products during the design phase as well as post GA via enhancement requests\nDevelop and deliver training materials for TAC - Training is a key component of the day-to-day success of support - An Enablement engineer is responsible for staying up to date with technical details on Palo Alto Networks new products and industry in general and sharing those details with TAC via white papers, BBLs, or TOIs\nDevelop tools for TAC – For better visibility and troubleshooting\nFilling in the gaps - Sometimes there are opportunities to “catch” a problem before it escalates - Our team is positioned to identify or help in these unplanned projects that result in a better customer experience, cost reduction or better security\n\nQualifications\nYour Experience\n5+ years of experience in Support roles, working directly with large global customers and partners in addition to internal teams (such as DevOps, Engineering, QA, and Product managers)\nExperience with Linux\nStrong scripting skills (JS/Python/Powershell)\nThe ability to read source code (C/C++/Python..)\nExcellent written and verbal communication skills\nRequired basic networking knowledge - Ability to independently debug broad, complex, and unique environments with mixed applications and protocols\nExperience with Windows OS-based applications (Installation, troubleshooting, Debugging) - an advantage\nExperience as an Enablement Engineer or an Escalations Engineer - an advantage\nPrevious experience with Endpoint Security software - an advantage\nExperience with MS Server solutions (SCCM, GPO, AD, MSSQL, IIS, Exchange) - an advantage\nExperience training internal technical teams - an advantage\nAdditional Information\nThe Team\nOur technical support team is critical to our success and mission. As part of this team, you enable customer success by providing support to clients after they have purchased our products. Our dedication to our customers doesn’t stop once they sign – it just evolves. Our technical team provides the behind-the-scenes support to meet our customer’s needs. As threats and technology evolve, we stay in step to accomplish our mission. You’ll be involved in implementing new products, transitioning from old products to new, and will fix integrations and critical issues as they are raised – in fact, you’ll seek them out to ensure our clients are safely supported. We fix and identify technical problems, with a pointed focus of providing the best customer support in the industry.\nWe’re a fast-growing, immensely successful organization because of our people and products (built and supported by our people). We work the frontlines against cyberthreats and attacks, protecting everyday transactions in the digital environment. It means we’re good at scaling quickly to new threats, get fulfillment from resolving new problems, and think about things just plain differently.\nOur Commitment\nWe’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.\nWe are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.\nPalo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.\nAll your information will be kept confidential according to EEO guidelines.\n#LI-MS2\nCovid-19 Vaccination Information for Palo Alto Networks Jobs\nVaccine requirements and disclosure obligations vary by country.\nUnless applicable law requires otherwise, you must be vaccinated for COVID or qualify for a reasonable accommodation if:\nThe job requires accessing a company worksite\nThe job requires in-person customer contact and the customer has implemented such requirements\nYou choose to access a Palo Alto Networks worksite\nIf you have questions about the vaccine requirements of this particular position based on your location or job requirements, please inquire with the recruiter.Show more Report"}, {"company": "Mobileye", "job": "Junior C++ Developer", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=205&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cce73e04&cb=1676382453497&jobListingId=1008356388344&jrtk=3-1-1gp82sflqkbn6801-1goojgr4kh7hd800-a0b3d33cf9e0999b-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhich team will you join?\nMobileye is the world leader in automotive and driving assistance systems, developing the world's most advanced software technologies and hardware architectures.\nOur group is located in Haifa and is responsible for enabling deep learning and computer vision algorithms on the Mobileye platform.\nWe develop the software architecture system and tools to enable state-of-the-art algorithms to run efficiently in vehicles – contributing to saving lives and enabling autonomous vehicles.\nWe use cutting-edge technology stack and design methodologies, to achieve optimized and robust solutions in order to support different customers across the globe.\nCheck out our technology in action: https://www.youtube.com/watch?v=50NPqEla0CQ\nWhat will your job look like:\nAs a C++ developer, you will join the Mobileye Application team, a new forming team in Haifa. This is an exciting opportunity to write and design an application from scratch!\n\nThe car application controls the main execution flow of various software components running of Mobileye chip, in addition it also controls many sensors and manage their inputs, sensors such as camera, lidar, radar, car signals (speed, etc.)\nThe application combines all the different inputs and feeds them into the different algorithms, in order to create a worldview for the car.\n\nThe project is challenging both in its real-time complexity of a system with multiple various sensors and being of part of overall automotive car system architecture.\nDoing all of that while working on highly optimized and well-designed software.\nThe main application is developed in C++ for Linux.\nAll you need is:\nBSc/MSc in Computer Science/ Electrical Engineering with computer science chain\nKnowledge of C/C++ with practical experience - significant Advantage\nOOP basics\nGit/Linux basics\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Oski Technology", "job": "Formal Verification Engineer", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=206&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f70bd59a&cb=1676382456070&jobListingId=1008415067695&jrtk=3-1-1gp82si5ejc9j801-1goojgr4kh7hd800-6437d60342e7d637-", "description": "We are looking for a Formal Verification Engineer for our NVIDIA Networking team!\nThis is an exciting opportunity to join a hardworking Pre-Silicon design and verification team, working on groundbreaking Switch technologies. We deploy state-of-the art formal verification tools and methodologies to prove design correctness. Working in our formal verification team will expose you to a wide range of cutting edge design and technologies. Our Switch team delivers world class Bridge and router solutions for HPC, data-center, network, and storage markets. We micro-architect, verify, and deliver smart and high bandwidth multi port switches. NVIDIA has the most sophisticated formal tools and methodologies in the industry, which help us achieve A0 design tapeouts. As part of this team, you'll enjoy a versatile work environment, which is educational, dynamic and ambitious.\nWhat you'll be doing:\nIn this position you will use formal verification algorithms to formally prove the correctness of complicated logic problems.\nYou will work on ambitious designs along with our Pre-Silicon team and take part in developing the next generation of NVIDIA's core technology.\nWhat we need to see:\nBSc in Electrical/Computer Engineering or MSc in Mathematics\n2+ years of relevant experience.\nExcellent analytical, logical reasoning and problem-solving skills\nStrong debugging and analytical skills.\nStrong communication and interpersonal skills are required\nWays to stand out from the crowd:\nFormal verification work experience.\nKnowledge of digital logic\nNVIDIA has some of the most forward-thinking and hardworking people in the world working for us. Are you a creative and autonomous engineer who loves a challenge? Come join our team and help us build the future HPC and data centers.Show more Report"}, {"company": "Mobileye", "job": "Signal Integrity Engineer", "city": "Haifa", "date": "8d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=207&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4708f1fe&cb=1676382458635&jobListingId=1008438104786&jrtk=3-1-1gp82skm9ih4s801-1goojgr4kh7hd800-6493d22c3e3566e8-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhich team will you join?\nYou will join a relatively small team of talented and experienced Electrical Validation & Signal/Power Integrity engineers with wide scope of responsibility, from Pre-Si SI/PI simulations to Post-Si Electrical validation and debugging, covering all High-Speed interfaces and Power Delivery of Mobileye EyeQ products.\nWhat will you do?\nYou will deal with design, optimization and debugging high-speed interfaces - like LPDDR4/5, PCIe Gen4/5, C/DPHY.\nYou'll deal with the state of art signal & power integrity simulation tools and methodologies, advanced results analysis, optimization/verification of Mobileye and customers' PCB designs, etc.\nThis is a dynamic work environment that requires interfacing with Silicon & Hardware design engineers, IP providers, Electrical and System Validation teams, Customer Application Engineers, EDA tools vendors, and product managers.\nThe proximity to Electrical Validation activities - we are a single SI/EV team - is another powerful advantage, enabling joint simulation-measurements efforts.\nAll you need is:\nBSc or MSc in Electrical or Computer engineering\n2 years of proven experience in SI/PI simulations\nKnowledge in SI/PI simulation tools, including 2.5D/3D extraction\nKnowledge in transmission line theory, electro-magnetics\nExperience in custom digital/analog circuit design and transistor level simulations is an advantage\nExperience in Electrical Validation is an advantage\nExperience in High-Speed PCB design is an advantage\nExperience with DDR and/or PCI and/or MIPI high-speed interfaces is an advantage\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Radware", "job": "Cloud DevOps TL", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=208&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_42fc7fd5&cb=1676382459710&jobListingId=1008446919109&jrtk=3-1-1gp82slnagsq5801-1goojgr4kh7hd800-010685aa5ecbaa6d-", "description": "Cloud DevOps TL - (2300001K)\nRadware, a world leader in the cybersecurity field, is looking for a talented DevOps Team Leader to join its Cloud R&D Team. Radware’s Cloud-based security services combines Big Data analytic, machine learning technologies, and behavioral analysis for cyber threats detection, assessment and mitigation.\nAs a DevOps Team Leader in our team, you will have the opportunity to lead and work with cutting edge cloud technologies and best-in-class DevOps practices.\n\nWhat will you do?\nBe in charge of complex, distributed, high-scale production cloud systemsDevelop and maintain modern state-of-the-art CI/CD pipeline to improve R&D processesTake responsibility and implement automated build and deployment processesManage and create automated configuration for our Cloud environmentsIntegrate test automation into the CI/CD cycleTake part in building cloud-based big data solutionBuild cloud-based monitoring and alerting capabilitiesMaintain overall industry knowledge on latest trends, technology, etc.Act as the coach and mentor to team members and technical staff\nWhat do you need to succeed\nBachelor's Degree in Software Engineering, Computer Science, Information Technology, Information Systems, or similar.Experience as a Devops lead in cloud-based environments (Minimum 3 years).Experience in building CI/CD processes and pipelines (Jenkins, k8s etc.)Experience with Linux and networkingExperience with monitoring, maintaining, and optimizing production systemsStrong Shell/Bash/Python scripting skills and experienceProven hands-on experience with Containers (Docker) and Orchestration tools (Kubernetes).Experience with infrastructure as code, ideally TerraformStrong working knowledge of AWSStrong working knowledge of GCP (advantage)Experience with version control systems (Git, Bitbucket)Ability to use a wide variety of open source technologies and toolsAbility to clearly articulate design and implementation choicesTeam player and excellent interpersonal skills\n\nPrimary Location: IL-IL-Tel Aviv\nWork Locations: Radware Israel, Tel Aviv 22 Raoul Wallenberg Street Tel Aviv 69710\nJob: Cloud and ManagementShow more Report"}, {"company": "InspHire", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a product data analyst to join an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is responsible for enhancing the business success of the company by ensuring excellence in the performance on all business aspects including marketing, games & product design, retention, monetization, etc. The department builds, operate, and optimize the processes across the entire company through the top of the art analytical capabilities & product understanding.\nResponsibilities\n• Leverage data to understand the company's products in depth, identify areas of opportunity, and execute projects to drive growth and engagement of the company's users\n• Work closely with the product teams to analyze existing features and ensure a successful implementation of new features.\n• Use data to fine-tune and balance the game’s economy, providing economy analysis and drive metrics for revenue optimization\n• Evaluating and measuring A/B testing results and trends among players\n• Build and maintain reports, dashboards, and metrics to monitor the performance of products\n• Be an expert on industry trends and the competitor landscape to evolve the company's thinking\nWhat we expect\n• 2+ years of experience in product analytics in the Online/Gaming industry\n• BA/B.Sc. in Statistics / Math / Engineering / Economics or other quantitative fields\n• Strong SQL with experience in querying large, complex data sets.\n• Strong Excel skill\n• Advanced knowledge in statistical tools and models- advantage\n• Proven experience leading data driven projects from definition\n• High level of analytical and problem-solving skills with strong attention to details\nDesired\n• Experience working with Qlikview – advantage\n• English: Advanced\n• Core competencies: Professionalism, Responsibility, Collaboration and Teamwork, Initiative and Creativity\nPersonal Requirements:\n• Ability to collaborate with colleagues across different disciplines and locations to achieve results\n• Passion for gaming\n• High level of verbal and written English.Show more Report"}, {"company": "InspHire", "job": "Art Director/Graphic Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a creative Art Director/Graphic Designer who enjoys working in a fast-paced environment and loves the challenge of discovering what makes consumers “click” to join An online casino company founded by three entrepreneurs . You will cooperate with a design-savvy team to devise an overall concept.\nThe goal is to translate marketing and branding strategies into innovative and impressive campaigns that stimulate targeted audiences.\nResponsibilities\nGenerate clear ideas and concepts in tandem with the copywriter\nProduce sketches, storyboards, roughs to visualize ideas\nUnderstand marketing initiatives, strategic positioning and target audience\nCooperate with the rest of the creative team across different types of media\nTake work from concept to final execution within deadlines\nPresent completed ideas to management and marketing team\nStay on top of all trends and maintain best practices\nRequirements\nProven working experience as Art Director/Graphic Designer\nHands-on experience with logo design, typography, color, web layout design, image selection and graphic design\nProficient use of InDesign, Photoshop, Illustrator or other visual design and wire-framing tools\nDemonstrable graphic design skills with a strong portfolio\nIncorporate feedback and take/give direction well\nTeam player with strong communication and presentation skills\nRelevant education or trainingShow more Report"}, {"company": "Palo Alto Networks", "job": "Sr. Product Manager (Cortex XDR)", "city": "Tel Aviv-Yafo", "date": "14d", "rating": "4.2", "link": "", "description": ""}, {"company": "InspHire", "job": "ASO Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "The biggest up-and-coming social gaming start-up is looking for passionate ASO (App Store Optimization) Managers!\nNow is a great time to join this Marketing team for a very key role. As an ASO manager, you will be developing an ASO strategy to ensure the company's game will appear at the top of the search results in all applicable App stores. Your objective will be to support organic downloads and the user acquisition strategy by being an ASO guidelines expert on Key app stores and proactively implementing them in the company's product pages.\nResponsibilities\nPerform keyword research in multiple languages.\nClosely work with the Head of Content and VP Marketing on app descriptions.\nProvide graphic requirements to the Art team for new icons & screenshots.\nResearch, plan, run and analyze ASO tests.\nMonitoring and tracking app store rankings and conversion rate, using the latest analytical tools.\nRequirements\nAt least 2 years of experience in ASO/SEO – must!\nAn excellent understanding of the different App stores and their processes.\nUnderstanding and passion for mobile games.\nStrong English skills (additional languages are an advantage).\nExcellent research and analytical skills.\nExperience in graphics design – a big advantage.\nOrganized, creative and detail-oriented.\nHigh proficiency in Microsoft Office/Google Spreadsheet.\nGood people skills,Show more Report"}, {"company": "Mobileye", "job": "Physical Design Engineer", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=213&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_21f90420&cb=1676382465791&jobListingId=1008091616414&jrtk=3-1-1gp82srl62ing001-1goojgr4kh7hd800-ea19ac7610e9f0bb-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhich department will you join?\nEPG is a fast-paced, dynamic, and startup-like group responsible for researching, incubating and developing next-generation technologies and ideas, with a strong orientation towards computer vision, machine learning, data, and AI.\nThe group hosts a diverse team of scientists, engineers and developers to research, realize, and bring to market innovative new products, leveraging cutting-edge technologies, skills and capabilities.\nWe’re looking for a Backend expert to join the growing Physical Design Team, responsible for state of the art SoC design from definition to Tape-Out.\nWhat will your job look like?\nHands-on physical design block owner from RTL to GDS.\nFloorplan exploration with guidance and collaboration with front-end and architecture teams.\nSTA: work with FE and floor planner to manage block and top level constraints and 1st level of timing analysis.\nSynthesis exploration and final synthesis netlist: Scan insertion @ synthesis, clean checks from Lint, UPF & Spyglass.\nPlace & Route: from Synthesis netlist to final layout and signoff verification with target to achieve best power performance and area.\nAll you need is:\nBSc or MSc degree in Computer Engineering or Electrical Engineering.\nExperience in scripting languages like Tcl/python/Perl/tcsh.\nTeam player with excellent communication skills, customer orientation, and a “can-do” attitude.\nExperience in relevant domains - Advantage.\nBuilding or maintaining implementation tools and flow – Advantage.\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Egis", "job": "Lead Rolling Stock Expert FM", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=214&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_faabf5c3&cb=1676382467009&jobListingId=1008301342012&jrtk=3-1-1gp82sss6khqf801-1goojgr4kh7hd800-a70f2e118c5e0249-", "description": "General information\nOrganisation\nEgis is a global consulting and engineering firm working in construction, transport and mobility services. Our mission: create and operate intelligent infrastructure and buildings to further the transition to a low-carbon economy and contribute to more balanced and sustainable territorial development.\n\nTo support our growth dynamic, we offer a wide variety of career opportunities in more than 120 countries.\n\nJoining our Group and its 16,000 employees means, above all, sharing our values as a people-first company, strongly committed to sustainability and innovation.\n\nReference\n2022-7865\nPosition description\nJob title\n\nLead Rolling Stock Expert FM\nContract type\n\nPermanent contract\nJob description\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\n\nBased in Jerusalem, you will be part of our Urban Railway / LRT projects in Jerusalem and our other future transportation projects in Israel. You will lead the area of rolling stock, providing high-level advice and be responsible for the supervision of implementation of new rolling stock on the Blue Line.\nUnder responsibility of the Project Director, your activities will include but not be limited to:Review the design documentation produced by the contractor for Rolling Stock works and construction activities to verify their consistency with the Tendering specifications, the international standards and the state of the art. Prepare Documents Review Sheets (DRS).Follow up the construction, delivery and tests of the whole fleetProvide regular support to the public transport client regarding project activities.Participate and coordinate the meetings regarding rolling stock activities such as design reviews, interfacing and testing supervision at contractor/sub-contractors and customer’s sites.Prepare and issue Minutes of Meetings.Coordinate with other services for interfacing and commissioning activities of the rolling stock.\n\nProfile\n\nTo be considered for this position as Lead Rolling Stock Expert we have the following requirements:Graduate professional and have a professional license.A systemic vision, be a team player, organized sensitive to customer service.Experience of minimum 10 years in Rolling Stock, ideally including experience with Light Rail Vehicles.Knowledge of railway rolling stock structuresExperience in root cause analysis for mechanical issues on rolling stock in service.Knowledge and management of railway test environments.Good knowledge of materials and electrical and pneumatic systems and structural analysis is required (HVAC, Brake systems, TCMS, FEA, Welding).Fluent in written/spoken English\n\nPosition location\nJob location\n\nMiddle-East/North Africa, Israel\nCity\n\nJerusalem\n\nCandidate criteria\nMinimum level of education required\n\n6-Engineer’s degree\nMinimum level of experience required\n\nOver 10 yearsShow more Report"}, {"company": "Guesty", "job": "Art Director", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Guesty is looking for an Art Director with outstanding conceptual and visual design skills as well as a strong understanding of digital marketing across multiple channels. You will be responsible for elevating and maintaining the artistic level of the creative team’s delivery, while being hands-on and executing on your own projects.\nThis is a huge opportunity to join Guesty at a pivotal time in the company’s successful history. The Art Director will be part of Guesty’s brand repositioning project and help define the new visual identity of the company.\nRequirements:\n\nInspirational creative leader who can drive and influence a new culture for design within Guesty.\nPassion for design and creative marketing.\nExperience in a broad range of marketing design disciplines including branding, motion, lead generation, social media, and events.\nAbility to oversee creative execution by other team members while keeping up with your own deliverables.\nTalent for pitching creative concepts to marketing teammates and senior management.\nExperience working on a performance-driven marketing team.\n10+ years of experience in marketing design.\n2+ years as art director at a SaaS/product-centric company.\nHigh level of English written and verbal communication skills.\nDegree from a top-tier design school or equivalent experience.\nGuesty is proud to be an Equal Opportunity Employer. We provide equal employment opportunities to all employees and applicants regardless of any characteristic protected by law.\nResponsibilities:\n\nTake artistic ownership of the creative team’s projects and work closely to guide & mentor them through creative vision.\nElevate the creative team’s execution by bringing your talent and expertise to every aspect of the creative process.\nContribute to the conceptualization, design direction, and development of marketing initiatives.\nClosely monitor and assure the creative quality for projects of different disciplines - From product videos and social media content to web design elements and campaign creative.\nExecute at a high level and on tight timelines while maintaining the highest standards of design.\nWork on multiple projects in a team-oriented environment.\nMaintain excellent communication both internally with the team and externally with other stakeholders.\nProactively identify key areas for optimization from both a UI and UX perspectiveShow more Report"}, {"company": "Gong", "job": "Senior Product Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=216&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2e5b5ca6&cb=1676382469539&jobListingId=1007399156772&jrtk=3-1-1gp82svaoj4h3801-1goojgr4kh7hd800-11d2508bb813ebea-", "description": "Gong is one of Israel’s most valued private software companies. Our solution uses machine learning and AI to automate big parts of customer-facing roles. Over 3000 innovative companies like Google, Amazon, AT&T, Linkedin, Novartis, Appsflyer, Monday, Walkme, Taboola, trust Gong to power their customer reality.\n\nAt Gong, we’re building new-generation, machine-learning based software that automates big parts of customer-facing roles by “understanding” their conversations and related work.\n\nOur solution guides sales professionals, coaches them on how to become better, performs tasks for them, and directs them to the best actions.\nWe’re seeking a highly motivated & experienced product analyst to join our product group in building our product.\nAs Sr. Product Analyst, you’ll play a key role in ensuring our platform and processes work smoothly and at scale.\nYou will:\nInfluence change by presenting product and customer data-driven insights to product management and senior leadership; confidently present the outcome of your analysis and make recommendations to executives and team leaders\nBe the right hand of product and business leaders in building business cases for new product functionality, and tracking the effectiveness of the functionality over time; monitor key metrics, identify business trends and generate forecasts\nLead deep-dive analysis that will frame product strategy and product roadmap decisions\nFoster our data-centric, continuous learning culture with your passion for telling stories with data; grow our best practices around reporting quality, data hygiene, and data governance\nOwn the design, development, and maintenance of ongoing dashboards and their underlying data sets\nWork collaboratively with product managers and engineers to ensure that the right data is generated and collected\nYou have:\nBA degree in a quantitative field (Math, Statistics, Industrial Engineering, Engineering, Economics, etc.) ; MBA preferred\n4+ years of demonstrated experience working in a quantitative or analytical role, preferably at a startup or management consulting firm\nConfirmed ability to surface key insights and/or predictive forecasting models that subsequently drove business changes with measurable lift in performance\nFluency in common statistical analysis methods; and specifically, the ability to quickly separate data from noise\nProficiency using SQL and Excel for data querying and manipulation; comfortable using additional data access and analysis tools\nExperience with product analytics methodologies\nPassionate about producing high-quality accurate analytics deliverables\nIdeally, you are experienced in creating and maintaining dashboards using data visualization tools such as Tableau, Sisense, or similar\nIdeally, have programming experience using languages such as Python\nSelf-motivation, proactively going beyond the call of duty\nCreativity and strategic thinking\nThe ability to work comfortably in a constantly evolving environment\nYou'll get:\nAn opportunity to play a major part in the company's product strategy and operations\nAn opportunity to work with other top talents to solve complex challenges\nTo experience building a state-of-the-art SaaS product used by top business professionals\nTo be part of a high-profile, well-funded company with access to top US customers.\nTo analyze complex, non-trivial data generated in a fast-moving product, which is used by tens of thousands of users on a daily or weekly basis\nTo lead and own momentus projects and tasksFirst-hand entrepreneurial experience\nHere at Gong, we encourage our employees to express their personality and identity (whether gender, ethnic, religious, or sexual), and we ensure fairness and equal opportunities.\nWe follow a hybrid working model that combines working from home, on the go, or at the office. This allows us: flexibility, autonomy, positive work relationships, and effective work habits\nIf these considerations are important to you when choosing a work place, we'd love to see you with us.Show more Report"}, {"company": "AWS EMEA SARL (Israel Branch)", "job": "2023 Research Science Internship - Quantum Computing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "", "description": ""}, {"company": "NVIDIA", "job": "Formal Verification Engineer", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c2b0282d&cb=1676382472245&jobListingId=1008414905406&jrtk=3-1-1gp82t1unncch801-1goojgr4kh7hd800-1179297e7bbd2102-", "description": "We are looking for a Formal Verification Engineer for our NVIDIA Networking team!\nThis is an exciting opportunity to join a hardworking Pre-Silicon design and verification team, working on groundbreaking Switch technologies. We deploy state-of-the art formal verification tools and methodologies to prove design correctness. Working in our formal verification team will expose you to a wide range of cutting edge design and technologies. Our Switch team delivers world class Bridge and router solutions for HPC, data-center, network, and storage markets. We micro-architect, verify, and deliver smart and high bandwidth multi port switches. NVIDIA has the most sophisticated formal tools and methodologies in the industry, which help us achieve A0 design tapeouts. As part of this team, you'll enjoy a versatile work environment, which is educational, dynamic and ambitious.\nWhat you'll be doing:\nIn this position you will use formal verification algorithms to formally prove the correctness of complicated logic problems.\nYou will work on ambitious designs along with our Pre-Silicon team and take part in developing the next generation of NVIDIA's core technology.\nWhat we need to see:\nBSc in Electrical/Computer Engineering or MSc in Mathematics\n2+ years of relevant experience.\nExcellent analytical, logical reasoning and problem-solving skills\nStrong debugging and analytical skills.\nStrong communication and interpersonal skills are required\nWays to stand out from the crowd:\nFormal verification work experience.\nKnowledge of digital logic\nNVIDIA has some of the most forward-thinking and hardworking people in the world working for us. Are you a creative and autonomous engineer who loves a challenge? Come join our team and help us build the future HPC and data centers.Show more Report"}, {"company": "Mobileye", "job": "R&D Mechanical Engineer", "city": "Jerusalem", "date": "24h", "rating": "4.2", "link": "", "description": ""}, {"company": "FUNDGUARD", "job": "Backend Team Leader", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=220&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2c8a912c&cb=1676382474568&jobListingId=1008238350829&jrtk=3-1-1gp82t48fp6d7801-1goojgr4kh7hd800-7ba1b7f9622f8776-", "description": "DESCRIPTION\nFundGuard is the new generation investment accounting utility for asset managers and their service providers. Our cloud-native, AI-powered operating system and technology platform are transforming investment operations. FundGuard existentially changes asset servicing to enable reduced fees and the ability to offer new and innovative products, including crypto-asset services, at scale, today and tomorrow.\nThe company is led by an experienced team with successful exits and has raised more than $55 million, backed by strategic partners including Citi and State Street Corp, venture firms Blumberg Capital, LionBird Ventures, and Team8 Capital among others.\nRead more about our latest achievements\nFundGuard Named “Tomorrow’s Top Growth Company” by Qumra Capital\n﻿We offer an exciting work opportunity where you’ll:Use cutting edge cloud technologiesDevelop one of the more robust enterprise applications with deep financial enginesWork with massive sets of dataBuild a highly performant application to serve leading global financial institutionsCollaborate with highly experienced engineering and product team members\nJoin FundGuard at the forefront of innovative financial technology. Work with us!\nVisit us: fundguard.com/careers\nFollow us: linkedin.com/fundguard\nWe are located in Azrieli Center Tel Aviv.\nYour mission is to lead and expand a team of talented developers, collaborate with colleagues in solving complex problems, prioritize and overcome design challenges. Own features from design and development to production. Drive technical excellence, high product quality, innovation and timely delivery in an agile environment\nWork closely with Product Management, R&D and other stakeholders from ideation to real customer value.\nREQUIREMENTS\n3+ years of experience in leading R&D teams in fast paced environments\n5+ years of experience in software engineering\nSolid proficiency in modern Java/C++/C#\nExperience developing large, scalable, distributed information systems using a microservices architecture\nMastery of high-performance, reentrant and efficient code\nCompetency working with state-of-the-art source control management and CI tools\nExperience with Agile/Scrum development methodologies\nTeam player, mentor, strong communication and problem-solving skills\nComputer Science degree(s) from leading universities or/and technological intelligence units graduate\nNice to have skills:\nJava and Spring (boot) proficiency\nExperience with cloud frameworks such as Kafka, Cassandra, Redis, Elasticsearch and S3/Blob\nFamiliarity with “supporting” languages like Python, shell scripting\nFinancial understanding or qualifications\nExperience with open-source frameworks such as Docker, Kubernetes, Prometheus and GrafanaShow more Report"}, {"company": "Jacobs", "job": "Telecom Designer", "city": "Qiryat Gat", "date": "12d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a547bc04&cb=1676382476328&jobListingId=1008432670231&jrtk=3-1-1gp82t5v5kckn801-1goojgr4kh7hd800-ecd1f5f017d0819c-", "description": "Your Impact:\nJacobs is thrilled to announce the expansion of our team in Israel! Now you can join us locally in our exciting journey of challenging today & reinventing tomorrow!\nCome be a part of a vibrant, dynamic team that delivers world class designs for industry leading clients around the world. We design of some of the most complex and specialized facilities being constructed today.\nThis challenging position involves working as part of a multi-discipline, highly interactive and coordinated team focused on projects including semiconductor manufacturing, data center facilities, and other state of the art manufacturing facilities.\nThe ideal candidate will be a self-motivated individual with excellent communication skills. They will exhibit a passion and desire to apply their professional experience and knowledge in a team environment on technically challenging and professionally rewarding projects.\nOur Telecom Designers:\nPerform necessary engineering and design tasks to produce construction documents in conjunction with a team of engineers and designersDesign telecommunication cabling infrastructures based upon client design criteria, national and international codes, TIA/EIA industry standards and Telecom Distribution Methods Manual.Are responsible for designing the following elements and systems:\no Backbone Distribution\no Horizontal Distribution Pathways\no Voice/Data Cables and Connecting Hardware\no Outside Plant\no Telecommunication Spaces.\nCoordinate and collaborate real time with other disciplines to develop designs.Perform quality review checks on design deliverables.Display strong communication and interpersonal skills and have the ability to work in a fast-paced team environment with multiple deadlines.Perform site surveys and design verification.\nHere’s What You’ll Need:\nData Centre / Semiconductor experience preferable, or large scale industrial.Strong relevant engineering/design experience in industrial/advanced technology sector.Excellent English level - written and spoken,Minimum 4 years proven leadership in building telecom system designWorking knowledge of NEC and current BICSI standardsAbility to interact with other engineering disciplines, clients, and vendors at all levels.Experience using REVIT and BIM.\nPreferred requirements\n5-10 years’ experience in design of telecom systems for semiconductor facilitiesShow more Report"}, {"company": "Mobileye", "job": "Real-Time Software Engineer", "city": "Haifa", "date": "6d", "rating": "4.2", "link": "", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nAbout the team:\nThe Object-Semantics group is intended to solve computer vision problems with a semantic aspect, with an emphasis on the automotive industry. In our group, we research, develop, and deploy state-of-the-art techniques to achieve world-class results which will allow the safe development of autonomous driving features and advanced driver assistant systems.\nWhat will your job look like:\nAs a member of the Objects Semantics Algorithms team, you will be part of a team that is responsible for architecting, developing, implementing, building, testing, and productizing computer vision-based algorithms, while engaging and collaborating with other teams and members of Mobileye’s teams on various sites.\nYou will implement core strategic features of the Autonomous Vehicle Real-Time System such as scheduler features, memory management, or inter-processor communication.\nYou will work closely with Product Managers, Algorithm Developers and group leaders.\nWork independently, use available resources to get unblocked, and complete tasks on schedule by exercising strong judgment and problem-solving skills.\nDevelop a strong understanding of relevant product areas, codebase, and systems.\nIntegrate and develop core services that serve as an enterprise data backbone, identifying elegant solutions to complex workflows alongside documentation and version control of the solutions.\nAll you need is:\nB.Sc. in Computer Science, or equivalent knowledge (M.Sc – advantage)\n3+ years of experience with C/C++ and Python\nHands-on experience with real-time software\nSolid understanding of operating systems fundamentals\nProficiency with debugging complex software systems\nTeam player, highly effective collaboration skills. Ability to communicate and coordinate with many people in different positions and capacities\nAbility to handle multiple competing priorities in a fast-paced environment, result-oriented\nStrong Advantages: Unix/Linux environment, MLOps, Databases, Docker & Cloud Computing, CI/CD, Source Control, System Design\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "INTEL", "job": "Technical Leader for Pre-Si Verification", "city": "Jerusalem", "date": "30d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=223&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_348e6c88&cb=1676382478676&jobListingId=1008394765089&jrtk=3-1-1gp82t88u2tho001-1goojgr4kh7hd800-94765d4a25241ee6-", "description": "Job Description\nAny processor, in the past 10 years, that you worked on - we developed it.\nJoin us in creating the future processors of Intel.\nOur Team ensures the logic correctness during the development of each new Intel CPU product before it is being shipped to production.\nThe role includes developing dedicated verification environments and tools, while driving a complex process of exercising the design to verify its logical correctness. These environments are developed using unique, state-of-the-art languages and tools, and advanced software engineering methodologies.\nVarious validation techniques are used while offering a unique Hardware-Software experience.\nIn addition to various tools, languages (UVM, Python) and verification methodologies, you will develop expertise with Intel Architecture and Micro Architecture and will be deeply involved in the process of defining new Intel features.\nQualifications\nAt least 5 years of experience in pre silicone verification\nProven experience in leading project \\ team\nIMPORTANT: Please be informed that Intel is proactively trying to find candidates for a FW Validation Team Lead position and that this position may not be available at this time.\nInside this Business Group\nThe Core and Client Development Group (C2DG) is a worldwide organization focused on the development and integration of SOCs, Core ™, and critical IPs that power Intel's leadership products, driving most of the Client roadmap for CCG, Delivering Server First Cores that enable continued growth for DCG and invest in future disruptive technologies.\n\nPosting Statement\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\n\nBenefits\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://www.intel.com/content/www/us/en/jobs/benefits.html\nJobTypeShow more Report"}, {"company": "InspHire", "job": "Front End Developer", "city": "Ramat Gan", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a Front-End Web Developer who is motivated to combine the art of design with the art of programming to join a well-financed, energetic startup-like publicly traded company, led by experienced and well-reputed entrepreneurs in the blockchain-crypto space is. Responsibilities will include translation of the UI/UX design wireframes to actual code that will produce visual elements of the application. You will work with the UI/UX designer and bridge the gap between graphical design and technical implementation, taking an active role on both sides and defining how the application looks as well as how it works.\nResponsibilities\nDevelop new user-facing features\nBuild reusable code and libraries for future use\nEnsure the technical feasibility of UI/UX designs\nOptimize application for maximum speed and scalability\nAssure that all user input is validated before submitting to back-end\nCollaborate with other team members and stakeholders\nSkills And Qualifications\nProficient understanding of web markup, including HTML5, CSS3\nBasic understanding of server-side CSS pre-processing platforms, such as LESS and SASS\nProficient understanding of client-side scripting and JavaScript frameworks, including jQuery\nGood understanding of advanced JavaScript libraries and frameworks, such as AngularJS, KnockoutJS, BackboneJS, ReactJS, DurandalJS etc.\nGood understanding of asynchronous request handling, partial page updates, and AJAX\nBasic knowledge of image authoring tools, to be able to crop, resize, or perform small adjustments on an image. Familiarity with tools such as as Gimp or Photoshop is a plus.\nProficient understanding of cross-browser compatibility issues and ways to work around them.\nProficient understanding of code versioning tools, such as Git / Mercurial / SVN\nGood understanding of SEO principles and ensuring that application will adhere to them.Show more Report"}, {"company": "8BIT sp. z o. o.", "job": "Product Manager (mid/senior)", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "", "link": "", "description": "Our client is a leading gaming studio on the $50B Metaverse Roblox\nTheir games are played by millions every day and they are seeking to expand the team and reach new heights! They’re a female-founded, female-led, non-traditional gaming studio united by the belief and desire to dream up their own stories, their own worlds, and create inclusive shared experiences on the metaverse.\n\nAs a Product Manager, you will report to the VP of Product, defining and executing on our product roadmap, focusing on strategic partnerships with the biggest media, music, and lifestyle brands coming to the Metaverse.\nProduct management is both challenging and rewarding. As part of their product team, you’ll be focused on enabling the players and the Roblox Community to have fun while creating meaningful friendships that persist across many games and experiences. This important pursuit requires empathy for our players as well as an analytical approach towards their actions.\nAt this point, the position is open to Israeli and European-based PMs.\nRESPONSIBILITIES\nResponsible for design and spec new and existing features for our Roblox Experiences across various products and games (including 3rd party)\nCollaborate with design and development teams to ship new experiences.\nAnalyze and define change across features, product roadmap, UX/UI and all other aspects of a F2P entertainment product.\nEstablish KPIs for product analytics that influence future roadmaps.\nEstablish, guide, and modify product documentation.\nTranslate technical terms, art and wireframes to working PRDs / GDDs\nFind new opportunities, shifting points and easy solutions in order to impact the product in meaningful ways\nREQUIREMENTS\nBachelor’s degree or four or more years of work experience in the games industry.\nHistory of successful product launches, product requirements, feature delivery and trade offs of a product, end to end product delivery and/or deal executions.\nPRD / GDD writing experience.\nAnalytic tools monitoring and analyzing experience.\nExperience with global teams and internationally operated services.\nVoice of the player and the Roblox Community – explore and learn how and why players engage with THEIR experiences and other experiences on Roblox. Become their voice and represent their needs throughout the development process.\nExtraordinary at building presentations, documents and presenting them at all levels of the organization.\nDeeply value attention-to-detail and believe that an extraordinary product is the sum of an inordinate number of small, thoughtful decisions.\nAble to use data and insights to align people on which problems to prioritize and tackle in order to deliver what’s best for customers.\nNot your time for a move? Recommend a friend and earn 700 EUR! Contact: jobs@8bitplay.com\nIMPORTANT: We will never, absolutely never send your CV and/or personal data to any of our clients without your direct consent. Submitting your CV is not equal to giving us consent to share your details with our external partners- we will always contact you upfront and ask for your agreement.\nBy submitting this form you give your consent for the information provided on this form to be held on computer or other relevant filing systems belonging to 8Bit Studio one and to be shared with other accredited employees in accordance with the GDPR 2018.\nBy submitting this form you agree that 8Bit Studio, NIP 9570949266, REGON: 36386962 processes your personal data contained in the recruitment documents supplied by you, including but not limited to your image, for the purposes of the current recruitment processes. 8Bit Studio confirms that your consent may be withdrawn anytime.\nFor more insight about game jobs and recruitment for game industry visit our homepageShow more Report"}, {"company": "Team8", "job": "Sygnia-Incident Response Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "Sygnia is a top tier cyber technology and services company, providing consulting and incident response support for organizations worldwide. Sygnia works with companies to proactively build their cyber resilience and to respond and defeat attacks within their networks. It is the trusted advisor and cybersecurity service provider of IT and security teams, senior managements, and boards of top organizations worldwide, including Fortune 100 companies.\nThe company draws on top talent from the ranks of elite military technology units and from across the cyber industry and has some of the world’s top talents in cyber security. Described by Forbes as a “cyber security delta force”, it applies technological supremacy, digital combat experience, data analytics and a business-driven mindset to cyber security, enabling organizations to excel in the age of cyber.\nSygnia is looking for an Incident Response Manager to lead investigations and response activities in support of organizations worldwide.\nCyber threats are constantly growing in volume, velocity and sophistication. When an organization is confronted with an advanced attack, it needs the strongest capabilities on its side. In many cases, an incident response engagement is in fact a battle within a network. The operational art, experience focus and speed of Sygnia response teams can mean the difference between a minor blow and a devastating impact on performance and reputation of organizations.\n The Incident Response Manager is both a subject matter expert for clients and team members, and a leader. Significant part of our investigations is performed onsite at the client location, in collaboration with the client’s IT and security teams.\nRESPONSIBILITIES\nLead incident response and hunting efforts, including large scale sophisticated attacks, to contain and defeat to real-world cyber threats\nLead a team of top-tier cyber security researchers and forensic experts conducting assessments and in-depth analysis in complex investigation, as well as security assessments.\nProvide excellent communication and status updates to a variety of audiences, including technical and executive stakeholders\nCollaborate and work with client’s IT and Security teams during investigations\nDesign and improve internal incident response methodologies and processes\nRequirements:\n\nAt least 5years’ experience in team management (from military service and/or industry)\nDecisive bright and positive leader, who strive for excellency\nCalm leader with in-depth thinking and ability to succeed in an ultra-dynamic, fast pace environment/situation.\nUnwavering focus and crisis management skills: Must have the ability to see things for what they are, to manage relationships and communication channels and to evaluate the actions taken\nExceptional written and verbal presentation skills - must be able to articulate complex technical issues in a concise and confident manner to both technical personnel and executive level management\nIn-depth understanding of the life cycle of advanced security threats, attack vectors and methods of exploitation\nStrong technical understanding of network fundamentals, common Internet protocols and system and security controls\nExperience with the tools and techniques used in security event analysis, incident response, computer forensics, malware analysis, or other areas of security operations\nWillingness for intensive travel abroad\nADVANTAGES\nPrevious experience in strategy or cybersecurity consulting – advantage\nAcademic degree in a technological or scientific discipline – advantage\nTeam8:\n\nSygniaShow more Report"}, {"company": "Oski Technology", "job": "Chip Design Engineer", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=227&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1bc15b75&cb=1676382483633&jobListingId=1008415067496&jrtk=3-1-1gp82td3fp6eb801-1goojgr4kh7hd800-6ee0abd2afee2e52-", "description": "We are now looking for Chip Design Engineer for the Switch Silicon group.\nAs a Chip Design Engineer at NVIDIA's Networking business unit, you'll join a group of passionate engineers to design and implement the next generation state of the art Switch Silicon chips. In this position, you'll make a real impact in a dynamic, technology-focused company while developing the industry's best high-speed communication devices, delivering the highest throughput and lowest latency!\nWhat you'll be doing:\nWork in a combined design and verification team which develops some of the switch silicon core units specializing in quality of service.\nPlan and Design RTL units / blocks according to Arch & Micro arch specifications under challenging constraints with high orientation to power, area, and performance.\nBuild reference models, verify and simulate chip blocks/entities according to specifications.\nWork closely with multiple teams within organizations such as Architecture, Micro- Architecture, and FW.\nWhat we need to see:\nElectrical Engineering B.Sc. or Computer Engineering B.Sc. graduate with high scores or equivalent experience.\nA team player with good communication and interpersonal skills.\nPrevious experience in RTL design or RTL verification – an advantage.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. Are you creative and autonomous? Do you love the challenge of crafting the highest performance & lowest power silicon possible? If so, we want to hear from you. Come, join our Switch Silicon design team and help us build the next chip in this exciting and quickly growing field.Show more Report"}, {"company": "Oski Technology", "job": "Chip Design Architect", "city": "Tel Aviv-Yafo", "date": "26d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=228&ao=1136043&s=58&guid=0000018631386c518141a05e6e1c6a21&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e3853a42&cb=1676382485086&jobListingId=1008403098420&jrtk=3-1-1gp82tefgkhqa801-1goojgr4kh7hd800-d169579d920d569f-", "description": "Our technology has no boundaries! NVIDIA is building the world’s most groundbreaking and state of the art accelerated compute platforms for the world to use. It’s because of our work that scientists, researchers and engineers can advance their ideas. We pioneered a supercharged form of computing loved by the fastest paced computer users in the world - scientists, designers, artists, and gamers.\nWe are seeking a highly motivated Chip Design Architect to join our team of experts and help shape the future of high-performance computing. Our next-generation Infiniband and NVL switches will be at the forefront of connecting and powering the world's most advanced compute clusters, from supercomputers used in AI research to high-performance clusters used in industries such as finance and research labs. As a Chip Design Architect at NVIDIA, you will have the opportunity to work on some of the most cutting-edge technology and help to drive the innovation of our next generation of switches that will be used by top researchers and engineers around the world. The products you'll develop will be integrated in many leading-edge compute clusters, and supercomputers, and you'll be part of a team with a strong track record of success.\nWhat you'll be doing:\nDefine the Infiniband and NVL switch chip architecture end-to-end, and the entire feature set by internal requirements and customers requirements through all product life cycles (post/pre silicon, on deployments).\nDevelop chip architecture specifications and design guidelines, conduct trade-off analysis for different architecture options, and oversee the implementation of the chosen architecture by the chip design / FW / SW teams\nPerform research and analysis for current and future architectures, include patents development.\nCollaborate with cross-functional teams, including other architecture teams, logic design, system software, firmware, and research teams, to ensure the successful execution of the project.\nPartner with cross platforms teams (physical design, logic design, DV, system software, firmware, applications, research)\nServe as a subject matter expert and technical leader within the organization, sharing your expertise and knowledge with cross-functional teams to drive innovation and improve overall performance.\nWhat we need to see:\nBSc or MSc in Electrical Engineering / Computer Science or equivalent experience.\n3+ years of chip architect experience or 6+ years of chip design / design verification experience.\nDeep understanding of how to build and integrate systems with various technology components.\nCan-do attitude and high energy with leadership and excellent interpersonal skills and possess the ability to learn sophisticated concepts in a fast-paced environment.\nYou have utmost passion towards attention to details on design and high focus on design quality.\nWays to stand out from the crowd:\nKnowledge and understanding of networking and compute systems.\nExperience and love for system architecture, Networking/CPU/GPU/Memory/Storage.\nBackground in in-network computing\nNVIDIA has some of the most forward-thinking and talented people in the world working for us. If you're creative and autonomous, we want to hear from you. It’s not just technology though! It is our people, some of the brightest in the world, and our company diverse culture make NVIDIA one of the most fun, innovative and dynamic places to work in the world! At the center of NVIDIA's culture are our core values like innovation, excellence and determination and team, that guide us to be the best we can be.Show more Report"}, {"company": "Fireblocks", "job": "Senior Frontend", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": ""}, {"company": "Ibex Medical Analytics", "job": "In house Senior Pathologist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "About Ibex:\n\nIBEX is a well-funded start-up with global presence and headquarters in the USA and Israel. Ibex develops state-of-the-art artificial intelligence solutions for cancer diagnostics. Our cutting-edge technology is transforming the diagnosis of cancer, leading to rapid and accurate decision making and providing new diagnostic insight to enable precision medicine.\n\nOur world class team of researchers, engineers and medical experts is growing. If you are an outstanding professional, passionate about your work, a team player and want to make a difference in the lives of millions of people – come join us. You will get the opportunity to work on novel and challenging problems and help us fight cancer while doing it!\nResponsibilities:\n\nWe are looking for a Senior Pathologist to join our team. As an in-house pathologist, you will work closely with our R&D team on new applications for our cancer diagnostics platform as we expand it to additional tissues and indications, acting as subject matter expert and advising on all clinical matters. You will further work with our AI experts, scientific researchers and other pathologists on tasks such as:\n\nAnnotate (mark and label) various cell types and structures in whole-slide images\nAnalysis of algorithmic performance and clinical data\nDesign and execution of clinical research and case studies\nAdvise on improvements to our platform, workflow and user-interface\nWriting clinical, scientific and other pathology-related papers\nHelp the commercial team engage physicians and improve adoption of our solution by customers\nProven experience as a licensed pathologist\nExperience in conducting clinical studies and clinical writing – an advantage\nExperience in a Medtech company – an advantage\nWilling to work in a dynamic and intense start-up environment\nFluent in English\nGreat communication skills\n\nWe are an equal opportunity employer and committed to creating a friendly, inclusive environment that is a pleasure to work in, and where there is an unbiased acceptance of others.Show more Report"}]