[{"company": "אומניסיס בע''מ", "job": "Algorithms researcher", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Oski Technology", "job": "Video Architecture and Algorithms Student", "city": "Israel", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "NVIDIA", "job": "Video Architecture and Algorithms Student", "city": "Israel", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186313928e3a6b1d782b91068c1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e61ef514&cb=1676382538561&jobListingId=1008340174776&jrtk=3-1-1gp82v2o1k6d8801-1goojia9ugrgg800-b97ae78d16d69fd0-", "description": "Today, NVIDIA is tapping into the unlimited potential of AI to define the next era of computing. An era in which our GPU acts as the brains of computers, robots, and self-driving cars that can understand the world. Doing what’s never been done before takes vision, innovation, and the world’s best talent. As an NVIDIAN, you’ll be immersed in a diverse, encouraging environment where everyone is inspired to do their best work. Come join the team and see how we can make a lasting impact on the world.\nVideo/Multimedia Architecture Group is an idiosyncratic group of people that seed and evangelize the technology for Video Compression engines. The group's responsibility is to research, invent, set the technological roadmap, and define the architecture to make it a product. We are looking for a passionate M.Sc./Ph.D. Student, who loves challenges to join our Video/Multimedia Architecture team. The Individual chosen for this position will have the opportunity to take an active part in researching and developing state-of-the-art Video Compression and Video Pre-/Post- Processing Algorithms and Architecture aimed to be deployed into Nvidia’s world-class consumer and data center products. Come and help us lead the next generation of video!\nWhat you will be doing:\nMaster our Video Algorithms and Architecture\nResearch and evaluate algorithms currently used in related applications.\nTest and measure constantly the quality improvements of the design step, quantify them, and document them.\nDefine the SI architecture and SW algorithms for different design groups (worldwide)\nWhat we need to see:\nM.Sc./Ph.D. student in Electrical Engineering, Computer Science or Software Engineering.\nDomain interest and area of research is in one or more: Image processing or Computer vision, Machine learning, or 3D graphics algorithms\nExperience in OOP/OOD with C++ and Python\nPassion for problem-solving and Algorithms research and development\nWays to stand out from the crowd:\nActual experience with C++/Python Algorithmic Frameworks such as OpenCV, Numpy, SciPy, CuPy, matplotlib, etc.\nWorking knowledge of one of the most popular Artificial Intelligence development frameworks (e.g TensorFlow, PyTorch, Keras, etc.)\nKnowledge in video compression standards.\nNVIDIA is committed to fostering a diverse work environment and is proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform essential job functions, and receive other benefits and privileges of employment. Please contact us to request an accommodation.Show more Report"}, {"company": "IBM", "job": "Cloud Quality - MSc/PhD Summer internship 2023 - Research Lab", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "NVIDIA", "job": "Chip Architect Student", "city": "Israel", "date": "27d", "rating": "4.6", "link": "", "description": ""}, {"company": "Oski Technology", "job": "Chip Architect Student", "city": "Israel", "date": "27d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186313928e3a6b1d782b91068c1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f1efd010&cb=1676382543076&jobListingId=1008400632931&jrtk=3-1-1gp82v74skcm4801-1goojia9ugrgg800-73a255031ec084ea-", "description": "NVIDIA has been redefining computer graphics, PC gaming, networking and accelerated computing for more than 25 years. It’s an outstanding legacy of innovation that’s motivated by phenomenal technology.\nWe are now looking for a motivated Chip Architect Student to use creativity and problem solving skills to work on the ConnectX network adapter and Bluefield Data Processing Unit with the highly inventive and knowledgeable team\nWhat you'll be doing:\nBe part of the team that defines the Network Adapter chip and Data processing Unit architecture end to end from the market requirements through design and all product life cycles (post/pre-silicon, on deployments).\nPerform research and analysis on real systems and simulation tools for deployed products and innovate for future solutions.\nCollaborate with other research teams.\nDevelop Proof of Concepts using our technology, collaborating with our most sophisticated customers on state-of-the-art innovations.\nWhat we need to see:\nStudent for B.Sc. in Electrical or Computer Engineering.\nProgramming skills.\nKnowledge and understanding of compute and networking systems.\nCan-do attitude and high energy with leadership and excellent interpersonal skills and possess the ability to learn complex concepts in a fast pace environment.\nPassion and attention to details in design and a high focus on design quality.\nWays to stand out from the crowd:\nExperience and love for system architecture, CPU/GPU/Memory/Storage/Networking.\nNVIDIA is committed to encouraging a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.Show more Report"}]