[{"company": "Cisco Systems", "job": "Software Engineer Intern - Netanya, Israel", "city": "Netanya", "date": "29d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=000001863139d0deabb8fd752c32804f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_affedcea&cb=1676382546385&jobListingId=1008397016244&jrtk=3-1-1gp82v8qejorf801-1goojjk94is3v800-072f9dc2ec84c191-", "description": "Location: Netanya, Israel\n\nWHY YOU’LL LOVE CISCO\nWe connect everything: people, processes, data, and things. We innovate everywhere, taking bold risks to shape the technologies that give us smart cities, connected cars, and handheld hospitals. And we do it in style with unique personalities who aren’t afraid to change the way the world works, lives, plays and learns. We are thought leaders, tech geeks, pop culture aficionados, and we even have a few purple haired rock stars. We celebrate the creativity and diversity that fuels our innovation. We are dreamers and we are doers. #We Are Cisco\n\nWHAT YOU'LL DO\nWe are looking for Software Engineer Intern to join the Security Policy Access (SPA) product development team. In this role you will work on design and implementation of ground-breaking new features and tackle critical customers issues in high scale enterprise production environments.\n\nWHO YOU'LL WORK WITH\nCisco is redefining the networking industry. To make this happen, we are heavily investing in team responsible for the Network. We are disrupting the industry by building a new networking platform that can learn, adapt, and secure itself at the speed of today’s businesses. Cisco Digital Network Architecture platform automates network management and provides our customers with state-of-the-art analytics and insights. You will work with one of the most hardworking group of engineers in the industry, bringing innovation into the networking world.\n\nREQUIREMENTS\nStudent graduating in late 2023/early 2024 pursuing a BA/BSc in Computer Science or Software Engineering from Technion, Tel Aviv, Ben-Gurion or Hebrew University with a GPA of 85 or above- Strong software development skills in Java/C#/C++- Good understanding of standard networking protocols- Software development experience in Linux environment- Very good verbal and written communication skills (English) - Hands on experience with scripting languages (Python, Perl)- You are curious to learn new technologies and collaborate with fellow engineers to raise the bar to create team success\n\nWe understand from experience that not ticking every box on the skills sections stops many from applying. You should apply if you feel you are the right person for the job and have the aptitude to learn and deliver results.\n\n #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. We embrace digital, and help our customers implement change in their digital businesses. Some may think we’re \"old\" (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do - you can’t put us in a box!But \"Digital Transformation\" is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)Day to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "AWS EMEA SARL (Israel Branch)", "job": "2023 Research Science Internship - Quantum Computing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "", "description": ""}, {"company": "Amazon Dev Center (Tel Aviv)", "job": "2023 Applied Science Internship - Machine Learning, Deep Learning, Computer Vision, NLP", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=000001863139d0deabb8fd752c32804f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5d7cf4a0&cb=1676382548787&jobListingId=1008113995413&jrtk=3-1-1gp82vcntjflm801-1goojjk94is3v800-2c81ea232650a898-", "description": "\nEnrolled in a PhD or Master's degree in Computer Science, Machine Learning, Engineering, Operations Research, Statistics or related fields\nExperience in any programming language such as Python, Java, C++, or similar scripting and programming languages\n\nJob summary\n\nPlease note we may also have internship opportunities in Haifa, Austria, France, Germany, Ireland, Luxembourg, Italy, Spain, Poland, UK\n\nAre you a MS or PhD student interested in a 2023 Internship in the field of Applied Sciences? Do you enjoy diving deep into hard technical problems and coming up with solutions that enable successful products that improve the lives of people in a meaningful way?\n\nWe’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact, visionary person you know you’re ready to be. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth. How often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.\n\nIf you’re insatiably curious and always want to learn more, then you’ve come to the right place. Depending on your location, country, job status and other requirements, some or all of the following benefits may be available to you as an intern.\n\n\nCompetitive pay\nImpactful project and internship/role deliverables\nHybrid working (team dependent)\nNetworking opportunities with fellow interns\nInternships events such as speaker series, intern panels, Leadership Principles sessions, Amazon writing skills sessions.\nMentorship and career development\n\nIf this describes you, come join our research teams at Amazon. We are looking for motivated students with research interests in a variety of domain expertise in applied sciences to build state-of-the-art solutions for never before solved problems.\n\nIf you’re successful during your internship, you could be considered for a graduate role after finishing your university studies\n\nInternship start dates vary throughout the year. Internship length can vary between 3 - 6 months for Full Time and 6 - 12 months for Part Time.\n\nKey job responsibilities\n\nWork closely with scientists and engineering teams (position-dependent)\nWork on an interdisciplinary team on customer-obsessed research\nDesign new algorithms, models, or other technical solutions\nExperience Amazon's customer-focused culture\nPublications at top-tier peer-reviewed conferences or journals.\nExperience in design of experiments and statistical analysis\nExperience implementing algorithms using toolkits and self-developed code\nExperience in solving business problems through machine learning, data mining and statistical algorithms\nFamiliar with the core undergraduate curriculum of computer science.\nTechnical fluency; comfort understanding and discussing architectural concepts and algorithms, schedule tradeoffs and new opportunities with technical team members.\nExcellent critical thinking skills, combined with the ability to present your beliefs clearly and compellingly in both verbal and written form.\n\nPlease note this is not a remote internship opportunity\n\nEU Student Programs TeamShow more Report"}, {"company": "IBM", "job": "Cloud Quality - MSc/PhD Summer internship 2023 - Research Lab", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "InspHire", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "5.0", "link": "", "description": "A TLV-based startup that’s on a mission to change the work experience for 80% of the world’s global workforce is looking for a talented, experienced and creative Art Director with managerial experience to build creative capacity at scale within the company.\n\nApply here to help shape the future of work!\n\nAbout This Role:\nAs an Art Director you will develop and execute a creative strategy to meet the company’s business goals and support its growing marketing efforts. This includes establishing the studio in-house to support all creative needs. Focus areas cover motion graphics, directing photo and video shoots, illustrations, website, landing pages and the creation of digital assets at scale, OOH marketing and traditional marketing.\nOwnership & Responsibilities:\nRecruit and operate an in-house studio\nCraft a creative business strategy aligned with business goals supporting an ever-growing marketing budget across multiple channels (acquisition oriented)\nLead the marketing creative team and manage the creative process from A to Z, collaborate with the Content, Marketing and Product teams\nSet the visual tone/direction of campaigns to build concepts and bring them to life\nResponsible for delivering marketing assets at scale for a variety of channels: banners, landing pages, video ads, newsletters, blogs, social posts, etc.\nTurn creative briefs into beautiful marketing assets\nPrioritize projects and work on tight deadlines\nBe on top of the marketing assets performance, initiate data-driven AB tests and always strive to improve conversion rates\nWork closely with external vendors, stakeholders and partners\nQualifications:\nProven experience in building and managing a studio / a significant creative team\n5+ Years of experience as a designer or related positions in a marketing agency - a must\nExperience with motion graphics, directing video shoots, and digital marketing assets\nTeam player with the ability to work with strategists, data scientists and account teams in a fast-paced environment\nUnderstand how to scale ideas for global deliverables\nExperience designing for different audiences (B2B, consumer, enterprise)\nPossess strong art direction/design skills\nFollow brand guidelines and work within a design system\nProven experience working across teams, both in leading projects, and collaborating on work\nAttention to details and high sensitivity to aesthetic\nCritical thinking and storytelling skills\nExcellent communication skills, both verbal and written\nFamiliarity with online marketing metrics\nPortfolio of beautiful, compelling digital and brand-oriented workShow more Report"}, {"company": "Clarivate", "job": "", "city": "Jerusalem", "date": "", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=343&guid=000001863139d259bfbd22e770f61125&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_4de3b628&cb=1676382554845&jobListingId=1008430435452&jrtk=3-1-1gp82vijijm51801-1goojjl0rgfp8800-aee013221725c25b-", "description": "EX LIBRIS– Who are we?\nEx Libris, Part of Clarivate, is a global EdTech (Education Technology) industry, leader. We serve some of the most prestigious academic institutions and research Universities around the world, with a total of over 7,500 customers in 90 countries.\nOur SaaS solutions help universities transform academic libraries, maximize the impact of research activities, enhance teaching and learning, and drive student engagement and success. For more information about Ex Libris, see our website, and join us on Facebook, YouTube, LinkedIn, and Twitter.\nWe are looking for a Product Manager to join our Cross Products Team in Jerusalem. This is an amazing opportunity to work on bringing Linked Data into the Top Academic Libraries in the world. The team consists of five people and is reporting to the Director of Cross Product and Operations. We have a great skill set in SaaS products and we would love to speak with you if you have skills in building data-driven products.\nAbout You – experience, education, skills, and accomplishments\nBachelor’s degree in one of the following fields: Information Science, Data Science, Computer Science, Industrial Engineering, or Exact Science or equivalent education\nWork experience in your field, plus 1-2 years as a product manager\nStrong understanding of complex computers systems in a cloud environment\nStrong orientation for all aspects of data – analysis, modeling, scale, advanced processing\nExperience managing basic customer questions and concerns for their product(s).\nAbility to collaborate across teams to manage product development.\nExcellent English\nHas a working understanding of business drivers and key issues.\nMust possess the ability to gain domain knowledge in the position.\nIt would be great if you also had . . .\nProfessional experience in a library setting.\nMBA\nMLIS - Master of Library and Information Science\nWhat will you be doing in this role?\nProduct Requirements – Provide clear and measurable product requirements and make trade-off recommendations between implementation and functionality.\nProduct Delivery – manages the development and launch of new features and functionality through the entire product development lifecycle process from concept through implementation and release. (For full product, or significant product features)\nCustomer Research – Participate in leading focus groups, customer surveys, and user testing to inform product priorities. Monitors key product analytics to inform development priorities.\nProduct Roadmap – Under direction, understands market priorities and works with Engineering to identify trade-offs. Drives activities/user store products and deliver the product to market t, according to product roadmap. Prioritizes and sequences product features to meet market demands.\nProduct Strategy - Internalize product strategy such that it informs market requirements and feature prioritization.\nThe product you will be developing\nLinked Data is a new technology we would like to leverage across the core products of Ex Libris, Alma, and Primo. Using this technology, we want to provide a whole new end-to-end experience from a global collaborative cataloging platform through the best-in-class library management system over the cloud (Alma) to the robust discovery system (Primo). We aim to utilize this new way of working with the data as a graph database, integrated with new AI services.\nThis is a long-term area that is at the core of Ex Libris's strategy.\nAbout the Team\nThe cross-products and operations team has five people working with multiple product managers and development teams in various areas such as UX and Accessibility, Analytics, Security and Privacy as well as core features of the Higher Education Platform. These people are veterans in their areas and work collaboratively within the team and externally including other groups from the wider cooperate of Clarivate. The people on the team are based in Israel.\nHours of Work / More important information for you:\nOur base is in the Jerusalem, Israel office, working in a hybrid model\nThis is a full-time position.\nOccasional travel is required.\nWhy Ex-Libris?\nAt Ex Libris, we value our employees and are striving to create the perfect balance between work and home life. Join us to be part of a family-like environment; enjoy our unique culture and benefits. Be part of a thriving, productive community helping change the future of higher education with the state-of-the-art technology from Ex Libris.\nAt Ex Libris, we work hard and have fun doing it!\nAt Clarivate, we are committed to providing equal employment opportunities for all persons with respect to hiring, compensation, promotion, training, and other terms, conditions, and privileges of employment. We comply with applicable laws and regulations governing non-discrimination in all locations.Show more Report"}, {"company": "CytoReason", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "4.2", "link": "", "description": ""}, {"company": "adklix", "job": "", "city": "Raanana", "date": "", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=343&guid=000001863139d259bfbd22e770f61125&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_b52e28a8&cb=1676382557007&jobListingId=1005649432555&jrtk=3-1-1gp82vko3p2kl801-1goojjl0rgfp8800-d08c57b228bd4a82-", "description": "Responsibilities:\nWe are seeking a Junior Art Director to join our team and assist with the development of advertising assets for a wide range of industries. The candidate will have 2-3 years experience and must be conceptual, collaborative, strategic, and capable of crafting big ideas and experiences, and executing them across all channels (direct mail, digital print, video, social media).\nIn addition, the ideal candidate will possess a true passion for, and understanding of, what drives consumer behavior.\nThis will be a full-time position.\nRequirements:\n\nGreat design skills with a sense of design, composition and color\nAbility to work quickly and create many different looks\nProficiency in Photoshop, Illustrator, and other design tools\nBachelor’s degree (four-year degree) from a well-known institutio\nCandidates must submit a link to their work when applying.Show more Report"}, {"company": "Natural Intelligence", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "4.1", "link": "", "description": "Founded in 2009 and 100% self-funded to this day, Natural Intelligence is a leader in online multi-vertical marketplaces. Our global brands, Top10.com and BestMoney.com, help millions worldwide make informed decisions every day. Our proprietary platform, xMatch, harnesses AI and ML technologies in order to help consumers make easier choices, and find the right products and services tailored to their needs.\nWe are seeking a highly talented & motivated Creative Art to join our Growth Department. This is an exciting opportunity for an experienced creative person who is in love with creating unforgettable images and holistic concepts that make a powerful impact.\nResponsibilities\nDesign unique images in the social media field (Facebook, Instagram, Snapchat, TikTok, etc.).\nCreate storyboards for UGC and Commercial videos.\nManage A/B testing processes from A to Z by working closely with campaign managers.\nConstant analysis of trends in the social media field and ability to implement these insights in the design you create.\nWork closely with the Copywriter, Design Studio, and Video Studio while creating sharp and data-driven creatives.\nMaking a vertical-based overview and utilizing creative data in order to monetize the creative assets results.\nRequirements:\n\nEnglish proficiency, both spoken and written.\n3 years of experience as an art director in a big advertising agency.\nPrevious experience in creating storyboards and social images.\nExperience in creating a campaign for social media such as Facebook and Tik Tok.\nAbility to work in a large team.\nExperience in growth/performance marketing - a big plus.\nWorking with a fintech customer - a big plus.\nOnly suitable CVs will be considered.Show more Report"}]