[{"company": "Egis", "job": "Track Expert FM", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=301&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bc4dd452&cb=1676382489838&jobListingId=1008323646984&jrtk=3-1-1gp82tj4kgfos801-1goojhj25i6i0800-bb22a15caeb904ed-", "description": "General information\nOrganisation\nEgis is a global consulting and engineering firm working in construction, transport and mobility services. Our mission: create and operate intelligent infrastructure and buildings to further the transition to a low-carbon economy and contribute to more balanced and sustainable territorial development.\n\nTo support our growth dynamic, we offer a wide variety of career opportunities in more than 120 countries.\n\nJoining our Group and its 16,000 employees means, above all, sharing our values as a people-first company, strongly committed to sustainability and innovation.\n\nReference\n2022-7980\nPosition description\nJob title\n\nTrack Expert FM\nContract type\n\nPermanent contract\nBusiness Line specific context\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\n\nJob description\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\nBased in Jerusalem, you will be part of our Urban Railway / LRT projects in Jerusalem and our other future transportation projects in Israel. You will lead the area of track engineering and construction, providing high-level advice and be responsible for the supervision of track design and construction on the LRT Blue Line.\nUnder responsibility of the Project Director, your activities will include but not be limited to:Review the design documentation produced by the contractor for track works and construction activities to verify their consistency with the Tendering specifications, the international standards and the state of the art track.Prepare Documents Review Sheets (DRS).Review track design and advise on improvements to track alignment and equipment design.Provide regular support to the public transport client engineer regarding project activities.Participate and coordinate the meetings regarding rail track activities such as design reviews, interfacing and testing supervision.\n\nProfile\n\nTo be considered for this position as Track Expert we have the following requirements:Graduate professional in civil or mechanical engineering and have a professional license.A systemic vision, be a team player, organized sensitive to customer service.Experience of minimum 15 years in rail track / civil engineering,A minimum of 5 years’ experience in Light Rail / tramwayKnowledge of international railway track standardsExperience in a design and build context of railway in an international environment is highly valued.Fluent in written and spoken English\n\nPosition location\nJob location\n\nMiddle-East/North Africa, Israel\nCity\n\nJérusalem\n\nCandidate criteria\nMinimum level of education required\n\n6-Engineer’s degree\nMinimum level of experience required\n\nOver 10 yearsShow more Report"}, {"company": "Palo Alto Networks", "job": "Sr. Product Manager (Cortex XDR)", "city": "Tel Aviv-Yafo", "date": "14d", "rating": "4.2", "link": "", "description": ""}, {"company": "InspHire", "job": "ASO Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "The biggest up-and-coming social gaming start-up is looking for passionate ASO (App Store Optimization) Managers!\nNow is a great time to join this Marketing team for a very key role. As an ASO manager, you will be developing an ASO strategy to ensure the company's game will appear at the top of the search results in all applicable App stores. Your objective will be to support organic downloads and the user acquisition strategy by being an ASO guidelines expert on Key app stores and proactively implementing them in the company's product pages.\nResponsibilities\nPerform keyword research in multiple languages.\nClosely work with the Head of Content and VP Marketing on app descriptions.\nProvide graphic requirements to the Art team for new icons & screenshots.\nResearch, plan, run and analyze ASO tests.\nMonitoring and tracking app store rankings and conversion rate, using the latest analytical tools.\nRequirements\nAt least 2 years of experience in ASO/SEO – must!\nAn excellent understanding of the different App stores and their processes.\nUnderstanding and passion for mobile games.\nStrong English skills (additional languages are an advantage).\nExcellent research and analytical skills.\nExperience in graphics design – a big advantage.\nOrganized, creative and detail-oriented.\nHigh proficiency in Microsoft Office/Google Spreadsheet.\nGood people skills,Show more Report"}, {"company": "Mobileye", "job": "Physical Design Engineer", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5851fcc1&cb=1676382494747&jobListingId=1008091616414&jrtk=3-1-1gp82tnurjool801-1goojhj25i6i0800-ea19ac7610e9f0bb-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhich department will you join?\nEPG is a fast-paced, dynamic, and startup-like group responsible for researching, incubating and developing next-generation technologies and ideas, with a strong orientation towards computer vision, machine learning, data, and AI.\nThe group hosts a diverse team of scientists, engineers and developers to research, realize, and bring to market innovative new products, leveraging cutting-edge technologies, skills and capabilities.\nWe’re looking for a Backend expert to join the growing Physical Design Team, responsible for state of the art SoC design from definition to Tape-Out.\nWhat will your job look like?\nHands-on physical design block owner from RTL to GDS.\nFloorplan exploration with guidance and collaboration with front-end and architecture teams.\nSTA: work with FE and floor planner to manage block and top level constraints and 1st level of timing analysis.\nSynthesis exploration and final synthesis netlist: Scan insertion @ synthesis, clean checks from Lint, UPF & Spyglass.\nPlace & Route: from Synthesis netlist to final layout and signoff verification with target to achieve best power performance and area.\nAll you need is:\nBSc or MSc degree in Computer Engineering or Electrical Engineering.\nExperience in scripting languages like Tcl/python/Perl/tcsh.\nTeam player with excellent communication skills, customer orientation, and a “can-do” attitude.\nExperience in relevant domains - Advantage.\nBuilding or maintaining implementation tools and flow – Advantage.\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Egis", "job": "Lead Rolling Stock Expert FM", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=305&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4915fff0&cb=1676382495862&jobListingId=1008301342012&jrtk=3-1-1gp82tp1rk60o801-1goojhj25i6i0800-a70f2e118c5e0249-", "description": "General information\nOrganisation\nEgis is a global consulting and engineering firm working in construction, transport and mobility services. Our mission: create and operate intelligent infrastructure and buildings to further the transition to a low-carbon economy and contribute to more balanced and sustainable territorial development.\n\nTo support our growth dynamic, we offer a wide variety of career opportunities in more than 120 countries.\n\nJoining our Group and its 16,000 employees means, above all, sharing our values as a people-first company, strongly committed to sustainability and innovation.\n\nReference\n2022-7865\nPosition description\nJob title\n\nLead Rolling Stock Expert FM\nContract type\n\nPermanent contract\nJob description\n\nEgis Rail, a business line of the Egis Group, brings together all of the necessary expertise for guided urban transport and rail: systems, automation, rolling stock, safety, equipment, civil engineering, environment, etc. Egis Rail has led numerous successful projects on all continents, from preliminary design of public transport systems through to commissioning, and covering all aspects of testing and handover to clients.\n\nBased in Jerusalem, you will be part of our Urban Railway / LRT projects in Jerusalem and our other future transportation projects in Israel. You will lead the area of rolling stock, providing high-level advice and be responsible for the supervision of implementation of new rolling stock on the Blue Line.\nUnder responsibility of the Project Director, your activities will include but not be limited to:Review the design documentation produced by the contractor for Rolling Stock works and construction activities to verify their consistency with the Tendering specifications, the international standards and the state of the art. Prepare Documents Review Sheets (DRS).Follow up the construction, delivery and tests of the whole fleetProvide regular support to the public transport client regarding project activities.Participate and coordinate the meetings regarding rolling stock activities such as design reviews, interfacing and testing supervision at contractor/sub-contractors and customer’s sites.Prepare and issue Minutes of Meetings.Coordinate with other services for interfacing and commissioning activities of the rolling stock.\n\nProfile\n\nTo be considered for this position as Lead Rolling Stock Expert we have the following requirements:Graduate professional and have a professional license.A systemic vision, be a team player, organized sensitive to customer service.Experience of minimum 10 years in Rolling Stock, ideally including experience with Light Rail Vehicles.Knowledge of railway rolling stock structuresExperience in root cause analysis for mechanical issues on rolling stock in service.Knowledge and management of railway test environments.Good knowledge of materials and electrical and pneumatic systems and structural analysis is required (HVAC, Brake systems, TCMS, FEA, Welding).Fluent in written/spoken English\n\nPosition location\nJob location\n\nMiddle-East/North Africa, Israel\nCity\n\nJerusalem\n\nCandidate criteria\nMinimum level of education required\n\n6-Engineer’s degree\nMinimum level of experience required\n\nOver 10 yearsShow more Report"}, {"company": "Guesty", "job": "Art Director", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Guesty is looking for an Art Director with outstanding conceptual and visual design skills as well as a strong understanding of digital marketing across multiple channels. You will be responsible for elevating and maintaining the artistic level of the creative team’s delivery, while being hands-on and executing on your own projects.\nThis is a huge opportunity to join Guesty at a pivotal time in the company’s successful history. The Art Director will be part of Guesty’s brand repositioning project and help define the new visual identity of the company.\nRequirements:\n\nInspirational creative leader who can drive and influence a new culture for design within Guesty.\nPassion for design and creative marketing.\nExperience in a broad range of marketing design disciplines including branding, motion, lead generation, social media, and events.\nAbility to oversee creative execution by other team members while keeping up with your own deliverables.\nTalent for pitching creative concepts to marketing teammates and senior management.\nExperience working on a performance-driven marketing team.\n10+ years of experience in marketing design.\n2+ years as art director at a SaaS/product-centric company.\nHigh level of English written and verbal communication skills.\nDegree from a top-tier design school or equivalent experience.\nGuesty is proud to be an Equal Opportunity Employer. We provide equal employment opportunities to all employees and applicants regardless of any characteristic protected by law.\nResponsibilities:\n\nTake artistic ownership of the creative team’s projects and work closely to guide & mentor them through creative vision.\nElevate the creative team’s execution by bringing your talent and expertise to every aspect of the creative process.\nContribute to the conceptualization, design direction, and development of marketing initiatives.\nClosely monitor and assure the creative quality for projects of different disciplines - From product videos and social media content to web design elements and campaign creative.\nExecute at a high level and on tight timelines while maintaining the highest standards of design.\nWork on multiple projects in a team-oriented environment.\nMaintain excellent communication both internally with the team and externally with other stakeholders.\nProactively identify key areas for optimization from both a UI and UX perspectiveShow more Report"}, {"company": "Gong", "job": "Senior Product Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Gong is one of Israel’s most valued private software companies. Our solution uses machine learning and AI to automate big parts of customer-facing roles. Over 3000 innovative companies like Google, Amazon, AT&T, Linkedin, Novartis, Appsflyer, Monday, Walkme, Taboola, trust Gong to power their customer reality.\n\nAt Gong, we’re building new-generation, machine-learning based software that automates big parts of customer-facing roles by “understanding” their conversations and related work.\n\nOur solution guides sales professionals, coaches them on how to become better, performs tasks for them, and directs them to the best actions.\nWe’re seeking a highly motivated & experienced product analyst to join our product group in building our product.\nAs Sr. Product Analyst, you’ll play a key role in ensuring our platform and processes work smoothly and at scale.\nYou will:\nInfluence change by presenting product and customer data-driven insights to product management and senior leadership; confidently present the outcome of your analysis and make recommendations to executives and team leaders\nBe the right hand of product and business leaders in building business cases for new product functionality, and tracking the effectiveness of the functionality over time; monitor key metrics, identify business trends and generate forecasts\nLead deep-dive analysis that will frame product strategy and product roadmap decisions\nFoster our data-centric, continuous learning culture with your passion for telling stories with data; grow our best practices around reporting quality, data hygiene, and data governance\nOwn the design, development, and maintenance of ongoing dashboards and their underlying data sets\nWork collaboratively with product managers and engineers to ensure that the right data is generated and collected\nYou have:\nBA degree in a quantitative field (Math, Statistics, Industrial Engineering, Engineering, Economics, etc.) ; MBA preferred\n4+ years of demonstrated experience working in a quantitative or analytical role, preferably at a startup or management consulting firm\nConfirmed ability to surface key insights and/or predictive forecasting models that subsequently drove business changes with measurable lift in performance\nFluency in common statistical analysis methods; and specifically, the ability to quickly separate data from noise\nProficiency using SQL and Excel for data querying and manipulation; comfortable using additional data access and analysis tools\nExperience with product analytics methodologies\nPassionate about producing high-quality accurate analytics deliverables\nIdeally, you are experienced in creating and maintaining dashboards using data visualization tools such as Tableau, Sisense, or similar\nIdeally, have programming experience using languages such as Python\nSelf-motivation, proactively going beyond the call of duty\nCreativity and strategic thinking\nThe ability to work comfortably in a constantly evolving environment\nYou'll get:\nAn opportunity to play a major part in the company's product strategy and operations\nAn opportunity to work with other top talents to solve complex challenges\nTo experience building a state-of-the-art SaaS product used by top business professionals\nTo be part of a high-profile, well-funded company with access to top US customers.\nTo analyze complex, non-trivial data generated in a fast-moving product, which is used by tens of thousands of users on a daily or weekly basis\nTo lead and own momentus projects and tasksFirst-hand entrepreneurial experience\nHere at Gong, we encourage our employees to express their personality and identity (whether gender, ethnic, religious, or sexual), and we ensure fairness and equal opportunities.\nWe follow a hybrid working model that combines working from home, on the go, or at the office. This allows us: flexibility, autonomy, positive work relationships, and effective work habits\nIf these considerations are important to you when choosing a work place, we'd love to see you with us.Show more Report"}, {"company": "AWS EMEA SARL (Israel Branch)", "job": "2023 Research Science Internship - Quantum Computing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "", "description": ""}, {"company": "NVIDIA", "job": "Formal Verification Engineer", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=309&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_db5908e3&cb=1676382503003&jobListingId=1008414905406&jrtk=3-1-1gp82u00pk6cv801-1goojhj25i6i0800-1179297e7bbd2102-", "description": "We are looking for a Formal Verification Engineer for our NVIDIA Networking team!\nThis is an exciting opportunity to join a hardworking Pre-Silicon design and verification team, working on groundbreaking Switch technologies. We deploy state-of-the art formal verification tools and methodologies to prove design correctness. Working in our formal verification team will expose you to a wide range of cutting edge design and technologies. Our Switch team delivers world class Bridge and router solutions for HPC, data-center, network, and storage markets. We micro-architect, verify, and deliver smart and high bandwidth multi port switches. NVIDIA has the most sophisticated formal tools and methodologies in the industry, which help us achieve A0 design tapeouts. As part of this team, you'll enjoy a versatile work environment, which is educational, dynamic and ambitious.\nWhat you'll be doing:\nIn this position you will use formal verification algorithms to formally prove the correctness of complicated logic problems.\nYou will work on ambitious designs along with our Pre-Silicon team and take part in developing the next generation of NVIDIA's core technology.\nWhat we need to see:\nBSc in Electrical/Computer Engineering or MSc in Mathematics\n2+ years of relevant experience.\nExcellent analytical, logical reasoning and problem-solving skills\nStrong debugging and analytical skills.\nStrong communication and interpersonal skills are required\nWays to stand out from the crowd:\nFormal verification work experience.\nKnowledge of digital logic\nNVIDIA has some of the most forward-thinking and hardworking people in the world working for us. Are you a creative and autonomous engineer who loves a challenge? Come join our team and help us build the future HPC and data centers.Show more Report"}, {"company": "Mobileye", "job": "R&D Mechanical Engineer", "city": "Jerusalem", "date": "24h", "rating": "4.2", "link": "", "description": ""}, {"company": "FUNDGUARD", "job": "Backend Team Leader", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=311&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e048249c&cb=1676382505915&jobListingId=1008238350829&jrtk=3-1-1gp82u2rpi6gs801-1goojhj25i6i0800-7ba1b7f9622f8776-", "description": "DESCRIPTION\nFundGuard is the new generation investment accounting utility for asset managers and their service providers. Our cloud-native, AI-powered operating system and technology platform are transforming investment operations. FundGuard existentially changes asset servicing to enable reduced fees and the ability to offer new and innovative products, including crypto-asset services, at scale, today and tomorrow.\nThe company is led by an experienced team with successful exits and has raised more than $55 million, backed by strategic partners including Citi and State Street Corp, venture firms Blumberg Capital, LionBird Ventures, and Team8 Capital among others.\nRead more about our latest achievements\nFundGuard Named “Tomorrow’s Top Growth Company” by Qumra Capital\n﻿We offer an exciting work opportunity where you’ll:Use cutting edge cloud technologiesDevelop one of the more robust enterprise applications with deep financial enginesWork with massive sets of dataBuild a highly performant application to serve leading global financial institutionsCollaborate with highly experienced engineering and product team members\nJoin FundGuard at the forefront of innovative financial technology. Work with us!\nVisit us: fundguard.com/careers\nFollow us: linkedin.com/fundguard\nWe are located in Azrieli Center Tel Aviv.\nYour mission is to lead and expand a team of talented developers, collaborate with colleagues in solving complex problems, prioritize and overcome design challenges. Own features from design and development to production. Drive technical excellence, high product quality, innovation and timely delivery in an agile environment\nWork closely with Product Management, R&D and other stakeholders from ideation to real customer value.\nREQUIREMENTS\n3+ years of experience in leading R&D teams in fast paced environments\n5+ years of experience in software engineering\nSolid proficiency in modern Java/C++/C#\nExperience developing large, scalable, distributed information systems using a microservices architecture\nMastery of high-performance, reentrant and efficient code\nCompetency working with state-of-the-art source control management and CI tools\nExperience with Agile/Scrum development methodologies\nTeam player, mentor, strong communication and problem-solving skills\nComputer Science degree(s) from leading universities or/and technological intelligence units graduate\nNice to have skills:\nJava and Spring (boot) proficiency\nExperience with cloud frameworks such as Kafka, Cassandra, Redis, Elasticsearch and S3/Blob\nFamiliarity with “supporting” languages like Python, shell scripting\nFinancial understanding or qualifications\nExperience with open-source frameworks such as Docker, Kubernetes, Prometheus and GrafanaShow more Report"}, {"company": "Jacobs", "job": "Telecom Designer", "city": "Qiryat Gat", "date": "12d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=312&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_dcef44e5&cb=1676382507140&jobListingId=1008432670231&jrtk=3-1-1gp82u422mfoo801-1goojhj25i6i0800-ecd1f5f017d0819c-", "description": "Your Impact:\nJacobs is thrilled to announce the expansion of our team in Israel! Now you can join us locally in our exciting journey of challenging today & reinventing tomorrow!\nCome be a part of a vibrant, dynamic team that delivers world class designs for industry leading clients around the world. We design of some of the most complex and specialized facilities being constructed today.\nThis challenging position involves working as part of a multi-discipline, highly interactive and coordinated team focused on projects including semiconductor manufacturing, data center facilities, and other state of the art manufacturing facilities.\nThe ideal candidate will be a self-motivated individual with excellent communication skills. They will exhibit a passion and desire to apply their professional experience and knowledge in a team environment on technically challenging and professionally rewarding projects.\nOur Telecom Designers:\nPerform necessary engineering and design tasks to produce construction documents in conjunction with a team of engineers and designersDesign telecommunication cabling infrastructures based upon client design criteria, national and international codes, TIA/EIA industry standards and Telecom Distribution Methods Manual.Are responsible for designing the following elements and systems:\no Backbone Distribution\no Horizontal Distribution Pathways\no Voice/Data Cables and Connecting Hardware\no Outside Plant\no Telecommunication Spaces.\nCoordinate and collaborate real time with other disciplines to develop designs.Perform quality review checks on design deliverables.Display strong communication and interpersonal skills and have the ability to work in a fast-paced team environment with multiple deadlines.Perform site surveys and design verification.\nHere’s What You’ll Need:\nData Centre / Semiconductor experience preferable, or large scale industrial.Strong relevant engineering/design experience in industrial/advanced technology sector.Excellent English level - written and spoken,Minimum 4 years proven leadership in building telecom system designWorking knowledge of NEC and current BICSI standardsAbility to interact with other engineering disciplines, clients, and vendors at all levels.Experience using REVIT and BIM.\nPreferred requirements\n5-10 years’ experience in design of telecom systems for semiconductor facilitiesShow more Report"}, {"company": "Mobileye", "job": "Real-Time Software Engineer", "city": "Haifa", "date": "6d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=313&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7d1afda9&cb=1676382508360&jobListingId=1008443679407&jrtk=3-1-1gp82u57fkbkq801-1goojhj25i6i0800-ad268b7633d7ccb3-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nAbout the team:\nThe Object-Semantics group is intended to solve computer vision problems with a semantic aspect, with an emphasis on the automotive industry. In our group, we research, develop, and deploy state-of-the-art techniques to achieve world-class results which will allow the safe development of autonomous driving features and advanced driver assistant systems.\nWhat will your job look like:\nAs a member of the Objects Semantics Algorithms team, you will be part of a team that is responsible for architecting, developing, implementing, building, testing, and productizing computer vision-based algorithms, while engaging and collaborating with other teams and members of Mobileye’s teams on various sites.\nYou will implement core strategic features of the Autonomous Vehicle Real-Time System such as scheduler features, memory management, or inter-processor communication.\nYou will work closely with Product Managers, Algorithm Developers and group leaders.\nWork independently, use available resources to get unblocked, and complete tasks on schedule by exercising strong judgment and problem-solving skills.\nDevelop a strong understanding of relevant product areas, codebase, and systems.\nIntegrate and develop core services that serve as an enterprise data backbone, identifying elegant solutions to complex workflows alongside documentation and version control of the solutions.\nAll you need is:\nB.Sc. in Computer Science, or equivalent knowledge (M.Sc – advantage)\n3+ years of experience with C/C++ and Python\nHands-on experience with real-time software\nSolid understanding of operating systems fundamentals\nProficiency with debugging complex software systems\nTeam player, highly effective collaboration skills. Ability to communicate and coordinate with many people in different positions and capacities\nAbility to handle multiple competing priorities in a fast-paced environment, result-oriented\nStrong Advantages: Unix/Linux environment, MLOps, Databases, Docker & Cloud Computing, CI/CD, Source Control, System Design\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "INTEL", "job": "Technical Leader for Pre-Si Verification", "city": "Jerusalem", "date": "30d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4d269469&cb=1676382509520&jobListingId=1008394765089&jrtk=3-1-1gp82u6ci2p8l001-1goojhj25i6i0800-94765d4a25241ee6-", "description": "Job Description\nAny processor, in the past 10 years, that you worked on - we developed it.\nJoin us in creating the future processors of Intel.\nOur Team ensures the logic correctness during the development of each new Intel CPU product before it is being shipped to production.\nThe role includes developing dedicated verification environments and tools, while driving a complex process of exercising the design to verify its logical correctness. These environments are developed using unique, state-of-the-art languages and tools, and advanced software engineering methodologies.\nVarious validation techniques are used while offering a unique Hardware-Software experience.\nIn addition to various tools, languages (UVM, Python) and verification methodologies, you will develop expertise with Intel Architecture and Micro Architecture and will be deeply involved in the process of defining new Intel features.\nQualifications\nAt least 5 years of experience in pre silicone verification\nProven experience in leading project \\ team\nIMPORTANT: Please be informed that Intel is proactively trying to find candidates for a FW Validation Team Lead position and that this position may not be available at this time.\nInside this Business Group\nThe Core and Client Development Group (C2DG) is a worldwide organization focused on the development and integration of SOCs, Core ™, and critical IPs that power Intel's leadership products, driving most of the Client roadmap for CCG, Delivering Server First Cores that enable continued growth for DCG and invest in future disruptive technologies.\n\nPosting Statement\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\n\nBenefits\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://www.intel.com/content/www/us/en/jobs/benefits.html\nJobTypeShow more Report"}, {"company": "InspHire", "job": "Front End Developer", "city": "Ramat Gan", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a Front-End Web Developer who is motivated to combine the art of design with the art of programming to join a well-financed, energetic startup-like publicly traded company, led by experienced and well-reputed entrepreneurs in the blockchain-crypto space is. Responsibilities will include translation of the UI/UX design wireframes to actual code that will produce visual elements of the application. You will work with the UI/UX designer and bridge the gap between graphical design and technical implementation, taking an active role on both sides and defining how the application looks as well as how it works.\nResponsibilities\nDevelop new user-facing features\nBuild reusable code and libraries for future use\nEnsure the technical feasibility of UI/UX designs\nOptimize application for maximum speed and scalability\nAssure that all user input is validated before submitting to back-end\nCollaborate with other team members and stakeholders\nSkills And Qualifications\nProficient understanding of web markup, including HTML5, CSS3\nBasic understanding of server-side CSS pre-processing platforms, such as LESS and SASS\nProficient understanding of client-side scripting and JavaScript frameworks, including jQuery\nGood understanding of advanced JavaScript libraries and frameworks, such as AngularJS, KnockoutJS, BackboneJS, ReactJS, DurandalJS etc.\nGood understanding of asynchronous request handling, partial page updates, and AJAX\nBasic knowledge of image authoring tools, to be able to crop, resize, or perform small adjustments on an image. Familiarity with tools such as as Gimp or Photoshop is a plus.\nProficient understanding of cross-browser compatibility issues and ways to work around them.\nProficient understanding of code versioning tools, such as Git / Mercurial / SVN\nGood understanding of SEO principles and ensuring that application will adhere to them.Show more Report"}, {"company": "8BIT sp. z o. o.", "job": "Product Manager (mid/senior)", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=316&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_aa2e4fb1&cb=1676382511909&jobListingId=1008395241738&jrtk=3-1-1gp82u8mbi9gm801-1goojhj25i6i0800-d2140524577cb932-", "description": "Our client is a leading gaming studio on the $50B Metaverse Roblox\nTheir games are played by millions every day and they are seeking to expand the team and reach new heights! They’re a female-founded, female-led, non-traditional gaming studio united by the belief and desire to dream up their own stories, their own worlds, and create inclusive shared experiences on the metaverse.\n\nAs a Product Manager, you will report to the VP of Product, defining and executing on our product roadmap, focusing on strategic partnerships with the biggest media, music, and lifestyle brands coming to the Metaverse.\nProduct management is both challenging and rewarding. As part of their product team, you’ll be focused on enabling the players and the Roblox Community to have fun while creating meaningful friendships that persist across many games and experiences. This important pursuit requires empathy for our players as well as an analytical approach towards their actions.\nAt this point, the position is open to Israeli and European-based PMs.\nRESPONSIBILITIES\nResponsible for design and spec new and existing features for our Roblox Experiences across various products and games (including 3rd party)\nCollaborate with design and development teams to ship new experiences.\nAnalyze and define change across features, product roadmap, UX/UI and all other aspects of a F2P entertainment product.\nEstablish KPIs for product analytics that influence future roadmaps.\nEstablish, guide, and modify product documentation.\nTranslate technical terms, art and wireframes to working PRDs / GDDs\nFind new opportunities, shifting points and easy solutions in order to impact the product in meaningful ways\nREQUIREMENTS\nBachelor’s degree or four or more years of work experience in the games industry.\nHistory of successful product launches, product requirements, feature delivery and trade offs of a product, end to end product delivery and/or deal executions.\nPRD / GDD writing experience.\nAnalytic tools monitoring and analyzing experience.\nExperience with global teams and internationally operated services.\nVoice of the player and the Roblox Community – explore and learn how and why players engage with THEIR experiences and other experiences on Roblox. Become their voice and represent their needs throughout the development process.\nExtraordinary at building presentations, documents and presenting them at all levels of the organization.\nDeeply value attention-to-detail and believe that an extraordinary product is the sum of an inordinate number of small, thoughtful decisions.\nAble to use data and insights to align people on which problems to prioritize and tackle in order to deliver what’s best for customers.\nNot your time for a move? Recommend a friend and earn 700 EUR! Contact: jobs@8bitplay.com\nIMPORTANT: We will never, absolutely never send your CV and/or personal data to any of our clients without your direct consent. Submitting your CV is not equal to giving us consent to share your details with our external partners- we will always contact you upfront and ask for your agreement.\nBy submitting this form you give your consent for the information provided on this form to be held on computer or other relevant filing systems belonging to 8Bit Studio one and to be shared with other accredited employees in accordance with the GDPR 2018.\nBy submitting this form you agree that 8Bit Studio, NIP 9570949266, REGON: 36386962 processes your personal data contained in the recruitment documents supplied by you, including but not limited to your image, for the purposes of the current recruitment processes. 8Bit Studio confirms that your consent may be withdrawn anytime.\nFor more insight about game jobs and recruitment for game industry visit our homepageShow more Report"}, {"company": "Team8", "job": "Sygnia-Incident Response Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "Sygnia is a top tier cyber technology and services company, providing consulting and incident response support for organizations worldwide. Sygnia works with companies to proactively build their cyber resilience and to respond and defeat attacks within their networks. It is the trusted advisor and cybersecurity service provider of IT and security teams, senior managements, and boards of top organizations worldwide, including Fortune 100 companies.\nThe company draws on top talent from the ranks of elite military technology units and from across the cyber industry and has some of the world’s top talents in cyber security. Described by Forbes as a “cyber security delta force”, it applies technological supremacy, digital combat experience, data analytics and a business-driven mindset to cyber security, enabling organizations to excel in the age of cyber.\nSygnia is looking for an Incident Response Manager to lead investigations and response activities in support of organizations worldwide.\nCyber threats are constantly growing in volume, velocity and sophistication. When an organization is confronted with an advanced attack, it needs the strongest capabilities on its side. In many cases, an incident response engagement is in fact a battle within a network. The operational art, experience focus and speed of Sygnia response teams can mean the difference between a minor blow and a devastating impact on performance and reputation of organizations.\n The Incident Response Manager is both a subject matter expert for clients and team members, and a leader. Significant part of our investigations is performed onsite at the client location, in collaboration with the client’s IT and security teams.\nRESPONSIBILITIES\nLead incident response and hunting efforts, including large scale sophisticated attacks, to contain and defeat to real-world cyber threats\nLead a team of top-tier cyber security researchers and forensic experts conducting assessments and in-depth analysis in complex investigation, as well as security assessments.\nProvide excellent communication and status updates to a variety of audiences, including technical and executive stakeholders\nCollaborate and work with client’s IT and Security teams during investigations\nDesign and improve internal incident response methodologies and processes\nRequirements:\n\nAt least 5years’ experience in team management (from military service and/or industry)\nDecisive bright and positive leader, who strive for excellency\nCalm leader with in-depth thinking and ability to succeed in an ultra-dynamic, fast pace environment/situation.\nUnwavering focus and crisis management skills: Must have the ability to see things for what they are, to manage relationships and communication channels and to evaluate the actions taken\nExceptional written and verbal presentation skills - must be able to articulate complex technical issues in a concise and confident manner to both technical personnel and executive level management\nIn-depth understanding of the life cycle of advanced security threats, attack vectors and methods of exploitation\nStrong technical understanding of network fundamentals, common Internet protocols and system and security controls\nExperience with the tools and techniques used in security event analysis, incident response, computer forensics, malware analysis, or other areas of security operations\nWillingness for intensive travel abroad\nADVANTAGES\nPrevious experience in strategy or cybersecurity consulting – advantage\nAcademic degree in a technological or scientific discipline – advantage\nTeam8:\n\nSygniaShow more Report"}, {"company": "Oski Technology", "job": "Chip Design Engineer", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=318&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f7c5e70a&cb=1676382514409&jobListingId=1008415067496&jrtk=3-1-1gp82ub5rkbnu801-1goojhj25i6i0800-6ee0abd2afee2e52-", "description": "We are now looking for Chip Design Engineer for the Switch Silicon group.\nAs a Chip Design Engineer at NVIDIA's Networking business unit, you'll join a group of passionate engineers to design and implement the next generation state of the art Switch Silicon chips. In this position, you'll make a real impact in a dynamic, technology-focused company while developing the industry's best high-speed communication devices, delivering the highest throughput and lowest latency!\nWhat you'll be doing:\nWork in a combined design and verification team which develops some of the switch silicon core units specializing in quality of service.\nPlan and Design RTL units / blocks according to Arch & Micro arch specifications under challenging constraints with high orientation to power, area, and performance.\nBuild reference models, verify and simulate chip blocks/entities according to specifications.\nWork closely with multiple teams within organizations such as Architecture, Micro- Architecture, and FW.\nWhat we need to see:\nElectrical Engineering B.Sc. or Computer Engineering B.Sc. graduate with high scores or equivalent experience.\nA team player with good communication and interpersonal skills.\nPrevious experience in RTL design or RTL verification – an advantage.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. Are you creative and autonomous? Do you love the challenge of crafting the highest performance & lowest power silicon possible? If so, we want to hear from you. Come, join our Switch Silicon design team and help us build the next chip in this exciting and quickly growing field.Show more Report"}, {"company": "Oski Technology", "job": "Chip Design Architect", "city": "Tel Aviv-Yafo", "date": "26d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=319&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_10bce191&cb=1676382515515&jobListingId=1008403098420&jrtk=3-1-1gp82uc86ii0r801-1goojhj25i6i0800-d169579d920d569f-", "description": "Our technology has no boundaries! NVIDIA is building the world’s most groundbreaking and state of the art accelerated compute platforms for the world to use. It’s because of our work that scientists, researchers and engineers can advance their ideas. We pioneered a supercharged form of computing loved by the fastest paced computer users in the world - scientists, designers, artists, and gamers.\nWe are seeking a highly motivated Chip Design Architect to join our team of experts and help shape the future of high-performance computing. Our next-generation Infiniband and NVL switches will be at the forefront of connecting and powering the world's most advanced compute clusters, from supercomputers used in AI research to high-performance clusters used in industries such as finance and research labs. As a Chip Design Architect at NVIDIA, you will have the opportunity to work on some of the most cutting-edge technology and help to drive the innovation of our next generation of switches that will be used by top researchers and engineers around the world. The products you'll develop will be integrated in many leading-edge compute clusters, and supercomputers, and you'll be part of a team with a strong track record of success.\nWhat you'll be doing:\nDefine the Infiniband and NVL switch chip architecture end-to-end, and the entire feature set by internal requirements and customers requirements through all product life cycles (post/pre silicon, on deployments).\nDevelop chip architecture specifications and design guidelines, conduct trade-off analysis for different architecture options, and oversee the implementation of the chosen architecture by the chip design / FW / SW teams\nPerform research and analysis for current and future architectures, include patents development.\nCollaborate with cross-functional teams, including other architecture teams, logic design, system software, firmware, and research teams, to ensure the successful execution of the project.\nPartner with cross platforms teams (physical design, logic design, DV, system software, firmware, applications, research)\nServe as a subject matter expert and technical leader within the organization, sharing your expertise and knowledge with cross-functional teams to drive innovation and improve overall performance.\nWhat we need to see:\nBSc or MSc in Electrical Engineering / Computer Science or equivalent experience.\n3+ years of chip architect experience or 6+ years of chip design / design verification experience.\nDeep understanding of how to build and integrate systems with various technology components.\nCan-do attitude and high energy with leadership and excellent interpersonal skills and possess the ability to learn sophisticated concepts in a fast-paced environment.\nYou have utmost passion towards attention to details on design and high focus on design quality.\nWays to stand out from the crowd:\nKnowledge and understanding of networking and compute systems.\nExperience and love for system architecture, Networking/CPU/GPU/Memory/Storage.\nBackground in in-network computing\nNVIDIA has some of the most forward-thinking and talented people in the world working for us. If you're creative and autonomous, we want to hear from you. It’s not just technology though! It is our people, some of the brightest in the world, and our company diverse culture make NVIDIA one of the most fun, innovative and dynamic places to work in the world! At the center of NVIDIA's culture are our core values like innovation, excellence and determination and team, that guide us to be the best we can be.Show more Report"}, {"company": "Fireblocks", "job": "Senior Frontend", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": ""}, {"company": "Ibex Medical Analytics", "job": "In house Senior Pathologist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "About Ibex:\n\nIBEX is a well-funded start-up with global presence and headquarters in the USA and Israel. Ibex develops state-of-the-art artificial intelligence solutions for cancer diagnostics. Our cutting-edge technology is transforming the diagnosis of cancer, leading to rapid and accurate decision making and providing new diagnostic insight to enable precision medicine.\n\nOur world class team of researchers, engineers and medical experts is growing. If you are an outstanding professional, passionate about your work, a team player and want to make a difference in the lives of millions of people – come join us. You will get the opportunity to work on novel and challenging problems and help us fight cancer while doing it!\nResponsibilities:\n\nWe are looking for a Senior Pathologist to join our team. As an in-house pathologist, you will work closely with our R&D team on new applications for our cancer diagnostics platform as we expand it to additional tissues and indications, acting as subject matter expert and advising on all clinical matters. You will further work with our AI experts, scientific researchers and other pathologists on tasks such as:\n\nAnnotate (mark and label) various cell types and structures in whole-slide images\nAnalysis of algorithmic performance and clinical data\nDesign and execution of clinical research and case studies\nAdvise on improvements to our platform, workflow and user-interface\nWriting clinical, scientific and other pathology-related papers\nHelp the commercial team engage physicians and improve adoption of our solution by customers\nProven experience as a licensed pathologist\nExperience in conducting clinical studies and clinical writing – an advantage\nExperience in a Medtech company – an advantage\nWilling to work in a dynamic and intense start-up environment\nFluent in English\nGreat communication skills\n\nWe are an equal opportunity employer and committed to creating a friendly, inclusive environment that is a pleasure to work in, and where there is an unbiased acceptance of others.Show more Report"}, {"company": "OSR Enterprises", "job": "Expert Graphic Designer / Branding / Ui-Ux", "city": "Petah Tikva", "date": "30d+", "rating": "3.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=322&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2218cea2&cb=1676382521361&jobListingId=1008232200558&jrtk=3-1-1gp82uhpfj45o801-1goojhj25i6i0800-60b528858d0d26c1-", "description": "DESCRIPTION\nOSR is expanding to meet the unprecedented demand of its customers and stakeholders.\nOSR has established itself as a leader standing on the forefront of innovation and ingenuity; working with world-renowned automotive OEMs to deliver revolutionary multi-domain platform solutions and next-generation Cybersecurity, pioneering AI, Blockchain, Road Safety and Data-Services with unique User Experience, years ahead of the competition and at the dawn of the connected mobility revolution.\n We are looking for the best to join us as we expand our groundbreaking journey.\nWe are confident that your unique skillset, perspective, and passion, encouraged and inspired by our wealth of technology, research and expertise in these fields will be the driving force needed to continue being an industry spearhead for many years to come.\n Position\nExpert Graphic Designer / Branding / Ui-Ux\nWe are interested in welcoming an extremely motivated, experienced, Graphic Designer to join our Marketing & Design Department. A great and trusted team player, who is open minded to ideas and opinions. A creative personality eager to contribute, learn, and be inspired by OSR’s groundbreaking projects.\n﻿In your role, you will be responsible for:\nCollaborate in the UI design and graphic assets of a unique platform for monitoring and controlling automotive mobility\nWorking with a team of talented graphic designers from around the world, specializing in product design and marketing materials\nDesigning layouts and producing graphics for digital and marketing materials, to include infographics, webpage assets, and a variety of deliverables for presentations and events\nWorking closely with stake holders from various departments, developing ideas, creating and suggesting design concepts, and prototypes for new projects\nPrioritize and manage multiple projects and to meet deadlines\nEnsure that deliverables fulfil their purpose and best convey their ideas, while addressing the needs of each project and remaining within the style and scope as defined by the company\nTesting website asset graphics and functionality across various media and devices\nREQUIREMENTS\nEssential:\nHigh skills in Adobe Creative Cloud software. Photoshop, Illustrator, XD etc.\nAt least 3+ years’ experience in Graphic Design ,Branding, Marketing, Product design.\nAble to follow company-defined style with a personal touch\nPortfolio of completed design projects, concepts, and prototypes\nBachelor’s degree in Visual Communication, Art or Design\nKnowledge of website design and maintenance\nExperience in brand development and implementation\nProfessional experience in using Adobe Creative Cloud software (Photoshop, Illustrator, XD, InDesign, etc.)\nProficiency in MS Word and PowerPoint\nProficiency in English\nAdvantage to those who also have:\nKnowledge in HTML\\CSS\\WordPress, front-end proficiency\nBackground in creating graphics for automotive ads (digital & print) *great advantage\nProficiency in 3D software (Gravity Sketch, ZBrush, Blender, Cinema 4D, etc.)* great advantageShow more Report"}, {"company": "Palo Alto Networks", "job": "Senior Product Manager (Cortex XSOAR)", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=323&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5a8b4a65&cb=1676382522794&jobListingId=1008415856730&jrtk=3-1-1gp82uj6236hs001-1goojhj25i6i0800-65481f0bf39a775a-", "description": "Company Description\nOur Mission\nAt Palo Alto Networks® everything starts and ends with our mission:\n\nBeing the cybersecurity partner of choice, protecting our digital way of life.\n\nWe have the vision of a world where each day is safer and more secure than the one before. These aren’t easy goals to accomplish – but we’re not here for easy. We’re here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.\nWe’re changing the nature of work. Palo Alto Networks is evolving to meet the needs of our employees now and in the future through FLEXWORK, our approach to how we work. From benefits to learning, location to leadership, we’ve rethought and recreated every aspect of the employee experience at Palo Alto Networks. And because it FLEXes around each individual employee based on their individual choices, employees are empowered to push boundaries and help us all evolve, together.\n\nJob Description\nYour Career\nCortex XSOAR leads the Security Orchestration, Automation and Response market by delivering a comprehensive Security Operations Platform that combines full case management, intelligent automation, and collaborative investigation. Our teams focus on innovating the most advanced SOAR platform, expanding its rich integrations marketplace, covering more automation use cases as well as expanding the threat intelligence capabilities within XSOAR.\nIf you are highly motivated, competitive, and do not shy away from tough challenges, come join our XSOAR product management group and join some of the best minds in the world to shape the future of security operations.\nYour Impact\nHelp drive an existing market leading product, and grow it to new horizons by bringing innovative and disruptive approaches\nBuild a strong product strategy and business case, in addition to working with marketing on product brand, positioning and collateral materials\nGrow and manage a strong product management team that will deliver the entire product life cycle - collect customers’ feedback and hear their need, prioritize features and trade offs, write the product requirements and work closely with engineering group to deliver the roadmap\nBuild and launch enterprise class products and services\nWorking effectively with all areas of the organization in a global company, from engineering to sales\nWork closely with UX/ UI experts to create an intuitive and state of the art user interface\n\nQualifications\nYour Experience\n5+ years experience as a product manager or similar\nInherent passion for cybersecurity and solving problems\nDrive to design new, innovative and disruptive solutions\nPreferred, BS/MS in Computer Science, or another engineering/technical degree or equivalent military experience required\nStrong desire to take ownership of new technology products and their full life cycle\nAbility to manage multiple tasks, projects, priorities and deadlines\nExcellent analytical, written and verbal communication skills in English\nExperience in speaking in front of partners and major customers\nTeam player with a can do approach\nExcellent people skills, team & culture mentality\nAdditional Information\nThe Team\nWe are the global cybersecurity leader, known for always challenging the security status quo. Our mission is to protect our way of life in the digital age by preventing successful cyberattacks. This has given us the privilege of safely enabling tens of thousands of organizations and their customers. Our pioneering Security Operating Platform emboldens their digital transformation with continuous innovation that seizes the latest breakthroughs in security, automation, and analytics. By delivering a true platform and empowering a growing ecosystem of change-makers like us, we provide highly effective and innovative cybersecurity across clouds, networks, and mobile devices.\nOur Security Operating Platform is built for automation. It is easy to operate, with capabilities that work together, so customers can prevent successful cyberattacks. They can use analytics to automate routine tasks so they can focus on what matters. We are known for continuously delivering innovations.\nOur Commitment\nWe’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.\nWe are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.\nPalo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.\nAll your information will be kept confidential according to EEO guidelines.\nCovid-19 Vaccination Information for Palo Alto Networks Jobs\nVaccine requirements and disclosure obligations vary by country.\nUnless applicable law requires otherwise, you must be vaccinated for COVID or qualify for a reasonable accommodation if:\nThe job requires accessing a company worksite\nThe job requires in-person customer contact and the customer has implemented such requirements\nYou choose to access a Palo Alto Networks worksite\nIf you have questions about the vaccine requirements of this particular position based on your location or job requirements, please inquire with the recruiter.Show more Report"}, {"company": "Jacobs", "job": "Life Safety Systems Engineer", "city": "Giv`atayim", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=324&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e9c9d108&cb=1676382524289&jobListingId=1008157913588&jrtk=3-1-1gp82ukorjoq8801-1goojhj25i6i0800-b8208820cc8c6263-", "description": "Your Impact:\nAt Jacobs, we don’t settle. We’re always looking beyond to raise the bar and deliver with excellence. We apply our expertise and knowledge as we look into the future with great optimism and focus. Start your Jacobs career that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow.\n\n\nWe're looking for a Life Safety Systems Engineer in Kiryat Gat, Israel who is excited about working on projects that enable the heart of our clients’ business. Join us and you’ll have the chance to work on projects including semiconductor manufacturing, data center facilities, and other state of the art manufacturing and research facilities. Come be a part of a vibrant, dynamic team that delivers world class designs for well-known clients around the world. You’ll thrive as you perform design of Life Safety and Security Systems for our client’s advanced facilities.\n\nThis position will provide Lead opportunities for delivery of complex packages in coordination with engineers and design leads that form the core of our electrical delivery team. You will interface directly with client counterparts in designing of their facilities. Utilising AutoCAD and Revit MEP, our teams create 3D models in coordination with architects and engineers. From those 3D BIM models you’ll design fire alarm, smoke and leak detection, security and intrusion detection systems, and more. Using the various applicable Life Safety & Fire codes as well as industry standards you will provide: calculations; equipment size and quantities; equipment and construction specifications; network diagrams and addressing; and various construction deliverables in both 2D and 3D platforms for a constructable design.\n\nBring your curiosity, talent for multi-tasking and collaboration, and extreme organisational skills and we’ll help you grow, pursue and fulfill what drives you – so we can make big impacts on the world, together.\nAt Jacobs, we’re partnering across the globe to create the best project outcomes by maximising the design, digital technology, and support capabilities of our Global Integrated Delivery (GID) teammates. By joining Jacobs, you’ll commit to supporting and engaging with these teams, as we work to build a company like no other\nHere’s What You’ll Need:\nBachelor’s Degree in Engineering or Sciences.Knowledge & application of NFPA 70 (NEC) and electrical design requirementsKnowledge & application of NFPA 101 Life Safety Code, and NFPA 72 Fire Alarm and Signaling CodeKnowledge & application of NFPA 400 Hazardous Materials CodeFamiliar with IBC and NFPA 1 Fire Code as they pertain to LSSDesign experience with security, access control, intrusion detection and CCTVDesign experience with Fire Alarming, VESDA systems, HPM, and Leak DetectionExperience leading a team of LSS design staffKnowledge of design and construction specificationsExperience estimating and scheduling mid to large scale projects\n\nIdeally, you’ll also have:\n\nMaster’s degreeWorking knowledge of 3D BIM software (Revit)10 years of LSS design in semiconductor or datacentersOversight of Quality Assurance and Checking program for LSS and Security systemsStart-up and Commissioning of LSS and Security systemsOther Certification:CFPS – Cert. Fire Protection SpecialistCPP / APP – Cert/Assoc. Protection Professional (security)PSP – Physical Security ProfessionalShow more Report"}, {"company": "ironSource", "job": "Senior Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "ironSource Aura, a revolutionary large scale mobile platform, is looking for an outstanding and passionate data scientist to join our team.\nYou'll have an opportunity to research, design, implement, and evaluate a variety of advanced ML algorithms using the latest technology.\n\nRequirements:\n\nMSc or PhD in Data Science, Computer Science or Engineering\nAt least 7 years of experience as a data scientist\nExperience solving complex business problems using state of the art algorithms\nStrong knowledge of Python\nSolid background in algorithms, data structures, and programming\nGood understanding of probability and statistics\nExperience in leading data science projects from idea to production in various domains and using various ML solutions\nAbility to mentor others, work in teams, teach and learn from peers\nTeam player, ability to handle several tasks simultaneously\nIndependent, out of the box thinker\nRole:\n\nApply cutting edge solutions while leveraging our vast amounts of data\nDevelop on-line and scalable models and tools using machine learning, deep learning and NLP techniques\nTake on projects end-to-end from business question all the way to production\nWork alongside machine learning experts, big data engineers, product managers and developers from across the organization to solve complex problems\nContribute to continuous learning and knowledge sharing within the data science group, in order to stay ahead of the curve\nLead innovation initiatives and stay in tune with the latest technologies and algorithms\nBusiness Unit:\n\nData & Analytics\n\nAdvantages:\n\nExperience with working with ML frameworks (e.g., Sagemaker)\nExperience working on an applied recommendations system solution\nExperience in NLP and deep learning techniques\nExperience with machine learning tools such as Tensorflow, Keras and Pytorch\nExperience with big-data frameworks (e.g. Kafka, Spark)\nSkills - Technical 3:\n\nKafkaShow more Report"}, {"company": "Cardo Systems", "job": "Graphic/UX Designer – Temp position", "city": "Raanana", "date": "30d", "rating": "4.0", "link": "", "description": "Cardo Systems, the global market leader in the field of wireless communication systems for motorcycle & ski helmets, is looking for a creative and energetic Graphic/UX designer to join our marketing team.\nFull-time, temporary position (9 months for maternity leave replacement) in a hybrid model (from the company's offices at Raanana/from home), reporting to the Director of Corporate Marketing.\nJob Description:\nThe ideal candidate will continue developing the company-wide design language that is in tune with both the market esthetics and the company’s brand pillars, control all up-to-date design tools for online and offline use, and become an integral part of a dynamic marketing team.\nAs part of your creative job, you will be required to interpret our marketing needs into design/UX solutions that create an impact and drive our brand forward. To complete your tasks, you are expected to be responsible for company-wide design language and master a variety of products, for both online and offline use, for example, company website product packaging, brand guidelines, company collateral, infographics, presentations, exhibitions, video art to name but a few.\nRoles & Responsibilities:\nThink creatively and lead the development of new design concepts, graphics, and layouts\nCultivate a solid body of work\nWork with a wide range of media and use graphic design software\nPrepare rough drafts and present your ideas\nAmend final designs for comments and gain full approval\nWork as part of a team with other marketing team members\n\nRequirements:\n\nRequirements:\nMin. of 3 years experience in graphic design roles – a must\nExperience working with Adobe: XD, InDesign, Photoshop, and Illustrator software – a must.\nAbility to perform independently and under pressure\nDemonstrable graphic design skills with a strong portfolio\nPossession of creative flair, versatility, conceptual/visual ability, and originality\nPrior experience working in consumer electronics companies and/or global companies – an advantage\nProfessionalism regarding time and deadlines\nAbility to interact, communicate, and present ideas\nEnglish – high proficiencyShow more Report"}, {"company": "NVIDIA", "job": "Chip Design Architect", "city": "Tel Aviv-Yafo", "date": "26d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=327&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5c52443e&cb=1676382529349&jobListingId=1008402955788&jrtk=3-1-1gp82upodi14l801-1goojhj25i6i0800-6b9579cd64476620-", "description": "Our technology has no boundaries! NVIDIA is building the world’s most groundbreaking and state of the art accelerated compute platforms for the world to use. It’s because of our work that scientists, researchers and engineers can advance their ideas. We pioneered a supercharged form of computing loved by the fastest paced computer users in the world - scientists, designers, artists, and gamers.\nWe are seeking a highly motivated Chip Design Architect to join our team of experts and help shape the future of high-performance computing. Our next-generation Infiniband and NVL switches will be at the forefront of connecting and powering the world's most advanced compute clusters, from supercomputers used in AI research to high-performance clusters used in industries such as finance and research labs. As a Chip Design Architect at NVIDIA, you will have the opportunity to work on some of the most cutting-edge technology and help to drive the innovation of our next generation of switches that will be used by top researchers and engineers around the world. The products you'll develop will be integrated in many leading-edge compute clusters, and supercomputers, and you'll be part of a team with a strong track record of success.\nWhat you'll be doing:\nDefine the Infiniband and NVL switch chip architecture end-to-end, and the entire feature set by internal requirements and customers requirements through all product life cycles (post/pre silicon, on deployments).\nDevelop chip architecture specifications and design guidelines, conduct trade-off analysis for different architecture options, and oversee the implementation of the chosen architecture by the chip design / FW / SW teams\nPerform research and analysis for current and future architectures, include patents development.\nCollaborate with cross-functional teams, including other architecture teams, logic design, system software, firmware, and research teams, to ensure the successful execution of the project.\nPartner with cross platforms teams (physical design, logic design, DV, system software, firmware, applications, research)\nServe as a subject matter expert and technical leader within the organization, sharing your expertise and knowledge with cross-functional teams to drive innovation and improve overall performance.\nWhat we need to see:\nBSc or MSc in Electrical Engineering / Computer Science or equivalent experience.\n3+ years of chip architect experience or 6+ years of chip design / design verification experience.\nDeep understanding of how to build and integrate systems with various technology components.\nCan-do attitude and high energy with leadership and excellent interpersonal skills and possess the ability to learn sophisticated concepts in a fast-paced environment.\nYou have utmost passion towards attention to details on design and high focus on design quality.\nWays to stand out from the crowd:\nKnowledge and understanding of networking and compute systems.\nExperience and love for system architecture, Networking/CPU/GPU/Memory/Storage.\nBackground in in-network computing\nNVIDIA has some of the most forward-thinking and talented people in the world working for us. If you're creative and autonomous, we want to hear from you. It’s not just technology though! It is our people, some of the brightest in the world, and our company diverse culture make NVIDIA one of the most fun, innovative and dynamic places to work in the world! At the center of NVIDIA's culture are our core values like innovation, excellence and determination and team, that guide us to be the best we can be.Show more Report"}, {"company": "Oski Technology", "job": "Chip Design Verification Engineer", "city": "Tel Aviv-Yafo", "date": "26d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=328&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_05a1374a&cb=1676382530817&jobListingId=1008403784056&jrtk=3-1-1gp82ur5l2p8l001-1goojhj25i6i0800-d9f46d0067dbe035-", "description": "We are now looking for a Chip-Design Verification Engineer to join our Switch Silicon team.\nAs a Chip Design Engineer at NVIDIA's Networking business unit, you'll join a group of passionate engineers to design and implement the next-generation state-of-the-art Switch Silicon chips. In this position, you'll make a real impact in a dynamic, technology-focused company while developing the industry's best high-speed communication devices, delivering the highest throughput and lowest latency!\nWhat you'll be doing:\nWork in a design & verification team which develops front-end design for the Switch silicon and the GPU.\nDevelop Verification components and reference models, verify and simulate chip blocks according to specifications under challenging constraints with high orientation to power, area, and performance.\nWork closely with multiple teams within organizations such as Architecture, Micro- Architecture, and FW.\nWhat we need to see:\nElectrical Engineering B.Sc., Computer Engineering or other relevant engineering department graduate with high scores, or equivalent experience.\n3+ years of experience in RTL verification. Less experienced engineers with high university grades will also be considered\nSelf-motivated, ability to work independently and drive tasks to completion\nA team player with good communication and interpersonal skills.\nWays to stand out in the crowd:\nKnowledge in Specman, Verilog\nKnowledge in Networking\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. Are you creative and autonomous? Do you love the challenge of crafting the highest performance & lowest power silicon possible? If so, we want to hear from you. Come, join our Switch Silicon design team and help us build the next chip in this exciting and quickly growing field.Show more Report"}, {"company": "NVIDIA", "job": "Chip Design Verification Engineer", "city": "Tel Aviv-Yafo", "date": "26d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=329&ao=1136043&s=58&guid=000001863138cbea8e63962cd43ee9f2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_efd04212&cb=1676382531929&jobListingId=1008403651921&jrtk=3-1-1gp82us8hk6d8801-1goojhj25i6i0800-34e1b9bf676fdfa1-", "description": "We are now looking for a Chip-Design Verification Engineer to join our Switch Silicon team.\nAs a Chip Design Engineer at NVIDIA's Networking business unit, you'll join a group of passionate engineers to design and implement the next-generation state-of-the-art Switch Silicon chips. In this position, you'll make a real impact in a dynamic, technology-focused company while developing the industry's best high-speed communication devices, delivering the highest throughput and lowest latency!\nWhat you'll be doing:\nWork in a design & verification team which develops front-end design for the Switch silicon and the GPU.\nDevelop Verification components and reference models, verify and simulate chip blocks according to specifications under challenging constraints with high orientation to power, area, and performance.\nWork closely with multiple teams within organizations such as Architecture, Micro- Architecture, and FW.\nWhat we need to see:\nElectrical Engineering B.Sc., Computer Engineering or other relevant engineering department graduate with high scores, or equivalent experience.\n3+ years of experience in RTL verification. Less experienced engineers with high university grades will also be considered\nSelf-motivated, ability to work independently and drive tasks to completion\nA team player with good communication and interpersonal skills.\nWays to stand out in the crowd:\nKnowledge in Specman, Verilog\nKnowledge in Networking\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. Are you creative and autonomous? Do you love the challenge of crafting the highest performance & lowest power silicon possible? If so, we want to hear from you. Come, join our Switch Silicon design team and help us build the next chip in this exciting and quickly growing field.Show more Report"}, {"company": "ART MEDICAL Ltd", "job": "Design Control Engineer", "city": "Netanya", "date": "30d+", "rating": "4.7", "link": "", "description": "ART MEDICAL is a well-funded medical startup, developing cutting-edge technologies for ICU patients. Our smART+™ platform is an intelligent, sensor-based feeding system for critical care patients that aims to prevent life-threatening, in-hospital complications, such as ventilator-associated pneumonia, malnutrition, and acute kidney injury. With the introduction of Nutrition Management 2.0™ to critical care patient scoring systems, the smART+™ platform monitors, analyzes and prevents malnutrition and gastric aspiration in real time. By providing optimal nutritional care and achieving up to 100% feeding efficiency, the smART+™ platform improves the standard of care and helps ICU patients recover faster.\nWe are looking for an experienced Design Control Engineer to join our collaborative and growing team.\nRole & ResponsibilitiesAssure design processes are in place and implemented.Assure design documents and processes comply with design controls and regulatory standards.Assure design inputs documents are following customers’ needs.Verify that design output documents are in accordance with design inputs.Verify V&V activities are covering design changes.Participate in the design change process.Recommend & Drive design corrective and preventive action responses to internal and external audit findings.\nRequirements:\n\nFamiliar with ISO 13485: 2016 and Working knowledge of the FDA Quality System Regulation 21 CFR 820.5 years of experience in medical device companies.3+ years of experience in design controls.BSc/BA degree or similar academic certificate.Team player.Show more Report"}]