[{"company": "Deloitte", "job": "Network Engineer", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=201&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_87a21d90&cb=1676382829236&jobListingId=1008308706842&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp837uiok60o801-1goorviu1i7l8800-a63814985d15e362--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBfB50HFqKVh5wF1vplutx0bA7NiMhtMC4Z-If4-rGZLOo2n5vkTQSPu6wCmKmT7edNUAVN6WB3-aJ91NYttIoiJvU4vkttN-UFw2sm5srI_fY7Be9G_46OC6-sF-lYAWvtvHQTrLicD6m-8Z9ki93IveEge3itaaSY7dsqEFtUBhEhvGyOwU4VvBoDhM8UVDESkyyOLBSZIsqOEh2h9P9yoIcjVz6uugh0bw1OILNhywkwSagEwUp4_EVw1PTdTmKyvcoYOxwDTKq0u4KQSFlv5MjSj0ZAngb7rGHsHuQ9x75GoSuibrG3qgbFXfulIOLDN87kI9cqvO1cG_65Btfb8aXQ44TH5i4E2TzcN_O69FYZ8N2EyG2-c_vzLR-v_TDKgLUp3IA_Do94CM0XD_Juttu_2uQtEgsnYAg4fFqzKzA7mL06vRkqiK7vIBNd9cn4Y-f2p1k-P3EN6t_8jF3a-ptvHq2Ist9YHL1tHbxIDJX7CuVfq1J_7TfCtij8aVvWZhAZe70ctIdE5KI-3Q8bwlKyXL9if1izKfc876ITF_i0fWA_vPMIykBdfSTfKf7Ct8psFORVGPXdRD03nux9L2j-Ph9fBA22cNxfoS81V7DdnQvISpwWpfKWBjNs4X4u9sV8YABKmMAD1LvnYqgA", "description": "The incumbent focuses on providing operational and project support ensuring that the network is highly available. Assists in the planning and evaluation of existing network platforms and systems. Is involved in the development of technical standards, interface applications, evaluation of new products and network problem resolutions. Serves as a liaison between technical teams and internal clients to establish new network connectivity request and assists with ongoing maintenance.\n\nTechnical Skills • Network Engineer - Cisco, LAN, WAN, WLAN. • Deep knowledge of Networking / Dynamic Routing Protocols. • Upgrade software on hardware such as Switches, Routers and Wireless. • Technical and non-technical Documentation | Visio.\n\n3+ year of experience in ISP or global company and multiple cultures. • Excellent time management and attention to detail is essential. • Knowledge of agile methodology. • Good written and verbal communication skills.\n\n\nVery good English level. •CCNA/CCNP, CCIE advantage. Education & Experience •Bachelor’s degree or equivalent experience: degree in computer science, mathematics, engineering, or other technical degree preferred. • Master’s degree preferred\n\nShow more Report"}, {"company": "", "job": "להייטק- Digital Board Design", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "Check Point Software Technologies Ltd.", "job": "Technical Services Engineer - Entry Level", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=203&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f85b978a&cb=1676382831582&jobListingId=1008397191185&jrtk=3-1-1gp8380suk63v801-1goorviu1i7l8800-2a20c5247b95e90d-", "description": "Your Impact & Responsibilities\n\nWhy should you Join Check Point Technical Support family?\n\nGet experience with the security products of the leading vendor in the Cyber Security industry.\nChallenge yourself on daily basis with complex, technical issues.\nWork with the biggest Enterprise IT departments around the world.\nJoin a team of motivated, fun and creative minds.\nBuild a long-term career at Check Point with multiple options for future growth.\n\nThe training materials will include:\n\nNetworking\nOperating Systems\nCheck Point’s leading products\nProfessional tools and methodologies\nThe training will begin on 05.03.2023\nYour Knowledge & Skills\nTechnical orientation, no experience is required! We will teach you everything you need.\nVery good English skills (Spoken and written).\nService orientation.\nThe training will take place at the company’s office/ remotely and salary will be paid during the training period.Show more Report"}, {"company": "Google", "job": "Site Reliability Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "Broadcom", "job": "R&D ASIC Engineer", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "3.6", "link": "", "description": "Please Note:\n1. If you are a first time user, please create your candidate login account before you apply for a job.\n2. If you already have a Candidate Account, please Sign-In before you apply.\nJob Description:\nThe job includes Design and Verification of ASIC.\nRequired a University graduate in Electrical Engineering.\nRequired 8+ years’ experience of ASIC Design/Verification.\nAdvantage for experience with Verilog, System Verilog, synthesis and validation.\nBroadcom is proud to be an equal opportunity employer. We will consider qualified applicants without regard to race, color, creed, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability status, medical condition, pregnancy, protected veteran status or any other characteristic protected by federal, state, or local law. We will also consider qualified applicants with arrest and conviction records consistent with local law.\nIf you are located outside USA, please be sure to fill out a home address as this will be used for future correspondence.Show more Report"}, {"company": "Edwards Lifesciences", "job": "Research Engineer", "city": "Israel", "date": "2d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=206&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8201faf2&cb=1676382835548&jobListingId=1008452345369&jrtk=3-1-1gp8384objopl801-1goorviu1i7l8800-365a398526f380b8-", "description": "Conduct ad-hoc research projects, involving planning, executing, and analyzing the results. Execution involves designing tests and working hands-on in the lab.\nThe job necessitates high analytical skills, as well as good technical skills.\nAbility to systematically work on different projects at the same time.\nProvide design inputs to existing or new products, based on the results of the Research work\nWrite technical reports based on multiple testing.\nCollaborate with different functions within the organization, both technical and cross functional.\nCreate working plans and manage resources to support Research activities.\n\nRequired Education/Skills:\nBachelor’s degree in Biomedical\\mechanical engineering\nHigh self-learning ability\nStrong execution, communication, and interpersonal relationship\nTechnical oriented skills\nBasic understanding of statistical techniques\nFluent English both oral and written\n\nRequired Experience:\n1-4 years of experience in medical device\nPreferred experience with cardiovascular industry\nKnowledge and understanding of imaging modalities as CT, Fluoroscopy and echocardiography – Advantage\nPrograming experience in Python and MATLAB - advantage\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Broadcom", "job": "Software Engineer - R&D Software Development Position", "city": "Tel Aviv-Yafo", "date": "9d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=207&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1327986f&cb=1676382836949&jobListingId=1008437542168&jrtk=3-1-1gp838651ih5h801-1goorviu1i7l8800-5b4e6f2b1f09d8ff-", "description": "Please Note:\n1. If you are a first time user, please create your candidate login account before you apply for a job.\n2. If you already have a Candidate Account, please Sign-In before you apply.\nJob Description:\nAn opportunity to join Broadcom Inc., Dune R&D Center (StrataDNX product-line), and take part in the development of future networking products!!\nWe are looking for exceptional, innovative software engineers to develop our next-generation cutting-edge networking platforms which are located at the core of Global Internet, Core Routers, Carrier Networks, Service Providers, Data Centers, White Box systems, Enterprise systems, and Telecom infrastructure.\nYou will join the software development group and take a leading part in the full life-cycle software development: from design and coding of Networking Software APIs, Data-path Programming, Management of different Software and Hardware Components, testing during the early stages of the feature to optimizations, debug, providing tools and integration into customer products.\nWe are looking for passionate engineers that will take our Software to the next level!\nRequirements:\nB.Sc. in Computer Science, Software Engineering or a related field from a recognized university, cum laude\nAt least 3 years of experience in C/C++ SW Development or exceptional graduate\nPassionate, Responsible and Team-player\nMust be a quick learner with the ability to adopt new technologies and methodologies\nAdvantages:\nExperience in Software-Embedded/Real-Time Software development\nExperience with working on Linux environment\nHave background knowledge in Networking protocols (e.g. Ethernet, IP, how switching/routing works)\nBroadcom is proud to be an equal opportunity employer. We will consider qualified applicants without regard to race, color, creed, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability status, medical condition, pregnancy, protected veteran status or any other characteristic protected by federal, state, or local law. We will also consider qualified applicants with arrest and conviction records consistent with local law.\nIf you are located outside USA, please be sure to fill out a home address as this will be used for future correspondence.Show more Report"}, {"company": "Palo Alto Networks", "job": "Systems Engineer - Israel", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.2", "link": "", "description": ""}, {"company": "Texas Instruments", "job": "FAST Rotation Program - Technical Sales Engineer - Tel Aviv, Israel", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=209&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_76451a71&cb=1676382839782&jobListingId=1007839898354&jrtk=3-1-1gp8388t6gsq5801-1goorviu1i7l8800-2b1e6756d8a6afbb-", "description": "About TI\nAs a global semiconductor company operating in 35 countries, Texas Instruments (TI) is first and foremost a reflection of its people. From the TIer who unveiled the first working integrated circuit in 1958 to the more than 30,000 TIers around the world today who design, manufacture and sell analog and embedded processing chips, we are problem-solvers collaborating to change the world through technology. Put your talent to work with us – change the world, love your job!\nAbout the job\nTI’s FAST (Field Applications & Sales Training) Rotation Program is designed to prepare Sales & Applications team members for customer-oriented careers that pair technical skills with business perspectives. The program provides experiences that help rising TIers understand how to successfully grow TI’s business and to thrive throughout their entire TI career. There are two available FAST program tracks: (1) Field Applications and (2) Technical Sales.\nJob description:\nThis 7-month experience aims to teach Technical Sales Associates (TSAs) how to build and manage customer relationships, and how to influence decisions to grow TI’s revenue. The track includes three rotations:\nRotation 1, Field Sales Office (FSO): This 3-month rotation integrates TSAs with a local TI sales team, offering first-hand experience of TI’s sales process. TSAs partner with customers and internal teams to uncover and win every possible customer opportunity, and also leverage our one-of-a-kind virtual account system to learn how to find, define, and win opportunities in a mix of real-time and simulated environments.\nRotation 2, Sales Operations: This 2-month rotation provides first-hand experience working with the pricing and customer service teams. Focus areas for this rotation include pricing models, supply chain functions, price negotiation, and an overview of pricing guidelines, laws, procedures and tools.\nRotation 3, Product Marketing: This 2-month rotation focuses on the relationship between sales and a particular product line. This rotation helps TSAs understand product life cycles, roadmap development, marketing approaches, and ways to collaborate with product marketing to win at the customer.\nUpon successful completion of this track in the FAST program, rotators are welcomed as Technical Sales Representatives (TSRs) on TI’s Worldwide Sales & Applications team.\nResponsibilities include, but are not limited to:\nUsing technical expertise, various sales tools and relationships with engineering teams to identify projects\nManaging and quantifying leads, and managing the commercial aspects of customer relationships\nDeveloping, forecasting and monitoring an annual plan for revenue growth\nMinimum Qualifications:\nBachelors in Electrical Engineering, Computer Engineering, Electrical and Computer Engineering or related field\nFluent in English and Hebrew\nPreferred Qualifications:\nAbility to effectively balance strong technical skills with solid relationship-building capabilities\nDemonstrated strong analytical and problem-solving skills\nStrong written, verbal communication skills\nAbility to work in teams and collaborate effectively with people across various functions\nStrong time management skills that enable on-time project delivery\nDemonstrated ability to build strong, influential relationships\nAbility to work effectively in a fast-paced and rapidly changing environment\nAbility to take the initiative and drive for results\nOur Offer:\nBenefit from a competitive salary\nYearly profit sharing (dependent on company success)\nMany additional benefits\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture. Explore a world of opportunities for your personal and professional development\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "JAC Recruitment UK Ltd", "job": "Field Service Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "", "description": ""}, {"company": "NeoGames", "job": "Service Operations Engineer", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.0", "link": "", "description": "We are NeoGames, a global leader of iLottery solutions and services to the national and state-regulated lotteries.\nWe empower our customers to create the most successful iLottery programs with a complete solution that includes industry-leading omnichannel platforms, an innovative portfolio of the best-performing interactive games, and a full suite of business and technology services.\nWe are on the lookout for extraordinary people, who will be eager to learn, to be a part of a team and share our vision.\nRequirements:\n\nExcellent verbal and written communication skills in English – MustProven ability to troubleshoot and resolve technical issues in a creative, customer-oriented and results-driven mindset – MustStrong understanding of web and web-related technologies and Client/Server applications – An advantagePrevious experience in SQL – An advantage2+ years of relevant experience in a customer-focused position involving technical knowledge – An advantageExperience with Web debugging tools – An advantageService Oriented and good communication and interpersonal skillsFast & self-learner, hardworking, team player, organized and responsible, dynamic, motivated and independentBachelor's degree in Computer Science / Software Engineering (or similar) – An advantage24/7 availability in case of critical issues (on-call duty)\nResponsibilities:\n\nCommunicate with a customer in e-mails, JIRA items, and conference callsProvide Tier 3/4 services for internal and external entities, provide high level of support to meet the customer SLA, and minimize escalations to R&D\nInterface with various Departments, R&D and Customer Support groups to address product issues in complex environmentsOwn, troubleshoot and solve customer technical issues, using collaboration, troubleshooting best practices and transparency within and across teamsPrioritize, monitor, and be responsible for the progress of all problems reportedManage critical escalations during on and off hoursShow more Report"}, {"company": "פיקארו השמה גיוס וסורסינג בע\"מ", "job": "Experienced QA Automated Engineer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "5.0", "link": "", "description": "לחברה מובילה הנמצאת בחזית הטכנולוגיה בתחום העברת קול על גבי רשתות (VoIP) IP באמצעות מוצרי תקשורת חדשניים עבור ספקי תקשורת– OEM, אינטגרטורים ומפעילים ברחבי העולם, מחפשים Experienced QA Automated Engineer . החברה מספקת ללקוחותיה ושותפיה מגוון רחב של מוצרי Media Gateways וטכנולוגיות Media Processing לרשתות VoIP מיקום: קרית שדה התעופה. עובדים במודל היברידי (שלושה ימים מהבית) . -לפחות 2+ ש\"נ כבודק תוכנה ומפתח אוטומציה.\n\n\nניסיון ב-IP networking - חובה. יתרונות: -ניסיון בכתיבת סקריפטים ב-Python. -ניסיון וידע ב- VoIP. -ניסיון מעשי עם ראוטרים של Cisco - יתרון משמעותי.\n\nShow more Report"}, {"company": "אמן מחשבים בע''מ", "job": "Data Engineer לארגון מסווג", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=213&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_90aec517&cb=1676382845723&jobListingId=1008456288680&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838ei8itkk801-1goorviu1i7l8800-f84fb8e33c6fa9ed--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAPgYLGlNz97cRxpd0IV0kDBJPZNDCWW6L9XNAs8TLM5WOSI2Tip3iar4vdFc91T05ndjbmO5MF2ph0TGLaFn52JU-94u_-L5rIN8ZbVbZMAL0e7A4W6QcathOZGpXTCQg4kLZjybaYQU-MqklyGM3VzmB09M31o4Jy9wLVyneSQbgtNgXZpsx_nYSxH7nDEkdfbuKC8OPnELL6UlM-89G8AqrPaC6ya5yCiaO92zN6GTXF0fAzAcID0CLPXO6LYDuL-jGc0ZeXB64UV5GuZ4lpcAIdn-n1kkV-1vASYRHK7us9BF4LXW5MQX7-lFkp8i2vNlDfTWkcrlyjKcF47dTDuC76htsgz02OfK_a9HOKfPBYJGCISpmn-beidcUMYS2FDh3klGeM1AmiXjgN_DQBeUcWaRw30epi_J-YhdSP_qCqiPoplaA3rwkSJKmefaqF_gEuNYdTSrYuaxNngOkIomM2SlHWuBMHiRipuniLFrQP5vnW9w_54bafvErFwQK9H_tr1q1E1fC9blS1784e7R8BqXXLq4-QpZxCaX5eiq8Svt5cM7z5wY4Fc-Rhhq1M1e2rpEfNEmUg-W1sWa3a3lXM1Sr2xxZl038GpjjdvQPFi9uOk5MxSeF28OjQlMne81cACteQmrxg5IdGXC4m", "description": "לארגון מסווג במרכז הארץ דרוש/ה Data Engineer לעבודה בצוות במסגרת התפקיד כתיבת פייפליינס מאפס. הזדמנות לקחת חלק מרכזי בארגון מסקרן. ניסיון עבודה כ- Data engineer בצוות R&D ניסיון עבודה ושליטה מלאה ב- Python שליטה מלאה ב- SQL ניסיון עבודה עם CI/CD רצון ונכונות לעבודה בארגון מסווג כחלק מצוותShow more Report"}, {"company": "", "job": "Field Application Engineer (FAE)+Sales Engineer", "city": "Raanana", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=214&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a42ddf8f&cb=1676382846966&jobListingId=1008071775771&cpc=8795CF9063CD573D&jrtk=3-1-1gp838fstp6df801-1goorviu1i7l8800-f4edee33e0856a56--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGglsxWUyJPq3a2tW3WqbgY3_ZEHBTfBv-aN5Sq0oPmYKn_tMZpmB8FdgFD5oLlR6qa_-aslXTmtyoIL4tMPb0-zI08HRyXiph4gDC5_AhxV8KV4k73KHvmWbHo57QC-TpOThnl-yv0QRtZpDgyHVYOGnXdJxZ7oDdvvpPGWIUx5XJQYC9cjmmIVi9iZkID7HWLoj646PH_yvf7XJbwmUyO5w7K-PBrtjz0fdHoQdP1r5C9XqptCZP9tekk-rje1nxJTl455bsQEXkoy7FMTr_2xRTbLK34nOR2lF5zb7rABnMWsJy8s8tkU-1zYosRx48m-yt6I4MLUf6VveTPolBOlDIKRtUoDG2o44UQUSGO3VtVwW9-ixtEHVJwFX4R27ax6CkLkv5h2_ttXnmL2YGa-yP9mO47jlNKr5LhjiuuOMd_LQg0fpIRSZd11ONYNKYkPm_zMDe_4dE5kpkwtalVAnEVibwm30y6tQ9JSqiOlv5ucDtkGYBBskZeZJJwVlWat2aG0znk6IT1h-pee10SV1BYkxwYQ1oFVE7PsM_E1q5PtRX7vbSy89gk5UgKtqzNDzmOI1YOk3HEYl35IRSMR7CKzFcKv7_hKLt56ibuMK6Vrvo_PZpGesHOSqTz_6g0dSk6zxv2oSNkR7RkccfZ6TLJ7RkAQQMPitnFttJZP8%3D", "description": "מהנדס/ת מכירות + FAE לשוק הישראלי. אם את/ה מהנדס/ת אלקטרוניקה, בעל/ת ניסיון בפיתוח, ומעוניין/ת לצאת מהמעבדות ולהיחשף לחברות/ טכנולוגיות חדשות - מקומך אתנו. עבודה מול מחלקות פיתוח והנדסה בשוק המקומי (צבאי, רפואי, תקשורת, פודטק, סמיקונדקטור ועוד.) אפיון ומציאת פתרונות לדרישות לקוחות - לרכיבי אלקטרוניקה /פתרונות אמבדד / מודולים / אלקטרומכניקה/ RF ועוד. תנאים מעולים!\n\nBS.c אלקטרוניקה, או שווה ערך. ניסיון של לפחות שנתיים ממחלקות פיתוח - יתרון. כישורי תקשורת וסקרנות מפותחים. כריזמה ואנרגיה מתפרצת.\n\nאנגלית ברמה גבוהה.Show more Report"}, {"company": "SQLink", "job": "חברת מדיקל מצליחה בצפון מגייסת SW Quality Engineer", "city": "Raanana", "date": "2d", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=215&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_75e0b325&cb=1676382848916&jobListingId=1008453967380&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838hqok60h801-1goorviu1i7l8800-7cfe0e1e0db57b9f--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HLtIrFJpMJJ0UrehPcgp5xhPxL2rpyWY7ekzNPkfR2VeAGZRXc2pqPijBZ3s4JUZ401tvH_CZEF21GCcmWJT3ZwhoaaVMYmyEOj1cWOVwSGvKGyhIgpda7hI91_Sp9godsEv1DlJEJ2eMmulpY046qUTRsiYPdDb5c8PVXNg_k6ZxZxOG38ZcXOBr33OFpFO4CiEbEsZH1BzmZ00aw7fxhHmlGXB-qn1uXsyI1qZHXM2eKfbW7Rcn5vveQbn5xsQEH1gNRBCL3h682eR4fxAbb2yw3ejbam-Zxeem7JfKO5hhP1KF0QtEI98dd_flpErIi-bwN0L_Io33Q3yGbuyYH1NOymQDevWQdZ5uOGPddB7OblQkjus7cyf1MwpyGJdAI09vu_1Axai2Mx9loJ6OyFcKVZwwr-R_Apq6mzZ5_LFVc8D4Wo0faebZcZMOmDIzqYKwaShU5zxlpIoWxMCvH3rkchgsbRxeIU8QsfUZrco1UudNN-G6nu6po8PRct6R3RQ627QYvqcxd7WxuwqoteVR5xzUoTRLuQidrAeyb5bfxxY1fWyN9pWkjQdDg9FV1DhZ2S9hqvgPm3lrSOUUIzqQTZotc4lyxIdEkG5MHH0JXgqv2qT5gr6tYA2CJAK_VWUdDcCZd3plNlhBPlDesVDBU2xRaAxm4%3D", "description": "SW Quality Engineer לחברת מדיקל גלובלית בצפון. התפקיד כולל: בדיקות ידניות למוצרים רפואיים חדשניים, כתיבת מסמכי בדיקות, השתלבות ועבודה בצוות, ועוד. הזדמנות להשתלב בחברה מובילה בתחומה בתפקיד משמעותי ותנאים מצויינים. - השכלה רלוונטית - 3 שנות ניסיון בבדיקות QA למערכת חומרה-תוכנה - ניסיון עבודה מחברת מדיקל - ניסיון בתכיבת מסמכי בדיקותShow more Report"}, {"company": "Google", "job": "Engineering Manager, Siemplify, Google Cloud", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "INFINIDAT", "job": "Technical Advisor", "city": "Herzliya", "date": "9d", "rating": "3.9", "link": "", "description": "DESCRIPTION\nAt Infinidat, we help enterprises and service providers empower their data-driven competitive advantage at scale. We are a leading provider of enterprise-class storage solutions. The company’s software-focused architecture delivers sub-millisecond latency, full availability, and scalability with a significantly lower total cost of ownership than competing storage technologies.\nAn Infinidat Technical Advisor (TA) is an experienced Storage Systems Engineer providing our customers with a named technical resource for the duration of the lifecycle of their installed system(s). As the customer’s trusted advisor, the TA provides a full spectrum of services. During the time of the engagement, the TA will learn about the customer’s IT operations as it relates to the ongoing implementation of the Infinidat storage systems.\nRESPONSIBILITIES\nAct as a single technical point of contact post-sales for non-break/fix issues\nSupport and guide the customer through the implementation of new systems into their environment\nEstablish a comprehensive understanding of the customer's environment (e.g. applications, servers, network, virtualization) integrated with the Infinidat systems\nAdvocate on behalf of the customer, ensuring all specific needs and concerns are properly communicated with Infinidat\nAct as a Crisis Manager in the event of serious service impact\nProvide regular executive updates to the customer and to Infinidat senior management\nWork with support and account teams to produce and deliver Root Cause Analysis\nFollow up on open customer issues and requests to ensure timely resolution\nConduct periodic Service Reviews with the customer and their account team\nPro-actively work with the customer to recommend code levels, best practices and relevant white paper\nREQUIREMENTS\nProject Management experience\nSensitivity and tolerance when dealing with customers\nInterpersonal skills and positive communication skills\nAbility to team effectively and work with other departments within Infinidat particularly the support teams\nAbility to work independently and use own initiative\nA capability to operate in an ever-changing dynamic working environment\nCreative thinking when looking for technological solutions\nGood understanding of Unix operating systems, particularly CentOS\nDeep understanding of central NAS and SAN storage systems\nUnderstanding of Ethernet, iSCSI and FC SAN networks\nGood understanding of open system world compute\nGood understanding of VMware and Hyper V virtual environments\nGood understanding of DRP and backup environments\nAn understanding of API and scripting with Python.\nFamiliarity with DB and application environments, including Oracle, SAP, Microsoft SQL, Exchange\nFluent English language skills (both oral and written)\n5+ years of Storage Industry Experience\nAbout Infinidat\nAward-winning Infinidat is a global provider of enterprise storage platforms and solutions. Installed in Global Fortune 500 companies around the world supporting a wide variety of applications and use cases, our software defined storage architecture delivers microsecond latency, autonomous automation, powerful cyber storage resilience, 100% guaranteed availability, and dramatically reduces enterprise storage CAPEX and OPEX.\nThe company’s portfolio has been named a Leader for four consecutive years in the Gartner® Magic Quadrant™ for primary storage, has received the Gartner Peer Insights Customers’ Choice Award for 3 consecutive years based on end-users’ ratings, as well as numerous other awards from the storage analyst and storage press community.\nOur success continues to be based on the talent, experience, and motivation of employees who leverage their skills and abilities to make a real impact in the industry.\nIf you have the power to be the best of the best, we would love to have you join the Infinidat family and make a mark as an essential player in our company’s growth.Show more Report"}, {"company": "JPMorgan Chase Bank, N.A.", "job": "Full-Stack Engineer", "city": "Herzliya", "date": "1 day ago", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bac624ed&cb=1676382853052&jobListingId=1008455761801&jrtk=3-1-1gp838ls1k60h801-1goorviu1i7l8800-82a34c18980a87d9-", "description": "We are looking for a Full-Stack Engineer to join our team and deliver innovative solutions in the heart of the finance industry by using the latest technology stack, modern architecture, and software engineering best practices.\n\nYou will have a significant impact on creating new solutions, and you will own features from design to production, using cutting edge technologies, resources and backing of a global leader in the financial industry. You will be involved in full product life cycles, working with excellent software engineering, product owners, user experience experts, as well as our business stakeholders.\n\n\nYou should be proficient with front-end and back-end coding, web-services, database systems (both NoSQL and Relational), software security, performance, and scale. As a developer, we look first and foremost for people who are passionate about solving business problems through innovation and engineering practices. You will be required to apply your in-depth knowledge and expertise to all aspects of the software development lifecycle and stay focused on the team's goals and the business strategy.\nYour Role and Responsibilities\n\nResearch and development solutions to challenged problems\nTake end to end ownership - develop, test, and deploy full-stack web applications\nAutodidactic abilities to ramp-up quickly on new technologies\nWrite clean code using superb quality and security standards of products\nImprove everything you touch with a passion for experimentation process\nProduct oriented combining thoughtfulness and pragmatism to get stuff done\nCollaborate with teams in multiple regions and time zones\nYour Qualifications\n\nB.Sc. in Computer Science (or an equivalent)\n5+ years of experience with software development and web applications\n2+ years of proven experience in client side development using React, JavaScript/TypeScript, HTML5, CSS3\nHands-on experience in one of the back-end programming languages Java/Python\nFamiliarity with state management frameworks such as Redux\nKnowledge of front-end testing frameworks such as Jest/Enzyme\nExcellent verbal and written communication skills (Both Hebrew and English)\nAdvantages\n\nExperience with Agile scrum methodology and CI/CD deployment process\nKnowledge of RDBMS, NoSQL databases, and SQL queries\nFamiliarity with Spring framework and Spring Boot web applications\nKnowledge of Cloud technologies (preferably AWS)\nJ.P. Morgan is a global leader in financial services, providing strategic advice and products to the world's most prominent corporations, governments, wealthy individuals and institutional investors. Our first-class business in a first-class way approach to serving clients drives everything we do. We strive to build trusted, long-term partnerships to help our clients achieve their business objectives.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.\nJ.P. Morgan is a global leader in financial services, providing strategic advice and products to the world's most prominent corporations, governments, wealthy individuals and institutional investors. Our first-class business in a first-class way approach to serving clients drives everything we do. We strive to build trusted, long-term partnerships to help our clients achieve their business objectives.\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.Show more Report"}, {"company": "נישה", "job": "System engineer", "city": "Tel Aviv-Yafo", "date": "13d", "rating": "3.6", "link": "", "description": "לחברת SU העוסקת בפיתוח מכשור מציל חיים לתחום הקרדיולוגיה, דרוש/ה מהנדס/ת מערכת כחלק ממחלקת הפיתוח תואר ראשון בהנדסת אלקטרוניקה/מכונות/הנדסת מערכת או אחר- חובה לפחות 3 שנות ניסיון בהנדסת מערכת מחברת מכשור רפואי -חובה ניסיון מחברת מכשור רפואי העוסקת בפיתוח מכשור קרדיולוגי/MRI/הדמייה - יתרון משמעותי ניסיון עם מערכות מכשור רפואי גדולות ומורכבות -יתרון ניסיון באחד או יותר מהבאים : עבודה במעבדה, אינטגרציה, כתיבת מסמכי דרישות, מערכות בקנה מידה גדול- יתרון משמעותיShow more Report"}, {"company": "Deloitte", "job": "Senior/Junior Data Engineer", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=220&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c490da30&cb=1676382855514&jobListingId=1008435556111&jrtk=3-1-1gp838o902f30001-1goorviu1i7l8800-b186792f917f6629-", "description": "Description\n\nDeloitte Analytics, a part of Deloitte Israel consulting practice, is looking for a talented Data Engineer to join our growing team!\n\nHow your day will look like:\n\nAs a Data Engineer, you will take an integral part in our local and global projects.\nOur clients come from a wide range of industries and organizations across the globe.\nYou will work in collaboration with the data architect and data scientists and will be responsible for the development and implementation of data gathering, maintenance, deployment of DS pipelines, and helping to build infrastructural solutions that support the data, science teams.\nYou will collaborate with internal teams to facilitate solutions for DMPs.\nRequirements\nMSc/BA in Computer Science or another relevant field.\nA passionate Data Engineer with experience in developing data pipelines using AWS/Azure/other cloud-based technologies and Big Data technology stack to create custom solutions using large data sets.\nExperienced in writing APIs, scrapers, and crawlers.\n2-6 years of experience with Data Modeling and tuning of relational as well as NoSQL datastores (Athena, MongoDB, MySQL, Red-shift, etc.)\n2-6 years experience in ETL development using Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.) – is a plus.\nExperience using cloud-native tools and design patterns (Containers, Serverless, Docker, Kubernetes, etc.) – is a plus.\nFluent in English\nTeam player with a can-do attitude\n\nFull time Job\n\nLocation: Tel Aviv, Hybrid\nWe at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.Show more Report"}, {"company": "נישה", "job": "Document and Quality Control Engineer", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_26613140&cb=1676382856763&jobListingId=1008423892933&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838pg12jqa001-1goorviu1i7l8800-0c05a39f76a13d9d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC0OIaE1NxJ1a3d1v4KqfxBd2SmPBAq3aNAx2x8ecG85NJoPiBWKySX1KpnYznaigusI1GBAZc54qDjwhdItIwYw1lcLtpC0EOu7_Nh9ot7zuMnAloch2vwTJwIM2mo5kcrYr6ARzEoHbKI7KLs5yk3lbbhpt6DKLHwfXfKa0DcU8xqQ9hFh20aZFB_0AdIpZe2miYLUnppnE7PZTMiFjEIRe_ooJ9wwZ7PMpVuSzp6wkmcPROEm5888T_cXeLWxS8xuZQvZx4gswYLuwXYeO_B9OvcaTv-7tW9olj612oEk84g7UDziHtk3PVkzs7akSwnwHTQPo4iFKqjU0XsC0PhB48H6B_2WCsDS5k-9iV77KpladLuiW3rIgnfPazD_TfRTpNmH4b9vyLlfmAXh7B-qIwpiQmdj_F0CWjsEAWcnmkoEUx0lzT7PTwYTBjM9PIoDAPBSa0DC671ABhys5eZPayTnn7gUF-yNRDUHm3nicIwEGG9PbnkwkU3WWaws6UOfHaLksURJy7AzbGstk3VhtUXyjyM9MY7T9UOSNQmbvbLBNhPeGDMKRRe4AliAdiExTbGr8uOkObw7rZfBmwtBeO48q0HOSZr-srjRqKt0ASGjEVh5p7L-kA7NZq4Mqai-MZz11HMBZFZ16nczQ0o", "description": "לחברת מיכשור רפואי מובילה ביקנעם דרוש/ה מבקר/ת איכות להצטרף לצוות האיכות דיווח למנהל/ת QC הנדסאי אלקטרוני או מכני תעשייתי (HANDESAI) או תחום דומה . ניסיון של לפחות 3 שנים כמבקר/ת איכות -חובה! מכשור רפואי-יתרון. יכולות טכניות ויכולת גבוהה לפתרון בעיות.\n\nניסיון במערכת ERP יתרון לקורסי QA/QC מיומנויות בינאישיות ותקשורת גבוהות שפה: עברית ואנגלית טובהShow more Report"}, {"company": "MalamTeam3", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=222&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b06e7534&cb=1676382858370&jobListingId=1008070271437&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838r08jij3801-1goorviu1i7l8800-7a9455391c9a46fe--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tCjX7o1y-kWCixrjUB_PGkYSUOmWVwx2KfcRsUteqGCEBugE5FDOTUTFG8sSuROsoskBrpasQJDaD2u4dT9ZC_OxeomsoDt33fiWcjPf1VcB8UeDSffxk0uDxM7T6ZAHnmty7hGNGVkN9JsHCEgZiWVsiD6kpRb630m6yW5nBxuX8Pm6dtdUkA16Cdn9lwQ6qnlUR8uImKH-wxtf_ZsJnucRRV3Uy2vebCfPFQc3yG_VyXLNWz84IlvvRsvEkIoxmt0zwqPRENOSW1MVwnkrXzFxop9D-pCjqsNf3CS_PpAqeIYk6JP8L6spw2BEyV8hwszISNxPE_4TskLjUHoO3bpVFcztH3sKGP9gdY5ufNtZUcw1YBH6QtbThkx4dE9b9oAQImMT8iR9XDIXqySkWS8wJwX6dCZLFCEiSUs_OXdo021Ag9MsQxqs9IMdM2ETC5SQ62_WnAS4Ubygi64wBI1ATFd1Lm465wQXopHmLK9j6xy9jWaRozP7iEES6HpDGqjEy2xlrywgzC5AXHXmRl0XWR4W4K7q1FAmTEvjROAjZzJmGRM8Ow9TmaD_gaJtHhGjXkzguvClnVxbG5eMqKku3v9E-16SQaEj8OBxjHvAKiGj6g7EbOQwELaq6GHI-VQtljw-1uhEUpRutO5-uGbNySc_01xtM8zsIJPQbGq7sOZniN52EQQ%3D", "description": "דרוש/ה בודק/ת ידני/ת ואוטומציה לחברת ביטוח מובילה בתחומה במסגרת התפקיד: ביצוע בדיקות ידניות ואוטומטיות לתהליכים במערכות WEB וMOBILE, הבנת דרישות UI/UX, כתיבת מסמכי אפיון ומסמכי STP,STD,STR , עבודה מול בסיס נתונים SQL. ניסיון של 4 שנים כבודק/בודקת תוכנה ידע וניסיון בהרצת בדיקות אוטומטיות עבודה מול בסיס נתונים SQLShow more Report"}, {"company": "Google", "job": "Silicon Validation Engineer, Google Cloud", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "R&D Manager", "city": "Southern", "date": "6d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=224&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_92f281c8&cb=1676382861623&jobListingId=1008444887754&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838u5vp6cj801-1goorviu1i7l8800-1d920c0b16636e2d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNANtB5ZZYDlIbgi8f3h3mUvlJHkO6fdk4VOuQsIlauBo5BgnQyiy2oUmCiXk-sfj35eqIh4yo3dtyBsfXoUTd9RUuaTwMI8wHVDDgKOuOtH8T5z0namydoN0RRcjf1BOf7w-PaHm5-WdrnD6WtQK9z-5lFt6ZVAKJ5mM4pAKTcog6kMoaSfEM3iEMp3nkiQpmquKJd5q-Vx0cgRD-aOM9c1QsmIKsFvU1gv33zgzvix-9dSmc-3iAdmTHNnhQDbOlgSsxNRh-NajuRKY1lVX6oVDZXaKrVDxpVWt7Pxezu06sn6WnM8KCBdA-ALhPchxaSGY9UDe2tu8cZDrrfO-BGE6l46UoSmrZIQO2a9ZU6i5lD9cHO7r0_73XZeQEBaLV8VrXwElOSNVvD8sNwTAH7zogECi_8TZAUQ_2O2bEqW079RIFX5MIqdE1KyYWikWpviH6RsmEmuYAxmz6AJJAVNUNIfUneFkAFymAO0Eyjfcn0eyD8gMnybsHNl67_TYaqtyQKRilE4OHRUvbpHWAYya3Ba1PrugMYoQZLw4Xf94CnJQjswFBzZdDN2VHpkWWbXzqzYRNjr9UlWo3iDwAbm6lXgLc5FtoeszpTB--7sXsFYQFi-jIde5Z1yudgvfjm8yWZIRy2VcHma9-YTR9zM", "description": "Leading Engineering team and set the technology agenda Manage various projects Parallel • Collaborate with cross-functional partners in Sales, General Ganagers, and executive members to define and build a data-informed technology strategy and roadmaps. • Advise GM and priorities regarding design and direction of new developments. • Ensure the engineering team is scheduled and working efficiently while utilizing company equipment and harnessing the rest of the departments. The ideal candidate demonstrates personnel leadership skills, proven technical competence, and the ability to collaborate with others to achieve business objectives.\n\nResponsibilities : • Lead and mentor a team of electrical and mechanical engineers to deliver the best RF/Antenna product to fit the customer need • Conduct presentations to military and commercial engineering team (including PDR, CDR, etc.) • Review SOWs and special requests from clients, evaluate, and raise issues or concerns. • Provide estimated cost of new designs • Support an organizational effort toward better understanding customer needs and pain points, and develop plans that further this goal • Attract and retain new engineering talent • Manage the product portfolio • Champion technical discussion with the client technical staff **Please Apply your CV in WORD Document • 5-10 years of experience as an engineer and/ team leader of engineers • Experience in a military/government company or similar (IAI, Elbit, Rafael, etc.) • Proven success in leading mechanical and electrical engineering teams in rapid product development • Basic understatement of the antennas and RF world • Passionate about the telecommunication market • Knowledge of Microsoft (excel, word, outlook, MS projects) • Must be fluent in English and Hebrew • Have a strong builder mentality, and know how to effectively \"bring people Demonstrated success in building a culture of innovation, ownership, and accountability • Strong strategic business knowledge, change management, and continuous improvement champion • Understatement of concept from the plastic, electronics, and metal industries that relate to the production of antenna productalongShow more Report"}, {"company": "אורגד מאגרים בע''מ", "job": "Junior DFT Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=225&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_47e5f745&cb=1676382863225&jobListingId=1006884230390&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838vpekhrt801-1goorviu1i7l8800-1867df31ac64a337--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCYQvHrt0AEv4bbv5HwhlTwLBSGHMMScTuhk9ZoyDNzgzQ6_wzhTn3-JAeEUpXPZ8E20vYB5UL-q5yGBH6cjlEJ4TIaxgZM87huT5OIvbYRGK_-vTuWTkpbDA5lRy8vakfPLeWcEi_Ut_zcrg5hN-IrtKuzEFXb0HiaSxjvqSMC20kL7a2VV89CfhqNSShQ78dxEaHLIdkknenozN0yGCkXzWSuZa8SsDpg3Ki4Pi34tW7DXNWNhsVR0K6Yiy4fWUxDOkblJ0wDoydOFtSKQ4DBvHTvtm_ZY85iPjtybXPdoqgl0QR5h_1bI9yYXJJQEdbAI1KajXbGyzF3UqkhtSaw69kwH9tCiyzAydjuNnzSlq-VxfKS6T-bzv492EPnx7I2XsD3Q-NCXlmZ3c3PqD7DyG710Q9hccwrvCQCwnEexu4IWs4j8Pr0tra9WzFSM4gsp5j3azP-TytGTVv0bsj89AjrleSoCA68glw6K0r0OZxZLH1C1ZZtLeB1w_kuAn4NHwizLL17iur8N7Gh7BNxmMWDaVdkLLFwV9j7-OZN7sLyM0EeDUsZ7QOF8b44CgkZsvRBqWJ34R0DlSkkkFbRvoEbvsCSgQ6n2HjCEVOT7M0-jclBwiUfciBBF-wGxzHFyOIaUUxdDM8QiFpHRL5T", "description": "לחברת סמיקונדקטור מעולה מהנדס/ת DFT אפשרי לבוגר , ללא ניסיון B.Sc. or M.Sc. degree in Computer Engineering/Electrical Engineering 0-5 years in a semiconductor company as a DFT engineer Chip design, Verilog and System Verilog Verification, UVM methodologyATPG tools Scan insertion tools Gate-level simulations Static timing analysis Scripting (Perl/Tcl) Familiarity with ATEShow more Report"}, {"company": "RecrutiX", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=226&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b36cf84e&cb=1676382864685&jobListingId=1008393458650&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83917ikuir801-1goorviu1i7l8800-98a03b69ec5dec0a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBd5v_If7FO5aUq39gSkFFiWo0q5cuYpaC2A5ac78RhGMQGvJwCmkWg6gRc0AyihHs6N5kQWl2LkMmHyb0hp1F0gUxqe4vLXCy9vGhogoBOm-OGawOmwaoz_8Uozj_bNd9-xBTfIDa__32nv3IEEVb21YzJ3ZLBgJKdrPXOpT-dRfL2CuXiGrtExsS5SfZ2KNevHVBytNHjyvVbocfRf7e8cC0vDvxeU3-1roXuMcqq67HwEBm9_lIU2I-ItjL85Fj7bPoyQoHhnQPexTNfd9JJ3m41CALpmCUaEnUhTSSp27yzCY3NT7zhdU6FYVY-AHhFYo1u3MiibYABcX9cBQL9sbKxSrkdYILlEgjukPaieMxXehh839q4vrAo2K4tTvEk7gP2l7na7ps90MdPteYadlWNSociKF0UaJAlvwsra4fjlne9q8voiJFBqN67EbRJW7Abg0ztVbuF1VrL-j7mpqATcYAczz9epMlj6W3orcx9YvYDOKeGFr4dO-PV5B8Fl9IlQ69Nby2Oxg5OUpAUAOYqhP59vuHGAQpbfcHhhypv1oQx7LY5hbxXBZ9aGxzzUwW9KKoQifoVFBmw_17X99GKZohElEpW1z8c8bWu9MyCAg8EcexTU_Uja9rsVubKq_VUc8nEMp4DNymx1pMk", "description": "Test documentation creation and supporting (checklists, test cases, mind maps) Issues reporting and further processing Performing functional, UI&UX testing Regular and clear status, progress reporting Work closely with all scrum team/product owners Cooperate and work closely with the development team We offer: - Ability to work remotely (New York time zone); - 8-9 hour working day and 5-day working week; - Corporate events (Remote position, Full Time) 2+ years of experience in testing 1+ year of experience in automation testing (Java Script) Ability to analyze the automation test runs Experience and deep awareness in testing levels and types (smoke, acceptance, system, integration, grey box, regression) Good basis in SQL Data Bases working experience Understanding of scrum methodology Good communication and reporting skills. Be able to effectively cooperate with a development team Good self-organization: be able to switch between tasks quickly without focus lost At least Intermediate level of spoken and written EnglishShow more Report"}, {"company": "פיקארו השמה גיוס וסורסינג בע\"מ", "job": "Junior Embedded Engineer", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "5.0", "link": "", "description": ""}, {"company": "SQLink", "job": "Full stack Engineer לחברה מובילה", "city": "Raanana", "date": "7d", "rating": "3.7", "link": "", "description": ""}, {"company": "מרטנס הופמן מקבוצת Malam Team", "job": "data engineer", "city": "Jerusalem", "date": "16d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=229&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_20af298e&cb=1676382873127&jobListingId=1008423355675&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp8399ep2pv5001-1goorviu1i7l8800-543e8db7adbeee1c--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HL9gN3FSo5qRZL0jbljSAjXZsCRx83YYFDWuW2FV8gw3XgYsZj9h1jUKhHhVBirEMSGV7NkzpkPVUNEJyTaXjytblzeftQRXdi8gN0fJCl_7OaX9CYGU3BgsYCSdp6SYH0ZuBBP3_Q9oyHaE3tSRdEi6SjKNhtPgbkXN4FneHCtkqOa5csVIFYn3YgsMfUMYQ5AA0xl7P4PbWOjLdLWYaDu7fsk5RZN81S6g1ThrScOOC5juyvlnD-q6Gzd6nzqQa3JLtb9K1o6oCFlSDszJziDgwOPU1d_0rcSBNi43aFqDZofyIYjSLtv4rl_66YncLeOhoCdIGbW-S_YFWV-fAYhrQDy19tyRjFjvHkqOCmGkVBVd_paAhqjTAZ4jL_7xNyfYsREOxV9I5xfG59gxOO0eD9yXwLtXDl-TkuZNrF82Nxutu5RSJcBjiqmicToIr95IqUboqNEOT-6B17y-wS45NhLYZS3KvWD9dgVpm9pIAGdGKg9ro2I6Z39EC1i2hyFhjX9dI3fEKL0-GZ3K18CtPPmEYx7jjudzYqF2vPJE2u8TdcTm4MoYMYNhpKM8s0Be0BqRlk1ypf87y8UvABUxp7WMZyGLJa1AWrUrvSGJmhSSUNZnKpAVkysFmLMIjAvgVHH14PZMCn-Zn8bWxYvnpU8AuT3lxY%3D", "description": "למרטנס הופמן מקבוצת MALAM TEAM דרוש\\ה data engineer לארגון מוביל באזור השפלה. ניסיון מעמיק בפיתוח ב- Python- שנתיים לפחות- חובה ניסיון מעמיק בפיתוח בעולמות Azure cloud Data bricks , Data factory ,Data lake – שנתיים לפחות- חובה שליטה טובה ב SQL- חובה. ניסיון בפיתוח ETL בסביבת BIShow more Report"}, {"company": "NetHR", "job": "Sales Engineer", "city": "Jerusalem", "date": "21d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=230&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d5911dd7&cb=1676382874355&jobListingId=1008413822967&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839al3kuho801-1goorviu1i7l8800-36eb66c795d9bf57--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBUvnGSt1weWMoZSU40N9AjRVafJ9e6GbkUGd3n5iRzVMfZATmCEMjBiaPJDvzvbnyTuc7jCzWvnKxxLFAaqsnlq-6lzajJx1xtVWU2spge3Wr788b30Bnpw2qvvD0zJgD1Cza79Z2nIBMrEWfNaOxPpQKmYKD-50c8JKrFwMeWpnumOa7IdLohKnHINlsn-vUoJFk-D9ni2tPboowthKB9Tdjh90C2W19bUjsT5dhXhUXGAYV9Ccf83MeBNQmS2BfxY-tB_vCLNMpMnSep3wz1xWNn2HNICkSxQpXvifx_R6vwSg8qZmfvgioVLL2u-CasZrttlEiz55l9XryyAaqulbJjgvNsSDeIc-ng33bGG_zxVBb37KEqQ22-9vfRSCwUdGv0hUf6aLcmHCno-xqe62FYqfVujyiPgIglQPlZKJ0ECHjo5UN8L-TFF_3l-KZw0eE9AUox3iS8AtJQ2W0mOdmljWgGDJFiUBEy0XsObhFt3fGaNEHkzlBCSAxwoiTAiwKKNFP_H8jyMDcA5B0vBcnG05tUvPa-G1bW3tE_Oog1WNyDL9i3U00pbGsV37D_lvlfVbqf_KEYwYKdvLCkgSN1c6p-THrE13B7YwLAVIGo2PwEiYQf6cL_VzaabZtCKDwqyFLkaPsk79TdZP5Q", "description": "Responsible for generating existing and/or new sales. Responsible for developing customers and maintaining their satisfaction. Determines and develops approaches to sales assignments to achieve quota/ strategies Leads projects requiring coordination with other functions, organizations Bachelors University Degree in Electronic Engineering or equivalent. Over five years of experience in High Tech Sales, customer Support, Marketing or R&D.\n\nTechnical knowledge in Broadband, Wireless Lan 3G,4G Strong communication skill and the ability to interact with a wide variety of people. Self-motivated and willingness to take up challenging assignments Highly competitive, assertive with a passion to \"win\" and “teach” Comfortable in challenging customers by offering the customer unique perspectives Sociable, people oriented, outgoing, desires lots of quality customer interaction, and wants to earn recognitionShow more Report"}]