[{"company": "Apple", "job": "Senior Formal Verification Engineer", "city": "Haifa", "date": "5d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=401&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_74688209&cb=1676383283714&jobListingId=1008449460544&jrtk=3-1-1gp83lqeakluo801-1goos78nqjijq801-1690c772f48cca6a-", "description": "Summary\nPosted: Aug 1, 2022\nRole Number:200000213\nAre you in the Formal Verification domain, interested in developing proofs on the most critical parts of Apple products? Keep reading! Our team is a small family of FV enthusiasts with varied academic backgrounds, seeking for breakthrough methodologies. We encourage professional development and knowledge sharing on regular basis We constantly aim to stretch our limits, with emphasis on tackling the space explosion problem as well as raising confidence in proof completeness. Sounds you could fit? Let’s talk!\nKey Qualifications\n+4 years FV engineering\nModel checking researchers/developers\nSVA/Jasper - advantage\nDescription\nIn this role you will be responsible for developing mathematical proofs using model checking tools, to find RTL(Verilog) bugs or prove their absence.\nEducation & Experience\nB.Sc. in Mathematics and Computer Science, Electrical/Computer Engineering, M.Sc/PhD Mathematics\nAdditional RequirementsShow more Report"}, {"company": "BIRD Aerosystems", "job": "System Engineer Team Leader- 1199", "city": "Herzliya", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=402&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6a1448a6&cb=1676383285466&jobListingId=1007176529556&jrtk=3-1-1gp83lrv3jij3801-1goos78nqjijq801-9e7efe5f7f0a8921-", "description": "What are we looking for?\nSystem Engineer Team Leader to lead our amazing group of system engineers in the R&D division.\n\nWhat do you need to have?\n\nBachelor’s degree in Electrical Engineering\nMBA in Electrical Engineering- an advantage\nExperience in leading a team- a MUST\nAt least 10 years’ experience in multi-disciplinary projects and system engineering\nExperience with MATLAB – must\nRF test equipment experience – must\nExperience with radar systems design – significant advantage\nMilitary background from IDF technological units – an advantage\nFluent English\nTeam player with strong interpersonal skillsShow more Report"}, {"company": "WhiteSource", "job": "Application Security Engineer Lead", "city": "Giv`atayim", "date": "30d+", "rating": "4.1", "link": "", "description": "Mend is a successful, rapidly growing start-up offering a unique cloud-based solution of open-source management and security. We are getting millions of customer source code programs from all over the world and analyzing them automatically on a daily basis\nWe are expanding our portfolio of products, by starting the development of a new, state-of-the-art, cloud-based solution in the field of application security.\nWe are looking for a highly motivated, talented, and hands-on Application Security Engineer who will participate in building our next-generation static code analysis engines for detection and remediation capabilities. This role offers challenges across a wide variety of responsibilities. You will have an opportunity to establish the application security discipline in the SAST group, and define working procedures, processes, and tools.\nThe successful candidate will work closely with algorithms developers, improving the engines, developing security rules, performing a security review of source code, and suggesting optimization. We are searching for a team player with a can-do approach.\nResponsibilities:\nPerforming security source code analysis.\nAnalyze application vulnerabilities and provide mitigation strategies.\nResearching, designing, and writing application security rules for detection, while working closely with a development team for SAST\nAnalyzing different programming frameworks in different programming languages for potential sources and sinks for SAST.\nHandling complex cases escalated from the field and other teams.\nImproving Mend SAST engines for various programming languages.\nRequirements:\nExperience with security review of source code – Must!\nAt least 5 years of experience in application security or security research, including the understanding of application security attacks, vulnerabilities, and mitigations- Must!\nUnderstanding at least 2-3 of the following programming languages -Java, C#, Go, JS, Python, PHP, Ruby, etc- Must!\nLanguage agnostic approach to vulnerability identification in the source code (ability to read multiple programming languages source code and identify vulnerable parts).\nKnowledge of common Web Application security vulnerabilities (OWASP TOP10, SANS 25, etc.)\nProven experience leading tasks and projects end-to-end, passion to grow to a TL position\nExcellent English – written and verbal.\nExcellent interpersonal and communication skills.\nAdvantages:\nBSc or BA in Computer Science or a similar degree.\nExperience in managing application security engineers\nExperience working with development teams.\nExperience with bug bounty research or published advisories or exploits for discovered 0day vulnerabilities in applications.\nMend’s Diversity Commitment\nAt Mend, we believe bringing together the diversity of experience and background creates a better place to work, a better product, and more opportunities to innovate. Mend is committed to doing its part to mend the equity gap, fostering a safe, inclusive environment to inspire and support employees to be their authentic selves and provide development opportunities for all.Show more Report"}, {"company": "Pentana Solutions", "job": "Customer Service Network Operations Center Engineer Level 2", "city": "Central", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=404&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ae9f0cfc&cb=1676383288290&jobListingId=1007698411677&jrtk=3-1-1gp83lussk6di801-1goos78nqjijq801-26d3801c101d611c-", "description": "Pentana Solutions Pty. Ltd., a global company with its HQ situated in Melbourne, specialise in the development and supply of automotive software tailored to dealerships. Our current leadership position within the automotive IT industry stems from vast industry experience, technological knowledge and years of continual product development. With over 500 staff in 13 locations around the globe, our products and services extend to over 100 countries with over 50,000 daily users.\nAt the heart of our organisation, lays our En.R.I.TC.H values – our cultural values we pride ourselves on - Enjoyment, Respect, Integrity, Trust, Communication, and Honesty. As a company, we recognise our people are our greatest asset; we value attitude as well as aptitude and provide opportunities to those who demonstrate the ability and drive to succeed in their role.\nReporting directly to the CS NOC Team Leader within CSC team, the role is responsible for effectively manage and support of all Pentana products and services to our customers.\nTHE ROLE\nTroubleshooting Local LAN issues including customer VLAN, DNS, DHCP related issues and Pentana Solutions Cloud Networking & Connectivity related issues.\nTroubleshooting Private and Public Internet services.\nTroubleshoot Cisco and Juniper routing and switching.\nTroubleshooting VPN connectivity issues\nTroubleshooting LINUX, AIX and IBM AS400 system issues and Database application issues.\nReport on problems and log tickets with third party carriers.\nWorking with internal infrastructure teams to resolve Cloud networking related connectivity issues.\nInvestigate Backup, Restore, Scheduling, Security and Performance related issues.\nProvide technical support to end users when cases are escalated from the Level 1 Helpdesk.\nProvide Level 2 phone support and escalations to Level 3 engineers when required\nAnalyze recurring system issues and finding permanent solutions.\nManage own incident queue, within SLA’s and follow defined Helpdesk operating procedures.\nReport weekly on projects; meet service levels in line with Pentana Solutions standards.\nAct as an escalation point for team members.\nServe as a liaison between third party engineers and suppliers where necessary.\nParticipate in in-house configuration and hardware/software resolution where required.\nAbility to communicate effectively with all level of end users\nAble to work on shifting schedules 24/7, Philippines public holidays (i.e. weekends, late nights)\n\nEssential Skills:\nExtensive knowledge and experience in Cisco and Juniper Routing and Switching Network\nIBM and Dell Hardware Knowledge and troubleshooting skillsets would be beneficial.\nPerformance analyses and testing of Server hardware to diagnose faults\nLiaise with external vendors such as IBM and Dell to resolve faults\nCisco CCNA / CCNP, Juniper JNCIA networking and Microsoft MCSA/ MCSE Certifications will be beneficial.\nWHO ARE YOU;\nProfessional:\nDemonstrated experience within a similar incident/support role.\nExcellent Customer Service and Communications skills\nExcellent interpersonal and stakeholder management skills\nITIL Certification will be highly regarded\n\nPersonal:\nProblem solving and critical thinking mindset\nResilient, with strong negotiation\nProactive and highly organized with the ability to prioritize concurrent deadlines.\nHighly responsible, punctual and reliable\nAttentiveness to details and deadlines\nTo apply, please reference #1575 in your application to careersAsia@pentanasolutions.comShow more Report"}, {"company": "Google", "job": "Engineering Team Lead, Siemplify", "city": "Ramat Gan", "date": "14d", "rating": "4.5", "link": "", "description": ""}, {"company": "Apple", "job": "Senior CAD Engineer - Infrastructure and Queue Admin (Herzliya /Haifa)", "city": "Herzliya", "date": "8d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=406&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1253b8b3&cb=1676383293898&jobListingId=1008439638386&jrtk=3-1-1gp83m4b2jc9j801-1goos78nqjijq801-a4063c84c1ae3938-", "description": "Summary\nPosted: Sep 29, 2022\nRole Number:200396560\nIn this highly open role, you will provide multi-site, multi-team design support as part of the Infrastructure CAD Team. Technical areas of responsibility include compute-farm queuing software maintenance and management, support for vendor license integration, forecasting of hardware and software needs, and developing software and databases for metric tracking. Additional responsibilities include working with CAD Engineers to optimize tool-flows and regression suites.\nKey Qualifications\nFluent scripting skills in Python, Perl, TCL or Shell.\nExpert-level knowledge of server queuing systems (GE, LSF, NC).\nExperience integrating tool-flows into a batch/interactive queuing system.\nExperience driving web-based reporting and data visualization.\nExperience with SQL database administration and queries.\nExposure to vendor license management and syntax.\nExposure to configuration management tools (Perforce, GIT).\nAbility to handle a high engineering support load and co-ordinate with multiple users and management across multiple teams.\nDescription\n- Co-ordinate, handle and support compute-farm queuing software for multiple teams at multiple sites. - Triage and solve user issues related to queue job submissions - Provide real time and historical reports for queuing usage/metrics and compute data at all sites. - Optimize compute-farm queue configurations for license/resource usage and integration with tool-flows and regression suites. - Work with tool vendors to make job and license allocation more efficient. - Maintain and update tool wrappers, module-files and environment files. - Oversee EDA tool installation – assist with flow integration. - Create and maintain scripts and automation for infrastructure support.\nEducation & Experience\nBSc in Information System\nAdditional Requirements\nPlease add your Grades sheet when applying.\nApple is an Equal Opportunity Employer committed to inclusion and diversity. We take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, and individuals with disabilities.Show more Report"}, {"company": "Imagen", "job": "Senior Full Stack Engineer / Tech Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Imagen is developing a disruptive technology for the professional photo editing market. We use edited photos from each of our users, to create personalized AI profiles and to reduce and eliminate editing efforts. Creating a personalized profile based on user data gives great value to our users and creates many challenges.With a very strong market validation, a crazy month-over-month growth, and a top-tier VC backing us, we’re looking for the first team members to join our team. It’s an opportunity to be part of something huge and be a leader in a fast-growing company.What will you do:In this role, you will be responsible for a challenging overall development and implementation of front and back-end software applications, from designing architecture to high-level programming, performance testing, and systems integration.You will build client side applications with reusable code and modular components.You will take initiatives, design architecture, and deliver new features to production.You should have an advanced troubleshooting skills.You like to have fun and code with a smile.Requirements:Previous experience of at least 4-5 years as a full stack engineer.Experience with Frontend frameworks of one or more: Vue, React, or Angular.Experience with Backend framework of Node.js or Python.High attention to detail.Bachelor’s degree in computer engineering or computer science.Job Type: Full-timeShow more Report"}, {"company": "Medtronic", "job": "(Senior) Robotics Field Service Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=408&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6b49ce89&cb=1676383296669&jobListingId=1008340888970&jrtk=3-1-1gp83m72sma4q801-1goos78nqjijq801-055db631b01181b7-", "description": "Careers that Change Lives\nThe Robotics Field Service Engineer is responsible for all aspects of equipment support performed at customer sites or before delivery, and to ensure that it is completed in compliance with all company policies and standard operating procedures. This will include, pre-installation checks, system installation/commissioning, planned maintenance, troubleshooting, assessment, and breakdown repair.\nThe Robotics Field Service Engineer is the main contact point with the local customers and the local commercial team for all Service and Repair related questions.\nA Day in the Life\nLead and execute installations and commissioning of new equipment.\nPerform preventive maintenance as per service manual checklist. Perform appropriate testing to confirm system functionality according to the manufacturer's specifications.\nAttend breakdown calls and perform repairs and troubleshooting independently.\nProvide testing and validation support and data to the Global Service organization.\nAssist in technical support for users of Robotic systems. Including phone and remote support for users and technical staff.\nCollaborate with other field service engineers to troubleshoot difficult service activities.\nTravel to sites to work as a member of the local team to provide efficient repair/installation support.\nMust-Haves\nBachelor's degree is required – minimum of 4 years of relevant experience or advanced degree with a minimum of 2 years of relevant experience. Good knowledge of troubleshooting methods/skills and capital equipment control.\nSystems are primarily used in the operating room, so healthcare / surgical setting experience is required.\nExperience with robotics or motion control within a large capital equipment environment.\nTeam player with strong interpersonal skills.\nAvailable to travel (around 50% of the time) domestically and internationally and work outside of core office hours.\nStrong analytical and problem-solving skills that are balanced with speed and effectiveness.\nEffective verbal and written English and Hebrew communication skills.\nNice to Haves\nVocational/ Trade certificate with minimum 8 years of experience; Diploma/ Associate Degree with minimum 5 years of experience; Bachelor's degree with minimum 3 years of experience.\nIn-depth experience with medical devices for a minimum of 3 years.\nComplete and broad knowledge of operational systems, techniques, and practices typically gained through extensive experience and/or education.\nEffective presentation and negotiation skills.\nProficiency in Microsoft Office.\nWe Offer\nWe offer a competitive salary and benefits package to all our employees:\nFlexible working environment.\nAnnual Incentive Plan % depending on company results.\nPension scheme and group discount on healthcare insurance.\nTraining possibilities via Cornerstone/Harvard Manage Monitor/Skills Lab\nEmployee Assistance Program and Recognize! (our global recognition program).\nAbout Medtronic\n\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.\n\nYour Answer\nIs this the position you were waiting for? Then please apply directly via the apply button!Show more Report"}, {"company": "מיקרופוקוס", "job": "DevOps team lead", "city": "Jerusalem", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=409&ao=1110586&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fd14a0fb&cb=1676383298404&jobListingId=1007823078602&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83m8pakcmo801-1goos78nqjijq801-44142f41111b6b65--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAaZ5GayGWRIEb8S_-gn1dILBl5iuY4f9oDOTOKuVzYgNO7GnzRqaMXP_ANKTrH2JC7d9O0M7tz44SqdrkyKV8afNWV_5FLpJhMsz3Yn84byCuMuAzz4-YKREvLVZfwFLxvFTGdrMPE1peI-tp9g1oCmhtVxkW2alrUkGkAqZlSG_sgfAp6T1pfDOVXEo--jjKbGGSFcV_jC1kKR_JWWbzGe7JXAsgCq5hSN8RVKHanntyHxtsjV87yGrXRydAgioGPInPF9PuUgeQH17_-mIQTjR-dD5aYpWhi9gOIwsmDyH1EEuOHzLn2kEStx-1ZhMbg0hSvFzWKQ7Vd3fuzK115nFhwpY-vOkmt3Lm3TB79j2OHOYT4CGcM-zCdh5fdUyqRtAtSD5ZKaRmUr1Rl3ujHQ0dnMS8KwN-k_VoDEh9cJx8bq_e3_eUHloEB1g8i6W64Mv7kvhZftkxgsQVN4L22eAreAzxUnuZZeo7-xSo1jvHSDQlWRUwR3dcbF68FZ8MV7ZNHvqgB3yTq0MnmL05ptPNm6RM-A1nKwwNHHIfwZjkd2OpnygNHkUpyL33VXZpYC1uinGHhnzRLtBzCalQtg748soykA6alzLEMt5kDtSYEtm69HIDxhFM5b4TVxgq-7vXIfcR4D2A2R0C6QHzK", "description": "We’re looking for a talented and passionate DevOps team lead to lead and grow a team of talented DevOps engineers in LoadRunner Cloud If you are a DevOps Engineer with a hands-on experience in complex high scale production environments and cloud technologies and you have experience in leading people – this is your opportunity to be a significant influencer in a market leader product Responsibilities · Build state of the art solutions for our production platform · Work with other R&D teams on mutual projects · Be responsible for the smooth production-grade execution of provided solutions · Provide support and guidance to dev teams on using the underlying infrastructure · Managing requests and priorities from multiple teams · Work with developers to identify and resolve build or deployment problems · Innovate & strive to advance with the industry, continue to improve quality and efficiency of the build and deployment process Requirements · Experience with a major cloud environment on AWS · Experience with microservices architectures and its automation tools · Strong knowledge in software development methodologies and passion for creating high-standard toolsets for infrastructure-as-code · Strong interpersonal, teamwork and collaboration skills · Managerial experience - ability to lead, mentor and drive people · Excellent analytical and problem-solving skills LoadRunner Cloud is a cutting-edge technology cloud-based solution with infrastructure based on AWS, GCP and Azure stack that allows to plan, run, and scale performance tests without the need to schedule, deploy, and manage load generators.Show more Report"}, {"company": "RecrutiX", "job": "Senior Technical Support - Fintech Company", "city": "Tel Aviv-Yafo", "date": "5d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=410&ao=1110586&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_55e0efb6&cb=1676383300579&jobListingId=1008449200187&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83mascgfrt801-1goos78nqjijq801-a6efc620ccb503cd--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC9LM03Xf0tppXD1i5-jlB4Ic1BpqY0x_JnvR64bw2N77kbNEKRVSNHW_OdyuenFlEnb9sze_xK24SHehFEf76cB0ipal9x3U4-TkzzYG_phdkU9iGs6K_4MnP1i5QvIVnmLBuMUFYMvZ2Hhne363eFyQVCZu6o26Ga5Z6k7zMZ43B7WQL_1vs2igBBm6VHRUoAQmq7m5dkqknfkEjMFaSejwthEIVFSY7lsj4sY4c17VSujVugaWhMdqqz0oUj53lxlTpcFwm6yulxWymJOduK7Wbx0IuMtt1tQGH8fiQM4NLdh1Wa8NsD91m_S7Lc72UwkFkHYBmzBCezrDfYyiqvdYGomff_QFt1Y-tPW55UL76VrWLHcF-llU9FfsukIjmIaz-magC8WmNYILZEoH29dj3GXNBNJPUZvOF9ySDLUrW7iuuhl2BkHjNJfGQvBCVIUPSK9-UX7-63PxOkImxQQJcPbcAiLUhgGWnKku9aS-YedsMFZqpOKpmbhJX-SwMRDuH0pHT82ey9xZ3-xWDjhAdzRsGlphQsoiGovYWdRU3UQCvfEyJhfsS9LQ-FQk5grjCmYQAtdV87uesDsGR2O9D0LwLZg_i_58NBEaNvw5eMaYZ7pUqx2T8B92lrb1I_m-ARXu_UweKtHo1cRVA5", "description": "We are a global software company that develops and successfully operates a leading online trading platform. Our mission is to develop an innovative and advanced financial online technology platform. We build a place of creative and productive minds, follow by collaboration and excellence. Our platforms empower people all around the globe to follow their success anytime, anywhere.\n\nWe are looking for a talented Senior Support Engineer to join our Client Operations team. Job Requirements: • At least 3 years of experience as a Tier 2/3 technical support engineer for enterprise (B2B) software - a must. • Ability to work Monday to Friday - a must. • Experience with Windows OS including debugging and internals - a must.\n\n\nExperience with enterprise networks such as Active Directory, SCCM, and GPO - a must. • Experience with Linux including software installation and integration - a must. • High level of English - a must.\n\nShow more Report"}, {"company": "PerceptionBox", "job": "T2-3 Technical Support", "city": "Herzliya", "date": "21d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=411&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1815c40c&cb=1676383302052&jobListingId=1008412072796&jrtk=3-1-1gp83mca1ih5h801-1goos78nqjijq801-4bd94b659c3cd65e-", "description": "On behalf of our client PerceptionBox is looking for a T2-3 Technical Support Engineer to work on a challenging healthcare project.\n\nResponsibilities:\n\nWork on resolving various technical incidents for the Company’s customers involving various software, networking and hardware environments;\nMaintain deep knowledge of Company operations to support client/team technical requests effectively;\nState machine management via UI (creating/modification states), troubleshooting;\nInvestigation of bugs, logs analysis, route case system research;\nDevelop documentation regarding installation, upgrades, support, and compatibility issues.\n\nRequirements\n\n2 years of experience in an L2-L3 technical support;\nT3 Tech support with 2-3 years experience in AWS systems\nExtensive knowledge of SQL scripting;\nStrong ability to take ownership from initial report and follow through until full resolution and customer satisfaction;\nKnowledge of web technologies: HTML, CSS, JS, etc.;\nBasic knowledge of troubleshooting performance issues in a distributed microservices environment;\nExperience with monitoring/logging tools (Such as Grafana, Kibana, OpenTelemetry, Jaeger);\nProven record of working in a highly pressured multi-tasking environment and working independently;\nExperience with OpenVPN;\nGood communication skills and customer service focus;\nPassion for troubleshooting and ability to come up with efficient solutions for unordinary issues.\nUpper Intermediate English.\n\nWill Be a Plus\n\nAWS Cloud - Experience working with Cloud solutions or in Cloud software Support Team;\n2 years of experience as a Junior Node JS developer willing to do 6 months of Tech Support prior to joining the development team.\nWe Offer:\nCompetitive salary fixed in USD;\nPrivate Entrepreneurship formalisation;\nCozy office in Tel-Aviv AND Opportunity to work remotely from the whole world;\nSick Leave coverage;\nVacation – 17 working days (flexible, if you need more);\nWork within growing service company with prospectives for education and career advancement;\nParticipation in projects within the active development stage;\nThe friendly international team of strong professionals that will help you to achieve results;\nAgile management & internal mobility, no bureaucracy and initiative-friendly attitude;\nPossibilities for business trips abroad;\nCorporate team building events.Show more Report"}, {"company": "NeuroDerm", "job": "R&D Senior mechanical Engineer", "city": "Rehovot", "date": "24h", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=412&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8ac17255&cb=1676383303256&jobListingId=1008459243109&jrtk=3-1-1gp83mdh1jfn9801-1goos78nqjijq801-4be2779cf283b55c-", "description": "Development and design of products assembly, special tooling and fixtures\nMaking conceptual design, detailed design, CAD modeling and prototyping\nUtilize design analyses tools including theoretical calculations for components fit, tolerance analysis and stress calculations\nPerform evaluation testing and define components, sub-assembly and product level specs\nWriting technical protocols, tests methods and presentations related to design activities\nPerforming and/or supervising testing of new and existing products, writing and/or approve tests reports\nManaging activities related to ECOs\nSupport validation and verification activities of products\nSupport industrialization and manufacturing activities\nWork closely with internal interfaces (Engineering, Electronics, QA, HF, RA and software groups) as well as external interfaces such as subcontractors\nLead and support procurement of commercial off-the-shelf components\nLead projects activities with other R&D teams\nQualifications\nBachelor of Science or higher degree in Mechanical Engineering\n5 or more years related experience in products development and design\nProficiency in 3-D CAD software such as SolidWorks\nExperience with design for manufacturability (DFM)\nExperience with medical devices design is a plus\nExperience with medical industry standards is a plus\nKnowledge in assembly processes\nExperience with plastic injection, molds, and parts design\nExperience with sheet metal parts design is a plus\nKnowledge in PCB manufacturing\nExperience with mechanism design\nExperience with verification tests\nExperience with writing design requirements, protocols, test reports etc\nExcellent communication skills proficient in Hebrew and EnglishShow more Report"}, {"company": "R2Net Israel Ltd. - JamesAllen.com", "job": "Lead Software Engineer", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=413&ao=1110586&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_289829c2&cb=1676383304908&jobListingId=1008201334278&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83meuti3be801-1goos78nqjijq801-a64412e2e35b4369--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNB9cEcgCIbpx0cQF7JvNrbME9QSTOmNUhCioFKdnonZuSIJReA4DPLJ2SR0VhUwLBw-FPRpg88EVNF7HrpPORKLMwT6OeOza7SKIrOczzoN39-U6DI08IAGGoAADBW34zT5JWD4KOUv6L434ftVLIZuVgKMZjUnFGBRqSjdqQh3owKXVrMDbgmgYmGpF5mQxJMEcO2fWk8NFySJSDBWBNrP3zBc2XPcZ8JXBwFGLalZcYdCeI_dB9mH7AZOAjCuiPBlx8humTKntb2x214QNcoIuxkijUnfkczwObbSx7XPrf2pxo_reB8F_ppkrgj0y_KaVMFAHbwAdXrTc1guB-futR99z6c5-iBivrPX6AmZhC1x2pp6PIE5ugLPUXElGEFkEDEtqhouAn2Z6YLi7lkKQvVuJnqPj5BBmvrsb3rL_6rxpKEyf116wU34AvFoewPXMAe1g6crvBnTQmauR-m2zUcTpcWtciJ7zgLg75EWbmhFaD7zIz3b024JpC1E7o9ZLiCZ-ShF8cyuTugG52XkdAIY5IYRZMGMgX8CtmFCr_7xR5uASx_b7nD5Ts3on-d9EQ_w4XclJ2M2s_bDHKnTI1yyeUdkbBlvLYnf-1QANGv6q-7WXF7uTl96jm82dfKdyD2SlyUpi0p7KorPPssM", "description": "What’s It Like To Work For Us? At R2Net, we’re proud of our unique and diverse work environment, striving to employ people from many different backgrounds and cultures. Every team member has a voice within the company and contributes to our overall development. We provide ample opportunities for growth and cultivate a collaborative and entrepreneurial approach to our day-to-day work.\n\nAdditionally, it is very important to us to promote a strong work-life balance for each of our employees. Responsibilities: Take part in the architecture, design, development, and delivery of complex features in a distributed and dynamic development environment. A hands-on tech lead (80%) to lead a squad of Full-Stack developers; Technically manage, mentor, review, and improve the quality of the code and process. Write Javascript/Typescript for Node.js web services and React Web apps.\n\nWrite well-designed, testable, efficient code that complies with specifications. Experience in developing web applications using React. Experience in NodeJs and Javascript\\Typescript Development. Experience with DevOps tools; Docker\\ Kubernetes\\ CI\\CD.\n\nExtensive experience with full-stack development, distributed systems, and relational databases (MySQL or other). Experience in AWS or another cloud environment. Team player, strong communication skills, a positive attitude, and empathy.Show more Report"}, {"company": "Synopsys", "job": "Applications Engineer, Sr II", "city": "Herzliya", "date": "8d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=414&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_376761db&cb=1676383306984&jobListingId=1008439308354&jrtk=3-1-1gp83mh4s2tho001-1goos78nqjijq801-7876fbf33599dd6f-", "description": "42999BR\nISRAEL - Herzelia\nJob Description and Requirements\nEmulation has become an indispensable part of SoC designs verification with growing designs sizes and complexity. Synopsys is uniquely positioned to offer the market leading verification and Emulation Solutions.\n\nOur Application Engineers team works closely with local industry customers from early Emulation Platforms & Solutions pre-sales stages, towards planning, deployment and ongoing support.\nWe help our customers achieve their HW Verification and SW bring-up targets with our products, while working with R&D teams on improvements and future technologies in that space.\n\nThe Role:\nProvide our customers technical and engineering expertise in their ASIC design HW verification process, using our Emulation Platforms and Solutions:\nAnalyze customers verification methodologies and targets, platform and Testbench solutions planning.\nDrive and execute Synopsys Emulation products Evaluations on customers designs.\nSupport customers in deployment of the Emulation products, from RTL code compilation and synthesis, towards SoC-level full functionality bring-up on Emulator.\nHands-on bring-up of Emulation Testbenches, including interface protocol Transactors, memory models SpeedAdapters, C++ code, and automation scripts.\nRegularly interact with customers as their first contact to address any quality issue or required improvements in our products and their collaterals.\nWork internally with R&Ds to provide feedbacks on products, track development process and roadmaps.\nWork internally with Sales team on accounts strategy and business growth opportunities.\nJob Requirements:\nBachelors degree in Electronic Engineering or Computer Engineering.\nTypically requires a minimum of 2 years relevant experience in ASIC/SoC design and/or Verification\nprocess. Direct experience on HW Emulators or Prototyping platforms is highly preferred.\nProficiency in HVL languages like SystemVerilog/C/C++, Unix/Linux development environment, and scripting languages.\nKnowledge of key protocol’s like Ethernet, PCIe, AMBA, UART, DDR, and their usage in SoCs is a\nbig advantage.\nHW (RTL)/SW (C++/Scripts) Code Debug and troubleshooting skills are highly desirable.\nExcellent communication skills and ability to interact with customers as well as peers\nProven Self-learning skills and high motivation to gain expertise.\nTraining skills with ability to create and deliver high level of technical training material.\nJob Category\nEngineering\nCountry\nIsrael\nJob Subcategory\nApplications Engineering\nHire Type\nEmployeeShow more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "DevOps Team Leader/DevOps Engineer", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=415&ao=1110586&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2ee53899&cb=1676383308501&jobListingId=1006951632194&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83miiqkcmj801-1goos78nqjijq801-7227ba0f3926b37b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAcqJjt6X43WZUp1eOtFDmlTzoxlC0JoJreADayO0ObrvcHnJVjQMlVyFNGn_Ruqo0fWpFyhOUOho8QvGdBPFEAKBsVxr9UEGoRZIcJmvh3gd92wsRpwUgOLKVKzK125iEaKz0_Ybs2f7l7i7DDfQxUt_wfI8HUxHo8f9LJUz7qd34P7O_PrdzYN8cK4uLTplP4J6ZrRTFWS3qUTtm5HFhYC1YaEhXo3TzPhfuM9IYoVU7vaYbq4jqoSjIyaPBRvtuHQAHOBW76qed_9NLB3q7-NECJ31zwyab-kausgj6ZPJWPZmCLsllEpROemGKIB4Yngp3zUYaFCW1PZr1C7C2ppIHPh73tmMuht6RO_RsRF_FSL2IYlSSpvp0a589BRqRGu96D4KyUxiDB6AEbzxDXqhvM7F29kNzLJ1P6kvWt4BHYKt9-mKxMfYxQXsVn5sppTipO6WVchf3FBur8ONlwRymYKBeyr4Fo741IqgbXEsRoRdyyzjcNo2KFw2MqnPUePFoGDNETLvgWLci9ScMYfjR_aFtu5IrIPbz9DDFEvYLu41izhtjJ0Lp6UtVbyx31ejuz3uWH28ZEFkTlX1D1iCkWHtSVvoMCFedmrK0_aW6KVrSkrWlRfVED-g7Zb_QpRC7wZ8k57LqI3880JKlk", "description": "DevOps Team Leader B.Sc. in Computer Science. At least 3 years experience in team management Proven experience in designing and managing SaaS infrastructure. Experience in building CI/CD in a complex multi-service environment.\n\nArchitectural vision and ability to design scalable and secured cloud-based services. Linux proficiency as sysadmin on Debian and/or RedHat derived distros. Knowledge of network admin: TCP/IP, ssh, HTTP/HTTPS, SSL, NLB. Scripting skills: bash (must), ruby, and/or python.\n\nExperience with Git and familiar with one or more of Github, Gitlab, Bitbucket. Hands-on experience with AWS or similar public cloud. Docker and Orchestration tools (K8S). Monitoring tools (Prometheus, Icinga, Grafana).\n\nCreating and managing clusters of ELK, RabbitMQ / Kafka, Redis. Fluent Hebrew and English – oral and written. ******************* משרה נוספת - DevOps TL Deep experience with Linux system knowledge.(Redhat CentOS) – Must (min 3 years ) Scripting and development skills – Must. (min 3 years ) Experience as a TL DevOps - Must.\n\n(min 2 years ) Experience with networking and configuration management tools .(Ansible/puppet/ Terraform) – Must Knowledge in Linux OS building and customization. Experience with Docker and Kubernetes. Passionate about new technologies. DevOps Engineer 4+ years of experience in a DevOps role Extensive experience in both application development as well as operational support for large, high scale applications Experience with Hashistack - terraform, consul, vault, and nomad Experience with Kubernetes Experience with running Dockers in production Knowledge of at least one of Ruby/Go/Java/Python - more than one is an advantage Experience with automating Cloud Computing platforms (particularly AWS) Understanding of Chef/Puppet/Ansible ****** Knowledge of the ins and outs of cloud providers (AWS, Google Cloud, etc) 3+ years Experience in DevOps or Software Development using the Ops toolset in the industry/Army unit Experience working in an algorithmic/data science system (an advantage) Excellent knowledge of Linux Good knowledge of Docker Good Knowledge of Terraform or similar IaC tools Coding skills (Python / Ruby / JS / Golang) Understanding of CI and CD concepts Working with databases (RDBMS or NoSQL) and large, complex data sets Good understanding of DevOps methodologies and infrastructure level tools Performance monitoring and tuning Understanding of security best practices, both for application (OWASP) and for the organization (SOC2 and the like)Show more Report"}, {"company": "JobInfo", "job": "Staff Software Engineer", "city": "Israel", "date": "6d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=416&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e53d8a15&cb=1676383309880&jobListingId=1008446727455&jrtk=3-1-1gp83mjstp6d7801-1goos78nqjijq801-c4856818fccc2a0e-", "description": "Job Description:\nyou have a unique opportunity to work on cutting edge technology as part of our high-performance global project teams.\nAdditional Positions:\nBackend C++ Linux, Driver/Kernel developer, C++ Developer, Real-time, C Developer\nLocation:\nHybrid, Sharon area\nCategory:\nSoftware\nJob Qualifications:\n\" Bachelor, Master or PhD (computer science or electronics engineering) with good academic record\n\" Professional experience developing C/C++ software\n\" Experience with leading software project or mentoring junior engineers\n\n\" Experience with Linux or Android development environment, preferably working on driver or middleware development or graphics application development\n\" Knowledge of graphics technology and standards such as Vulkan, OpenGL/OpenGL ES/EGL, Direct3D\n\" Experience of performance/function modelling, profiling and analysis\n\" Experience with agile development process is a plus\nCompany Occupation:\nData security, High Tech, Internet related\nCompany Size:\n500+Show more Report"}, {"company": "JobInfo", "job": "Team Leader/Staff Software Engineer", "city": "Central", "date": "6d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=417&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_85cb8f67&cb=1676383311196&jobListingId=1008446727815&jrtk=3-1-1gp83ml8ukbmr801-1goos78nqjijq801-2e0bf6f91a685723-", "description": "Job Description:\nyou have a unique opportunity to work on cutting edge technology as part of our high-performance global project teams\nAdditional Positions:\nBackend C++ Linux, Driver/Kernel developer, Team leader, C/C++ Team Leader, RT Team Leader\nCategory:\nSoftware\nJob Qualifications:\nBachelor, Master or PhD (computer science or electronics engineering) with good academic record\n\nProfessional experience developing C/C++ software\n\nExperience with leading software project or mentoring junior engineers\n\n\nExperience with Linux or Android development environment, preferably working on driver or middleware development or graphics application development\n\nKnowledge of graphics technology and standards such as Vulkan, OpenGL/OpenGL ES/EGL, Direct3D\n\nExperience of performance/function modelling, profiling and analysis\n\nExperience with agile development process is a plus\nCompany Occupation:\nData security, High Tech, Internet related\nCompany Size:\n500+Show more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "Senior QA Engineer", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=418&ao=1110586&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fb981ab3&cb=1676383312417&jobListingId=1008075714601&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83mmevjoq1801-1goos78nqjijq801-c7899e9c485291bc--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCxIMfqP5lsjwVDinN3PwsynvlqIOR7H15_csd7yZaCvZLNjnACioMhM3zClr_t9CscIjLAfHgMHF9pjqc7wwPXKIw7VVXS987qQsskTSlksSkC01xkrCZ3e6MDgZQwlURHSvS4B_y3X06chkW3WPS9QkvwowBYuOtcCI_cnib7_YI5Apd0XLwZONnRQbiN9ct1m_o1sYk5DihQPqiVDP4V9JYm2zzANCa35TmhI-ooloN37DAKB9d7-FM6RdJa2eCz4RmCg7Gr4sHbseIE88z7MSReMR8x7GPzvl2_JQI6ljc1uQn2Yg2irl5sUopAFFcg6oOchPw6K0BROXbaT2ZBZGrwbA4JMMBBGyObZ0OsUma9fRWAdqrvG5_dg_ri2lE6m8oKCN4ByLzuQZDQ6tM2y7h72GYXolD_AOuOUr7SbtTlhx-akokgvCgtUzUhZ29y5OmKmWInaWbsCLKBk9BOKWMDKDtrRJvhPF7_q2L9yEyRXdG5GlCwuSObT6760Cf-26pMvGJMq70FqqMuV-0cm8mw0JjnkCKYTGJdXEwnibXG3jKsWqSW6dLlbDXGoG8uskDCivhJEYooblq2z0nswn2VMIYV2Fj8sbGeqwMLqmX_vHv5XnMJfyMDDHnFxCLK7UZ2eeul3rSehFjiqGjs", "description": "QA Tech Lead 5+ years experience in planning & executing manual/automated test plans Ability to lead the QA process in the group- define processes, review test plans, guide testers and more. Strong technical and analytical skills Knowledge in Java- advantage Experience in testing SaaS application - advantage Working experience with SQL - advantage ידני ואוטומציה- 50/50 ********* Testing Engineer At least 2 years experience as a Test Engineer Experience with Linux Experience programming in Java/Python Experience with a cloud platform such as AWS, GCP, K8S, MS Knowledge of End-to-End testing, API, Microservices, and backend testing methodologies Strong hands-on experience in designing and developing automation frameworks Knowledge of Networking Excellent teamwork skills העבודה משלבת בדיקות ידניות ואוטומטיות QA Lead At least 2 years experience in building, scaling and leading a QA team in a startup that included automated and manual testing procedures. At least 5 years of software quality assurance or test automation experience in embedded or automotive systems. Expertise working in a CI/CD environment.\n\nExperience in Linux. Good programming skills in common languages, such as Python, BASH. Strong experience with test automation frameworks and scripting. Extensive knowledge in performance tests using tools such as Kibana, ping, iperf, wireshark, etc.\n\nSolid knowledge of software quality assurance methodologies and tools. Knowledge of Scrum/Agile software development process. ********* Senior QA Engineer 3+ years of experience as a QA engineer 2+ years of experience with automation testing tools, such as Selenium, Cypress, Testim, or similar Experience working with Postman. Experience working in an Agile environment Experience in querying databases like MySQL, Postgres, or MongoDB Experience in managing development processes with Jira or other process management tools Familiarity with forensics and monitoring tools (Sentry, Grafana, Prometheus)Show more Report"}, {"company": "VMware", "job": "Senior Success 360 (S360) Customer Success Manager - Opportunity for Working Remotely , Jerusalem", "city": "Jerusalem", "date": "5d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=419&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e3ea0554&cb=1676383313718&jobListingId=1008447390448&jrtk=3-1-1gp83mnm2jopl801-1goos78nqjijq801-4d6cc3aee947b773-", "description": "Senior Success 360 Customer Success Manager\nWhy will you enjoy this new opportunity?\nDo you enjoy helping Global and Enterprise organizations achieve their business outcomes through their technology investments? If you do, we have the perfect job opportunity for you!\nAs a Success 360 Customer Success Manager, you will serve as a trusted advisor, driving a cross-functional, unified customer experience for our customers during their transformational journey with VMWare.\nUpon joining our Customer Success team, you will play a critical role in delivering the Success 360 offering for enterprise customers by enabling them to rapidly and successfully onboard, adopt and realize business value with harmonized digital and in-person engagements across the entire customer journey.\nIn the Customer Success Manager role, you will interact daily with your assigned customers, helping them to achieve onboarding and activation milestones in driving product consumption. You will also jointly develop Success Plans with each customer to align their technology objectives to business outcomes.\nAs a Customer Success Manager, you be able to create a long-term relationship with your assigned customers as you develop an understanding of the customer’s desired business outcomes, focusing on maximizing value realization across their VMware portfolio.\nSuccess in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing?\nDuring the first year, you will onboard into the Customer Success role and work with your assigned customers.\nUpon joining the Customer Success 360 team, you will be guided through a well-organized four-week onboarding plan that will be prepared for you.\nAfter onboarding, you will be assigned your first S360 accounts and work to establish ongoing cadence for account meetings with the customer, the account team and internal resources to understand the customer’s current and planned VMware production adoption and use cases.\nOne month after engaging with your customers, you will be able to articulate customer key business objectives and desired outcomes and begin crafting a joint Success Plan with the customer.\nYou will establish ongoing cadence for account meetings with the customer, and orchestrate internal resources to progress toward achieving key milestones.\nYou will create your Success Plan in Gainsight and record all customer activity and milestones throughout the customer journey.\nWithin 3 months of your joining date, you will be able to present your achievements in a Quarterly Business Review using the internal tools and deliverables that we will provide to you.\nYou will collaborate with internal resources to understand customer use cases and identify opportunities for prescribing Adoption Guidance and Workshops to further adoption and consumption.\nYou will proactively monitor customer health, identify expansion opportunities and mitigate renewal risk.\nDuring months 6-12, you will continue to drive business priorities within your assigned accounts and contribute to improving the overall Success 360 practice.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will ensure best-in-class execution; Develop and implement changes in both the customer's and VMware's operations systems that directly add value.\nThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?\nAs part of the s360 Customer Manager team, you will be working throughout the S360 subscription period with several assigned and strategic customers. The activities you will perform are all aligned with the purpose of helping our customers achieve their desired business outcomes through VMware technology. You will orchestrate the adoption and consumption of the VMware technologies the customer has purchased.\nYou will also be collaborating with the broader VMware account team and specialists as you perform the following:\nYou will have a track record of experience in customer success, in an enterprise software or SaaS organization, with a proven track record of successfully managing complex customer relationship in technology.\nYou will develop excellent understanding of VMware and associated technologies.\nYou will keep track of business and technology trends seen in market and hold one or more industry certifications in areas of interest.\nYou will possess robust inter-personal skills and ability to build relationships with internal and client stakeholders (including business and up to C-suite).\nYou will have experience developing and driving business cases that outline value to customers.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will demonstrate ability to manage multiple customer accounts, projects and deadlines simultaneously.\nWhat is the leadership like for this role? What is the structure and culture of the team like?\nThe Global Success 360 team is focused on driving strategic customer outcomes, while enabling our customers to derive maximum value from their VMware solutions. We provide a unified governance model to ensure we are acting as One VMware on behalf of our customers.\nWe strive to have a diverse and unified team, one which is focused on our customers and their success while contributing to a positive team culture. We are an open team who share best practice and collaboration amongst our colleagues. We give back to each other and our communities and welcome innovation and creativity at all levels, to be a meaningful contributor in our countries and societies.\nWhere is this role located?\nFlexible: The role is considered remote (based in Germany) and working from your home office unless otherwise specified by your future manager. You may be required to travel to VMware planned events and to meet with your customers and account teams (up to 25%).\nWhat are the benefits and perks of working at VMware?\nYou will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com.\nMedical Coverage, Retirement, and Parental Leave Plans for All Family Types\nGenerous Time Off Programs\n40 hours of paid time to volunteer in your community\nRethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities\nFinancial contributions to your ongoing development (conference participation, trainings, course work, etc.)\nWellness reimbursement and online fitness and wellbeing classes\nCategory : Services and Consulting\nSubcategory: Customer Success\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2023-02-02\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Show more Report"}, {"company": "Albert Technologies", "job": "R&D Support Engineer (Tier 3 Support)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=420&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d32def54&cb=1676383316455&jobListingId=1006048246395&jrtk=3-1-1gp83mqdamfph801-1goos78nqjijq801-1f27589abb23e7ba-", "description": "Responsibilities:\nThe R&D Support Team is the top tier of technical support at Albert. As part of the team you will:\nProvide R&D level (Tier 3) support for Account Managers, Professional Services, and Data Researchers.\nHandle day to day activities in terms of deep investigation of support tickets, escalation handling, monitoring alarms, and alerts.\nWork with developers and product teams to resolve problems in production and deliver fixes.\nRequirements:\nRequirements:\n2+ years of proven experience as a Tier 3 support engineer.\nBachelor’s degree in information systems, software engineering or equivalent.\nHigh-level of troubleshooting production bugs, logs analysis, and performance troubleshooting.\nVery eager to dig into technical support issues to figure out the root cause.\nExperience with SQL scripting.\nWillingness to work in a start-up software company.\nBring a positive, collaborative, team-oriented attitude to the office and your customers every day.\nAdvantage:\nBackground in Python programming, Javascript.\nBackground in the online marketing field.\nFamiliarity with Facebook Business Manager, Google Adwords, Google Analytics.\nJOIN TO US\nSend your CV to cv@albert.aiShow more Report"}, {"company": "Nano Dimension", "job": "Engineering NPI Leader", "city": "Ness Ziona", "date": "21d", "rating": "3.7", "link": "", "description": "Nano Dimension (Nasdaq: NNDM) is a leading electronics provider that is disrupting, reshaping, and defining the future of Additive Manufacturing systems for electronics.\n The Engineering Department at Nano Dimension is looking for an Experienced Mechanical/ Electrical Engineer to join the NPI HW Matrix Team.\n Nano Dimension’s Engineering department is part of the operation division. The Engineering department is responsible for all manufacturability and sustainability aspects of Nano’s multidisciplinary products.\n We simply do things differently. What about you?\nResponsibilities\n You’ll be acting as Engineering NPI Leader, joining the Engineering Matrix team: Hardware Leading team at Nano Dimension.\n What will you do as Mechanical/ Electrical Engineer in the Engineering Department?\n Be A Leader, responsible for all the product engineering activities and changes\nWork with R&D to withstand engineering standards and Demands\nGet clear definition from the clients (project managers, Production, Service department) and plan the mechanic own activities accordingly\nLead and implement CAD Designs, ECO (models and drawings)\nYou'll be a part of Engineering responsibilities – design for cost, cycle time, reliability, and manufacturability.\nWrite technical documentation (assembly instructions, calibration instructions, test plans, etc.)\nMechanic/ Electric design is focusing mainly on Electro-mechanics (motion mechanisms, etc.), Cabling, Chassis & production support tools (jigs and fixtures)\nWorking with Nano’s suppliers, mechanical lead, and supplier NPI readiness\nPlay as technical information pivot with operations dept.\n#LI-Onsite\nResponsibilities\nWhat will make you succeed in the role?\nProduct Leader in a multidisciplinary company\nMinimum 3 years of Mechanic/ Electric design.\nExperience in Engineering/NPI.\nBSc Mechanical/ Electrical Engineering.\nExperience and Knowledge in CAD SW, SolidWorks, Windchill, PDM.\nProduct BOM builds & maintenance by ECO’s via PLM (Windchilll) interface with SOLIDWORKS\n\nGroup:\n\nNano DimensionShow more Report"}, {"company": "Transmit Security", "job": "Senior Frontend Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "", "description": "Transmit Security gives businesses the modern tools they need to build secure, trusted and end-to-end digital identity journeys to innovate and grow. CX-focused, cybersecurity conscious leaders rely on Transmit Security's xCIAM platform to provide their customers with smooth experiences protected from fraud across all channels and devices.\n\nTransmit Security serves many of the world's largest banks, insurers, retailers, and other leading brands, collectively responsible for more than $1.3 trillion in annual commerce. For more information, please visit www.transmitsecurity.com.\n\n\nAbout the Role:\n\nWorking with the latest and most advanced front end libraries and frameworks will be part of this role. Developing portals and SDKs aimed at end users (B2C), developers and company administrators (B2B).\n\nEstablishing a shared FE infrastructure and building a consumer-facing app that integrates ML and human interfaces with the product and design teams.\n\n\nWhat you'll do:\n\nImplement features for a newly developed React-based product (portals and SDKs).\n\nIntegrate different Front End libraries into our infrastructure and experiment with them\n\nCollect requirements from different product groups.\n\nWhat you'll need:\n\nDeveloping consumer-facing apps for over five years.\n\nReact.js and NodeJS experience\n\nYour passion for design and delivering new products is contagious.\n\nAdvantage for\n\nCustomizable apps experience\n\nEmbedding camera input into web applications\n\nEmbedding computer vision/data science algorithms\n\nMobile web development\n\n#LI-TL1 #LI-HybridShow more Report"}, {"company": "Tipalti", "job": "Engineering Support (Tier 3)", "city": "Tel Aviv", "date": "1 day ago", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=423&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e2ca77d9&cb=1676383326681&jobListingId=1008456399435&jrtk=3-1-1gp83n4cgis1r801-1goos78nqjijq801-104994f69c52727d-", "description": "As a Technical Support Engineer, you will take ownership of technical escalations and serve as a focal point for all the Operation teams. You will also investigate highly technical and complex issues while working closely with the engineering teams.\n\nyou will be responsible for providing expert technical support to our customers and internal teams during complex projects related to integrations and migrations. You will have to be familiar with reading system logs, and have experience with JSON data structures.\n\n\nYou will be expected to take part in maintaining the trust of our customers and be required to consistently collaborate with our internal Operation teams to identify and handle a wide variety of complex use cases until resolution.\n\nResponsibilities\n\nTake ownership of technical escalations and serve as a focal point for all related teams.\nProvide technical support for integrations and migrations projects, including troubleshooting and resolving complex technical issues.\nInvestigate and resolve technical issues related to ERP systems and their integrations with other systems.\nAnalyze system logs to identify the root cause of technical issues.\nCollaborate with cross-functional teams, including engineering, product, and operations teams, to resolve customer problems efficiently.\nMaintain internal documentation and performed knowledge-sharing with team members.\n\nRequirements\n\n3+ years experience in a Technical Support role or other related fields.\nProven experience with databases and high-level SQL queries (SSMS, MongoDB).\nExcellent troubleshooting, problem-solving, and analytical skills.\nExcellent written and verbal communication skills in English.\nAbility to understand complex flows and work in collaboration with the R&D department\nFamiliarity with API (SOAP and REST), reading XML, and JSON files– Advantage\nFamiliarity with GraphQL and API clients such as PostMan - Advantage\nStrong familiarity with enterprise resource planning (ERP) systems.\nAbility to understand complex flows and work in collaboration with the R&D department.\nProven track record of successfully managing complex technical issues.\nWorking in shifts - Night shifts will be done remotely\nMulti-tasking, self-learning, highly motivated, and a team player!\n\n#LI-LA1\nCompanies like Twitch, Twitter, GoDaddy, and Roblox entrust Tipalti to scale their business rapidly and dramatically reduce finance friction. Headquartered in San Mateo, California, we're a well-funded startup with a multi-billion dollar valuation.\n\nBut beyond the technology and impressive growth, Tipalti is fueled by a commitment to our customers. We work hard for our 98% customer retention rate built on trust and reliability. Tipalti means \"We handled it,\" a mission our customers know we deliver consistently.\n\nAround personal growth and wellness, Tipalti oﬀers competitive benefits, a flexible workplace, career coaching, and an environment where you can thrive and be an impact player! Our culture ensures everyone checks their egos at the door and stands ready to reach success together. We also dedicate ourselves to diversity and equal opportunity for all.Show more Report"}, {"company": "חברה דיסקרטית", "job": "System Design Engineer , מהנדס/ת תוכנה/אלקטרוניקה/מכונות, 5 ש\"נ+נסיון במערכות אלקטרומכניות", "city": "Tel Aviv-Yafo", "date": "5d", "rating": "4.4", "link": "", "description": "\nצפון: לחברת הייטק דרוש/ה System Design Engineer * עבודה בצוות מו\"פ, מהנדס/ת תוכנה/אלקטרוניקה/מכונות, לפחות 5 ש\"נ, ניסיון במערכות אלקטרומכניות – חובה, ניסיון ב- AI & deep learning - יתרון * העבודה מחולקת בין אתרי החברה* *Responsibilities*: 1. Lead the development and implementation of multi-disciplinary systems consisting of multi-platform software, custom firmware and electro-optic-mechanical hardware. 2. Defining hardware specification and software API in internal and external teams.\n\n3. Research lab hands on activities – such as platforms bring up, prototyping, , performance testing, etc. 4. Generate end to end system analysis and research results reports 5.\n\nWork in 2 different sItes, with R&D team *Job requirements*: 1. B.Sc in Software Engine ering/Electrical Engineering/Mechanical Engineering 2. 5+ years of multi-disciplinary system development/system integration 3. Problem-solving skills and debugging of high complexity systems 4.\n\nHands-on experience with lab equipment 5. Experience in electronics, opto-mechanical systems (advantage) 6. Theoretical background in AI & deep learning (advantage) 7. Fluent English 8.\n\nCommunication skills 9. Ability to work under pressure and a tight timetable שכר: 25-30K העבודה בשני אתרי החברה בצפון המשרה מיועדת לגברים ונשים כאחד. נא לשלוח קו\"ח מעודכנים במבנה וורד וציפיות שכר רק פניות מתאימות ייענוShow more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "Full Stack Team Lead", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=425&ao=1110586&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2160dd12&cb=1676383336175&jobListingId=1006944362872&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83ndjpihn6801-1goos78nqjijq801-1e502af9e142b0ca--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBVSq59hMj37vo_SZbFmyeNDw729jAyZ_VsYsPvwoXE73RJQwp74kdwW-ol2xRbUo6dCgn14anAqP-O_0a1ceAkslOvzhZ8ITbv83Lurh-B_K0YRU13BKQauwxpDFy1e8LAUBWItqq-jLc9N8Yx4whLHIyFPM6Bz_n2i8NlhIInvego-j2xpmv27onnJtooEcCnXcPHzY0UKqU9lIUoRPXCkMSbv_X0LjqbOf9QWbxOF4MZxrN2il9KwMSDNcMVFNGR86y9iMTHtf3Ek71stzcVvcsZUxIK_SLAw4NldxwN1Ni52q3v9jC4Ln3HT_vsFhn2nUGdaNVPym0tdOa5PLtpavxuET0u0wvKQ7jJDXtVhJKxAZKf-wBjp6dnx7UW_lXpEeQuLjJl8lHgekuVlUET4_-u-mZc9sYgAHnrPDkeql3hQYRX4pEre_mS5kCYLhX39dWXqrRv2bNCFuOZDXkhpdIgpSaVr_dnyKHxVp0GO3RrIO2MoGkQEPS1Be7Ng8J1OdaPVHctTqmkFGHYOq6Sk3VmDEV3LBahKzIOs6cJCwYPIq7bs3Tvt3aidIFElecoRq2Bx9_cZmfdHG8RjpTgsWV6k3kuU357P3uYykgkYcvWrkqcp7MEZnypIzHRdCFJ2cyj0Ze9osRRAjnoqyQK", "description": "Full Stack Team Lead 3+ years of managerial experience, leading teams and directly managing engineers 5+ years of hands-on experience in full-stack development (preferably using Python or Javascript\\Node.js). Solid cloud experience, working either AWS, Azure, or GCP. Including Lambda, DynamoDB/CosmosDB, and containers. Experience with React or another contemporary library\\framework.\n\nExperience with CI\\CD methodology. ****** Full Stack Team Leader At least 3 years of experience in managing full stack teams. Extensive experience in design and development of web applications. At least 3 years of experience in server-side development with one or more of the following languages: JS (node), Java, Scala, Python, Go At least 2 years of experience in client-side development, using one or more of the following frameworks: Angular, React, Vue B.Sc in Computer Science or equivalent Experience with Relational and NoSQL databases Experience with Linux environment and containers (docker) Experience with SOA, microservices and kubernetes Full Stack Team Lead 2+ years experience as a team leader 3+ years of experience as a Software engineer, working with Node.js, React Proven working experience in AWS cloud environment or similar Proven working experience with a container environment.\n\n************** משרה נוספת - Full Stack Team Leader 4+ years of Hands on experience in full stack development. 2+ years of Hands on experience in React & Node.js. Experience in designing & building of high-scale systems. Experience with cloud architectures (e.g AWS) 1+ years of experience as a full stack team lead erShow more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "Software Team Leader/R&D Team Leader", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=426&ao=1110586&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b8244d3a&cb=1676383337454&jobListingId=1007211429997&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83netbk6ep801-1goos78nqjijq801-81deb5a180fbc18b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNByw7tVZ4pjWgFpQz6ckYuMmeQSvwIsTgjuLuiYKM71WXNfR1gDPOfZuZVXWo4hIZjru7wzlgDA17SJ3aeFSw5pwAe9ih24j7fhXLul3pv0dZfAZBY1eFTdx5GUyoWqFmf2F2R073Foo4onCTt455Bk53wMotJlYzu1bfN5uxTSfE7wPpwEnY7Hj9VsrvgErl1hvM1FD9zYUk7_HYpwZ99nZrY6ztZ4XAYa4KsQku8JlAjcGBagPvLve5xD-8VYBLD5wpkBf3C3Joj4ow3MZiYfsde2fJHZ_D00QCtymEWaN3w2mQHLBQr7Jr6KoHRZPsK8dSo0E6i-6_AEMPFf733I-hY-h1jwaxHCEyXyojgFVq5E3n_CEE0Djbzra9fRf1karmXDOL1u9CGuEXMVFpcwgwo5MEewOO2HzcozfryE7gp9CssTV76CPXZZiUEWeVKRup72C6lXnxdeDh7G8BQP6MC6vocZ0ksB7Gv4X4o44ejqzErs43THOc5rYTfiS9SCgiH8bWDUfO3hq6Q3yyqHpW8T5VgREmshd7RXiY0b-gLA9wmB7b2-Bjb_RW7RZQRe4OLe2FU-ptaBlUaMdB_wLxNtiS0OgsVU4RNV3U5neD97XZCfBhUQwPwWYMOhAVdR2f-00Z1t5l-gNh1VvrIw", "description": "Cloud senior team leader 3+ years’ experience in managing large (5+) teams of highly skilled developers, and the ability to lead, coach, guide, and influence them 5+ years of full-time experience in cloud or Full-Stack engineering positions B.Sc. in Computer Science or related field, from a leading university ********* Software Engineering Team Leader 5 years of experience as a software engineering team leader/ manager 5+ years of experience in large-scale backend development in one or more of the following languages: Python, Go, C++, Java, C#. Experience in building and deploying systems in AWS cloud. ******* 2+ years of experience as a team leader must 5+ years of experience in Javascript is a must 5+ years of experience in server-side technologies (NodeJS, Java, Python, Ruby, Go).\n\nExpertise in databases such as ElasticSearch, MySQL, Cassandra, etc. Experienced with dockers and K8s. Software Engineer Team Leader – Vue JS/React & Node JS BE, B.Tech, MCA/Other Engineering graduates having experience in Software development. 3+ years of TL experience leading a team from recent years in a SCRUM methodology.\n\n5+ years technology leadership experience utilizing industry-leading open source stacks Vue.js/React , Node JS, .Net, C#, WebAPI - must Javascript / ECMAScript 6 / TypeScript - must SQL Server, MongoDB , other RDBMS -must AWS Cloud - must ******** At least 5 years experience developing backend with low latency in C++ linux environment. Team leader of 4 people or above for at least 2 years Knowledge in rational and no-sql databases ********** R&D Team Leader 5+ years of programming experience. Experience in backend development - Java, node.js. Experience in JavaScript and Client side technologies like - React.\n\nExperience in AWS cloud computing.Show more Report"}, {"company": "Apple", "job": "SRE and MLOps Senior Engineer - Imaging and Sensing Group", "city": "Herzliya", "date": "7d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=427&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0aadbfc5&cb=1676383339355&jobListingId=1008440455379&jrtk=3-1-1gp83ngosmfoo801-1goos78nqjijq801-bbdb064453f18221-", "description": "Summary\nPosted: Jan 30, 2023\nRole Number:200460287\nWe’re looking for a high-energy, highly motivated Senior SRE that will be a key member of the SW Infra & Tools team within the Imaging and Sensing organization, which is responsible for developing depth, photography & AR/VR related solutions and use cases. As part of the team's responsibility, we also develop and manage MLOps tools. The role would be a senior-level position with broad responsibility for ensuring the reliability, performance, and scalability of the team’s cloud-based web applications as well as smaller scale in-house and on-premise compute solutions and resources. In addition to the SRE responsibilities, this role will also include some tasks typically associated with MLOps roles. The Senior SRE will work in collaboration with other SRE teams in the organization to apply solutions or processes already available in other teams and will have supervision over another DevOps engineer in the team. KEY RESPONSIBILITIES: Migrate the team’s web applications to the cloud Implement maintain monitoring and alerting systems to proactively identify and resolve issues Collaborate with the development team to identify and resolve performance and scalability bottlenecks and conduct performance testing and optimizations Automate deployment, scaling, and management of the team's web applications while using infrastructure-as-code methodologies and tools Develop and maintain documentation on processes, procedures, and standard methodologies Writing code and CI/CD pipelines (Jenkins) to maintain and provision production/staging/development environments\nKey Qualifications\n7+ years of experience in similar roles\n5+ years supporting large scale in production applications in an SRE role\nStrong experience in cloud computing, with a focus on AWS\nPractical real-world experience with containerization, virtualization & orchestration technologies such as Docker and Kubernetes\nExperience with configuration management & infrastructure as code tools such as Terraform, Pulumi, Ansible, Puppet, or Chef\nExperience with monitoring and alerting tools such as Prometheus, Grafana, Datadog, New Relic.\nProficiency in Python and Bash\nExperience with large data systems and both relational, columnar and analytical databases\nKnowledge in networking protocols & technologies such as TCP/IP, SSL/TLS, CDNs is highly desirable\nProven understanding of Linux (macOS knowledge is a plus)\nExperience with machine learning and data science tools is a plus\nExcellent communication (verbal & written) and collaboration skills\nOrganized and detail oriented\nDescription\nThe Imaging and Sensing group at Apple develops algorithms for scene understanding and depth sensing using active (e.g Lidar and True Depth cameras) and passive (e.g Monocular and Stereo RGB cameras) sensors for enabling features for Photography, AR, and more. This multi-disciplinary group of engineers is responsible for research, architecture, design, and development of future Apple products and technologies.\nEducation & Experience\nBachelor's or Master's degree in Computer Science or a related field\nAdditional RequirementsShow more Report"}, {"company": "Enghouse", "job": "Customer Support Engineer, Level 2", "city": "Central", "date": "8d", "rating": "3.3", "link": "", "description": "Who we are:\nEstablished in 1984, Enghouse Networks, a subsidiary of Enghouse Systems Limited (TSX:ENGH) has grown into one of the world’s most reliable telecommunications technology and solutions provider.\n\nOur commitment is to successfully deliver solutions that can enable digital transformation , ultimately building a connected global community.\n\nFrom edge to cloud, we support service providers to plan, design, engineer, monitor, protect and simplify network complexity in a vendor-agnostic NFV and SDN ecosystem.\n\nOur portfolio of solutions can enable services and revenue from 5G, IoT, AI and Cloud TV technologies.\n\nThe role\nWe are looking for a Tier2 maintenance and technical support engineer who will be responsible for:\n\nSupport and maintenance activities of Enghouse (Veraz/Dialogic) products deployed at regional and global Telco operators.\nServe a focal point of contact to assigned accounts for post-sale technical support.\nLead and perform analysis of equipment failures, guide on solutions and develop methodology and documentation for maintenance activities.\nInteract with global R&D, Product Management and support teams for developing solutions relevant to customers.\n\n\nWhat you bring\n\nAnalytical and self-learning skills, ability to work alone and in team to solve problems in voice/computer systems.\nExperience and working knowledge of Linux & Windows OS and IP networks\nHigh level verbal and written skills in English & Hebrew, additional languages are advantage.\nCommunication skills – ability to communicate the progress of work or projects\nAt least one year of working experience for service provider or software development company in either developer, QA or support roles.\nFamiliarity with Voice networks (Protocols SIP, MGCP, SS7) or BSc in Computer Science or Electronics Engineering is a plus.\nAccountability - makes & keeps commitments; meets schedules & deadlines & completes assignments, projects & goals within given timeframe\nOpenness to changes & new information & behavior adaption & work methods in response to new information\nCustomer service orientation\n\nWhat we offer:\n\nCompetitive Salary\nJoin a global diverse and growing team!\nWorking with Cloud and other cutting edge technology\nGrowth opportunities\nBenefits and vacation\nWork-life balance\n\n\nTo apply for this opportunity, please send your resume in English.\n\nWe thank all applicants for their interest; however, only those selected for an interview will be contacted. Enghouse Systems is an equal opportunity employer.\n #LI-EN8\n\n #LI-RemoteShow more Report"}, {"company": "CYREN", "job": "Tier 3 Tech Support Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=429&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9e17d152&cb=1676383342058&jobListingId=1007968115702&jrtk=3-1-1gp83njcfi7ma801-1goos78nqjijq801-e0268446edb93a0f-", "description": "Position Overview:\n\n\nThe Tier 3 Tech Support Representative serves as the final point of resolution for Cyren customers encountering problems with our products. You will troubleshoot and resolve complex technical issues that may impede our customer’s ability to use our solutions, addressing customer issues with a calm and methodical approach that instills confidence and ensures customer satisfaction. You will need to become a subject matter expert for Cyren products and ensure quality of service and SLA compliance.\n\n\nResponsibilities:\n\nEnsure Cyren is delivering high quality customer service via telephone and email or other appropriate communication channels.\nSupport internal and external customers on Cyren’s cloud security solutions.\nAct as Subject Matter Expert in select technological areas to support team members.\nAcquire and document in-depth technical knowledge of Cyren products and services.\nReconstruct complex customer environments in order to optimize our products.\nHelp customers during installation and operation of our solutions.\nMaintain a high level of awareness to email security topics, fraud and spam risks, prevention techniques and technologies.\n\nSkills and Experience:\n\nExcellent troubleshooting and problem-solving skills.\nKnowledge in networking: standard internet protocols and ports, network monitoring and analysis tools, configuration of network devices (switches, routers, firewalls)\nKnowledge of Linux: system and network configuration, software installation, troubleshooting, bash scripting, etc.\nAdvanced knowledge of Microsoft Windows: system and network configuration, registry, software installation, troubleshooting, scripting, Active Directory, etc.\nGood understanding of: DNS, Web proxies, Email servers, mail protocols, Web categorization, Web protocols, Anti-Spam and Anti-Malware solutions\nHigh motivation for innovation and ability to explore and drive new ideas and technologies, think and learn independently\n3+ years of experience in tech support\nWillingness to work on-call shifts 24/7\nExperience with virtualization infrastructure, private and public: VMWare, Hyper-V, AWS, Azure, or Rackspace - advantage\nProgramming or scripting experience - advantage\nAbility to work in a distributed and multi-cultural environment\nFluent in EnglishShow more Report"}, {"company": "Apple", "job": "Senior Data Scientist / DNN engineer - Imaging and Sensing Group", "city": "Herzliya", "date": "14d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=430&ao=1136043&s=58&guid=0000018631c3a272b0e0c66396f7902f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fa6712f9&cb=1676383344684&jobListingId=1008426276179&jrtk=3-1-1gp83nlun2dus001-1goos78nqjijq801-849b842a273e137c-", "description": "Summary\nPosted: Jan 23, 2023\nRole Number:200395033\nThe Imaging and Sensing group at Apple develops active sensors from the LiDAR Scanner on the iPhone Pro to health monitoring on the Watch. Our team comes from diverse backgrounds, including signal and image processing, statistics, machine learning, controls, physics, hardware and software development. We are looking for a highly capable and creative Senior Data Scientist to analyze and interpret Biomedical signals from real world human studies. The ideal candidate is a technical leader with proven track record in Data Science and in Deep Neural Networks. We are looking for a substantial experience in leading data science efforts, and is excited about proving feasibility of new sensors. In this role you will take a meaningful part in exploring, inventing, and implementing new ideas to address unsolved challenges and be part of a small and exceptionally talented team of researchers and engineers. * Visualize and deeply understand data from large datasets of real-world human studies * Design and prototype deep learning architectures to process data from new sensors for tackling unsolved challenges * Join forces and work with top researchers and engineers from Apple sites worldwide * This role involves significant hands-on work\nKey Qualifications\nMinimum 3 years as a technical lead in deep learning with profound knowledge in deep learning techniques.\nMinimum 5 year experience as data scientist with strong and creative data visualization skills.\nAt least 7 years of hands-on experience.\nExperience with statistical analysis of large datasets from real-world human studies.\nTraditional signal processing background with solid understanding of imaging, sensing and signal physics.\nDescription\nApple designs consumer electronics that have touched millions and changed Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple products. Do you love working on challenges that no one has solved yet? The Imaging and Sensing group at Apple develops Depth and Image Sensing systems such as the revolutionary True Depth camera that powers FaceID and the recently released LIDAR scanner.\nEducation & Experience\nM.Sc./Ph.D. in Computer Science / Electrical Engineering / Biomedical engineering/ Physics / Mathematics, in the domain of Computer Vision, Signal processing, Machine Learning, Data science or similar.\nAdditional RequirementsShow more Report"}]