[{"company": "GE Healthcare", "job": "Staff Software Engineer", "city": "Haifa", "date": "24h", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bf61f326&cb=1676383181614&jobListingId=1008456876016&jrtk=3-1-1gp83imnnkuin801-1goos5ft928qb000-fd8eaf535054812a-", "description": "Job Description Summary\nGE HealthCare is looking for a highly experienced and motivated Software Engineer to join the Haifa Image Generation group. You’ll design and develop software for the next generation CT product, implementing new complex image processing algorithms enabling new premium CT products that are expected to revolutionize the industry, while mentoring the team on GPU programming/optimization. You should have a strong C++, SW design and GPU programming and optimization background, good communication skills, and an ability to integrate well as part of the team and global organization. Be motivated to solve sophisticated problems in clear maintainable ways. You’ll be developing CT reconstruction software applications and services computational tools, working in the areas of algorithm development, platform, application, AI and cloud, collaborating with engineers across the globe from US, Sweden, Japan, India and China.\nJob Description\nRoles and Responsibilities\nIn this role, you will:\nBuild, design and implement CT image generation/reconstruction software – algorithms and applications.Implement and optimize algorithms for GPUMentor and help others in GPU code optimization – serve as technical leader and center of knowledge on this topicLead complex SW designs and related discussionsCommunicate with system engineers, algorithm developers and other software developers from across the globe, continuously collaborating with them effectively to achieve optimal product code and implement solutions that are aligned with and extend shared platforms and solutions for CTApply principles of SDLC and methodologies like Agile/Scrum/SAFe, CI, requirements analysis, documentation practices, software and product security, scalability, refactoring and testing techniques.Take part in developing a common imaging platform for all GE imaging productsWork on core data structures and algorithms and implement them using C++, OpenCL, Python, OneAPI\nEducation Qualification\nBachelor's or master’s degree in Computer Science, Software Engineering, Computer Engineering or related degree\nDesired Characteristics Technical Expertise:\nDeep and proven experience in GPU programming and optimization\nExtensive experience in C++ and OpenCL and/or CUDA\nStrong experience in OOD and architecture\nExcellent communication skills – able to effectively collaborate with engineers across the globe in a global organization.\nAble to write high quality maintainable code allowing long term support as well as flexibility of requirements, target HW and algorithms design.\nAware of methods and practices such as Agile/SCRUM/SAFe and continuous integration.\nHas the ability to break down problems and estimate time for development tasks\nAble to grasp system view, understanding the full picture and end-to-end solution\nMinimum of 6 years of software development experience focusing on GPU programming and optimization\nAdvantages:\nExperience in medical imaging software development, particularly algorithms on GPU\nExperience transitioning from a Matlab algorithm prototype to fully optimized product code on GPU\nExperience in leading SW design in a global organization\nPrior work experience in an agile environment and scrum master experience in particular\nUnderstand the technology landscape, up to date on current technology trends and new technology, bring new ideas to the team\nAbout GE HealthCare\nGE HealthCare is a leading global medical technology and digital solutions innovator with over 100 years of healthcare industry experience and around 50,000 employees globally. We enable clinicians to make faster, more informed decisions through intelligent devices, data analytics, applications and services, supported by our Edison intelligence platform. We operate at the center of an ecosystem working toward precision health - digitizing healthcare, helping drive productivity and improving outcomes for patients, providers, health systems and researchers around the world.\nOur rewards\nOur total rewards are designed to unlock your ambition by giving you the boost and flexibility you need to turn your ideas into world-changing realities. Our salary and benefits are everything you’d expect from an organization with global strength and scale, and you’ll be surrounded by career opportunities in a culture that fosters care, collaboration and support.\nDiversity & inclusion message\nGE HealthCare is an Equal Opportunity Employer where inclusion matters. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n#LI-TM1\nAdditional Information\nThe job is open to men and women equally\nRelocation Assistance Provided: NoShow more Report"}, {"company": "Arm", "job": "Team Leader/Staff Software Engineer", "city": "Raanana", "date": "7d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c9f2ca05&cb=1676383182951&jobListingId=1008440701599&jrtk=3-1-1gp83io0ojm6k801-1goos5ft928qb000-57216d1158764fbd-", "description": "Show more\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, colour, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.\nGPU Introduction:\nAs part of our Global Technology GPU group in Raanana, you have a unique opportunity to work on cutting edge technology as part of our high-performance global project teams. If you would like to shape the future of mobile devices and be part of creating the world’ s most popular GPUs, then read on!\nThe GPU Engineering Group produces graphics hardware as well as software products for mobile and embedded devices. The Mali™ range of Media Processors offers an advanced, programmable architecture for hardware acceleration of 2D and 3D graphics and video. Our flagship Mali processors set a new standard for performance, while continuing the Arm tradition of low-power consumption. Our hardware is supported by high performance software drivers for multiple different operating systems, including Android, Linux and Windows.\nWe are now hiring in the Raanana GPU group and looking for software engineers who have strong interest in programming and wish to be part of a proud team which creates technology that is available in products and solutions everywhere. In the job, you grow your technical capabilities and learn about graphics drivers and GPU hardware. The role is part of Arm’s global GPU organization and involves daily cooperation with colleagues from other GPU teams in Europe.\nOur global teams are serious about GPU development, and we love seeing our work become part of successful products and solutions globally. So, if you are looking to start a successful engineering career with a world-leading organization, in a vibrant and flexible team environment where your hard work will be recognized and rewarded, then we want to hear from you today!\nJob Requirements:\nEducation & Qualifications\nBachelor, Master or PhD (computer science or electronics engineering) with good academic record\nSkills & Experience\nProfessional experience developing C/C++ software\nExperience with leading software project or mentoring junior engineers\nExperience with Linux or Android development environment, preferably working on driver or middleware development or graphics application development\nKnowledge of graphics technology and standards such as Vulkan, OpenGL/OpenGL ES/EGL, Direct3D\nExperience of performance/function modelling, profiling and analysis\nExperience with agile development process is a plus\nABOUT GPU ENGINEERING GROUP:\n\nThe GPU Engineering Group produces graphics processing hardware and software products for mobile, embedded and automotive industries. Our Mali™ Graphics Processor is the world’s #1 shipping GPU. Now we are entering into a new growth phase to provide new technologies and products for existing and new markets and are looking for hardworking people to join the team.\nIn GPU Engineering you will work with the world’s best companies, making world-leading products based on our IP and alongside the best engineers in the world. We are a global team working across numerous sites and cultures. Your ideas will make a difference and you will have the opportunity to lead, challenge the status quo and ultimately change the world of graphics processing.\nPlease have a look at the following video to see what it's like to work with us: https://youtu.be/F4tNBNBgYEY\n#LI-JB1\nEqual Opportunities at Arm\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\nHybrid Working at Arm\nArm’s hybrid approach to working is centred around flexibility, where we split our time between the office and other locations to get our work done. We empower groups/teams to determine their hybrid working pattern, with an expected minimum attendance in the office of 20% per month, depending on the work, level of experience and team’s needs. In some cases, the flexibility we can offer is limited by local legal, regulatory, tax, or other considerations, and where this is the case, we will collaborate with you to find the best solution.Show more Report"}, {"company": "Google", "job": "Engineering Manager, Siemplify, Google Cloud", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "Deloitte", "job": "Senior/Junior Data Engineer", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7d4a1921&cb=1676383187152&jobListingId=1008435556111&jrtk=3-1-1gp83is4pihlg801-1goos5ft928qb000-b186792f917f6629-", "description": "Description\n\nDeloitte Analytics, a part of Deloitte Israel consulting practice, is looking for a talented Data Engineer to join our growing team!\n\nHow your day will look like:\n\nAs a Data Engineer, you will take an integral part in our local and global projects.\nOur clients come from a wide range of industries and organizations across the globe.\nYou will work in collaboration with the data architect and data scientists and will be responsible for the development and implementation of data gathering, maintenance, deployment of DS pipelines, and helping to build infrastructural solutions that support the data, science teams.\nYou will collaborate with internal teams to facilitate solutions for DMPs.\nRequirements\nMSc/BA in Computer Science or another relevant field.\nA passionate Data Engineer with experience in developing data pipelines using AWS/Azure/other cloud-based technologies and Big Data technology stack to create custom solutions using large data sets.\nExperienced in writing APIs, scrapers, and crawlers.\n2-6 years of experience with Data Modeling and tuning of relational as well as NoSQL datastores (Athena, MongoDB, MySQL, Red-shift, etc.)\n2-6 years experience in ETL development using Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.) – is a plus.\nExperience using cloud-native tools and design patterns (Containers, Serverless, Docker, Kubernetes, etc.) – is a plus.\nFluent in English\nTeam player with a can-do attitude\n\nFull time Job\n\nLocation: Tel Aviv, Hybrid\nWe at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.Show more Report"}, {"company": "MoovingON", "job": "R&D Team Lead", "city": "Nesher", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4a33b542&cb=1676383188470&jobListingId=1007705814502&jrtk=3-1-1gp83itd0jrp9801-1goos5ft928qb000-a9d66fab67c2139e-", "description": "We are looking for a R&D team leader to join our team in Nesher (Near Haifa). Reporting to MoovingON’s CTO- full-time position.\nThe position is aimed at experienced developers of full stack SaaS applications with managerial experience.\nThe Full Stack Engineer will be a part of our growing R&D team.\n\nJob Requirements:\n\nExperience with leading development team.\nAt least 4-5 years’ experience in Python development.\nExperience in Linux environment.\nExperience in GIT Version control.\nExperience in with UI development (JavaScript, SASS, HTML5, AngularJS, PWA).\nExperience in Celery and RESTful – An advantage\nExperience working with the following technologies – An advantage\nRabbitMQ or any other open-source message queueing\nPython Django\nDocker containers\n\nCharacteristics:\n\nTechnical versatility and experience in dynamic working environment.\nQuick, effective and versatile. Able to change directions in midstream\nExcellent interpersonal skills\nStrong self-learning skills\nOut of the box thinker & Creative\nTeam player\nGreat personality skills & Service Oriented\nAccountable\n\nThe position is for both men and women\n\nPlease send your CV to jobs@moovingon.com\n\n“* By submitting your CV to MoovingON, you agree to MoovingON’s Terms and privacy policy.”Show more Report"}, {"company": "Apple", "job": "Senior Formal Verification Engineer", "city": "Haifa", "date": "5d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3a613622&cb=1676383189816&jobListingId=1008449460544&jrtk=3-1-1gp83iuo2klua801-1goos5ft928qb000-1690c772f48cca6a-", "description": "Summary\nPosted: Aug 1, 2022\nRole Number:200000213\nAre you in the Formal Verification domain, interested in developing proofs on the most critical parts of Apple products? Keep reading! Our team is a small family of FV enthusiasts with varied academic backgrounds, seeking for breakthrough methodologies. We encourage professional development and knowledge sharing on regular basis We constantly aim to stretch our limits, with emphasis on tackling the space explosion problem as well as raising confidence in proof completeness. Sounds you could fit? Let’s talk!\nKey Qualifications\n+4 years FV engineering\nModel checking researchers/developers\nSVA/Jasper - advantage\nDescription\nIn this role you will be responsible for developing mathematical proofs using model checking tools, to find RTL(Verilog) bugs or prove their absence.\nEducation & Experience\nB.Sc. in Mathematics and Computer Science, Electrical/Computer Engineering, M.Sc/PhD Mathematics\nAdditional RequirementsShow more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "R&D Manager", "city": "Southern", "date": "6d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1110586&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c4b21882&cb=1676383191117&jobListingId=1008444887754&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83ivvikhqa801-1goos5ft928qb000-1d920c0b16636e2d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNANtB5ZZYDlIbgi8f3h3mUvlJHkO6fdk4VOuQsIlauBo5BgnQyiy2oUmCiXk-sfj35eqIh4yo3dtyBsfXoUTd9RUuaTwMI8wHVDDgKOuOtH8T5z0namydoN0RRcjf1BOf7w-PaHm5-WdvI5_WNAMFqCqyLzEqAolBREx2LmGV8Lzi1nvbeZEF_TjVzFcOsXpRTxmb3qyJFsheyua5GIzBIahHOKKJVnTod2bW5GpefDckuEmAkcfSzV97-zt9lWJDaTYSYA30Yzdtp6kOAzaosFbHbIks3xbDck7SJXy6At--qiOJZQwLnNlOybOR5X2PjvIRTz0d_PMbOOvM-zb5R6_e0AjtLIqpH6QXYfoNsr2f28lQi9a2U5hy86MHEWg75OE7NruvNvlv7pjQZbFjq09gaAiijZbc8wX7sGghmCaU5htHbLKPAqmo199g4-94vGV3VM8tZU1KZWSJbGsaCu_zzcEixKDWS_37xEQEB5BFwFFT-7y4Ol1YanqwlzRRv66xDzorRfhHsJb666fBaXteD-wScOy7BXseK82RaahemFgG_djrF7Y9o7u85oVjIEGTS-_WJGg6SEdHAPqYdMMe_sGojAgNI_6y6pLBhxu8ZvG04daFtcH9ak26GhCTUw67q3OklsClnETq94_bxV", "description": "Leading Engineering team and set the technology agenda Manage various projects Parallel • Collaborate with cross-functional partners in Sales, General Ganagers, and executive members to define and build a data-informed technology strategy and roadmaps. • Advise GM and priorities regarding design and direction of new developments. • Ensure the engineering team is scheduled and working efficiently while utilizing company equipment and harnessing the rest of the departments. The ideal candidate demonstrates personnel leadership skills, proven technical competence, and the ability to collaborate with others to achieve business objectives.\n\nResponsibilities : • Lead and mentor a team of electrical and mechanical engineers to deliver the best RF/Antenna product to fit the customer need • Conduct presentations to military and commercial engineering team (including PDR, CDR, etc.) • Review SOWs and special requests from clients, evaluate, and raise issues or concerns. • Provide estimated cost of new designs • Support an organizational effort toward better understanding customer needs and pain points, and develop plans that further this goal • Attract and retain new engineering talent • Manage the product portfolio • Champion technical discussion with the client technical staff **Please Apply your CV in WORD Document • 5-10 years of experience as an engineer and/ team leader of engineers • Experience in a military/government company or similar (IAI, Elbit, Rafael, etc.) • Proven success in leading mechanical and electrical engineering teams in rapid product development • Basic understatement of the antennas and RF world • Passionate about the telecommunication market • Knowledge of Microsoft (excel, word, outlook, MS projects) • Must be fluent in English and Hebrew • Have a strong builder mentality, and know how to effectively \"bring people Demonstrated success in building a culture of innovation, ownership, and accountability • Strong strategic business knowledge, change management, and continuous improvement champion • Understatement of concept from the plastic, electronics, and metal industries that relate to the production of antenna productalongShow more Report"}, {"company": "BIRD Aerosystems", "job": "System Engineer Team Leader- 1199", "city": "Herzliya", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_943d109a&cb=1676383192417&jobListingId=1007176529556&jrtk=3-1-1gp83j18sia2h801-1goos5ft928qb000-9e7efe5f7f0a8921-", "description": "What are we looking for?\nSystem Engineer Team Leader to lead our amazing group of system engineers in the R&D division.\n\nWhat do you need to have?\n\nBachelor’s degree in Electrical Engineering\nMBA in Electrical Engineering- an advantage\nExperience in leading a team- a MUST\nAt least 10 years’ experience in multi-disciplinary projects and system engineering\nExperience with MATLAB – must\nRF test equipment experience – must\nExperience with radar systems design – significant advantage\nMilitary background from IDF technological units – an advantage\nFluent English\nTeam player with strong interpersonal skillsShow more Report"}, {"company": "קווליטסט", "job": "V&V Engineer", "city": "Jerusalem", "date": "22d", "rating": "3.9", "link": "", "description": ""}, {"company": "Cisco Systems", "job": "Associate Solutions Engineer - Bachelor/Master (Graduate) - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_901a5c78&cb=1676383195602&jobListingId=1008313665965&jrtk=3-1-1gp83j4c1jc9j801-1goos5ft928qb000-0e20aed5fb47c639-", "description": "Start date: 31st July 2023\nTraining location: Amsterdam, Netherlands\nPost-training location: Tel Aviv, Israel\nArea of Interest: Sales –Product\nWhat You’ll Do:\nCisco Sales Associates Program offers a global environment that provides structured training and on-the-job-experience. We will develop your technical, sales and communication skills and give the opportunity to rotate through a variety of areas based on our model of Education Exposure Experience. You will learn how to position Cisco’s architectures, solutions and products to our customers.\nYour career will continue in a sales engineering role as part of Cisco’s Global Virtual Engineering (GVE) Team. GVE is a technical presales organisation, that provides software and systems engineering services to customers, partners, and internal Cisco sales employees. As a sales engineer, you’ll discover, demonstrate and design solutions by engaging with our customers and partners to bring simple solutions to their complex challenges.\nFrom there, your career can develop and grow into a variety of sales opportunities at Cisco.\nWhile challenging, it will push you to become the best version of yourself. You will achieve industry-standard certifications, as part our perpetual learning approach, and be assessed and mentored through customer simulations and on-the-job activities. We’ll offer you a safe and fun environment to practice what you’ve learnt, all the while providing you with feedback to develop your potential.\nWho You'll Work With:\nYou’ll be part of our Cisco Sales Associates Program (CSAP), an award-winning and industry recognised early-in-career development program for top university graduates from around the world. You’ll train alongside incredibly hardworking individuals, like yourself, from different countries and diverse backgrounds. Early on, you’ll make long-lasting friendships and belong to a rich human network that will support you throughout your career.\nAs a successful Associate Solutions Engineer (ASE), you’ll expand your software and networking knowledge to collaborate with Cisco sales professionals and provide technical solutions that drive business outcomes for our customers and partners.\nYou’ll learn from experts and coaches in an unrivalled setting using our own leading-edge technology. You’ll have your own mentor, a CSAP alumnus who’s been in your shoes and will help guide you in your first year. With a strong Cisco team committed to your success, you’ll gain hands-on education and experience, while receiving an attractive salary and pursuing your career dreams!\nWho You Are:\nRecent graduate or on your final year of studies towards a degree or related program or other academic certification in any of the STEM subject areas ideally with an emphasis on networking and computing\nMust have graduated by May 2021 or later\nFluent in English and Hebrew\nMust be able to legally live and work in Israel, without visa support or sponsorship (student visas or visas obtained on your own are not applicable for the program)\nWilling to relocate for 12 months to a designated CSAP training hub as required. Immigration and relocation support will be provided should the program be delivered in training hubs as opposed to virtually.\nTechnology enthusiast who enjoys innovating ideally with a demonstrated passion and interest in software languages. such as Java or Python\nDemonstrate an eagerness to establish a long-term Sales career with Cisco Israel.\nWhy Cisco\nAt Cisco, each person brings their own talents to work as a team and make a difference.\nYes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people.\nWe connect everything – people, process, data and things – and we use those connections to change our world for the better.\nWe innovate everywhere - From launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education and more.\nWe benefit everyone - We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities.\nColourful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Be you, with us. #WeAreCisco\nCisco is an equal opportunity employer.\n@Cisco #CiscoJobs #WeAreCisco\nCisco are always looking to identify talented people. If you are reading this posting then we may not have an open job right now, however it is highly likely we will in the future. If you are interested in working for Cisco in this capacity then please submit your details and CV or resume against this requisition so that when a suitable vacancy arises a Cisco representative can contact you directly.\nPlease note that vacancies will be filled on a rolling basis after opening, and we will close applications as offers are accepted; possibly before the stated deadline. Therefore, we highly recommend you submit your application as early as possible in order to be considered for the opportunity of your choice\n\nJoin us for Cisco in 60 - a set of 60-minute webinars from November 2021 – April 2022 for potential candidates to experience Cisco. More info and register HERE.\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "WhiteSource", "job": "Application Security Engineer Lead", "city": "Giv`atayim", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_842ce010&cb=1676383197062&jobListingId=1008087476807&jrtk=3-1-1gp83j5mrkhqa801-1goos5ft928qb000-72a4033cde72ca24-", "description": "Mend is a successful, rapidly growing start-up offering a unique cloud-based solution of open-source management and security. We are getting millions of customer source code programs from all over the world and analyzing them automatically on a daily basis\nWe are expanding our portfolio of products, by starting the development of a new, state-of-the-art, cloud-based solution in the field of application security.\nWe are looking for a highly motivated, talented, and hands-on Application Security Engineer who will participate in building our next-generation static code analysis engines for detection and remediation capabilities. This role offers challenges across a wide variety of responsibilities. You will have an opportunity to establish the application security discipline in the SAST group, and define working procedures, processes, and tools.\nThe successful candidate will work closely with algorithms developers, improving the engines, developing security rules, performing a security review of source code, and suggesting optimization. We are searching for a team player with a can-do approach.\nResponsibilities:\nPerforming security source code analysis.\nAnalyze application vulnerabilities and provide mitigation strategies.\nResearching, designing, and writing application security rules for detection, while working closely with a development team for SAST\nAnalyzing different programming frameworks in different programming languages for potential sources and sinks for SAST.\nHandling complex cases escalated from the field and other teams.\nImproving Mend SAST engines for various programming languages.\nRequirements:\nExperience with security review of source code – Must!\nAt least 5 years of experience in application security or security research, including the understanding of application security attacks, vulnerabilities, and mitigations- Must!\nUnderstanding at least 2-3 of the following programming languages -Java, C#, Go, JS, Python, PHP, Ruby, etc- Must!\nLanguage agnostic approach to vulnerability identification in the source code (ability to read multiple programming languages source code and identify vulnerable parts).\nKnowledge of common Web Application security vulnerabilities (OWASP TOP10, SANS 25, etc.)\nProven experience leading tasks and projects end-to-end, passion to grow to a TL position\nExcellent English – written and verbal.\nExcellent interpersonal and communication skills.\nAdvantages:\nBSc or BA in Computer Science or a similar degree.\nExperience in managing application security engineers\nExperience working with development teams.\nExperience with bug bounty research or published advisories or exploits for discovered 0day vulnerabilities in applications.\nMend’s Diversity Commitment\nAt Mend, we believe bringing together the diversity of experience and background creates a better place to work, a better product, and more opportunities to innovate. Mend is committed to doing its part to mend the equity gap, fostering a safe, inclusive environment to inspire and support employees to be their authentic selves and provide development opportunities for all.Show more Report"}, {"company": "Google", "job": "Engineering Team Lead, Siemplify", "city": "Ramat Gan", "date": "14d", "rating": "4.5", "link": "", "description": ""}, {"company": "Pentana Solutions", "job": "Customer Service Network Operations Center Engineer Level 2", "city": "Central", "date": "30d+", "rating": "3.2", "link": "", "description": "Pentana Solutions Pty. Ltd., a global company with its HQ situated in Melbourne, specialise in the development and supply of automotive software tailored to dealerships. Our current leadership position within the automotive IT industry stems from vast industry experience, technological knowledge and years of continual product development. With over 500 staff in 13 locations around the globe, our products and services extend to over 100 countries with over 50,000 daily users.\nAt the heart of our organisation, lays our En.R.I.TC.H values – our cultural values we pride ourselves on - Enjoyment, Respect, Integrity, Trust, Communication, and Honesty. As a company, we recognise our people are our greatest asset; we value attitude as well as aptitude and provide opportunities to those who demonstrate the ability and drive to succeed in their role.\nReporting directly to the CS NOC Team Leader within CSC team, the role is responsible for effectively manage and support of all Pentana products and services to our customers.\nTHE ROLE\nTroubleshooting Local LAN issues including customer VLAN, DNS, DHCP related issues and Pentana Solutions Cloud Networking & Connectivity related issues.\nTroubleshooting Private and Public Internet services.\nTroubleshoot Cisco and Juniper routing and switching.\nTroubleshooting VPN connectivity issues\nTroubleshooting LINUX, AIX and IBM AS400 system issues and Database application issues.\nReport on problems and log tickets with third party carriers.\nWorking with internal infrastructure teams to resolve Cloud networking related connectivity issues.\nInvestigate Backup, Restore, Scheduling, Security and Performance related issues.\nProvide technical support to end users when cases are escalated from the Level 1 Helpdesk.\nProvide Level 2 phone support and escalations to Level 3 engineers when required\nAnalyze recurring system issues and finding permanent solutions.\nManage own incident queue, within SLA’s and follow defined Helpdesk operating procedures.\nReport weekly on projects; meet service levels in line with Pentana Solutions standards.\nAct as an escalation point for team members.\nServe as a liaison between third party engineers and suppliers where necessary.\nParticipate in in-house configuration and hardware/software resolution where required.\nAbility to communicate effectively with all level of end users\nAble to work on shifting schedules 24/7, Philippines public holidays (i.e. weekends, late nights)\n\nEssential Skills:\nExtensive knowledge and experience in Cisco and Juniper Routing and Switching Network\nIBM and Dell Hardware Knowledge and troubleshooting skillsets would be beneficial.\nPerformance analyses and testing of Server hardware to diagnose faults\nLiaise with external vendors such as IBM and Dell to resolve faults\nCisco CCNA / CCNP, Juniper JNCIA networking and Microsoft MCSA/ MCSE Certifications will be beneficial.\nWHO ARE YOU;\nProfessional:\nDemonstrated experience within a similar incident/support role.\nExcellent Customer Service and Communications skills\nExcellent interpersonal and stakeholder management skills\nITIL Certification will be highly regarded\n\nPersonal:\nProblem solving and critical thinking mindset\nResilient, with strong negotiation\nProactive and highly organized with the ability to prioritize concurrent deadlines.\nHighly responsible, punctual and reliable\nAttentiveness to details and deadlines\nTo apply, please reference #1575 in your application to careersAsia@pentanasolutions.comShow more Report"}, {"company": "Imagen", "job": "Senior Full Stack Engineer / Tech Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Imagen is developing a disruptive technology for the professional photo editing market. We use edited photos from each of our users, to create personalized AI profiles and to reduce and eliminate editing efforts. Creating a personalized profile based on user data gives great value to our users and creates many challenges.With a very strong market validation, a crazy month-over-month growth, and a top-tier VC backing us, we’re looking for the first team members to join our team. It’s an opportunity to be part of something huge and be a leader in a fast-growing company.What will you do:In this role, you will be responsible for a challenging overall development and implementation of front and back-end software applications, from designing architecture to high-level programming, performance testing, and systems integration.You will build client side applications with reusable code and modular components.You will take initiatives, design architecture, and deliver new features to production.You should have an advanced troubleshooting skills.You like to have fun and code with a smile.Requirements:Previous experience of at least 4-5 years as a full stack engineer.Experience with Frontend frameworks of one or more: Vue, React, or Angular.Experience with Backend framework of Node.js or Python.High attention to detail.Bachelor’s degree in computer engineering or computer science.Job Type: Full-timeShow more Report"}, {"company": "Apple", "job": "Senior CAD Engineer - Infrastructure and Queue Admin (Herzliya /Haifa)", "city": "Herzliya", "date": "8d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fc9964e8&cb=1676383201876&jobListingId=1008439638386&jrtk=3-1-1gp83jagima4n801-1goos5ft928qb000-a4063c84c1ae3938-", "description": "Summary\nPosted: Sep 29, 2022\nRole Number:200396560\nIn this highly open role, you will provide multi-site, multi-team design support as part of the Infrastructure CAD Team. Technical areas of responsibility include compute-farm queuing software maintenance and management, support for vendor license integration, forecasting of hardware and software needs, and developing software and databases for metric tracking. Additional responsibilities include working with CAD Engineers to optimize tool-flows and regression suites.\nKey Qualifications\nFluent scripting skills in Python, Perl, TCL or Shell.\nExpert-level knowledge of server queuing systems (GE, LSF, NC).\nExperience integrating tool-flows into a batch/interactive queuing system.\nExperience driving web-based reporting and data visualization.\nExperience with SQL database administration and queries.\nExposure to vendor license management and syntax.\nExposure to configuration management tools (Perforce, GIT).\nAbility to handle a high engineering support load and co-ordinate with multiple users and management across multiple teams.\nDescription\n- Co-ordinate, handle and support compute-farm queuing software for multiple teams at multiple sites. - Triage and solve user issues related to queue job submissions - Provide real time and historical reports for queuing usage/metrics and compute data at all sites. - Optimize compute-farm queue configurations for license/resource usage and integration with tool-flows and regression suites. - Work with tool vendors to make job and license allocation more efficient. - Maintain and update tool wrappers, module-files and environment files. - Oversee EDA tool installation – assist with flow integration. - Create and maintain scripts and automation for infrastructure support.\nEducation & Experience\nBSc in Information System\nAdditional Requirements\nPlease add your Grades sheet when applying.\nApple is an Equal Opportunity Employer committed to inclusion and diversity. We take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, and individuals with disabilities.Show more Report"}, {"company": "Medtronic", "job": "(Senior) Robotics Field Service Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4adf4146&cb=1676383204511&jobListingId=1008340888970&jrtk=3-1-1gp83jd29mfoo801-1goos5ft928qb000-055db631b01181b7-", "description": "Careers that Change Lives\nThe Robotics Field Service Engineer is responsible for all aspects of equipment support performed at customer sites or before delivery, and to ensure that it is completed in compliance with all company policies and standard operating procedures. This will include, pre-installation checks, system installation/commissioning, planned maintenance, troubleshooting, assessment, and breakdown repair.\nThe Robotics Field Service Engineer is the main contact point with the local customers and the local commercial team for all Service and Repair related questions.\nA Day in the Life\nLead and execute installations and commissioning of new equipment.\nPerform preventive maintenance as per service manual checklist. Perform appropriate testing to confirm system functionality according to the manufacturer's specifications.\nAttend breakdown calls and perform repairs and troubleshooting independently.\nProvide testing and validation support and data to the Global Service organization.\nAssist in technical support for users of Robotic systems. Including phone and remote support for users and technical staff.\nCollaborate with other field service engineers to troubleshoot difficult service activities.\nTravel to sites to work as a member of the local team to provide efficient repair/installation support.\nMust-Haves\nBachelor's degree is required – minimum of 4 years of relevant experience or advanced degree with a minimum of 2 years of relevant experience. Good knowledge of troubleshooting methods/skills and capital equipment control.\nSystems are primarily used in the operating room, so healthcare / surgical setting experience is required.\nExperience with robotics or motion control within a large capital equipment environment.\nTeam player with strong interpersonal skills.\nAvailable to travel (around 50% of the time) domestically and internationally and work outside of core office hours.\nStrong analytical and problem-solving skills that are balanced with speed and effectiveness.\nEffective verbal and written English and Hebrew communication skills.\nNice to Haves\nVocational/ Trade certificate with minimum 8 years of experience; Diploma/ Associate Degree with minimum 5 years of experience; Bachelor's degree with minimum 3 years of experience.\nIn-depth experience with medical devices for a minimum of 3 years.\nComplete and broad knowledge of operational systems, techniques, and practices typically gained through extensive experience and/or education.\nEffective presentation and negotiation skills.\nProficiency in Microsoft Office.\nWe Offer\nWe offer a competitive salary and benefits package to all our employees:\nFlexible working environment.\nAnnual Incentive Plan % depending on company results.\nPension scheme and group discount on healthcare insurance.\nTraining possibilities via Cornerstone/Harvard Manage Monitor/Skills Lab\nEmployee Assistance Program and Recognize! (our global recognition program).\nAbout Medtronic\n\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.\n\nYour Answer\nIs this the position you were waiting for? Then please apply directly via the apply button!Show more Report"}, {"company": "מיקרופוקוס", "job": "DevOps team lead", "city": "Jerusalem", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1110586&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_dc822f34&cb=1676383206026&jobListingId=1007823078602&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83jei5kuha801-1goos5ft928qb000-44142f41111b6b65--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAaZ5GayGWRIEb8S_-gn1dILBl5iuY4f9oDOTOKuVzYgNO7GnzRqaMXP_ANKTrH2JC7d9O0M7tz44SqdrkyKV8afNWV_5FLpJhMsz3Yn84byCuMuAzz4-YKREvLVZfwFLxvFTGdrMPE1og76EbGjrznbm3p121nucx3yKiLO5xSw7kNeYgStU5HDH462HSvAK_VN9PC0vj5H343FkjbQKlrT9GTr9NnyBGwrUmMkqwZC3oUhD8Ry_VHgTg7fMExK95ufuQbI4BF4QGDKOTSaY_sEzc7W_Lx55fb2JH_zFOTMXIHeqROyR6QwR0Nnrnc8fY9Vy5Zt8Tcn13mnZT30w8SUdSWXIHMi-Ev20xL-pKXu5g-XpWHT7LCOfn7zzdOVn49c7Pu4JWtGrBQa683DNBacJTSoix7dCaRJ_MndAofDfTWa-nLZeK9xFdhgf5Cx3-AlAbBtaZuxcA9O1HtfMx_jLVFKNwrWRwP5tm_Pp3BEb9prioaFIVLhSb4OrtQPMpYX4uGF4p8RrMQ8-r1Sc2IrAoeccg8Uz6ES5f870NeGCJF1LL7ScbW9YH1DSe2NrB8yQqMS6C4uPezQf75l4h7cTsA5T1Gjb_oWIAOqANe_RxY99jOPOOVQ1A8KZ3tN7M_mJVCNZTHQUD2Yvq7aNfW", "description": "We’re looking for a talented and passionate DevOps team lead to lead and grow a team of talented DevOps engineers in LoadRunner Cloud If you are a DevOps Engineer with a hands-on experience in complex high scale production environments and cloud technologies and you have experience in leading people – this is your opportunity to be a significant influencer in a market leader product Responsibilities · Build state of the art solutions for our production platform · Work with other R&D teams on mutual projects · Be responsible for the smooth production-grade execution of provided solutions · Provide support and guidance to dev teams on using the underlying infrastructure · Managing requests and priorities from multiple teams · Work with developers to identify and resolve build or deployment problems · Innovate & strive to advance with the industry, continue to improve quality and efficiency of the build and deployment process Requirements · Experience with a major cloud environment on AWS · Experience with microservices architectures and its automation tools · Strong knowledge in software development methodologies and passion for creating high-standard toolsets for infrastructure-as-code · Strong interpersonal, teamwork and collaboration skills · Managerial experience - ability to lead, mentor and drive people · Excellent analytical and problem-solving skills LoadRunner Cloud is a cutting-edge technology cloud-based solution with infrastructure based on AWS, GCP and Azure stack that allows to plan, run, and scale performance tests without the need to schedule, deploy, and manage load generators.Show more Report"}, {"company": "PerceptionBox", "job": "T2-3 Technical Support", "city": "Herzliya", "date": "21d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5c8832aa&cb=1676383207246&jobListingId=1008412072796&jrtk=3-1-1gp83jfohjorf801-1goos5ft928qb000-4bd94b659c3cd65e-", "description": "On behalf of our client PerceptionBox is looking for a T2-3 Technical Support Engineer to work on a challenging healthcare project.\n\nResponsibilities:\n\nWork on resolving various technical incidents for the Company’s customers involving various software, networking and hardware environments;\nMaintain deep knowledge of Company operations to support client/team technical requests effectively;\nState machine management via UI (creating/modification states), troubleshooting;\nInvestigation of bugs, logs analysis, route case system research;\nDevelop documentation regarding installation, upgrades, support, and compatibility issues.\n\nRequirements\n\n2 years of experience in an L2-L3 technical support;\nT3 Tech support with 2-3 years experience in AWS systems\nExtensive knowledge of SQL scripting;\nStrong ability to take ownership from initial report and follow through until full resolution and customer satisfaction;\nKnowledge of web technologies: HTML, CSS, JS, etc.;\nBasic knowledge of troubleshooting performance issues in a distributed microservices environment;\nExperience with monitoring/logging tools (Such as Grafana, Kibana, OpenTelemetry, Jaeger);\nProven record of working in a highly pressured multi-tasking environment and working independently;\nExperience with OpenVPN;\nGood communication skills and customer service focus;\nPassion for troubleshooting and ability to come up with efficient solutions for unordinary issues.\nUpper Intermediate English.\n\nWill Be a Plus\n\nAWS Cloud - Experience working with Cloud solutions or in Cloud software Support Team;\n2 years of experience as a Junior Node JS developer willing to do 6 months of Tech Support prior to joining the development team.\nWe Offer:\nCompetitive salary fixed in USD;\nPrivate Entrepreneurship formalisation;\nCozy office in Tel-Aviv AND Opportunity to work remotely from the whole world;\nSick Leave coverage;\nVacation – 17 working days (flexible, if you need more);\nWork within growing service company with prospectives for education and career advancement;\nParticipation in projects within the active development stage;\nThe friendly international team of strong professionals that will help you to achieve results;\nAgile management & internal mobility, no bureaucracy and initiative-friendly attitude;\nPossibilities for business trips abroad;\nCorporate team building events.Show more Report"}, {"company": "RecrutiX", "job": "Senior Technical Support - Fintech Company", "city": "Tel Aviv-Yafo", "date": "5d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1110586&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_117d1910&cb=1676383208542&jobListingId=1008449200187&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83jh0ajcbs801-1goos5ft928qb000-a6efc620ccb503cd--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC9LM03Xf0tppXD1i5-jlB4Ic1BpqY0x_JnvR64bw2N77kbNEKRVSNHW_OdyuenFlEnb9sze_xK24SHehFEf76cB0ipal9x3U4-TkzzYG_phdkU9iGs6K_4MnP1i5QvIVnmLBuMUFYMva1Rq5KMa5stp18BNoSWxcMm6AwFd0_VFGeQgOqmOB67P6RbBY7GafkRHrU75I9uZyxtDE17dWBW55u9w9hYuVGKZcpIVdX6-PNu_GBBuO9Gn_KXxhyJm9Jj-Pzhji6YGM3AZ-BDytfTzpFTb7fiWfieNp9GOW8W0QbK8aue5XkyMKhuv0G123gvzPZTEmXvMqySOEXQZHpV6FxaYRL3DeCUpCxWekiGM-X3mt9UO3pWamFFVXpIbvgKMvEMHRrA2Joz-sdTnxwe8llTACcMffpyFQDza_8nSacso_DjKuoASgko2zZkqqRS13HlFxOWxi5fHm4HVv6CNIYGBWVMPM2CvSBYxxTSO1CmVBd2qMJ3RxrzVcFaT3od-gmA738YCf-YHhe7P6AkHb_rEeW5pUlKcEr06dMbXn8iAHa5jxVWEmb3zK6v6dLojbAXB2C6bajbaZBPb_6tLZFAs5ImAtcMZv_FDEuboWcT7LCSmUzz9VAJzxNK4lecS7KdUM5ZI2IOlQMOhT1A", "description": "We are a global software company that develops and successfully operates a leading online trading platform. Our mission is to develop an innovative and advanced financial online technology platform. We build a place of creative and productive minds, follow by collaboration and excellence. Our platforms empower people all around the globe to follow their success anytime, anywhere.\n\nWe are looking for a talented Senior Support Engineer to join our Client Operations team. Job Requirements: • At least 3 years of experience as a Tier 2/3 technical support engineer for enterprise (B2B) software - a must. • Ability to work Monday to Friday - a must. • Experience with Windows OS including debugging and internals - a must.\n\n\nExperience with enterprise networks such as Active Directory, SCCM, and GPO - a must. • Experience with Linux including software installation and integration - a must. • High level of English - a must.\n\nShow more Report"}, {"company": "NeuroDerm", "job": "R&D Senior mechanical Engineer", "city": "Rehovot", "date": "24h", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0100d767&cb=1676383210061&jobListingId=1008459243109&jrtk=3-1-1gp83jig3kuio801-1goos5ft928qb000-4be2779cf283b55c-", "description": "Development and design of products assembly, special tooling and fixtures\nMaking conceptual design, detailed design, CAD modeling and prototyping\nUtilize design analyses tools including theoretical calculations for components fit, tolerance analysis and stress calculations\nPerform evaluation testing and define components, sub-assembly and product level specs\nWriting technical protocols, tests methods and presentations related to design activities\nPerforming and/or supervising testing of new and existing products, writing and/or approve tests reports\nManaging activities related to ECOs\nSupport validation and verification activities of products\nSupport industrialization and manufacturing activities\nWork closely with internal interfaces (Engineering, Electronics, QA, HF, RA and software groups) as well as external interfaces such as subcontractors\nLead and support procurement of commercial off-the-shelf components\nLead projects activities with other R&D teams\nQualifications\nBachelor of Science or higher degree in Mechanical Engineering\n5 or more years related experience in products development and design\nProficiency in 3-D CAD software such as SolidWorks\nExperience with design for manufacturability (DFM)\nExperience with medical devices design is a plus\nExperience with medical industry standards is a plus\nKnowledge in assembly processes\nExperience with plastic injection, molds, and parts design\nExperience with sheet metal parts design is a plus\nKnowledge in PCB manufacturing\nExperience with mechanism design\nExperience with verification tests\nExperience with writing design requirements, protocols, test reports etc\nExcellent communication skills proficient in Hebrew and EnglishShow more Report"}, {"company": "JobInfo", "job": "Staff Software Engineer", "city": "Israel", "date": "6d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4b7087ae&cb=1676383211409&jobListingId=1008446727455&jrtk=3-1-1gp83jjqd2jq8001-1goos5ft928qb000-c4856818fccc2a0e-", "description": "Job Description:\nyou have a unique opportunity to work on cutting edge technology as part of our high-performance global project teams.\nAdditional Positions:\nBackend C++ Linux, Driver/Kernel developer, C++ Developer, Real-time, C Developer\nLocation:\nHybrid, Sharon area\nCategory:\nSoftware\nJob Qualifications:\n\" Bachelor, Master or PhD (computer science or electronics engineering) with good academic record\n\" Professional experience developing C/C++ software\n\" Experience with leading software project or mentoring junior engineers\n\n\" Experience with Linux or Android development environment, preferably working on driver or middleware development or graphics application development\n\" Knowledge of graphics technology and standards such as Vulkan, OpenGL/OpenGL ES/EGL, Direct3D\n\" Experience of performance/function modelling, profiling and analysis\n\" Experience with agile development process is a plus\nCompany Occupation:\nData security, High Tech, Internet related\nCompany Size:\n500+Show more Report"}, {"company": "JobInfo", "job": "Team Leader/Staff Software Engineer", "city": "Central", "date": "6d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e190700e&cb=1676383213027&jobListingId=1008446727815&jrtk=3-1-1gp83jlcnjorf801-1goos5ft928qb000-2e0bf6f91a685723-", "description": "Job Description:\nyou have a unique opportunity to work on cutting edge technology as part of our high-performance global project teams\nAdditional Positions:\nBackend C++ Linux, Driver/Kernel developer, Team leader, C/C++ Team Leader, RT Team Leader\nCategory:\nSoftware\nJob Qualifications:\nBachelor, Master or PhD (computer science or electronics engineering) with good academic record\n\nProfessional experience developing C/C++ software\n\nExperience with leading software project or mentoring junior engineers\n\n\nExperience with Linux or Android development environment, preferably working on driver or middleware development or graphics application development\n\nKnowledge of graphics technology and standards such as Vulkan, OpenGL/OpenGL ES/EGL, Direct3D\n\nExperience of performance/function modelling, profiling and analysis\n\nExperience with agile development process is a plus\nCompany Occupation:\nData security, High Tech, Internet related\nCompany Size:\n500+Show more Report"}, {"company": "Synopsys", "job": "Applications Engineer, Sr II", "city": "Herzliya", "date": "8d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d9adbd80&cb=1676383214840&jobListingId=1008439308354&jrtk=3-1-1gp83jn5vghq4801-1goos5ft928qb000-7876fbf33599dd6f-", "description": "42999BR\nISRAEL - Herzelia\nJob Description and Requirements\nEmulation has become an indispensable part of SoC designs verification with growing designs sizes and complexity. Synopsys is uniquely positioned to offer the market leading verification and Emulation Solutions.\n\nOur Application Engineers team works closely with local industry customers from early Emulation Platforms & Solutions pre-sales stages, towards planning, deployment and ongoing support.\nWe help our customers achieve their HW Verification and SW bring-up targets with our products, while working with R&D teams on improvements and future technologies in that space.\n\nThe Role:\nProvide our customers technical and engineering expertise in their ASIC design HW verification process, using our Emulation Platforms and Solutions:\nAnalyze customers verification methodologies and targets, platform and Testbench solutions planning.\nDrive and execute Synopsys Emulation products Evaluations on customers designs.\nSupport customers in deployment of the Emulation products, from RTL code compilation and synthesis, towards SoC-level full functionality bring-up on Emulator.\nHands-on bring-up of Emulation Testbenches, including interface protocol Transactors, memory models SpeedAdapters, C++ code, and automation scripts.\nRegularly interact with customers as their first contact to address any quality issue or required improvements in our products and their collaterals.\nWork internally with R&Ds to provide feedbacks on products, track development process and roadmaps.\nWork internally with Sales team on accounts strategy and business growth opportunities.\nJob Requirements:\nBachelors degree in Electronic Engineering or Computer Engineering.\nTypically requires a minimum of 2 years relevant experience in ASIC/SoC design and/or Verification\nprocess. Direct experience on HW Emulators or Prototyping platforms is highly preferred.\nProficiency in HVL languages like SystemVerilog/C/C++, Unix/Linux development environment, and scripting languages.\nKnowledge of key protocol’s like Ethernet, PCIe, AMBA, UART, DDR, and their usage in SoCs is a\nbig advantage.\nHW (RTL)/SW (C++/Scripts) Code Debug and troubleshooting skills are highly desirable.\nExcellent communication skills and ability to interact with customers as well as peers\nProven Self-learning skills and high motivation to gain expertise.\nTraining skills with ability to create and deliver high level of technical training material.\nJob Category\nEngineering\nCountry\nIsrael\nJob Subcategory\nApplications Engineering\nHire Type\nEmployeeShow more Report"}, {"company": "Transmit Security", "job": "Senior Frontend Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "", "description": "Transmit Security gives businesses the modern tools they need to build secure, trusted and end-to-end digital identity journeys to innovate and grow. CX-focused, cybersecurity conscious leaders rely on Transmit Security's xCIAM platform to provide their customers with smooth experiences protected from fraud across all channels and devices.\n\nTransmit Security serves many of the world's largest banks, insurers, retailers, and other leading brands, collectively responsible for more than $1.3 trillion in annual commerce. For more information, please visit www.transmitsecurity.com.\n\n\nAbout the Role:\n\nWorking with the latest and most advanced front end libraries and frameworks will be part of this role. Developing portals and SDKs aimed at end users (B2C), developers and company administrators (B2B).\n\nEstablishing a shared FE infrastructure and building a consumer-facing app that integrates ML and human interfaces with the product and design teams.\n\n\nWhat you'll do:\n\nImplement features for a newly developed React-based product (portals and SDKs).\n\nIntegrate different Front End libraries into our infrastructure and experiment with them\n\nCollect requirements from different product groups.\n\nWhat you'll need:\n\nDeveloping consumer-facing apps for over five years.\n\nReact.js and NodeJS experience\n\nYour passion for design and delivering new products is contagious.\n\nAdvantage for\n\nCustomizable apps experience\n\nEmbedding camera input into web applications\n\nEmbedding computer vision/data science algorithms\n\nMobile web development\n\n#LI-TL1 #LI-HybridShow more Report"}, {"company": "R2Net Israel Ltd. - JamesAllen.com", "job": "Lead Software Engineer", "city": "Jerusalem", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1110586&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7672198e&cb=1676383217341&jobListingId=1008201334278&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83jpk7ma4q801-1goos5ft928qb000-a64412e2e35b4369--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNB9cEcgCIbpx0cQF7JvNrbME9QSTOmNUhCioFKdnonZuSIJReA4DPLJ2SR0VhUwLBw-FPRpg88EVNF7HrpPORKLMwT6OeOza7SKIrOczzoN39-U6DI08IAGGoAADBW34zT5JWD4KOUv6PiiemCFkgIQR7UoccfhkD3EAf3S6SGf1xmFzf5Q-aNqTRE5c9uzyjTd-ViLTS1Wagu7efELWNMBqHUJ-Z4Bp79pP4YAhBXQ04ZyqykL-3JVrWjKwWTkcBcYyNw0fCDBnGq9hB-Yc7u6QYBGv0iy3t7rjHFDV0ISsagLYoZ8LoMb8yhIM9bTs4En4xHb2vD5FdG80LNmepM0t5Fg1EgiFVplCGvyrPagYujBAiOqw80jd7xiAsvzuqkLVwADB-3iQzClUPNcKllO43qX5aSOqUSGEWl_e_-aPmw5d6ldfaDrjSw8Aq842QeIpIix42eqbsnhcb39tE028dh5CAZDYimNMgKKkY9JxZkS3O01KeJp7Ikr-o-v7gGVM7sdfExwz0kxpUlUY8q3YQg8bd4u5EPSPmw8f8d_fmggQMiYsutIyKhUtL56T-kvZtlINp1eh50fn5XvgxCE_uRx9CCexJnCBbhckGVv82yvhvMYnbDWkwCX8kTmdfylxXzeTHB_UPuWiQhYa8LJ", "description": "What’s It Like To Work For Us? At R2Net, we’re proud of our unique and diverse work environment, striving to employ people from many different backgrounds and cultures. Every team member has a voice within the company and contributes to our overall development. We provide ample opportunities for growth and cultivate a collaborative and entrepreneurial approach to our day-to-day work.\n\nAdditionally, it is very important to us to promote a strong work-life balance for each of our employees. Responsibilities: Take part in the architecture, design, development, and delivery of complex features in a distributed and dynamic development environment. A hands-on tech lead (80%) to lead a squad of Full-Stack developers; Technically manage, mentor, review, and improve the quality of the code and process. Write Javascript/Typescript for Node.js web services and React Web apps.\n\nWrite well-designed, testable, efficient code that complies with specifications. Experience in developing web applications using React. Experience in NodeJs and Javascript\\Typescript Development. Experience with DevOps tools; Docker\\ Kubernetes\\ CI\\CD.\n\nExtensive experience with full-stack development, distributed systems, and relational databases (MySQL or other). Experience in AWS or another cloud environment. Team player, strong communication skills, a positive attitude, and empathy.Show more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "Senior QA Engineer", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1110586&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e5f5fb1f&cb=1676383218800&jobListingId=1008075714601&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83jr1hkuhp801-1goos5ft928qb000-c7899e9c485291bc--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCxIMfqP5lsjwVDinN3PwsynvlqIOR7H15_csd7yZaCvZLNjnACioMhM3zClr_t9CscIjLAfHgMHF9pjqc7wwPXKIw7VVXS987qQsskTSlksSkC01xkrCZ3e6MDgZQwlURHSvS4B_y3X2bimKYM2bJ3ZeTefcYsOPo4iQ-1X_LOBU6vWLvdwKBD9hkJ4qfh0kG_DxUJj3JZ1XRyLwk7uwkZI2oKSyGqVEHJA9G57hVxnqSdSxeKFSnMk3ogVB80qsqkdyWxBEA5GJYYdM5yrvopwEGBez0UzY9WYfIzINbaauOjERGfm6PcqooPiVSKS9yR5ADoQto1lq7aVWVP7FPBnmH915IGZ8ntHg6s97ws7eoZFjQR6GiYUZzbFiVpjX0mikKtP6BH0nZ3PfuaI602PR1mZLp1BmBBWKixcg2XLnX9RQ-E3A9BMMfyHQkDcwaGeIJRc7e03DUKw3V8eaSZLF1OnaWZLacZZDd7apH_hO4Z8_9KCcuhNG_AP3uyIJ0i1rvH2chnQ-sbc2oH0qoRgZinof3_uZn5SjqhizMsXGM7tKO3GZ7oCq7dq2fy0oZ_Z8sVoKaev56oFR204CKoOZfOPntiWYCWfTNyeN-nVDwiYsiUpOOYUHp2Ds34MRZQn-qPOYILzfNVaojPZfpx", "description": "QA Tech Lead 5+ years experience in planning & executing manual/automated test plans Ability to lead the QA process in the group- define processes, review test plans, guide testers and more. Strong technical and analytical skills Knowledge in Java- advantage Experience in testing SaaS application - advantage Working experience with SQL - advantage ידני ואוטומציה- 50/50 ********* Testing Engineer At least 2 years experience as a Test Engineer Experience with Linux Experience programming in Java/Python Experience with a cloud platform such as AWS, GCP, K8S, MS Knowledge of End-to-End testing, API, Microservices, and backend testing methodologies Strong hands-on experience in designing and developing automation frameworks Knowledge of Networking Excellent teamwork skills העבודה משלבת בדיקות ידניות ואוטומטיות QA Lead At least 2 years experience in building, scaling and leading a QA team in a startup that included automated and manual testing procedures. At least 5 years of software quality assurance or test automation experience in embedded or automotive systems. Expertise working in a CI/CD environment.\n\nExperience in Linux. Good programming skills in common languages, such as Python, BASH. Strong experience with test automation frameworks and scripting. Extensive knowledge in performance tests using tools such as Kibana, ping, iperf, wireshark, etc.\n\nSolid knowledge of software quality assurance methodologies and tools. Knowledge of Scrum/Agile software development process. ********* Senior QA Engineer 3+ years of experience as a QA engineer 2+ years of experience with automation testing tools, such as Selenium, Cypress, Testim, or similar Experience working with Postman. Experience working in an Agile environment Experience in querying databases like MySQL, Postgres, or MongoDB Experience in managing development processes with Jira or other process management tools Familiarity with forensics and monitoring tools (Sentry, Grafana, Prometheus)Show more Report"}, {"company": "VMware", "job": "Senior Success 360 (S360) Customer Success Manager - Opportunity for Working Remotely , Jerusalem", "city": "Jerusalem", "date": "5d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fd87e4f8&cb=1676383219954&jobListingId=1008447390448&jrtk=3-1-1gp83js5ckclr801-1goos5ft928qb000-4d6cc3aee947b773-", "description": "Senior Success 360 Customer Success Manager\nWhy will you enjoy this new opportunity?\nDo you enjoy helping Global and Enterprise organizations achieve their business outcomes through their technology investments? If you do, we have the perfect job opportunity for you!\nAs a Success 360 Customer Success Manager, you will serve as a trusted advisor, driving a cross-functional, unified customer experience for our customers during their transformational journey with VMWare.\nUpon joining our Customer Success team, you will play a critical role in delivering the Success 360 offering for enterprise customers by enabling them to rapidly and successfully onboard, adopt and realize business value with harmonized digital and in-person engagements across the entire customer journey.\nIn the Customer Success Manager role, you will interact daily with your assigned customers, helping them to achieve onboarding and activation milestones in driving product consumption. You will also jointly develop Success Plans with each customer to align their technology objectives to business outcomes.\nAs a Customer Success Manager, you be able to create a long-term relationship with your assigned customers as you develop an understanding of the customer’s desired business outcomes, focusing on maximizing value realization across their VMware portfolio.\nSuccess in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing?\nDuring the first year, you will onboard into the Customer Success role and work with your assigned customers.\nUpon joining the Customer Success 360 team, you will be guided through a well-organized four-week onboarding plan that will be prepared for you.\nAfter onboarding, you will be assigned your first S360 accounts and work to establish ongoing cadence for account meetings with the customer, the account team and internal resources to understand the customer’s current and planned VMware production adoption and use cases.\nOne month after engaging with your customers, you will be able to articulate customer key business objectives and desired outcomes and begin crafting a joint Success Plan with the customer.\nYou will establish ongoing cadence for account meetings with the customer, and orchestrate internal resources to progress toward achieving key milestones.\nYou will create your Success Plan in Gainsight and record all customer activity and milestones throughout the customer journey.\nWithin 3 months of your joining date, you will be able to present your achievements in a Quarterly Business Review using the internal tools and deliverables that we will provide to you.\nYou will collaborate with internal resources to understand customer use cases and identify opportunities for prescribing Adoption Guidance and Workshops to further adoption and consumption.\nYou will proactively monitor customer health, identify expansion opportunities and mitigate renewal risk.\nDuring months 6-12, you will continue to drive business priorities within your assigned accounts and contribute to improving the overall Success 360 practice.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will ensure best-in-class execution; Develop and implement changes in both the customer's and VMware's operations systems that directly add value.\nThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?\nAs part of the s360 Customer Manager team, you will be working throughout the S360 subscription period with several assigned and strategic customers. The activities you will perform are all aligned with the purpose of helping our customers achieve their desired business outcomes through VMware technology. You will orchestrate the adoption and consumption of the VMware technologies the customer has purchased.\nYou will also be collaborating with the broader VMware account team and specialists as you perform the following:\nYou will have a track record of experience in customer success, in an enterprise software or SaaS organization, with a proven track record of successfully managing complex customer relationship in technology.\nYou will develop excellent understanding of VMware and associated technologies.\nYou will keep track of business and technology trends seen in market and hold one or more industry certifications in areas of interest.\nYou will possess robust inter-personal skills and ability to build relationships with internal and client stakeholders (including business and up to C-suite).\nYou will have experience developing and driving business cases that outline value to customers.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will demonstrate ability to manage multiple customer accounts, projects and deadlines simultaneously.\nWhat is the leadership like for this role? What is the structure and culture of the team like?\nThe Global Success 360 team is focused on driving strategic customer outcomes, while enabling our customers to derive maximum value from their VMware solutions. We provide a unified governance model to ensure we are acting as One VMware on behalf of our customers.\nWe strive to have a diverse and unified team, one which is focused on our customers and their success while contributing to a positive team culture. We are an open team who share best practice and collaboration amongst our colleagues. We give back to each other and our communities and welcome innovation and creativity at all levels, to be a meaningful contributor in our countries and societies.\nWhere is this role located?\nFlexible: The role is considered remote (based in Germany) and working from your home office unless otherwise specified by your future manager. You may be required to travel to VMware planned events and to meet with your customers and account teams (up to 25%).\nWhat are the benefits and perks of working at VMware?\nYou will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com.\nMedical Coverage, Retirement, and Parental Leave Plans for All Family Types\nGenerous Time Off Programs\n40 hours of paid time to volunteer in your community\nRethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities\nFinancial contributions to your ongoing development (conference participation, trainings, course work, etc.)\nWellness reimbursement and online fitness and wellbeing classes\nCategory : Services and Consulting\nSubcategory: Customer Success\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2023-02-02\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Show more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "DevOps Team Leader/DevOps Engineer", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": "DevOps Team Leader B.Sc. in Computer Science. At least 3 years experience in team management Proven experience in designing and managing SaaS infrastructure. Experience in building CI/CD in a complex multi-service environment.\n\nArchitectural vision and ability to design scalable and secured cloud-based services. Linux proficiency as sysadmin on Debian and/or RedHat derived distros. Knowledge of network admin: TCP/IP, ssh, HTTP/HTTPS, SSL, NLB. Scripting skills: bash (must), ruby, and/or python.\n\nExperience with Git and familiar with one or more of Github, Gitlab, Bitbucket. Hands-on experience with AWS or similar public cloud. Docker and Orchestration tools (K8S). Monitoring tools (Prometheus, Icinga, Grafana).\n\nCreating and managing clusters of ELK, RabbitMQ / Kafka, Redis. Fluent Hebrew and English – oral and written. ******************* משרה נוספת - DevOps TL Deep experience with Linux system knowledge.(Redhat CentOS) – Must (min 3 years ) Scripting and development skills – Must. (min 3 years ) Experience as a TL DevOps - Must.\n\n(min 2 years ) Experience with networking and configuration management tools .(Ansible/puppet/ Terraform) – Must Knowledge in Linux OS building and customization. Experience with Docker and Kubernetes. Passionate about new technologies. DevOps Engineer 4+ years of experience in a DevOps role Extensive experience in both application development as well as operational support for large, high scale applications Experience with Hashistack - terraform, consul, vault, and nomad Experience with Kubernetes Experience with running Dockers in production Knowledge of at least one of Ruby/Go/Java/Python - more than one is an advantage Experience with automating Cloud Computing platforms (particularly AWS) Understanding of Chef/Puppet/Ansible ****** Knowledge of the ins and outs of cloud providers (AWS, Google Cloud, etc) 3+ years Experience in DevOps or Software Development using the Ops toolset in the industry/Army unit Experience working in an algorithmic/data science system (an advantage) Excellent knowledge of Linux Good knowledge of Docker Good Knowledge of Terraform or similar IaC tools Coding skills (Python / Ruby / JS / Golang) Understanding of CI and CD concepts Working with databases (RDBMS or NoSQL) and large, complex data sets Good understanding of DevOps methodologies and infrastructure level tools Performance monitoring and tuning Understanding of security best practices, both for application (OWASP) and for the organization (SOC2 and the like)Show more Report"}, {"company": "Albert Technologies", "job": "R&D Support Engineer (Tier 3 Support)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=0000018631c2bf3499ce4a6b7ed3c9ee&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_800df959&cb=1676383223722&jobListingId=1006048246395&jrtk=3-1-1gp83jvqi2gpu001-1goos5ft928qb000-1f27589abb23e7ba-", "description": "Responsibilities:\nThe R&D Support Team is the top tier of technical support at Albert. As part of the team you will:\nProvide R&D level (Tier 3) support for Account Managers, Professional Services, and Data Researchers.\nHandle day to day activities in terms of deep investigation of support tickets, escalation handling, monitoring alarms, and alerts.\nWork with developers and product teams to resolve problems in production and deliver fixes.\nRequirements:\nRequirements:\n2+ years of proven experience as a Tier 3 support engineer.\nBachelor’s degree in information systems, software engineering or equivalent.\nHigh-level of troubleshooting production bugs, logs analysis, and performance troubleshooting.\nVery eager to dig into technical support issues to figure out the root cause.\nExperience with SQL scripting.\nWillingness to work in a start-up software company.\nBring a positive, collaborative, team-oriented attitude to the office and your customers every day.\nAdvantage:\nBackground in Python programming, Javascript.\nBackground in the online marketing field.\nFamiliarity with Facebook Business Manager, Google Adwords, Google Analytics.\nJOIN TO US\nSend your CV to cv@albert.aiShow more Report"}, {"company": "Nano Dimension", "job": "Engineering NPI Leader", "city": "Ness Ziona", "date": "21d", "rating": "3.7", "link": "", "description": "Nano Dimension (Nasdaq: NNDM) is a leading electronics provider that is disrupting, reshaping, and defining the future of Additive Manufacturing systems for electronics.\n The Engineering Department at Nano Dimension is looking for an Experienced Mechanical/ Electrical Engineer to join the NPI HW Matrix Team.\n Nano Dimension’s Engineering department is part of the operation division. The Engineering department is responsible for all manufacturability and sustainability aspects of Nano’s multidisciplinary products.\n We simply do things differently. What about you?\nResponsibilities\n You’ll be acting as Engineering NPI Leader, joining the Engineering Matrix team: Hardware Leading team at Nano Dimension.\n What will you do as Mechanical/ Electrical Engineer in the Engineering Department?\n Be A Leader, responsible for all the product engineering activities and changes\nWork with R&D to withstand engineering standards and Demands\nGet clear definition from the clients (project managers, Production, Service department) and plan the mechanic own activities accordingly\nLead and implement CAD Designs, ECO (models and drawings)\nYou'll be a part of Engineering responsibilities – design for cost, cycle time, reliability, and manufacturability.\nWrite technical documentation (assembly instructions, calibration instructions, test plans, etc.)\nMechanic/ Electric design is focusing mainly on Electro-mechanics (motion mechanisms, etc.), Cabling, Chassis & production support tools (jigs and fixtures)\nWorking with Nano’s suppliers, mechanical lead, and supplier NPI readiness\nPlay as technical information pivot with operations dept.\n#LI-Onsite\nResponsibilities\nWhat will make you succeed in the role?\nProduct Leader in a multidisciplinary company\nMinimum 3 years of Mechanic/ Electric design.\nExperience in Engineering/NPI.\nBSc Mechanical/ Electrical Engineering.\nExperience and Knowledge in CAD SW, SolidWorks, Windchill, PDM.\nProduct BOM builds & maintenance by ECO’s via PLM (Windchilll) interface with SOLIDWORKS\n\nGroup:\n\nNano DimensionShow more Report"}]