[{"company": "GE Healthcare", "job": "Verification Intern", "city": "Haifa", "date": "5d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1f643c71&cb=1676383021378&jobListingId=1008447299430&jrtk=3-1-1gp83dq742ing001-1goos2egqgahm800-d55a5cd7c7672f4e-", "description": "Job Description Summary\nVerification Intern\n\nDescription:\n Design and write STD with understanding testing methodology.\n Analyze and debug failures and issue founded reports.\n Customer documentation verification.\nJob Description\nVerification Intern\nDescription:\nDesign and write STD with understanding testing methodology.\nAnalyze and debug failures and issue founded reports.\nCustomer documentation verification.\nIntegrated work with development teams.\nDetermining priority for test scenario and creating execution plans for implementation.\n\nAdvantage and Qualification:\nExperience in SW & System testing.\nExperience in writing test plans and challenge the development and system teams.\nTeam player who has excellent interpersonal skills.\nFast learner and looking to be exposed and work with new technologies.\nHighly dedicated and motivated engineer.\nISTQB is an advantage.\nTest tools and framework ALM & Jira.\nInclusion and Diversity\nGE Healthcare is an Equal Opportunity Employer where inclusion matters. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\nWe expect all employees to live and breathe our behaviors: to act with humility and build trust; lead with transparency; deliver with focus, and drive ownership – always with unyielding integrity.\nOur total rewards are designed to unlock your ambition by giving you the boost and flexibility you need to turn your ideas into world-changing realities. Our salary and benefits are everything you’d expect from an organization with global strength and scale, and you’ll be surrounded by career opportunities in a culture that fosters care, collaboration and support.\nAdditional Information\nThe job is open to men and women equally\nRelocation Assistance Provided: NoShow more Report"}, {"company": "Texas Instruments", "job": "Sales Engineering / Account Management Intern – Ra'anana near Tel Aviv, Israel", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d1979772&cb=1676383023039&jobListingId=1008333254479&jrtk=3-1-1gp83drs2i3be801-1goos2egqgahm800-c26252f8b0a0692c-", "description": "We can't predict what the future holds, but we know Texas Instruments will have a part in shaping it.\nAre you an early technology adopter and want a glimpse of the latest products before anyone else? A Technical Sales Engineer internship may be a fit for you. Combine your technical skills with selling and marketing skills to help our customers solve their most challenging problems, and to develop and deliver innovative solutions across various end equipments. Technical Sales Engineers at TI work directly with customers to ensure TI technologies are in the world’s next-generation innovations.\n\nTechnical Sales Engineer Intern responsibilities include:\nGain hands-on experience in one of our Field Sales Offices (FSO) learning the Technical Sales Engineer role and how we conduct business with our customers\nLearn how our Technical Sales force engages with TI’s business units\nWork on hands-on, challenging projects and have opportunities to present your findings to leaders, including running a market analysis, customer case studies, running a project kick off, choosing high growth accounts, and making a final intern presentation\nTexas Instruments will not sponsor job applicants for visas or work authorization for this position.\nMinimum Requirements:\nPursuing a Bachelors degree in Electrical Engineering, Computer Engineering, Electrical and Computer Engineering or related field\nPreferred Qualifications:\nAbility to effectively balance strong technical skills with solid relationship-building capabilities\nDemonstrated strong analytical and problem solving skills\nStrong written, verbal communication skills\nAbility to work in teams and collaborate effectively with people across various functions\nStrong time management skills that enable on-time project delivery\nDemonstrated ability to build strong, influential relationships\nAbility to work effectively in a fast-paced and rapidly changing environment\nAbility to take the initiative and drive for results\nWhy TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics.\nWe’re different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI\nBenefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "Texas Instruments", "job": "Field Applications Engineering Intern (m/f/d) – Tel Aviv, Israel", "city": "Raanana", "date": "13d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_caebf9e0&cb=1676383024319&jobListingId=1008430376721&jrtk=3-1-1gp83dt2vk6dk801-1goos2egqgahm800-6336d0be7ac020f0-", "description": "We can't predict what the future holds, but we know Texas Instruments will have a part in shaping it.\nDo you strive to understand how electronics work, and enjoy solving technical problems? If so, a Field Applications Engineer internship may be the role for you. This internship is designed to establish you as a broad technical TI expert with customer engineers and internal teams, and to teach you how functional product characteristics correlate to system-level requirements. Demonstrate your technical competency on product selection, systems, implementation and debug, as you prepare for a career as a Field Applications Engineer.\n\nField Applications Engineer Intern responsibilities include:\nGain hands-on experience in one of our Field Sales Offices (FSO) learning the Field Applications Engineer role and how we conduct business with our customers\nLearn how our Field Applications force engages with TI’s business units\nWork on hands-on, challenging projects and have opportunities to present your findings to leaders, including running a market analysis, customer case studies, running a project kick off, choosing high growth accounts, and making a final intern presentation\nPut your talent to work with us as a Field Applications Engineer Intern – change the world, love your job!\nTexas Instruments will not sponsor job applicants for visas or work authorization for this position.\nMinimum Requirements:\nPursuing a Bachelors degree in Electrical Engineering, Computer Engineering, Electrical and Computer Engineering or related field\nPreferred Qualifications:\nAbility to effectively balance strong technical skills with solid relationship-building capabilities\nDemonstrated strong analytical and problem solving skills\nStrong written, verbal communication skills\nAbility to work in teams and collaborate effectively with people across various functions\nStrong time management skills that enable on-time project delivery\nDemonstrated ability to build strong, influential relationships\nAbility to work effectively in a fast-paced and rapidly changing environment\nAbility to take the initiative and drive for results\nWhy TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics.\nWe’re different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI\nBenefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "SAP", "job": "Intern - Product Manager Customer Data Cloud ( Gigya)", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7705e277&cb=1676383025683&jobListingId=1008423629640&jrtk=3-1-1gp83dueg2pv5001-1goos2egqgahm800-9f03d644ecda096c-", "description": "We help the world run better\nOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now!\nCompany Description\nSAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.\nSAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift societies, and sustain our environment. Because it’s the best-run businesses that make the world run better and improve people’s lives.\nMeet your team\nJoin the SAP Customer Experience Product & Engineering team and have a positive impact on how businesses are run across the globe. SAP CX is a leader in enterprise cloud applications for cloud CRM and DXP solutions, with thousands of organizations using our SaaS solutions to understand their customers best and engage with relevance and personalization. If you think you have what it takes to be part of a fun, fast paced, diverse, and talented group of team members who are the driving force behind our company’s product portfolio, then we want to hear from you!\nWhat you’ll do\nIn order to win and help our customers succeed , we strive to build best in class products in the Customer identity and Access management area. Our Product and development teams work together to fulfill this mission.\nAs part of your role you will be required to have in-depth understanding of our organization products, features, operations, and business environment. You will need to collaborate with the product managers on the website roadmap , help build the product backlog and follow up on the plans vs execution with the development teams.\nWhat we offer?\nPractice at one of the leading software development companies in the world\nWorking in a multinational environment\nExperience with highly scalable MACH-based SaaS applications\nSAP product know-how\nFriendly and open colleagues\nA compensation package above average\nContinuous personal and professional growth\nSuperior office and work environment\nInternational team\nWhat’s the job?\nEnsure product definition: Assist in describing the product backlog which reflects customer and user needs.\nEnsure product roadmap definition : Assist in maintaining product roadmap accuracy and transparency\nAssist in enriching the product backlog and support the scrum team and other relevant stakeholders to understand the backlog.\nEnsure product delivery: Support the validation of planned and implemented scope throughout the product lifecycle.\nAssist in creation of product-related non-coded assets (such as rollout and knowledge transfer material).\nAssist in collection and incorporating feedback from customers and other relevant stakeholders.\nWhat are we looking for?\nA student currently pursuing a bachelor's or master's degree with up to 18 months remaining to graduation\nCurrent student status in a recognized higher-education institute is required\nYou are interested in product management\nResponsible, detail-oriented, and able to handle complex tasks independently while meeting goals.\nA team player with the ability to work well with other team members across different locations\nFluent in verbal and written English\nBesides that, you are reliable, organized and have very good communication skills\nWhat do you need to stand out?\nYou want to work solving complex business problems\nYou are curious and proactive\nYou have a “Can do” attitude\nWe build breakthroughs together\nSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.\nWe win with inclusion\nSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.\nEOE AA M/F/Vet/Disability:\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.\nRequisition ID: 364829 | Work Area: Solution and Product Management | Expected Travel: 0 - 10% | Career Status: Student | Employment Type: Limited Part Time | Additional Locations: #LI-Hybrid.Show more Report"}, {"company": "Cisco Systems", "job": "Software Engineer Intern - Netanya, Israel", "city": "Netanya", "date": "29d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2b4855c3&cb=1676383026953&jobListingId=1008397016244&jrtk=3-1-1gp83dvlik6ep801-1goos2egqgahm800-072f9dc2ec84c191-", "description": "Location: Netanya, Israel\n\nWHY YOU’LL LOVE CISCO\nWe connect everything: people, processes, data, and things. We innovate everywhere, taking bold risks to shape the technologies that give us smart cities, connected cars, and handheld hospitals. And we do it in style with unique personalities who aren’t afraid to change the way the world works, lives, plays and learns. We are thought leaders, tech geeks, pop culture aficionados, and we even have a few purple haired rock stars. We celebrate the creativity and diversity that fuels our innovation. We are dreamers and we are doers. #We Are Cisco\n\nWHAT YOU'LL DO\nWe are looking for Software Engineer Intern to join the Security Policy Access (SPA) product development team. In this role you will work on design and implementation of ground-breaking new features and tackle critical customers issues in high scale enterprise production environments.\n\nWHO YOU'LL WORK WITH\nCisco is redefining the networking industry. To make this happen, we are heavily investing in team responsible for the Network. We are disrupting the industry by building a new networking platform that can learn, adapt, and secure itself at the speed of today’s businesses. Cisco Digital Network Architecture platform automates network management and provides our customers with state-of-the-art analytics and insights. You will work with one of the most hardworking group of engineers in the industry, bringing innovation into the networking world.\n\nREQUIREMENTS\nStudent graduating in late 2023/early 2024 pursuing a BA/BSc in Computer Science or Software Engineering from Technion, Tel Aviv, Ben-Gurion or Hebrew University with a GPA of 85 or above- Strong software development skills in Java/C#/C++- Good understanding of standard networking protocols- Software development experience in Linux environment- Very good verbal and written communication skills (English) - Hands on experience with scripting languages (Python, Perl)- You are curious to learn new technologies and collaborate with fellow engineers to raise the bar to create team success\n\nWe understand from experience that not ticking every box on the skills sections stops many from applying. You should apply if you feel you are the right person for the job and have the aptitude to learn and deliver results.\n\n #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. We embrace digital, and help our customers implement change in their digital businesses. Some may think we’re \"old\" (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do - you can’t put us in a box!But \"Digital Transformation\" is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)Day to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "Texas Instruments", "job": "VLSI Verification Engineer Intern", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_33aa844f&cb=1676383028145&jobListingId=1008378074163&jrtk=3-1-1gp83e0r8ihn6801-1goos2egqgahm800-2f1b154b3a10e682-", "description": "Why TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics. We're different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI\nBenefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\n\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nAbout the Job\nWe are looking for a passionate VLSI Verification student to join our HW group for a challenging, multidisciplinary job in the IOT space.\nJob Responsibilities\nDefine, design, implement and debug verification environments and tests for cutting edge wireless products.\nDeep dive into both low level and system level modules\nMinimum requirements:\nA student of Electrical Engineering or a related major 1-2 years before graduation\nAbility to work with local and global teams\nSelf-learner, with an internal motivation to learn new things and tackle engineering tasks\nStrong communication skills – Verbal and written\nPreferred qualifications:\nKnowledge in telecommunication, preferable to wireless protocols\nExperience with programming and scripting languages: python, Perl, C, Matlab etc.\nSystem-Verilog or Specman knowledge\nOur offer for you:\nBenefit from an attractive compensation\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture\nExplore a world of opportunities for your personal and professional development\n\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "Texas Instruments", "job": "Validation/Characterization Engineering Intern", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ff8b4e6a&cb=1676383029345&jobListingId=1008378074160&jrtk=3-1-1gp83e1viklv0801-1goos2egqgahm800-cc34a933e0485198-", "description": "Why TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics.\nWe're different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI\nBenefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nWe can't predict what the future holds, but we know Texas Instruments will have a part in shaping it.\nThe Validation/Characterization Engineering Intern at Texas Instruments are powered by a passion for continual improvement. Our solutions make a real difference and yours will, too. We make the semiconductor product design process easier and faster, which helps our customers succeed in today's fast-paced marketplace.\n\nIn this role, you’ll support the development and implementation of strategies that achieve profitability targets on assigned TI product lines through new product development, cost reduction, capacity expansion and yield enhancement projects. You’ll serve in development and implementation of cost-effective analog test techniques, resolve customer quality and application issues, and facilitate cross-functional teams for problem solving. You will collaborate with Analog Design on design-for-test features and Applications team on validation, while also tackling challenging problems in achieving analog performance testing on ATE multi-site hardware. These teams develop differentiating innovations in the test domain, ranging from methods to lower test cost for TI without compromising quality, to identifying design improvements for test, and resolving complex technical problems requiring an individual to transcend multiple domains.\nMinimum requirements:\nPursuing an undergraduate or graduate degree in Electrical Engineering or related degree\nCumulative 3.0/4.0 GPA or higher\nPreferred qualifications:\nAbility to establish strong relationships with key stakeholders critical to success, both internally and externally\nStrong verbal and written communication skills\nAbility to quickly ramp on new systems and processes\nDemonstrated strong interpersonal, analytical and problem-solving skills\nAbility to work in teams and collaborate effectively with people in different functions\nAbility to take the initiative and drive for results\nStrong time management skills that enable on-time project delivery\nOur offer for you:\nBenefit from an attractive compensation\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture\nExplore a world of opportunities for your personal and professional development\n\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "Cisco Systems", "job": "Software Engineer Intern - Caesarea, Israel", "city": "Israel", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5df3473a&cb=1676383031002&jobListingId=1008306907250&jrtk=3-1-1gp83e3jdp2kl801-1goos2egqgahm800-2355160ff5f42f29-", "description": "Location: Caesarea or Tel-Aviv, Israel\nStart Date: Flexible - in accordance with the university schedule\nWhat You'll Do\nYou'll develop Core Software technologies at the heart of tomorrow's leading infrastructure solutions, tackling the entire range of challenges from user-facing API-s, through high-level algorithms, all the way down to firmware.\nThe Cisco silicon One team is leading the silicon development in Cisco. We use the latest silicon technologies to build largest scale and most complex devices at the edge of feasibility.\nIf you want to work with amazing people, developing the first iteration of world-class products, join us!\nWho You'll Work With\nYou'll be part of the Cisco Silicon One team - an amazing group driving Cisco game changing next generation network devices - Cisco Silicon One™. Our unique team works in a startup atmosphere inside a stable and leading corporate environment on the outside.\nWe are transforming the industry and building a new internet for the 5G era, providing a unified, programmable silicon architecture that is the foundation of all Cisco's future routing products.\nOur design center is unique - hosting all silicon HW and SW development disciplines inside one site.\nOur devices are designed to be universally adaptable across service providers and web-scale markets, designed for fixed and modular platforms. Our devices deliver high speed without sacrificing programmability, buffering, power efficiency, scale or feature flexibility.\nCisco Silicon One™ is a revolutionary, ground-breaking technology for our customers and end users for decades to come! The Internet now has a new faster, better, safer engine!\nLearn more about us right here:\nSilicon One Article\nCisco Silicon One movie\nCisco CEO talks to Fortune about 5G Chips\nIsraeli Calcalist on Leaba Cisco acquisition (in Hebrew)\nCisco Bets Its Business on 'Internet for the Future' Strategy\nWhat are we looking for?\nBrilliant ambitious and motivated individual, regardless of previous experience.\nTeam players who enjoy big challenges\nStudents of Computer Science with GPA above 88 from leading Israeli Universities, graduating in 2023-24\nPeople who can quickly ramp on multiple, interdisciplinary domains.\nWhy Cisco\nWe connect everything: people, processes, data, and things. We innovate everywhere, taking bold risks to shape the technologies that give us smart cities, connected cars, and handheld hospitals. And we do it in style with unique personalities who aren’t afraid to change the way the world works, lives, plays and learns.\nWe are thought leaders, tech geeks, pop culture aficionados, and we even have a few purple haired rock stars. We celebrate the creativity and diversity that fuels our innovation. We are dreamers and we are doers.\n#WeAreCisco\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "Texas Instruments", "job": "WIFI Software Engineering Intern", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7a1ab97a&cb=1676383032413&jobListingId=1008325219957&jrtk=3-1-1gp83e4vvi393801-1goos2egqgahm800-0092672805e62a0c-", "description": "Why TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics.\nWe're different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI\nBenefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nAbout the Job\nWe are looking for a student to join our WIFI SW team, developing and implementing meaningful advanced cross layer networking for our next generation WIFI products.\nMinimum requirements:\nBSc Electrical / Communication Engineer / Computer Science student with more than a year left to complete, average grade >82\nSelf-learner, able to study from documentation\nIndependent, able to perform a complex task on his own\nAbility to work in a team and with people outside his team\nAdvantages:\n1 year of experience in C programming/real time embedded platforms/Networking protocols\nKnowledge in telecommunication, preferable to wireless protocols\nComplex system issue analysis and advanced debugging technique’s\nAvailability for 3 days a week or more\nOur offer for you:\nBenefit from an attractive compensation\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture\nExplore a world of opportunities for your personal and professional development\nPut your talent to work with us as a Software Engineering Intern – change the world, love your job!\nTexas Instruments will not sponsor job applicants for visas or work authorization for this position.\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "Meta", "job": "Research Engineer Intern, Computer Vision and ML (PhD) (Tel-Aviv)", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_24d60f2a&cb=1676383034371&jobListingId=1008458339346&jrtk=3-1-1gp83e6rt2pv5001-1goos2egqgahm800-4b74c99892f0111b-", "description": "Meta Reality Labs team is helping more people around the world come together and connect through world-class Augmented, Mixed and Virtual Reality hardware and software. With global departments dedicated to AR/VR research, computer vision, haptics, social interaction, and more, we are committed to driving the state-of-the-art forward through relentless innovation. AR and VR potential to change the world is immense - and we're just getting started.Our team explores, develops, and delivers new cutting-edge technologies that serve as the foundation of current and future Meta products. From visual localization, SLAM, 3D reconstruction, mapping, and context/semantic understanding, our team is focused on taking new technologies from early concept to the product level while iterating, prototyping, and realizing the human value and new experiences they open up.\n\n\nResearch Engineer Intern, Computer Vision and ML (PhD) (Tel-Aviv) Responsibilities:\n\nParticipate in cutting edge Computer Vision & Machine Learning research and development for VR/AR/MR related topics\nDevelop algorithms and software that will be part of mass-market shipping consumer products\nDocument, present your progress and project, and be motivated to publish your findings at high-impact CV/ML conferences\n\n\nMinimum Qualifications:\n\nCurrently in the process of obtaining a PhD degree in Computer Science, Electrical Engineering, or Electrical and Computer Engineering in the field of computer vision, machine learning, computer graphics, or robotics.\nMust be currently enrolled in a full time degree program and returning to the program after the completion of the internship\n3+ years experience with Python and/or C++\n2+ years experience with modern deep learning frameworks like PyTorch\nKnowledge in Computer Vision, in one or more of the following domains: Mutli-View Geometry (e.g. Structure-from-Motion, Multi-View Stereo, SLAM), Visual Localization, Object Recognition, Semantic Segmentation, Semi / Weakly / Self-supervised Machine Learning, Computational Geometry, Robotics and Tracking\nExcellent interpersonal skills, cross-group and cross-culture collaboration\nAbility to communicate complex research in a clear, precise, and actionable manner.\nHigh levels of creativity and quick problem solving capabilities\nProven track record of achieving significant results\n\n\nPreferred Qualifications:\n\nProven track record of achieving significant results as demonstrated by publications in top computer vision conferences (e.g., CVPR, ICCV, ECCV, or, SIGGRAPH) or journals (e.g., IEEE Transactions on Pattern Analysis and Machine Intelligence, International Journal of Computer Vision, Pattern Recognition, or IEEE Transactions on Image Processing).\nDemonstrated software engineering experience via an internship, work experience, coding competitions, open source contributions, or research\nIntent to return to a degree-program after the completion of the internship/co-op.Show more Report"}, {"company": "Amazon Data Services Israel", "job": "Software Dev Engineer Intern", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b211f320&cb=1676383035544&jobListingId=1008142270282&jrtk=3-1-1gp83e831k60h801-1goos2egqgahm800-6fb43868eaf37115-", "description": "Currently enrolled in a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, or related fields at time of application\nAlthough no specific programming language is required – you should be familiar with the syntax of languages such as Java, C/C++, or Python\nKnowledge of Computer Science fundamentals such as object-oriented design, algorithm design, data structures, problem solving and complexity analysis\n\nJob summary\nWe’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact, visionary person you know you’re ready to be. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth.\n\nHow often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.\n\nIf you’re insatiably curious and always want to learn more, then you’ve come to the right place.\n\nWith us, you’ll get good at making fast decisions, taking calculated risks and fearlessly chasing excellence.\n\n\nAs an intern, you will be matched to a manager and a mentor. You will have the opportunity to impact the evolution of Amazon technology as well as lead mission critical projects early in your career. Your design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed systems, data mining, automation, optimization, scalability, and security – just to name a few.\n\nKey job responsibilities\n\nCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring to market innovative products and services.\nDesign and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\nCreate solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\nBuild distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\nAbility to design and code the right solutions starting with broadly defined problems.\nWork in an agile environment to deliver high quality software.\nApplications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that Amazon works with a high volume of applicants. We appreciate your patience as we review applications for future Amazonians!\n\nPlease include a grade sheet/academic transcript (in English) along with your CV in a single PDF when submitting your application.\n\nPrevious technical internship(s) if applicable\nExperience with distributed, multi-tiered systems, algorithms, and relational databases\nExperience in optimization mathematics such as linear programming and nonlinear optimization\nAbility to effectively articulate technical challenges and solutions\nAdept at handling ambiguous or undefined problems as well as ability to think abstractlyShow more Report"}, {"company": "Alpha Omega", "job": "Intern Software Engineer", "city": "Northern", "date": "28d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_61a76791&cb=1676383037087&jobListingId=1008399648873&jrtk=3-1-1gp83e9itjoqr801-1goos2egqgahm800-3f9dda05ffd02dfd-", "description": "Job Description:\n\nThe selected candidate will join an R&D team developing one of Alpha Omega’s market-leading products. Assigned tasks will include logic and GUI design and development, as part of the team’s plans. The development environment includes interfaces with algorithms, hardware and human operators. Development is done under MS Windows OS.\n\n\nQualifications:\n\nStudent in Computer science, Computer Engineering or other relevant engineering degree.\nAvailability two/three times a week\nExpertise in building GUI is an advantage.\nExpertise in C++ coding is an advantage.\nCandidate might be requested to travel to the company headquarters in Tsiporit\n\n\nSuitable candidates shall submit their CV to: hr@alphaomega-eng.comShow more Report"}, {"company": "Alpha Omega", "job": "Intern Verification & Validation Engineer", "city": "Northern", "date": "14d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c33a5048&cb=1676383038733&jobListingId=1008428123590&jrtk=3-1-1gp83eb66j4h3801-1goos2egqgahm800-7178db87e6800426-", "description": "Job Description:\n\nDefine the V&V plans working with various R&D teams (SW, HW, and Mechanics) as well as the product team to meet the product requirements.\nImplement the V&V plans by defining, implementing and debugging the tests.\nEnsure responsibility for the products quality.\nEnsure that the product meets the AO Quality Assurance (QA) guidance in order to meet the medical quality criteria.\nEnsure high customer satisfaction by working with the support team on debugging the customer issues.\n\n\nQualifications:\n\nBSc (or higher) in any of the following subjects: Software, Computer, Hardware or biomedical Engineering.\nAbility to work 2-3 days a week\nSignal processing background.\nExperience in MATLAB.\nExperience in C/C++ Programming – advantage.\nKnowledge in medical products development – advantage.\nExperience in V&V projects – advantage.\nGood communication skills & team work.\nFluent English: reading speaking & writing.Show more Report"}, {"company": "Texas Instruments", "job": "VLSI Design Engineer Intern", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1369ceb3&cb=1676383040133&jobListingId=1008378074149&jrtk=3-1-1gp83eci9kuhv801-1goos2egqgahm800-3c06d3e0c2a0165b-", "description": "Why TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics. We're different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI Benefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nAbout the Job\nWe are looking for a passionate VLSI Design student to join our Hardware group for a challenging, multidisciplinary job in the IOT space.\nJob Responsibilities\nDefine, design, implement and integrate block modules for cutting edge wireless products.\nRun and debug tests for design validation.\nDeep dive into both low level and system level modules.\nMinimum requirements:\nA student of Electrical Engineering or a related major 1-2 years before graduation\nAbility to work with local and global teams\nSelf-learner, with an internal motivation to learn new things and tackle engineering tasks\nStrong communication skills – Verbal and written\nPreferred qualifications:\nKnowledge in telecommunication, preferable to wireless protocols\nExperience with programming and scripting languages: python, Perl, C, Matlab etc.\nSystem-Verilog or Verilog knowledge\nOur offer for you:\nBenefit from an attractive compensation\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture\nExplore a world of opportunities for your personal and professional development\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "Texas Instruments", "job": "BLE System Test Intern", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9e2bb04e&cb=1676383041608&jobListingId=1008325219970&jrtk=3-1-1gp83ee08khrt801-1goos2egqgahm800-79d81774e25437b6-", "description": "Why TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics.\nWe're different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI\nBenefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nAbout the Job\nWe are looking for a student to join our System Test team, responsible for defining, developing and performing tests on a system level for our Bluetooth Low Energy (BLE) products.\n\nMinimum Requirements:\nBSc Electrical / Communication Engineer / Computer Science student with more than a year left to complete, average grade >83\nSelf-learner, able to study from documentation\nAble to perform a complex tasks Independently\nAbility to work in a team and with people outside the team\nPreferred Qualifications:\nKnowledge in telecommunication, preferable to wireless protocols\nKnowledge in C and Python languages\nExperience in writing test scripts, developing test tools and automation\nExperience in defining test procedures, writing test documents\nExperience with test equipment, building test setups\nAvailability for 3 days a week or more\nOur offer for you:\nBenefit from an attractive compensation\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture\nExplore a world of opportunities for your personal and professional development\nPut your talent to work with us as a Software Engineering Intern - change the world, love your Job!\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "Meta", "job": "Research Scientist Intern-Computer Vision and Machine Learning (PhD) TLV", "city": "Tel Aviv-Yafo", "date": "25d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=0000018631c139d0962f5721da8665e7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c20ea87f&cb=1676383042794&jobListingId=1008406565689&jrtk=3-1-1gp83ef5cklue801-1goos2egqgahm800-e84dca291becee09-", "description": "The Reality Labs (RL) team is helping people around the world to come together and connect through world-class AR/VR experiences. We are seeking Research Interns to join the RL XR People team and work on novel CV/ML research to augment human appearance and expression. Through that, our team enables immersive new experiences that bring people closer together and enhance the way we interact with each other.\n\n\nResearch Scientist Intern-Computer Vision and Machine Learning (PhD) TLV Responsibilities:\n\nDevelop and execute on a research project related to computer vision, machine learning and generative models.\nPush state of the art research from recent top conferences (e.g., CVPR, ICCV, ECCV, SIGGRAPH, NIPS, ICLR, PAMI, IJCV).\n\n\nMinimum Qualifications:\n\nCurrently has, or is in the process of obtaining, a PhD degree in Computer Science, Electrical Engineering, or Electrical and Computer Engineering in the field of computer vision, machine learning, computer graphics, or robotics or related field.\nMust obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment.\n2+ years experience with building systems based on computer graphics, computer vision or machine learning methods.\n3+ years experience in C++ and Python.\n\n\nPreferred Qualifications:\n\nProven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as [insert several top conferences that are relevant to the position - e.g. “CVPR, ECCV/ICCV, SIGGRAPH, or similar\"\nDemonstrated software engineer experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. Github)\nExperience working and communicating cross functionally in a team environment\nIntent to return to a degree-program after the completion of the internship\nProven track record in Image analysis and synthesis (e.g. GAN, semantic segmentation, lighting estimation...)\nProven track record in Semi-supervised learning, self-supervised learning, or domain adaptation\nProven track record in 3D reconstruction and/or modeling\nProven track record in body shape modeling\nProven track record in Differentiable rendering and analysis by synthesisShow more Report"}, {"company": "Texas Instruments", "job": "WiFi System Test Intern", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "", "description": "Why TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics.\nWe're different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI\nBenefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nAbout the Job\nWe are looking for a student to join our System Test team, responsible for defining, developing and performing tests on a system level for our next-gen Wi-Fi products.\n\nMinimum Requirements:\nBSc Electrical / Communication Engineer / Computer Science student with more than a year left to complete, average grade >82\nKnowledge in C and Python languages\nAvailability for 3 days a week or more\nPreferred Qualifications:\nExperience in defining test procedures, writing test documents\nExperience with test equipment, building test setups\nKnowledge in telecommunication, preferable to wireless protocols\nExperience in writing test scripts, developing test tools and automation\nOur offer for you:\nBenefit from an attractive compensation\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture\nExplore a world of opportunities for your personal and professional development\nPut your talent to work with us as a Software Engineering Intern – change the world, love your job!\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}]