[[{"company": "Nisha Group", "job": "Full Stack Engineer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "", "link": "", "description": "תיאור משרה:לחברה בתחום הסייבר לארגונים. מסייעת לחברות לבנות עמידות בפני מתקפות רשת וכן לבלום ולהביס מתקפות מורכבות ברשתות שלהן. דרוש/ה Full Stack Engineerפיתוח בPython וReact, כ50.50דרישות משרה:לפחות 3 שנות ניסיון בפיתוח-חובהניסיון של לפחות 3 שנים בפיתוח Python- חובהניסיון בפיתוח React/angular/vue- חובהניסיון עם CLOUD- חובה (AWS- יתרון)KUBERNETES- יתרוןניסיון עם SQL- יתרוןסוג המשרה: מלאהShow more Report"}, {"company": "Gimmonix Technologies", "job": "Technical Support Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "We Are GimmonixGimmonix is a rapidly growing travel technology company at the forefront of solving some of the most complex challenges in the travel industry. And we’re looking for a driven candidate to join our team as customer support.We offer the most cutting-edge solutions for the rapidly growing demand in the travel industry, meaning more and more industry giants are jumping on board.The roleWe are looking for an experienced Customer Support Specialist to assist our customers with technical problems when using our products and services.Customer Support Specialist responsibilities include resolving customer's queries, guiding new clients, recommending solutions and guiding users through product features and functionalities. To be successful in this role, you should be curious, explore and resolve problems, and be an excellent communicator who’s able to earn our clients’ trust.ResponsibilitiesSupport and answering clients’ queriesAPI integration and functionalitySystem functionality monitoring by examining logsPerformance monitoringTraining and guidance to clients on functionality and settingsWhat you bring to the teamPrevious experience as Technical SupportPrevious experience with Travel industry or Travel-techEnglish as mother language level, other languages is a significant benefitEager to learn and tackle complicated problemsExperience with SQLExperience with XML, JSON, and with one of the following tools Postman, Insomnia - a MUSTExperience with calls and training to clientsJob Type: Full-timeShow more Report"}, {"company": "Unleash", "job": "Junior QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\nWe are looking for a Junior QA Engineer to join our R&D team and continue growing our product!\nYour main responsibilities will include:\nPlanning and execution of tests on both Front and Backend sides as well as integrations with external services\nExecuting hands-on manual tests of the companies products on different OS\nUse a variety of tools for debugging and executing tests\nReporting and tracking issues (bugs and tasks)\nWorking collaboratively with other team members from the Product and Development teams\nReport to QA Team lead\nRequirements and Qualifications:\nGraduate of a software testing course or a relevant academic degree\nAt least 1 year of experience as a manual software tester\nUnderstanding of client/server model\nExperience working with Linux & Mac\nGood inter-personal skills\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork, and you hold these skills, send us your CV!Show more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "Technical Program Manager", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7cbcf0b9&cb=1676382728096&jobListingId=1008447191029&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp834rq4ghq4801-1goorv390gagj800-d666879be9cb1f25--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAHwcAGFGW2fWkEWh-nkgPk-YSUZqDgSb0y6-XNoMQ82z6LVTSkWlwfxKe2VeVo_NJ9dL10GUXEvI0xpRYl8P8Bq7LnOerrDWGlD_hbVHJ8svrUCoblNCji3CImlwfI-1m0bemFdLns6fnAj-FydLwgg0IkG8OFSd4iBfNKxfiArynQYjRQGJ2egSUgCLEK8vXbkSkt1Fxeg8V8L-7CF2gOnSbVS8lyNgGhBn0wwqse2p1UL1y5bvsk-xKw7p-OMGuPbkEyjPW5VdRKovTshQ2LjPxclG7mSqERqP9AbOiqeX6AAQGV2V-qdBjKXlHbT95hUtyu6qG8z-RcNk0AG9d3SNoTL7csyAy0fFwu0S9uAIY6r0CYnHENDRHwh2U17FlQ9zH31rxjl1YR-g80QIuw5SGYHEIFc3N3tjkFLRuvgkjSfbs3dAyT77lz7Qb9Fk6SghbY0PQB2PtqtvRm-pOU9dbbOJ1SdUEEZhjxYKM5NhB7m2kcqL-FoXfhLZ0LtpKhLQoXInyr8I6fXhadQhzyjDK5oq_S0PL7TB4XQj-nU6y_jsy3-6MkK04ZGztjtJ4wyUlQ8H-nAgy29b83jYOrbEo8QQIOqS2lutdlIw_12-4rBTfSIplfZ8RTBFCBlm8mFqyOiiibpOhKx9LPm9W6", "description": "A technical program manager, responsible of leading complex multidisciplinary projects/programs that requires a high level of technical know-how. End to end responsibility throughout the entire development cycle, from inception to mass production. Play a key role in the definition & development of company’s next generation products. Working in full alignment with the internal R&D matrix as well as external stakeholders **Please Apply your CV in WORD Document · B.Sc.\n\n/ M. Sc in Electrical Engineering · Background of at least 5 years as Embedded or Board designer or Embedded Architect · At least 5 years working as a system engineer/project/ program manager from a multidisciplinary company · Experience with leading the development of embedded products · Proven capabilities to develop consumer mass production products · Proven leadership & execution capabilities · Experience working in matrix-based organization (HW, SW, subcontractors and operations) · Hands-on experience in product development which involve HW, FW, SW, RF, QA, and mechanics · Proficiency in MS Office and MS Project · Excellent communication, presentation and organizational skillsShow more Report"}, {"company": "GAN HR", "job": "Field Solutions engineer-Israel", "city": "Jerusalem", "date": "24h", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d95d664f&cb=1676382729620&jobListingId=1008457286189&cpc=8795CF9063CD573D&jrtk=3-1-1gp834t9hkcl4801-1goorv390gagj800-d748441722962032--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDAxgFh48ON3Cz6POLJ8v3RoCAE-AEnLnJZyb1piSHQp2E8RC1FKLBrTFSsNOyPg93_4eFNSKGT--DjdvCyJIuJI1kBTv148xnx3ruIWY-fWy6bZJWCfUqY50N-p4ApvW718Us8iHPB-NT7QEYJbySmCucmP4R3f3tpyHreq8czNHq4J3AqjMeLDE6dmzcotQWNG6cvT3xZ8lvtssFKLj0k7CuczrFUWMiRv06Sy5EK_lTYinELWTkxnNhB9nbswURDkUyDnZKX_trVercZjvg5h0tDdJWzW6HyOCMFsQ3jmOBWKb3nV6r_NMs2NlJF-pJCJmMbSHPVnp_zibSorQg6zb-47DH9NHLhg852_XMepTmzcmNN00AYm8up7PvqO2s1XkOziO56Gl36CWKWu3O5mMxpcvxBK6XRtJlcG-YRe9kfqfLBiW6opGyXo2VATNcTSBL426nnDv0YT-kZpiBykWnNKffande6_8F1A8YffLXibuCJECEUCyIgnvxVAbbqk1kioKJLI3WNXlpJIgtnhP0_flsYIJlP-fHj8OccIi2U52nNbjg3DJDz9cge0MqmtXGxjKKT9zpQHcT8UJp5kwDTotKHkek0wuwywohWKQdL-hChrUWmiFj9YaO6qHK92M0fyT8_gvmoIuZx6Gx0", "description": "\nEducation: Electrical engineering discipline. · 5-7 years’ experience as field application engineer for large electrical systems. · Experience working with Power Utilities, UPS, Generators, Power Electronics. · Ability to read facilities electrical schematics.\nAbility to travel on demand and extensively. · Excellent spoken and written English. · Experience in start-up working environment. Skills: · Strong “Customer Facing” and training attitude.\nStrong analytical skills · Good interpersonal skills, strong oral and written communication skills. · Education: Electrical engineering discipline. · 5-7 years’ experience as field application engineer for large electrical systems. · Experience working with Power Utilities, UPS, Generators, Power Electronics.\nAbility to read facilities electrical schematics. · Ability to travel on demand and extensively. · Excellent spoken and written English. · Experience in start-up working environment.\n\nSkills: · Strong “Customer Facing” and training attitude. · Strong analytical skills · Good interpersonal skills, strong oral and written communication skills.Show more Report"}, {"company": "קווליטסט", "job": "Manual QA Tester", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6c5bd7bb&cb=1676382731904&jobListingId=1008451918427&cpc=8795CF9063CD573D&jrtk=3-1-1gp834vhpkhqv801-1goorv390gagj800-d4db6f9172e24350--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBh999vSCxEVQvRmSxaVwl9DH5Awss6iVTn4DLf-YJhUny7tAy0hEuBFYJ5YSQABgiJcrRALg6h5bEpOCc9pdwWE_CDj0d_HEZZFIhy7Lfop0z4IG8J8n07PFHaViTAV1eiCVVwSTN4rkEwcADfxQOy_TgQ0pOgtq8g16minmujMAA824MlLVHd8KLJ_GgdeanRMg7N31tWb74_abmwcajt3rItdH70c5qr3fSKsmm7XUEylEqp2fd7JCE9HE_yIDWZnZbyiJ1XlITWuV2x-zCB5romNzThuViapDgqQ6SBgPtnY8sKTkVNgYTMZjKMIIRL-CBVkDj6F0141_RJOSascEHKnTtmiRSzVu4QUhZGPEu5Xgz828e1vDIMvGr7DM-zryaBzruBfj3705Ch-8817yFiYRQH81c3vcIO-Y0tHGWqVrWrBTfANRlwb6RnUGJNNAvvt0ABJsOEJTFdPpLYbbUEyi51AgKX2FEIum2dq74OcSQ5cb4YEtJ_o3t85fakxOE7x5YFrDDJURDSDVJXdElCGBIbqj5OOEKrKwfiTOGFrGYNrSvCNolS3Nypm426PYNVDdSIY0QZRZY-03YsEIGsCA4Q5SH2xpxJdR95fF_zkOIi05J4tMjuU-kVVehH3Nce8f4oKYALp17snn-g", "description": "Qualitest is looking for a talented QA engineer to work with one of Israel's leading Defense industries. This position is located in Haifa At least one year of experience in QA system testing At least one year of experience Reading system requirements and writing tests according to them Quality Center or any other bug tracking tools Someone who is looking for a long-term job Testing and supporting development of precise guided munition products. Review and analyze system specifications as well as execute test cases (manual) and analyze results. Report bugs and errors to development teams and help troubleshoot issuesShow more Report"}, {"company": "Mobileye", "job": "HW Board Design Engineer", "city": "Petah Tikva", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c63cd01&cb=1676382733043&jobListingId=1008066523456&jrtk=3-1-1gp8350l6j4j1801-1goorv390gagj800-b8e6225fb0b105b3-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWe are looking for a junior HW engineer with experience in high speed\\power design on boards to join our Radar HW group.\nRadar organization is developing Automotive Radar to enable fully autonomous driving.\nRadar HW group has multidisciplinary responsibilities, HW group is responsible for the development of all related hardware (packages, boards) both RF and high speed, mechanics solution (including thermal) and antenna design.\nWhat will your job look like?\nDesign high speed boards\\packages following all design stage including reviews, schematics, layout and modelling. Boards are including high speed SERDES, LPDDR4 power circuits and other digital interfaces\nAll you need is:\nB.Sc in Electrical engineering.\n3+ years experience in high-speed designs (using Orcad & Allegro).\nExperience in SI and PI modeling (e.g Hyperlynx, HFSS, 3D designer, ADS,CST) – Advantage.\nExperience with DDR - Advantage.\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "VMware", "job": "Technical Account Manager Herzliya, Tel Aviv District", "city": "Herzliya", "date": "8d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9f402f29&cb=1676382734589&jobListingId=1008437955815&jrtk=3-1-1gp83525jjfn9801-1goorv390gagj800-819aa4c15e9f1bf4-", "description": "Why will you enjoy this new opportunity?\nDoes helping people to achieve their best with technology inspire you? If it is, we have a great job opportunity for you!\nAs a TAM, you will have the joy of using both your technical and soft skills to help our customers achieve their full potential through VMware's technology portfolio.\nUpon joining our Customer Success - Technical Account Manager’s elite team, you will have the opportunity to bring your authentic self to work and use your skills to make an impact and drive change for our customers, products, and company.\nIn the TAM role, no day is the same and you will never be bored! You will interact daily with your assigned customers and will be able to make a real impact in their success as a business. The TAM Team find nothing more satisfying than seeing a challenge and being able to overcome it. You will be able to manage your own schedule and priorities to help our customers achieve their goals and at the same time, maintain a great work/life balance.\nSuccess in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing?\nDuring the first year, you will onboard into the TAM role and work with your assigned customers.\nThe first thing that you will achieve is completing a well-organised five week onboarding plan that will be prepared for you\nThree months after engaging with your customers, you will be able to articulate their long-term and short-term goals and how they connect to the bigger picture of their business — identifying the gaps that need to be resolved and approving the success plan for them\nBetween six to eleven months from your joining date, you will be able to present your achievements while performing the plan using the internal tools and deliverables that we will provide to you. Those will drive your TAM service renewal.\nThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?\nAs part of the Customer Success TAM team, you will be working for a long-term period with a small number of assigned customers. With them and with the VMware account teams, you will:\nUse your Time-management, communication and organization skills to build an effective consulting advisory relationship with the client engineering teams, DevOps, architects, operations teams, and management.\nYou will use your technical knowledge on the area of Multi-Cloud and VCN to help your customers to enhance their product adoption pace. Thus, allowing them to achieve their desired ROI from the products that they have’\nYou will support your customer's technical queries, solve technical issues and present the art of the possible with technology they have not thought about. You will be also creating with them their custom-tailored technology roadmap.\nYou will use your management skills to keep track of your customer's plans, making adjustments as needed, and driving them to completion.\nYou will help VMware to create ‘customers for life’ by collaborating with our Customer Success, Global Support, Development, and Sales teams- all to make sure that we drive outcome-focused value to our customers.\nUsing the experience that you gain your experience in the field, you will support the global TAM team (as well as the wider VMware organization), helping all of us to constantly improve.\nWhat is the leadership like for this role? What is the structure and culture of the team like?\nYaniv Ovadya Yaakov. Israel TAM Team Manager.\nI am A Musician Married with a wonderful wife and 4 Kids, I am in the IT Industry for more than 24 years, I hold a Masters Degree (M.Sc.) in Technology Management.\nI am working at VMware for more than 10 years, I have been a TAM at VMware for all that time.\nFrom my point of view the TAM role is the Most Important one at VMware, I see the TAM role as a Real Super Hero at VMware's customers acting as such for Both Internal customers within VMware and The external Customers we partner with.\nThe TAM Role Is the most versatile role I have ever taken and thus as described at the role description I am never bored, there Is always something new or a challenge that keeps this role interesting and hard.\nThe Israeli team you will be joining is working as an Elite Force team inside the Israeli office with both Customer Management capabilities and Serviceability at the highest level. Our role is to lead the customers to success while keeping control on what is going on at the customer and be the intelligence force into VMware, but still be the customer’s advocate with the highest integrity and leadership.\nOur Goal is to bring our customers success with VMware's solutions and make sure they will have the best service VMware as a company can bring.\nWhere is this role located?\nFlexible: The role is considered flexible and will be a mix of working from a local VMware office and customer's site, depending on your customers and the arrangements determined with your future manager. You will be expected to live within a reasonable daily commute of the office.\nWhat are the benefits and perks of working at VMware?\nYou and your loved ones will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting https://benefits.vmware.com/il/\nEmployee Stock Purchase Plan\nMedical Coverage, Retirement, and Parental Leave Plans for All Family Types\nGenerous Time Off Programs\nFinancial contributions to your ongoing development (conference participation, trainings, course work, etc.)\nWellness reimbursement and online fitness and wellbeing classes\nCategory : Services and Consulting\nSubcategory: Technical Account Management\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2023-01-30\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Show more Report"}, {"company": "נישה", "job": "Field Service Engineer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_127ca501&cb=1676382736517&jobListingId=1008452057719&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp835411ncch801-1goorv390gagj800-f23f9899890b0799--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBPrZ4sBHKR78VCuZWXhFUb-UKRWgxTDTlUCB2loE6iTR_hfuOqGs1dX3B06bHSBO12QpNTc9il1udD1YKmnPCjkZeSnRCyiMJw6zatoX7RnZp55gOy5mjegPw9MQgNg-g_hCESqn6_FoDSsTsijprBJ5h8o0re2it7WprIRWotwAUs1aJgFY6wwp7n3fuBlGpUQYBsYp-677IeTgwiTy1GQVdKRyPpv_iqM-L1KakRaXFY4p6KMW7rPf-xqV9RHxj7E8wLXA0OZUVooW1o_PP7kxHT9QG-jsJh5CHaa1p_skNCseWDYwpGMJeJkbq34ytmtpsuT0zztw1knMM8kglbex7_So3aBbEluRsVKBis19H5rz54C3AHJXHbSHSgp-Q-D8Tz7N0fCNN6rvKVXTpVrwqCeX90Y3h0lBrys2l4ATwjEIWKDiwCcw_OjrhovtrqhuVuGz7gw_AvnOTfE0J0y5ivtghcGxPkd9upY6g3D-YzPrPfbWbXUlvz5w_exS_cMfOh9j-QGszJeBwfbUl8apUQkSF4trPPAn9vm4DryM05rtyJnwe78WfhBixn5LcTY1fF_mKDk3OAwjP0WE0tbda9vqdTJhEavdiO7z1CRO_v0NZnqRmiLBFKi3BeEIzZAgjdRyPHR5RauTGAQPEO", "description": "לחברה מובילה בתחום הקרדיולוגיה, דרוש/ה Field Service Engineer לתפקיד הכולל תמיכה והענקת פתרון לבעיות טכניות לשיפור תהליכי הייצור בארץ ובעולם, הפחתת עלויות החברה על ידי הפחתת עלויות הובלת פרויקטים, סקירה והערכת תפוקת הייצור. כמו כן התפקיד כולל נסיעות לחו\"ל אחת לרבעון BSC בהנדסת חשמל ואלקטרוניקה או הנדסאי/ת - חובה נסיון של שנתיים בתמיכה ללקוחות / Field Service Engineer - חובה נסיון בתמיכה בייצור - חובה נסיון מחברות מולטידיסיפלינריות - חובה יתרון למועמדים מחברות המדיקלShow more Report"}, {"company": "אנטריפוינט", "job": "QA ENGINEER", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_314ae872&cb=1676382737652&jobListingId=1008435396479&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83555jjm5m801-1goorv390gagj800-c89644ac101c4e3d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tCjX7o1y-kWCixrjUB_PGkbdMwqzKIVan83VShw0EE73eISwVENSeJMhi8inuq7o9eyuLo_XunUNdxG3hBBn8_TFuKZxD0I4BDpJL18KfCnxEPS5ZN8xiAA48jdNmf57oz30c_iSWAX53rMjKiMbUIqqmCyXNJw8VeP75-VQMucG15UJgbz3NmXtDF7_tjS_JiS53o8Y_lZvh6PSoxylhj4qbXk85IsaOz9esRQCiGlXLif2IKlvmndA3cTdxKACHwpueAsATX6E26-yoXEWGCUSaM3mQB2oLuum7w_4tGC4iS-_myrnvv67woWLMa8zsdKWNFA-pXgLM-bCtcszAe-K6p3zUHS_OtGgbgDSLai7orw6xeMrqlOYUEhER2JvLvaOWJ4YUnZhUAZrtxFnkHEKXDRxB4C1gsuyXcoOENyQ6HTJpwzTMl4hq70nKDqfZPHmZo_NDgGEckL_3-XLwEQh2lOk1WoL_9-E-1y8JKNNRrTWy5I0YDzXPwZjAedVFSaGA-ojzuENzqRgjQgW-Ri7PCFZWQoUE7wb20RWH4fVHcKl8H49d-hzW2pcD-TFypaqTLZk9l-52745ZzZAyIVxWgDLNo9v7VWK3LeW1YAfDK7zO0x9SGwqeFdhPYWFWTo1AgcQh6jB7hhlHTtBM74_8hhB5Wl8uZ_JKvY3nVGX25sQLsi-JbI%3D", "description": "לחברת מדיה הממוקמת בתל אביב דרוש/ה QA ENGINEER עם ניסיון ב WEB&MOBILE למשרה מלאה. 3+ ניסיון QA ידני ניסיון בבדיקות אתרים/וואב אפליקציות ניסיון בבדיקןת אפליקציות מובייל ניסיון בכתיבת מסמכי הבדיקות (STP, STD, STR)Show more Report"}, {"company": "", "job": "DevOps Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "קווליטסט", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ca086130&cb=1676382799188&jobListingId=1008451918402&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83718qp6cj801-1goorv390gagj800-83f5af2fa63425ab--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBh999vSCxEVUSbaWAAfHe_dKiQazUrWNimv77t05pSIeVlUDy2RLnarCxF7DWT6csaVgNlgaJ5c3p8CebcFP0X84J-dicDtrSVZ8j2jqopya9Xsry5eXUd5l0jTumLmUgxKMBG9aLtU-Nz96yJB_UaTU-0M28GHMD6Bi4WNXXt4FOZzYjSFuUIHb0qULl69ws5bChBqbhwpIMh8FaDqrGS0D8Tu1wpwum-n6YAwJy1BOPW0dsBKVIe7AM6T-D3koCMmrN7uVxzGMhDAn_u_VuJaIxmjy-lYIYFwhKcGzgCFiDHqH-4OoEsR0oa2IyMgXImYNHeuW2BCQ-UepimRMei89lvHQ8vtSWiqtRggDQ4oSlL3ndw8l-jf-KjKYKtyjqFlsspX_baBdfknrIoF4XUI5gq6LO3mhnXvR786GMTKWMVvOHtenyAfEJXcoI14TxugW1qDIC86w5mmYk19QmQjRk76dOi1JGibCA7Sp_gqPt4gGmUQhdlBkrCIZbpcz2Kbq35HRLrmK8tH1joApkpcCR5sNEm5sw7bT_e-mw4c1_Ph6ShD4d_zjGybSQCzgxEu4gwuc8BqwnjuXZN3Hs54TWQn9_2xQ8-Xi1_I4nsfWJ5EqI4VvQKD4Tniv0z1_lCOAHbPL-VOs5e8lbQSiiy", "description": "Qualitest is looking for a talented and experienced QA engineer to work with the worlds new and growing Cyber team! In this position you will be working with Software Test Plan/Description/Report(STP/STD) test Networking / Cybersecurity products - Build our QA processes from scratch and execute manual end-to-end testing. This position is located in Tel Aviv (close to the train) 2+ years of experience as manual QA experience testing API's. Experience working with Postman- nice to have.\n\nTake ownership of quality health (e.g. testing coverage, performance, best practices, etc.)Innovate on testing tools, quality, and team processes Work closely with the development team Effectively use test management tool to maintain and execute test scripts Perform functional and regression testing Automation knowledge- advantageShow more Report"}, {"company": "riverside.fm", "job": "Junior Developer", "city": "Tel Aviv-Yafo", "date": "14d", "rating": "4.4", "link": "", "description": "About Riverside\nRiverside empowers media companies to record podcasts and video interviews remotely in studio-quality. Since launching, we have experienced rapid growth and are trusted by customers such as Spotify, NY Times, NBC, CNN and iHeartMedia.\nAbout the role\nJoining Riverside means being part of a content revolution in which everyone is creating content from everywhere.\nAt Riverside, every engineer is a product engineer. Our engineers are focused on building the easiest and most powerful content creation platform and bringing value to thousands of creators around the world. They love the fact that their favorite dev podcast (https://webrush.io/) is recorded with the software they built.\nThis role is open to recent University graduates who are keen to learn and grow while learning from the best, working on exciting, cool products with thousands of B2B and B2C customers.\nRequirements:\n\nWhat you bring to the table:\nBachelor's degree in Computer Science, Computer Engineering.\nOutstanding Graduate (GPA over 87) with at least 1 year of SW development experience\nStrong Development skills in Object Oriented languages such as Javascript\nExcellent troubleshooting and investigation skills\nCan-do attitude, motivational, problem solver, proactive and curious\nExcellent communication and interpersonal skills\nAdvantages\nExperience in React, Node - A Big plus\nExperience with AWS services, SaaS Technologies, micro services\nExperience with Docker and Kubernetes\nCompensation and Benefits\nCompetitive base salary\nStock options in the company\nKeren Hishtalmut, pension\nGenerous PTO\nLunch stipend\nCommuter and parking benefits\nFully-stocked kitchen, happy hours, team events\nAmazing Riverside gifts and swagShow more Report"}, {"company": "Deloitte", "job": "Network Engineer", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3de5b207&cb=1676382801759&jobListingId=1008308706842&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp8373otkcl3801-1goorv390gagj800-a63814985d15e362--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBfB50HFqKVh5wF1vplutx0bA7NiMhtMC4Z-If4-rGZLOo2n5vkTQSPu6wCmKmT7edNUAVN6WB3-aJ91NYttIoiJvU4vkttN-UFw2sm5srI_fY7Be9G_46OC6-sF-lYAWvtvHQTrLicD6m-8Z9ki93IobLpO0wbQ-Ay0PtzSYdDVCbQXBKecirTxzRa95USWWq6PUViQRKK_CXIz0pX_i-_ecTmlEQ7o09EgCMlJ0VTGnduAMEn8gYwMlxjEha8aGpYA0sPRz8xZ8Lw4A9TAydT9ArvJyLttkd-XIik5atCv1pDweuxcBMc7bxksQtOm2jpr8yUA26g5Wtp8Wd74_9fk-cko7s3My8yQfXpHIfrkNhh9PoKeyxsc720XYLVSRaPlf5rj9QgYpgewgSOcUUyjfLjGpAuGaHPTMW8TtxQIHbSH7yJNz8Dwn1kSbD-8WeUaKZ4DOFkd-DIsjEnUwogB30q3NKhDsE17qeU3RAT-0zM8QJCMTtN0q0JkupTboa_ui6yl48NWpnCkevVFCXqnHKRpi1fJxSXmZrZe6b61v5WksvBThIuwOHE68W_uJla1Gm_8TcSyWDnFy2tV2SWigxBwXsx1v1RpMgH7OKvcW1E19Fvc80A5z8E8GpvaZ-IN5aZUWyR4nbqf7pkSyD5", "description": "The incumbent focuses on providing operational and project support ensuring that the network is highly available. Assists in the planning and evaluation of existing network platforms and systems. Is involved in the development of technical standards, interface applications, evaluation of new products and network problem resolutions. Serves as a liaison between technical teams and internal clients to establish new network connectivity request and assists with ongoing maintenance.\n\nTechnical Skills • Network Engineer - Cisco, LAN, WAN, WLAN. • Deep knowledge of Networking / Dynamic Routing Protocols. • Upgrade software on hardware such as Switches, Routers and Wireless. • Technical and non-technical Documentation | Visio.\n\n3+ year of experience in ISP or global company and multiple cultures. • Excellent time management and attention to detail is essential. • Knowledge of agile methodology. • Good written and verbal communication skills.\n\n\nVery good English level. •CCNA/CCNP, CCIE advantage. Education & Experience •Bachelor’s degree or equivalent experience: degree in computer science, mathematics, engineering, or other technical degree preferred. • Master’s degree preferred\n\nShow more Report"}, {"company": "", "job": "להייטק- Digital Board Design", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "Check Point Software Technologies Ltd.", "job": "Technical Services Engineer - Entry Level", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "4.1", "link": "", "description": "Your Impact & Responsibilities\n\nWhy should you Join Check Point Technical Support family?\n\nGet experience with the security products of the leading vendor in the Cyber Security industry.\nChallenge yourself on daily basis with complex, technical issues.\nWork with the biggest Enterprise IT departments around the world.\nJoin a team of motivated, fun and creative minds.\nBuild a long-term career at Check Point with multiple options for future growth.\n\nThe training materials will include:\n\nNetworking\nOperating Systems\nCheck Point’s leading products\nProfessional tools and methodologies\nThe training will begin on 05.03.2023\nYour Knowledge & Skills\nTechnical orientation, no experience is required! We will teach you everything you need.\nVery good English skills (Spoken and written).\nService orientation.\nThe training will take place at the company’s office/ remotely and salary will be paid during the training period.Show more Report"}, {"company": "Google", "job": "Site Reliability Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "Broadcom", "job": "R&D ASIC Engineer", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "3.6", "link": "", "description": "Please Note:\n1. If you are a first time user, please create your candidate login account before you apply for a job.\n2. If you already have a Candidate Account, please Sign-In before you apply.\nJob Description:\nThe job includes Design and Verification of ASIC.\nRequired a University graduate in Electrical Engineering.\nRequired 8+ years’ experience of ASIC Design/Verification.\nAdvantage for experience with Verilog, System Verilog, synthesis and validation.\nBroadcom is proud to be an equal opportunity employer. We will consider qualified applicants without regard to race, color, creed, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability status, medical condition, pregnancy, protected veteran status or any other characteristic protected by federal, state, or local law. We will also consider qualified applicants with arrest and conviction records consistent with local law.\nIf you are located outside USA, please be sure to fill out a home address as this will be used for future correspondence.Show more Report"}, {"company": "Edwards Lifesciences", "job": "Research Engineer", "city": "Israel", "date": "2d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f250a7b7&cb=1676382810161&jobListingId=1008452345369&jrtk=3-1-1gp837bvij4it801-1goorv390gagj800-365a398526f380b8-", "description": "Conduct ad-hoc research projects, involving planning, executing, and analyzing the results. Execution involves designing tests and working hands-on in the lab.\nThe job necessitates high analytical skills, as well as good technical skills.\nAbility to systematically work on different projects at the same time.\nProvide design inputs to existing or new products, based on the results of the Research work\nWrite technical reports based on multiple testing.\nCollaborate with different functions within the organization, both technical and cross functional.\nCreate working plans and manage resources to support Research activities.\n\nRequired Education/Skills:\nBachelor’s degree in Biomedical\\mechanical engineering\nHigh self-learning ability\nStrong execution, communication, and interpersonal relationship\nTechnical oriented skills\nBasic understanding of statistical techniques\nFluent English both oral and written\n\nRequired Experience:\n1-4 years of experience in medical device\nPreferred experience with cardiovascular industry\nKnowledge and understanding of imaging modalities as CT, Fluoroscopy and echocardiography – Advantage\nPrograming experience in Python and MATLAB - advantage\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Broadcom", "job": "Software Engineer - R&D Software Development Position", "city": "Tel Aviv-Yafo", "date": "9d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d61c887b&cb=1676382811594&jobListingId=1008437542168&jrtk=3-1-1gp837dc0i3be801-1goorv390gagj800-5b4e6f2b1f09d8ff-", "description": "Please Note:\n1. If you are a first time user, please create your candidate login account before you apply for a job.\n2. If you already have a Candidate Account, please Sign-In before you apply.\nJob Description:\nAn opportunity to join Broadcom Inc., Dune R&D Center (StrataDNX product-line), and take part in the development of future networking products!!\nWe are looking for exceptional, innovative software engineers to develop our next-generation cutting-edge networking platforms which are located at the core of Global Internet, Core Routers, Carrier Networks, Service Providers, Data Centers, White Box systems, Enterprise systems, and Telecom infrastructure.\nYou will join the software development group and take a leading part in the full life-cycle software development: from design and coding of Networking Software APIs, Data-path Programming, Management of different Software and Hardware Components, testing during the early stages of the feature to optimizations, debug, providing tools and integration into customer products.\nWe are looking for passionate engineers that will take our Software to the next level!\nRequirements:\nB.Sc. in Computer Science, Software Engineering or a related field from a recognized university, cum laude\nAt least 3 years of experience in C/C++ SW Development or exceptional graduate\nPassionate, Responsible and Team-player\nMust be a quick learner with the ability to adopt new technologies and methodologies\nAdvantages:\nExperience in Software-Embedded/Real-Time Software development\nExperience with working on Linux environment\nHave background knowledge in Networking protocols (e.g. Ethernet, IP, how switching/routing works)\nBroadcom is proud to be an equal opportunity employer. We will consider qualified applicants without regard to race, color, creed, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability status, medical condition, pregnancy, protected veteran status or any other characteristic protected by federal, state, or local law. We will also consider qualified applicants with arrest and conviction records consistent with local law.\nIf you are located outside USA, please be sure to fill out a home address as this will be used for future correspondence.Show more Report"}, {"company": "Palo Alto Networks", "job": "Systems Engineer - Israel", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.2", "link": "", "description": ""}, {"company": "Texas Instruments", "job": "FAST Rotation Program - Technical Sales Engineer - Tel Aviv, Israel", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d9ab90c7&cb=1676382814073&jobListingId=1007839898354&jrtk=3-1-1gp837fpbkcml801-1goorv390gagj800-2b1e6756d8a6afbb-", "description": "About TI\nAs a global semiconductor company operating in 35 countries, Texas Instruments (TI) is first and foremost a reflection of its people. From the TIer who unveiled the first working integrated circuit in 1958 to the more than 30,000 TIers around the world today who design, manufacture and sell analog and embedded processing chips, we are problem-solvers collaborating to change the world through technology. Put your talent to work with us – change the world, love your job!\nAbout the job\nTI’s FAST (Field Applications & Sales Training) Rotation Program is designed to prepare Sales & Applications team members for customer-oriented careers that pair technical skills with business perspectives. The program provides experiences that help rising TIers understand how to successfully grow TI’s business and to thrive throughout their entire TI career. There are two available FAST program tracks: (1) Field Applications and (2) Technical Sales.\nJob description:\nThis 7-month experience aims to teach Technical Sales Associates (TSAs) how to build and manage customer relationships, and how to influence decisions to grow TI’s revenue. The track includes three rotations:\nRotation 1, Field Sales Office (FSO): This 3-month rotation integrates TSAs with a local TI sales team, offering first-hand experience of TI’s sales process. TSAs partner with customers and internal teams to uncover and win every possible customer opportunity, and also leverage our one-of-a-kind virtual account system to learn how to find, define, and win opportunities in a mix of real-time and simulated environments.\nRotation 2, Sales Operations: This 2-month rotation provides first-hand experience working with the pricing and customer service teams. Focus areas for this rotation include pricing models, supply chain functions, price negotiation, and an overview of pricing guidelines, laws, procedures and tools.\nRotation 3, Product Marketing: This 2-month rotation focuses on the relationship between sales and a particular product line. This rotation helps TSAs understand product life cycles, roadmap development, marketing approaches, and ways to collaborate with product marketing to win at the customer.\nUpon successful completion of this track in the FAST program, rotators are welcomed as Technical Sales Representatives (TSRs) on TI’s Worldwide Sales & Applications team.\nResponsibilities include, but are not limited to:\nUsing technical expertise, various sales tools and relationships with engineering teams to identify projects\nManaging and quantifying leads, and managing the commercial aspects of customer relationships\nDeveloping, forecasting and monitoring an annual plan for revenue growth\nMinimum Qualifications:\nBachelors in Electrical Engineering, Computer Engineering, Electrical and Computer Engineering or related field\nFluent in English and Hebrew\nPreferred Qualifications:\nAbility to effectively balance strong technical skills with solid relationship-building capabilities\nDemonstrated strong analytical and problem-solving skills\nStrong written, verbal communication skills\nAbility to work in teams and collaborate effectively with people across various functions\nStrong time management skills that enable on-time project delivery\nDemonstrated ability to build strong, influential relationships\nAbility to work effectively in a fast-paced and rapidly changing environment\nAbility to take the initiative and drive for results\nOur Offer:\nBenefit from a competitive salary\nYearly profit sharing (dependent on company success)\nMany additional benefits\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture. Explore a world of opportunities for your personal and professional development\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "JAC Recruitment UK Ltd", "job": "Field Service Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "", "description": ""}, {"company": "NeoGames", "job": "Service Operations Engineer", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.0", "link": "", "description": "We are NeoGames, a global leader of iLottery solutions and services to the national and state-regulated lotteries.\nWe empower our customers to create the most successful iLottery programs with a complete solution that includes industry-leading omnichannel platforms, an innovative portfolio of the best-performing interactive games, and a full suite of business and technology services.\nWe are on the lookout for extraordinary people, who will be eager to learn, to be a part of a team and share our vision.\nRequirements:\n\nExcellent verbal and written communication skills in English – MustProven ability to troubleshoot and resolve technical issues in a creative, customer-oriented and results-driven mindset – MustStrong understanding of web and web-related technologies and Client/Server applications – An advantagePrevious experience in SQL – An advantage2+ years of relevant experience in a customer-focused position involving technical knowledge – An advantageExperience with Web debugging tools – An advantageService Oriented and good communication and interpersonal skillsFast & self-learner, hardworking, team player, organized and responsible, dynamic, motivated and independentBachelor's degree in Computer Science / Software Engineering (or similar) – An advantage24/7 availability in case of critical issues (on-call duty)\nResponsibilities:\n\nCommunicate with a customer in e-mails, JIRA items, and conference callsProvide Tier 3/4 services for internal and external entities, provide high level of support to meet the customer SLA, and minimize escalations to R&D\nInterface with various Departments, R&D and Customer Support groups to address product issues in complex environmentsOwn, troubleshoot and solve customer technical issues, using collaboration, troubleshooting best practices and transparency within and across teamsPrioritize, monitor, and be responsible for the progress of all problems reportedManage critical escalations during on and off hoursShow more Report"}, {"company": "פיקארו השמה גיוס וסורסינג בע\"מ", "job": "Experienced QA Automated Engineer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b93ea609&cb=1676382818252&jobListingId=1008452057933&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp837js2jm5i801-1goorv390gagj800-2ba94845dc5b761e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBPrZ4sBHKR7z59TZmshYmi42cHWE2xuC57Ll-lBIuFEYhbd3Mfep4SyUyNLNWLeW9g5XXOWLg6_dbuke5f-v-sn3oN7Ov-tS5lAZtMBk2-hMxiWbdqw0U_KBn1vBCBYzFoJ8GnIc1Zid0f2sOk_6kT1XF3Y4BNF6Pc8AwzgYEFCWQm7PzAenc6ijYpLgOCELrVbPU06gZOpLRIiEhxHxlMToVMsQWITQCumcdylwMbmihUgV6LzvoU6T9FGAuwvmiUC9JIBZkyYVj_HL-VxD9AcPLmdgif2WQmMz1jfKKKCaA5le3XLF5jye-dVcwJ-cRgFgYolZBxQ8TEULvKghR0YVlW8Td8wCKiUE2slPgErs-KPSVCsdYv091j84_aq8oZvmyYNP4HvgwDLwkDnF-KwztfyQZjkVKu8BCC5VoC9twsRc3zWOo815eeDHtLgyl9mDMqKjNJHqHa2bsy-X2l5Sx6kNge6qUdx6tPZm-zzOvBp9UxtKJeXrVbjX6QI6l9gyZs0wbqe4aieQda0sTtYo_znQICSY2EZBqldEpFQZ2YGo2ED_laUC-tPx_1gxV0_GrQD9j5mDp7DfFpnc-HwdgH2me0j1ml5Vx070ZS_vGDopJrXc8yMILX4YTR2TlgvjQC2hv0le_KlXHe4h1B", "description": "לחברה מובילה הנמצאת בחזית הטכנולוגיה בתחום העברת קול על גבי רשתות (VoIP) IP באמצעות מוצרי תקשורת חדשניים עבור ספקי תקשורת– OEM, אינטגרטורים ומפעילים ברחבי העולם, מחפשים Experienced QA Automated Engineer . החברה מספקת ללקוחותיה ושותפיה מגוון רחב של מוצרי Media Gateways וטכנולוגיות Media Processing לרשתות VoIP מיקום: קרית שדה התעופה. עובדים במודל היברידי (שלושה ימים מהבית) . -לפחות 2+ ש\"נ כבודק תוכנה ומפתח אוטומציה.\n\n\nניסיון ב-IP networking - חובה. יתרונות: -ניסיון בכתיבת סקריפטים ב-Python. -ניסיון וידע ב- VoIP. -ניסיון מעשי עם ראוטרים של Cisco - יתרון משמעותי.\n\nShow more Report"}, {"company": "אמן מחשבים בע''מ", "job": "Data Engineer לארגון מסווג", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f404fa1&cb=1676382820219&jobListingId=1008456288680&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp837lp0jm5i801-1goorv390gagj800-f84fb8e33c6fa9ed--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAPgYLGlNz97cRxpd0IV0kDBJPZNDCWW6L9XNAs8TLM5WOSI2Tip3iar4vdFc91T05ndjbmO5MF2ph0TGLaFn52JU-94u_-L5rIN8ZbVbZMAL0e7A4W6QcathOZGpXTCQg4kLZjybaYQU-MqklyGM3VZZnGuOKXbwuVkT6lmOqKhe2wBEl3KuI57IMbTorq35GJ0NuIKbJ85SOacmd0Fxo4R9yQsorZ5HSjpLWq8uC9D8rEaUdUfuEOPK7gkaxTI8n4eVNc7MVWYIYvLFInxpW0PMRVz2g1QAKxvg7zJ7yALsmvTitCb7Kzafn-mOrSz1B0MTAgAqHyG-yGnQfAaD04n9wPXlcRiqZz7YRjy2RMfuhtmPB0GGKb_I9X6V_KNfiCF57ZfGRo6Ha5MVH632WgvbnA4TEBdnXUzA0gfNWnXhDj33YYtna0GmFPbpuSLHlQoXN72SBhVJrUzZ_tOzLLhxb-ZQSHH0N9hImcVUYVBxlWsEeAshHGtX-FX1BcSR-bx0kFtjDFYRSonPBn_BWjbsKHnxUufk5nx_zNwX87gtyqdrjecqihqWSWAqwmqvfAw45iAmNy3oxaPIJHlZnWQejzGpsuzT0F4HyP5jEQy50cMvKlc86psLTkjvlMvmjh5DSs2TIxQfb7Iu76bx8p", "description": "לארגון מסווג במרכז הארץ דרוש/ה Data Engineer לעבודה בצוות במסגרת התפקיד כתיבת פייפליינס מאפס. הזדמנות לקחת חלק מרכזי בארגון מסקרן. ניסיון עבודה כ- Data engineer בצוות R&D ניסיון עבודה ושליטה מלאה ב- Python שליטה מלאה ב- SQL ניסיון עבודה עם CI/CD רצון ונכונות לעבודה בארגון מסווג כחלק מצוותShow more Report"}, {"company": "", "job": "Field Application Engineer (FAE)+Sales Engineer", "city": "Raanana", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1110586&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c1d5a7eb&cb=1676382822536&jobListingId=1008071775771&cpc=8795CF9063CD573D&jrtk=3-1-1gp837o2gjc9s801-1goorv390gagj800-f4edee33e0856a56--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGglsxWUyJPq3a2tW3WqbgY3_ZEHBTfBv-aN5Sq0oPmYKn_tMZpmB8FdgFD5oLlR6qa_-aslXTmtyoIL4tMPb0-zI08HRyXiph4gDC5_AhxV8KV4k73KHvmWbHo57QC-TpOThnl-yv0QRtZpDgyHVYOGnXdJxZ7oDdNJK5kUlOyyOamFBWzOv-x92ZhIv5RYmADP0qAVChubeoZUeuNPBx5FgbKn-aD9YnzWuG760X-AzH9f-S70OBYNGpCrFjWqqHWpWFNp8rxR-2rZ3ZHeUOF1mj_0iKRAmuhOZrDXEQClVNtYSNQRsQxZWfJKYRzKTLY3CNmSeKENKn-wnibevf-oUz8Whp2AF14p9Z2Oz-jnr0nIS0RTb3YHxXIdQCSFw9EganSHW9Q_-fPyW2HT9wSaRvyJnwkIrAdmrySrNMZphFYjdibrIdcFiIrwruSfQPqP32hFy0-2EVAEWftdPxu_npD3fRHOOLZvpNZ0sr43pr7J7e9wTE5Yd8Pr7S8uJYA80dKcddWzPRIefb805IobkciI8dHHatOcl34u55wEuFrKWJdxTDvE9YYXYowH5uGStXElpgeOHW3sy4SBdY8FqrDu6ZtdrF2p6LHqc7bYmFxn-8N1Fjj8jsKxusubk225-GN0ZGaVHzWXLuWQi0wbrLeTmoLPJ6usN87toHIls%3D", "description": "מהנדס/ת מכירות + FAE לשוק הישראלי. אם את/ה מהנדס/ת אלקטרוניקה, בעל/ת ניסיון בפיתוח, ומעוניין/ת לצאת מהמעבדות ולהיחשף לחברות/ טכנולוגיות חדשות - מקומך אתנו. עבודה מול מחלקות פיתוח והנדסה בשוק המקומי (צבאי, רפואי, תקשורת, פודטק, סמיקונדקטור ועוד.) אפיון ומציאת פתרונות לדרישות לקוחות - לרכיבי אלקטרוניקה /פתרונות אמבדד / מודולים / אלקטרומכניקה/ RF ועוד. תנאים מעולים!\n\nBS.c אלקטרוניקה, או שווה ערך. ניסיון של לפחות שנתיים ממחלקות פיתוח - יתרון. כישורי תקשורת וסקרנות מפותחים. כריזמה ואנרגיה מתפרצת.\n\nאנגלית ברמה גבוהה.Show more Report"}, {"company": "SQLink", "job": "חברת מדיקל מצליחה בצפון מגייסת SW Quality Engineer", "city": "Raanana", "date": "2d", "rating": "3.7", "link": "", "description": "SW Quality Engineer לחברת מדיקל גלובלית בצפון. התפקיד כולל: בדיקות ידניות למוצרים רפואיים חדשניים, כתיבת מסמכי בדיקות, השתלבות ועבודה בצוות, ועוד. הזדמנות להשתלב בחברה מובילה בתחומה בתפקיד משמעותי ותנאים מצויינים. - השכלה רלוונטית - 3 שנות ניסיון בבדיקות QA למערכת חומרה-תוכנה - ניסיון עבודה מחברת מדיקל - ניסיון בתכיבת מסמכי בדיקותShow more Report"}, {"company": "Google", "job": "Engineering Manager, Siemplify, Google Cloud", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "INFINIDAT", "job": "Technical Advisor", "city": "Herzliya", "date": "9d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=0000018631bf8cd8a5638122d4175ebf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7f0480ae&cb=1676382827190&jobListingId=1008435596684&jrtk=3-1-1gp837shvi393801-1goorv390gagj800-3d860bd91a3a3f99-", "description": "DESCRIPTION\nAt Infinidat, we help enterprises and service providers empower their data-driven competitive advantage at scale. We are a leading provider of enterprise-class storage solutions. The company’s software-focused architecture delivers sub-millisecond latency, full availability, and scalability with a significantly lower total cost of ownership than competing storage technologies.\nAn Infinidat Technical Advisor (TA) is an experienced Storage Systems Engineer providing our customers with a named technical resource for the duration of the lifecycle of their installed system(s). As the customer’s trusted advisor, the TA provides a full spectrum of services. During the time of the engagement, the TA will learn about the customer’s IT operations as it relates to the ongoing implementation of the Infinidat storage systems.\nRESPONSIBILITIES\nAct as a single technical point of contact post-sales for non-break/fix issues\nSupport and guide the customer through the implementation of new systems into their environment\nEstablish a comprehensive understanding of the customer's environment (e.g. applications, servers, network, virtualization) integrated with the Infinidat systems\nAdvocate on behalf of the customer, ensuring all specific needs and concerns are properly communicated with Infinidat\nAct as a Crisis Manager in the event of serious service impact\nProvide regular executive updates to the customer and to Infinidat senior management\nWork with support and account teams to produce and deliver Root Cause Analysis\nFollow up on open customer issues and requests to ensure timely resolution\nConduct periodic Service Reviews with the customer and their account team\nPro-actively work with the customer to recommend code levels, best practices and relevant white paper\nREQUIREMENTS\nProject Management experience\nSensitivity and tolerance when dealing with customers\nInterpersonal skills and positive communication skills\nAbility to team effectively and work with other departments within Infinidat particularly the support teams\nAbility to work independently and use own initiative\nA capability to operate in an ever-changing dynamic working environment\nCreative thinking when looking for technological solutions\nGood understanding of Unix operating systems, particularly CentOS\nDeep understanding of central NAS and SAN storage systems\nUnderstanding of Ethernet, iSCSI and FC SAN networks\nGood understanding of open system world compute\nGood understanding of VMware and Hyper V virtual environments\nGood understanding of DRP and backup environments\nAn understanding of API and scripting with Python.\nFamiliarity with DB and application environments, including Oracle, SAP, Microsoft SQL, Exchange\nFluent English language skills (both oral and written)\n5+ years of Storage Industry Experience\nAbout Infinidat\nAward-winning Infinidat is a global provider of enterprise storage platforms and solutions. Installed in Global Fortune 500 companies around the world supporting a wide variety of applications and use cases, our software defined storage architecture delivers microsecond latency, autonomous automation, powerful cyber storage resilience, 100% guaranteed availability, and dramatically reduces enterprise storage CAPEX and OPEX.\nThe company’s portfolio has been named a Leader for four consecutive years in the Gartner® Magic Quadrant™ for primary storage, has received the Gartner Peer Insights Customers’ Choice Award for 3 consecutive years based on end-users’ ratings, as well as numerous other awards from the storage analyst and storage press community.\nOur success continues to be based on the talent, experience, and motivation of employees who leverage their skills and abilities to make a real impact in the industry.\nIf you have the power to be the best of the best, we would love to have you join the Infinidat family and make a mark as an essential player in our company’s growth.Show more Report"}], [{"company": "Deloitte", "job": "Network Engineer", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=201&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_87a21d90&cb=1676382829236&jobListingId=1008308706842&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp837uiok60o801-1goorviu1i7l8800-a63814985d15e362--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBfB50HFqKVh5wF1vplutx0bA7NiMhtMC4Z-If4-rGZLOo2n5vkTQSPu6wCmKmT7edNUAVN6WB3-aJ91NYttIoiJvU4vkttN-UFw2sm5srI_fY7Be9G_46OC6-sF-lYAWvtvHQTrLicD6m-8Z9ki93IveEge3itaaSY7dsqEFtUBhEhvGyOwU4VvBoDhM8UVDESkyyOLBSZIsqOEh2h9P9yoIcjVz6uugh0bw1OILNhywkwSagEwUp4_EVw1PTdTmKyvcoYOxwDTKq0u4KQSFlv5MjSj0ZAngb7rGHsHuQ9x75GoSuibrG3qgbFXfulIOLDN87kI9cqvO1cG_65Btfb8aXQ44TH5i4E2TzcN_O69FYZ8N2EyG2-c_vzLR-v_TDKgLUp3IA_Do94CM0XD_Juttu_2uQtEgsnYAg4fFqzKzA7mL06vRkqiK7vIBNd9cn4Y-f2p1k-P3EN6t_8jF3a-ptvHq2Ist9YHL1tHbxIDJX7CuVfq1J_7TfCtij8aVvWZhAZe70ctIdE5KI-3Q8bwlKyXL9if1izKfc876ITF_i0fWA_vPMIykBdfSTfKf7Ct8psFORVGPXdRD03nux9L2j-Ph9fBA22cNxfoS81V7DdnQvISpwWpfKWBjNs4X4u9sV8YABKmMAD1LvnYqgA", "description": "The incumbent focuses on providing operational and project support ensuring that the network is highly available. Assists in the planning and evaluation of existing network platforms and systems. Is involved in the development of technical standards, interface applications, evaluation of new products and network problem resolutions. Serves as a liaison between technical teams and internal clients to establish new network connectivity request and assists with ongoing maintenance.\n\nTechnical Skills • Network Engineer - Cisco, LAN, WAN, WLAN. • Deep knowledge of Networking / Dynamic Routing Protocols. • Upgrade software on hardware such as Switches, Routers and Wireless. • Technical and non-technical Documentation | Visio.\n\n3+ year of experience in ISP or global company and multiple cultures. • Excellent time management and attention to detail is essential. • Knowledge of agile methodology. • Good written and verbal communication skills.\n\n\nVery good English level. •CCNA/CCNP, CCIE advantage. Education & Experience •Bachelor’s degree or equivalent experience: degree in computer science, mathematics, engineering, or other technical degree preferred. • Master’s degree preferred\n\nShow more Report"}, {"company": "", "job": "להייטק- Digital Board Design", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "Check Point Software Technologies Ltd.", "job": "Technical Services Engineer - Entry Level", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=203&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f85b978a&cb=1676382831582&jobListingId=1008397191185&jrtk=3-1-1gp8380suk63v801-1goorviu1i7l8800-2a20c5247b95e90d-", "description": "Your Impact & Responsibilities\n\nWhy should you Join Check Point Technical Support family?\n\nGet experience with the security products of the leading vendor in the Cyber Security industry.\nChallenge yourself on daily basis with complex, technical issues.\nWork with the biggest Enterprise IT departments around the world.\nJoin a team of motivated, fun and creative minds.\nBuild a long-term career at Check Point with multiple options for future growth.\n\nThe training materials will include:\n\nNetworking\nOperating Systems\nCheck Point’s leading products\nProfessional tools and methodologies\nThe training will begin on 05.03.2023\nYour Knowledge & Skills\nTechnical orientation, no experience is required! We will teach you everything you need.\nVery good English skills (Spoken and written).\nService orientation.\nThe training will take place at the company’s office/ remotely and salary will be paid during the training period.Show more Report"}, {"company": "Google", "job": "Site Reliability Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "Broadcom", "job": "R&D ASIC Engineer", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "3.6", "link": "", "description": "Please Note:\n1. If you are a first time user, please create your candidate login account before you apply for a job.\n2. If you already have a Candidate Account, please Sign-In before you apply.\nJob Description:\nThe job includes Design and Verification of ASIC.\nRequired a University graduate in Electrical Engineering.\nRequired 8+ years’ experience of ASIC Design/Verification.\nAdvantage for experience with Verilog, System Verilog, synthesis and validation.\nBroadcom is proud to be an equal opportunity employer. We will consider qualified applicants without regard to race, color, creed, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability status, medical condition, pregnancy, protected veteran status or any other characteristic protected by federal, state, or local law. We will also consider qualified applicants with arrest and conviction records consistent with local law.\nIf you are located outside USA, please be sure to fill out a home address as this will be used for future correspondence.Show more Report"}, {"company": "Edwards Lifesciences", "job": "Research Engineer", "city": "Israel", "date": "2d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=206&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8201faf2&cb=1676382835548&jobListingId=1008452345369&jrtk=3-1-1gp8384objopl801-1goorviu1i7l8800-365a398526f380b8-", "description": "Conduct ad-hoc research projects, involving planning, executing, and analyzing the results. Execution involves designing tests and working hands-on in the lab.\nThe job necessitates high analytical skills, as well as good technical skills.\nAbility to systematically work on different projects at the same time.\nProvide design inputs to existing or new products, based on the results of the Research work\nWrite technical reports based on multiple testing.\nCollaborate with different functions within the organization, both technical and cross functional.\nCreate working plans and manage resources to support Research activities.\n\nRequired Education/Skills:\nBachelor’s degree in Biomedical\\mechanical engineering\nHigh self-learning ability\nStrong execution, communication, and interpersonal relationship\nTechnical oriented skills\nBasic understanding of statistical techniques\nFluent English both oral and written\n\nRequired Experience:\n1-4 years of experience in medical device\nPreferred experience with cardiovascular industry\nKnowledge and understanding of imaging modalities as CT, Fluoroscopy and echocardiography – Advantage\nPrograming experience in Python and MATLAB - advantage\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Broadcom", "job": "Software Engineer - R&D Software Development Position", "city": "Tel Aviv-Yafo", "date": "9d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=207&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1327986f&cb=1676382836949&jobListingId=1008437542168&jrtk=3-1-1gp838651ih5h801-1goorviu1i7l8800-5b4e6f2b1f09d8ff-", "description": "Please Note:\n1. If you are a first time user, please create your candidate login account before you apply for a job.\n2. If you already have a Candidate Account, please Sign-In before you apply.\nJob Description:\nAn opportunity to join Broadcom Inc., Dune R&D Center (StrataDNX product-line), and take part in the development of future networking products!!\nWe are looking for exceptional, innovative software engineers to develop our next-generation cutting-edge networking platforms which are located at the core of Global Internet, Core Routers, Carrier Networks, Service Providers, Data Centers, White Box systems, Enterprise systems, and Telecom infrastructure.\nYou will join the software development group and take a leading part in the full life-cycle software development: from design and coding of Networking Software APIs, Data-path Programming, Management of different Software and Hardware Components, testing during the early stages of the feature to optimizations, debug, providing tools and integration into customer products.\nWe are looking for passionate engineers that will take our Software to the next level!\nRequirements:\nB.Sc. in Computer Science, Software Engineering or a related field from a recognized university, cum laude\nAt least 3 years of experience in C/C++ SW Development or exceptional graduate\nPassionate, Responsible and Team-player\nMust be a quick learner with the ability to adopt new technologies and methodologies\nAdvantages:\nExperience in Software-Embedded/Real-Time Software development\nExperience with working on Linux environment\nHave background knowledge in Networking protocols (e.g. Ethernet, IP, how switching/routing works)\nBroadcom is proud to be an equal opportunity employer. We will consider qualified applicants without regard to race, color, creed, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability status, medical condition, pregnancy, protected veteran status or any other characteristic protected by federal, state, or local law. We will also consider qualified applicants with arrest and conviction records consistent with local law.\nIf you are located outside USA, please be sure to fill out a home address as this will be used for future correspondence.Show more Report"}, {"company": "Palo Alto Networks", "job": "Systems Engineer - Israel", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.2", "link": "", "description": ""}, {"company": "Texas Instruments", "job": "FAST Rotation Program - Technical Sales Engineer - Tel Aviv, Israel", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=209&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_76451a71&cb=1676382839782&jobListingId=1007839898354&jrtk=3-1-1gp8388t6gsq5801-1goorviu1i7l8800-2b1e6756d8a6afbb-", "description": "About TI\nAs a global semiconductor company operating in 35 countries, Texas Instruments (TI) is first and foremost a reflection of its people. From the TIer who unveiled the first working integrated circuit in 1958 to the more than 30,000 TIers around the world today who design, manufacture and sell analog and embedded processing chips, we are problem-solvers collaborating to change the world through technology. Put your talent to work with us – change the world, love your job!\nAbout the job\nTI’s FAST (Field Applications & Sales Training) Rotation Program is designed to prepare Sales & Applications team members for customer-oriented careers that pair technical skills with business perspectives. The program provides experiences that help rising TIers understand how to successfully grow TI’s business and to thrive throughout their entire TI career. There are two available FAST program tracks: (1) Field Applications and (2) Technical Sales.\nJob description:\nThis 7-month experience aims to teach Technical Sales Associates (TSAs) how to build and manage customer relationships, and how to influence decisions to grow TI’s revenue. The track includes three rotations:\nRotation 1, Field Sales Office (FSO): This 3-month rotation integrates TSAs with a local TI sales team, offering first-hand experience of TI’s sales process. TSAs partner with customers and internal teams to uncover and win every possible customer opportunity, and also leverage our one-of-a-kind virtual account system to learn how to find, define, and win opportunities in a mix of real-time and simulated environments.\nRotation 2, Sales Operations: This 2-month rotation provides first-hand experience working with the pricing and customer service teams. Focus areas for this rotation include pricing models, supply chain functions, price negotiation, and an overview of pricing guidelines, laws, procedures and tools.\nRotation 3, Product Marketing: This 2-month rotation focuses on the relationship between sales and a particular product line. This rotation helps TSAs understand product life cycles, roadmap development, marketing approaches, and ways to collaborate with product marketing to win at the customer.\nUpon successful completion of this track in the FAST program, rotators are welcomed as Technical Sales Representatives (TSRs) on TI’s Worldwide Sales & Applications team.\nResponsibilities include, but are not limited to:\nUsing technical expertise, various sales tools and relationships with engineering teams to identify projects\nManaging and quantifying leads, and managing the commercial aspects of customer relationships\nDeveloping, forecasting and monitoring an annual plan for revenue growth\nMinimum Qualifications:\nBachelors in Electrical Engineering, Computer Engineering, Electrical and Computer Engineering or related field\nFluent in English and Hebrew\nPreferred Qualifications:\nAbility to effectively balance strong technical skills with solid relationship-building capabilities\nDemonstrated strong analytical and problem-solving skills\nStrong written, verbal communication skills\nAbility to work in teams and collaborate effectively with people across various functions\nStrong time management skills that enable on-time project delivery\nDemonstrated ability to build strong, influential relationships\nAbility to work effectively in a fast-paced and rapidly changing environment\nAbility to take the initiative and drive for results\nOur Offer:\nBenefit from a competitive salary\nYearly profit sharing (dependent on company success)\nMany additional benefits\nJoin an international work environment where your ideas count and where you can thrive in a diverse culture. Explore a world of opportunities for your personal and professional development\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "JAC Recruitment UK Ltd", "job": "Field Service Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "", "description": ""}, {"company": "NeoGames", "job": "Service Operations Engineer", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.0", "link": "", "description": "We are NeoGames, a global leader of iLottery solutions and services to the national and state-regulated lotteries.\nWe empower our customers to create the most successful iLottery programs with a complete solution that includes industry-leading omnichannel platforms, an innovative portfolio of the best-performing interactive games, and a full suite of business and technology services.\nWe are on the lookout for extraordinary people, who will be eager to learn, to be a part of a team and share our vision.\nRequirements:\n\nExcellent verbal and written communication skills in English – MustProven ability to troubleshoot and resolve technical issues in a creative, customer-oriented and results-driven mindset – MustStrong understanding of web and web-related technologies and Client/Server applications – An advantagePrevious experience in SQL – An advantage2+ years of relevant experience in a customer-focused position involving technical knowledge – An advantageExperience with Web debugging tools – An advantageService Oriented and good communication and interpersonal skillsFast & self-learner, hardworking, team player, organized and responsible, dynamic, motivated and independentBachelor's degree in Computer Science / Software Engineering (or similar) – An advantage24/7 availability in case of critical issues (on-call duty)\nResponsibilities:\n\nCommunicate with a customer in e-mails, JIRA items, and conference callsProvide Tier 3/4 services for internal and external entities, provide high level of support to meet the customer SLA, and minimize escalations to R&D\nInterface with various Departments, R&D and Customer Support groups to address product issues in complex environmentsOwn, troubleshoot and solve customer technical issues, using collaboration, troubleshooting best practices and transparency within and across teamsPrioritize, monitor, and be responsible for the progress of all problems reportedManage critical escalations during on and off hoursShow more Report"}, {"company": "פיקארו השמה גיוס וסורסינג בע\"מ", "job": "Experienced QA Automated Engineer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "5.0", "link": "", "description": "לחברה מובילה הנמצאת בחזית הטכנולוגיה בתחום העברת קול על גבי רשתות (VoIP) IP באמצעות מוצרי תקשורת חדשניים עבור ספקי תקשורת– OEM, אינטגרטורים ומפעילים ברחבי העולם, מחפשים Experienced QA Automated Engineer . החברה מספקת ללקוחותיה ושותפיה מגוון רחב של מוצרי Media Gateways וטכנולוגיות Media Processing לרשתות VoIP מיקום: קרית שדה התעופה. עובדים במודל היברידי (שלושה ימים מהבית) . -לפחות 2+ ש\"נ כבודק תוכנה ומפתח אוטומציה.\n\n\nניסיון ב-IP networking - חובה. יתרונות: -ניסיון בכתיבת סקריפטים ב-Python. -ניסיון וידע ב- VoIP. -ניסיון מעשי עם ראוטרים של Cisco - יתרון משמעותי.\n\nShow more Report"}, {"company": "אמן מחשבים בע''מ", "job": "Data Engineer לארגון מסווג", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=213&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_90aec517&cb=1676382845723&jobListingId=1008456288680&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838ei8itkk801-1goorviu1i7l8800-f84fb8e33c6fa9ed--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAPgYLGlNz97cRxpd0IV0kDBJPZNDCWW6L9XNAs8TLM5WOSI2Tip3iar4vdFc91T05ndjbmO5MF2ph0TGLaFn52JU-94u_-L5rIN8ZbVbZMAL0e7A4W6QcathOZGpXTCQg4kLZjybaYQU-MqklyGM3VzmB09M31o4Jy9wLVyneSQbgtNgXZpsx_nYSxH7nDEkdfbuKC8OPnELL6UlM-89G8AqrPaC6ya5yCiaO92zN6GTXF0fAzAcID0CLPXO6LYDuL-jGc0ZeXB64UV5GuZ4lpcAIdn-n1kkV-1vASYRHK7us9BF4LXW5MQX7-lFkp8i2vNlDfTWkcrlyjKcF47dTDuC76htsgz02OfK_a9HOKfPBYJGCISpmn-beidcUMYS2FDh3klGeM1AmiXjgN_DQBeUcWaRw30epi_J-YhdSP_qCqiPoplaA3rwkSJKmefaqF_gEuNYdTSrYuaxNngOkIomM2SlHWuBMHiRipuniLFrQP5vnW9w_54bafvErFwQK9H_tr1q1E1fC9blS1784e7R8BqXXLq4-QpZxCaX5eiq8Svt5cM7z5wY4Fc-Rhhq1M1e2rpEfNEmUg-W1sWa3a3lXM1Sr2xxZl038GpjjdvQPFi9uOk5MxSeF28OjQlMne81cACteQmrxg5IdGXC4m", "description": "לארגון מסווג במרכז הארץ דרוש/ה Data Engineer לעבודה בצוות במסגרת התפקיד כתיבת פייפליינס מאפס. הזדמנות לקחת חלק מרכזי בארגון מסקרן. ניסיון עבודה כ- Data engineer בצוות R&D ניסיון עבודה ושליטה מלאה ב- Python שליטה מלאה ב- SQL ניסיון עבודה עם CI/CD רצון ונכונות לעבודה בארגון מסווג כחלק מצוותShow more Report"}, {"company": "", "job": "Field Application Engineer (FAE)+Sales Engineer", "city": "Raanana", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=214&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a42ddf8f&cb=1676382846966&jobListingId=1008071775771&cpc=8795CF9063CD573D&jrtk=3-1-1gp838fstp6df801-1goorviu1i7l8800-f4edee33e0856a56--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGglsxWUyJPq3a2tW3WqbgY3_ZEHBTfBv-aN5Sq0oPmYKn_tMZpmB8FdgFD5oLlR6qa_-aslXTmtyoIL4tMPb0-zI08HRyXiph4gDC5_AhxV8KV4k73KHvmWbHo57QC-TpOThnl-yv0QRtZpDgyHVYOGnXdJxZ7oDdvvpPGWIUx5XJQYC9cjmmIVi9iZkID7HWLoj646PH_yvf7XJbwmUyO5w7K-PBrtjz0fdHoQdP1r5C9XqptCZP9tekk-rje1nxJTl455bsQEXkoy7FMTr_2xRTbLK34nOR2lF5zb7rABnMWsJy8s8tkU-1zYosRx48m-yt6I4MLUf6VveTPolBOlDIKRtUoDG2o44UQUSGO3VtVwW9-ixtEHVJwFX4R27ax6CkLkv5h2_ttXnmL2YGa-yP9mO47jlNKr5LhjiuuOMd_LQg0fpIRSZd11ONYNKYkPm_zMDe_4dE5kpkwtalVAnEVibwm30y6tQ9JSqiOlv5ucDtkGYBBskZeZJJwVlWat2aG0znk6IT1h-pee10SV1BYkxwYQ1oFVE7PsM_E1q5PtRX7vbSy89gk5UgKtqzNDzmOI1YOk3HEYl35IRSMR7CKzFcKv7_hKLt56ibuMK6Vrvo_PZpGesHOSqTz_6g0dSk6zxv2oSNkR7RkccfZ6TLJ7RkAQQMPitnFttJZP8%3D", "description": "מהנדס/ת מכירות + FAE לשוק הישראלי. אם את/ה מהנדס/ת אלקטרוניקה, בעל/ת ניסיון בפיתוח, ומעוניין/ת לצאת מהמעבדות ולהיחשף לחברות/ טכנולוגיות חדשות - מקומך אתנו. עבודה מול מחלקות פיתוח והנדסה בשוק המקומי (צבאי, רפואי, תקשורת, פודטק, סמיקונדקטור ועוד.) אפיון ומציאת פתרונות לדרישות לקוחות - לרכיבי אלקטרוניקה /פתרונות אמבדד / מודולים / אלקטרומכניקה/ RF ועוד. תנאים מעולים!\n\nBS.c אלקטרוניקה, או שווה ערך. ניסיון של לפחות שנתיים ממחלקות פיתוח - יתרון. כישורי תקשורת וסקרנות מפותחים. כריזמה ואנרגיה מתפרצת.\n\nאנגלית ברמה גבוהה.Show more Report"}, {"company": "SQLink", "job": "חברת מדיקל מצליחה בצפון מגייסת SW Quality Engineer", "city": "Raanana", "date": "2d", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=215&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_75e0b325&cb=1676382848916&jobListingId=1008453967380&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838hqok60h801-1goorviu1i7l8800-7cfe0e1e0db57b9f--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HLtIrFJpMJJ0UrehPcgp5xhPxL2rpyWY7ekzNPkfR2VeAGZRXc2pqPijBZ3s4JUZ401tvH_CZEF21GCcmWJT3ZwhoaaVMYmyEOj1cWOVwSGvKGyhIgpda7hI91_Sp9godsEv1DlJEJ2eMmulpY046qUTRsiYPdDb5c8PVXNg_k6ZxZxOG38ZcXOBr33OFpFO4CiEbEsZH1BzmZ00aw7fxhHmlGXB-qn1uXsyI1qZHXM2eKfbW7Rcn5vveQbn5xsQEH1gNRBCL3h682eR4fxAbb2yw3ejbam-Zxeem7JfKO5hhP1KF0QtEI98dd_flpErIi-bwN0L_Io33Q3yGbuyYH1NOymQDevWQdZ5uOGPddB7OblQkjus7cyf1MwpyGJdAI09vu_1Axai2Mx9loJ6OyFcKVZwwr-R_Apq6mzZ5_LFVc8D4Wo0faebZcZMOmDIzqYKwaShU5zxlpIoWxMCvH3rkchgsbRxeIU8QsfUZrco1UudNN-G6nu6po8PRct6R3RQ627QYvqcxd7WxuwqoteVR5xzUoTRLuQidrAeyb5bfxxY1fWyN9pWkjQdDg9FV1DhZ2S9hqvgPm3lrSOUUIzqQTZotc4lyxIdEkG5MHH0JXgqv2qT5gr6tYA2CJAK_VWUdDcCZd3plNlhBPlDesVDBU2xRaAxm4%3D", "description": "SW Quality Engineer לחברת מדיקל גלובלית בצפון. התפקיד כולל: בדיקות ידניות למוצרים רפואיים חדשניים, כתיבת מסמכי בדיקות, השתלבות ועבודה בצוות, ועוד. הזדמנות להשתלב בחברה מובילה בתחומה בתפקיד משמעותי ותנאים מצויינים. - השכלה רלוונטית - 3 שנות ניסיון בבדיקות QA למערכת חומרה-תוכנה - ניסיון עבודה מחברת מדיקל - ניסיון בתכיבת מסמכי בדיקותShow more Report"}, {"company": "Google", "job": "Engineering Manager, Siemplify, Google Cloud", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "INFINIDAT", "job": "Technical Advisor", "city": "Herzliya", "date": "9d", "rating": "3.9", "link": "", "description": "DESCRIPTION\nAt Infinidat, we help enterprises and service providers empower their data-driven competitive advantage at scale. We are a leading provider of enterprise-class storage solutions. The company’s software-focused architecture delivers sub-millisecond latency, full availability, and scalability with a significantly lower total cost of ownership than competing storage technologies.\nAn Infinidat Technical Advisor (TA) is an experienced Storage Systems Engineer providing our customers with a named technical resource for the duration of the lifecycle of their installed system(s). As the customer’s trusted advisor, the TA provides a full spectrum of services. During the time of the engagement, the TA will learn about the customer’s IT operations as it relates to the ongoing implementation of the Infinidat storage systems.\nRESPONSIBILITIES\nAct as a single technical point of contact post-sales for non-break/fix issues\nSupport and guide the customer through the implementation of new systems into their environment\nEstablish a comprehensive understanding of the customer's environment (e.g. applications, servers, network, virtualization) integrated with the Infinidat systems\nAdvocate on behalf of the customer, ensuring all specific needs and concerns are properly communicated with Infinidat\nAct as a Crisis Manager in the event of serious service impact\nProvide regular executive updates to the customer and to Infinidat senior management\nWork with support and account teams to produce and deliver Root Cause Analysis\nFollow up on open customer issues and requests to ensure timely resolution\nConduct periodic Service Reviews with the customer and their account team\nPro-actively work with the customer to recommend code levels, best practices and relevant white paper\nREQUIREMENTS\nProject Management experience\nSensitivity and tolerance when dealing with customers\nInterpersonal skills and positive communication skills\nAbility to team effectively and work with other departments within Infinidat particularly the support teams\nAbility to work independently and use own initiative\nA capability to operate in an ever-changing dynamic working environment\nCreative thinking when looking for technological solutions\nGood understanding of Unix operating systems, particularly CentOS\nDeep understanding of central NAS and SAN storage systems\nUnderstanding of Ethernet, iSCSI and FC SAN networks\nGood understanding of open system world compute\nGood understanding of VMware and Hyper V virtual environments\nGood understanding of DRP and backup environments\nAn understanding of API and scripting with Python.\nFamiliarity with DB and application environments, including Oracle, SAP, Microsoft SQL, Exchange\nFluent English language skills (both oral and written)\n5+ years of Storage Industry Experience\nAbout Infinidat\nAward-winning Infinidat is a global provider of enterprise storage platforms and solutions. Installed in Global Fortune 500 companies around the world supporting a wide variety of applications and use cases, our software defined storage architecture delivers microsecond latency, autonomous automation, powerful cyber storage resilience, 100% guaranteed availability, and dramatically reduces enterprise storage CAPEX and OPEX.\nThe company’s portfolio has been named a Leader for four consecutive years in the Gartner® Magic Quadrant™ for primary storage, has received the Gartner Peer Insights Customers’ Choice Award for 3 consecutive years based on end-users’ ratings, as well as numerous other awards from the storage analyst and storage press community.\nOur success continues to be based on the talent, experience, and motivation of employees who leverage their skills and abilities to make a real impact in the industry.\nIf you have the power to be the best of the best, we would love to have you join the Infinidat family and make a mark as an essential player in our company’s growth.Show more Report"}, {"company": "JPMorgan Chase Bank, N.A.", "job": "Full-Stack Engineer", "city": "Herzliya", "date": "1 day ago", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bac624ed&cb=1676382853052&jobListingId=1008455761801&jrtk=3-1-1gp838ls1k60h801-1goorviu1i7l8800-82a34c18980a87d9-", "description": "We are looking for a Full-Stack Engineer to join our team and deliver innovative solutions in the heart of the finance industry by using the latest technology stack, modern architecture, and software engineering best practices.\n\nYou will have a significant impact on creating new solutions, and you will own features from design to production, using cutting edge technologies, resources and backing of a global leader in the financial industry. You will be involved in full product life cycles, working with excellent software engineering, product owners, user experience experts, as well as our business stakeholders.\n\n\nYou should be proficient with front-end and back-end coding, web-services, database systems (both NoSQL and Relational), software security, performance, and scale. As a developer, we look first and foremost for people who are passionate about solving business problems through innovation and engineering practices. You will be required to apply your in-depth knowledge and expertise to all aspects of the software development lifecycle and stay focused on the team's goals and the business strategy.\nYour Role and Responsibilities\n\nResearch and development solutions to challenged problems\nTake end to end ownership - develop, test, and deploy full-stack web applications\nAutodidactic abilities to ramp-up quickly on new technologies\nWrite clean code using superb quality and security standards of products\nImprove everything you touch with a passion for experimentation process\nProduct oriented combining thoughtfulness and pragmatism to get stuff done\nCollaborate with teams in multiple regions and time zones\nYour Qualifications\n\nB.Sc. in Computer Science (or an equivalent)\n5+ years of experience with software development and web applications\n2+ years of proven experience in client side development using React, JavaScript/TypeScript, HTML5, CSS3\nHands-on experience in one of the back-end programming languages Java/Python\nFamiliarity with state management frameworks such as Redux\nKnowledge of front-end testing frameworks such as Jest/Enzyme\nExcellent verbal and written communication skills (Both Hebrew and English)\nAdvantages\n\nExperience with Agile scrum methodology and CI/CD deployment process\nKnowledge of RDBMS, NoSQL databases, and SQL queries\nFamiliarity with Spring framework and Spring Boot web applications\nKnowledge of Cloud technologies (preferably AWS)\nJ.P. Morgan is a global leader in financial services, providing strategic advice and products to the world's most prominent corporations, governments, wealthy individuals and institutional investors. Our first-class business in a first-class way approach to serving clients drives everything we do. We strive to build trusted, long-term partnerships to help our clients achieve their business objectives.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.\nJ.P. Morgan is a global leader in financial services, providing strategic advice and products to the world's most prominent corporations, governments, wealthy individuals and institutional investors. Our first-class business in a first-class way approach to serving clients drives everything we do. We strive to build trusted, long-term partnerships to help our clients achieve their business objectives.\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.Show more Report"}, {"company": "נישה", "job": "System engineer", "city": "Tel Aviv-Yafo", "date": "13d", "rating": "3.6", "link": "", "description": "לחברת SU העוסקת בפיתוח מכשור מציל חיים לתחום הקרדיולוגיה, דרוש/ה מהנדס/ת מערכת כחלק ממחלקת הפיתוח תואר ראשון בהנדסת אלקטרוניקה/מכונות/הנדסת מערכת או אחר- חובה לפחות 3 שנות ניסיון בהנדסת מערכת מחברת מכשור רפואי -חובה ניסיון מחברת מכשור רפואי העוסקת בפיתוח מכשור קרדיולוגי/MRI/הדמייה - יתרון משמעותי ניסיון עם מערכות מכשור רפואי גדולות ומורכבות -יתרון ניסיון באחד או יותר מהבאים : עבודה במעבדה, אינטגרציה, כתיבת מסמכי דרישות, מערכות בקנה מידה גדול- יתרון משמעותיShow more Report"}, {"company": "Deloitte", "job": "Senior/Junior Data Engineer", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=220&ao=1136043&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c490da30&cb=1676382855514&jobListingId=1008435556111&jrtk=3-1-1gp838o902f30001-1goorviu1i7l8800-b186792f917f6629-", "description": "Description\n\nDeloitte Analytics, a part of Deloitte Israel consulting practice, is looking for a talented Data Engineer to join our growing team!\n\nHow your day will look like:\n\nAs a Data Engineer, you will take an integral part in our local and global projects.\nOur clients come from a wide range of industries and organizations across the globe.\nYou will work in collaboration with the data architect and data scientists and will be responsible for the development and implementation of data gathering, maintenance, deployment of DS pipelines, and helping to build infrastructural solutions that support the data, science teams.\nYou will collaborate with internal teams to facilitate solutions for DMPs.\nRequirements\nMSc/BA in Computer Science or another relevant field.\nA passionate Data Engineer with experience in developing data pipelines using AWS/Azure/other cloud-based technologies and Big Data technology stack to create custom solutions using large data sets.\nExperienced in writing APIs, scrapers, and crawlers.\n2-6 years of experience with Data Modeling and tuning of relational as well as NoSQL datastores (Athena, MongoDB, MySQL, Red-shift, etc.)\n2-6 years experience in ETL development using Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.) – is a plus.\nExperience using cloud-native tools and design patterns (Containers, Serverless, Docker, Kubernetes, etc.) – is a plus.\nFluent in English\nTeam player with a can-do attitude\n\nFull time Job\n\nLocation: Tel Aviv, Hybrid\nWe at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.Show more Report"}, {"company": "נישה", "job": "Document and Quality Control Engineer", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_26613140&cb=1676382856763&jobListingId=1008423892933&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838pg12jqa001-1goorviu1i7l8800-0c05a39f76a13d9d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC0OIaE1NxJ1a3d1v4KqfxBd2SmPBAq3aNAx2x8ecG85NJoPiBWKySX1KpnYznaigusI1GBAZc54qDjwhdItIwYw1lcLtpC0EOu7_Nh9ot7zuMnAloch2vwTJwIM2mo5kcrYr6ARzEoHbKI7KLs5yk3lbbhpt6DKLHwfXfKa0DcU8xqQ9hFh20aZFB_0AdIpZe2miYLUnppnE7PZTMiFjEIRe_ooJ9wwZ7PMpVuSzp6wkmcPROEm5888T_cXeLWxS8xuZQvZx4gswYLuwXYeO_B9OvcaTv-7tW9olj612oEk84g7UDziHtk3PVkzs7akSwnwHTQPo4iFKqjU0XsC0PhB48H6B_2WCsDS5k-9iV77KpladLuiW3rIgnfPazD_TfRTpNmH4b9vyLlfmAXh7B-qIwpiQmdj_F0CWjsEAWcnmkoEUx0lzT7PTwYTBjM9PIoDAPBSa0DC671ABhys5eZPayTnn7gUF-yNRDUHm3nicIwEGG9PbnkwkU3WWaws6UOfHaLksURJy7AzbGstk3VhtUXyjyM9MY7T9UOSNQmbvbLBNhPeGDMKRRe4AliAdiExTbGr8uOkObw7rZfBmwtBeO48q0HOSZr-srjRqKt0ASGjEVh5p7L-kA7NZq4Mqai-MZz11HMBZFZ16nczQ0o", "description": "לחברת מיכשור רפואי מובילה ביקנעם דרוש/ה מבקר/ת איכות להצטרף לצוות האיכות דיווח למנהל/ת QC הנדסאי אלקטרוני או מכני תעשייתי (HANDESAI) או תחום דומה . ניסיון של לפחות 3 שנים כמבקר/ת איכות -חובה! מכשור רפואי-יתרון. יכולות טכניות ויכולת גבוהה לפתרון בעיות.\n\nניסיון במערכת ERP יתרון לקורסי QA/QC מיומנויות בינאישיות ותקשורת גבוהות שפה: עברית ואנגלית טובהShow more Report"}, {"company": "MalamTeam3", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=222&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b06e7534&cb=1676382858370&jobListingId=1008070271437&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838r08jij3801-1goorviu1i7l8800-7a9455391c9a46fe--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tCjX7o1y-kWCixrjUB_PGkYSUOmWVwx2KfcRsUteqGCEBugE5FDOTUTFG8sSuROsoskBrpasQJDaD2u4dT9ZC_OxeomsoDt33fiWcjPf1VcB8UeDSffxk0uDxM7T6ZAHnmty7hGNGVkN9JsHCEgZiWVsiD6kpRb630m6yW5nBxuX8Pm6dtdUkA16Cdn9lwQ6qnlUR8uImKH-wxtf_ZsJnucRRV3Uy2vebCfPFQc3yG_VyXLNWz84IlvvRsvEkIoxmt0zwqPRENOSW1MVwnkrXzFxop9D-pCjqsNf3CS_PpAqeIYk6JP8L6spw2BEyV8hwszISNxPE_4TskLjUHoO3bpVFcztH3sKGP9gdY5ufNtZUcw1YBH6QtbThkx4dE9b9oAQImMT8iR9XDIXqySkWS8wJwX6dCZLFCEiSUs_OXdo021Ag9MsQxqs9IMdM2ETC5SQ62_WnAS4Ubygi64wBI1ATFd1Lm465wQXopHmLK9j6xy9jWaRozP7iEES6HpDGqjEy2xlrywgzC5AXHXmRl0XWR4W4K7q1FAmTEvjROAjZzJmGRM8Ow9TmaD_gaJtHhGjXkzguvClnVxbG5eMqKku3v9E-16SQaEj8OBxjHvAKiGj6g7EbOQwELaq6GHI-VQtljw-1uhEUpRutO5-uGbNySc_01xtM8zsIJPQbGq7sOZniN52EQQ%3D", "description": "דרוש/ה בודק/ת ידני/ת ואוטומציה לחברת ביטוח מובילה בתחומה במסגרת התפקיד: ביצוע בדיקות ידניות ואוטומטיות לתהליכים במערכות WEB וMOBILE, הבנת דרישות UI/UX, כתיבת מסמכי אפיון ומסמכי STP,STD,STR , עבודה מול בסיס נתונים SQL. ניסיון של 4 שנים כבודק/בודקת תוכנה ידע וניסיון בהרצת בדיקות אוטומטיות עבודה מול בסיס נתונים SQLShow more Report"}, {"company": "Google", "job": "Silicon Validation Engineer, Google Cloud", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "R&D Manager", "city": "Southern", "date": "6d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=224&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_92f281c8&cb=1676382861623&jobListingId=1008444887754&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838u5vp6cj801-1goorviu1i7l8800-1d920c0b16636e2d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNANtB5ZZYDlIbgi8f3h3mUvlJHkO6fdk4VOuQsIlauBo5BgnQyiy2oUmCiXk-sfj35eqIh4yo3dtyBsfXoUTd9RUuaTwMI8wHVDDgKOuOtH8T5z0namydoN0RRcjf1BOf7w-PaHm5-WdrnD6WtQK9z-5lFt6ZVAKJ5mM4pAKTcog6kMoaSfEM3iEMp3nkiQpmquKJd5q-Vx0cgRD-aOM9c1QsmIKsFvU1gv33zgzvix-9dSmc-3iAdmTHNnhQDbOlgSsxNRh-NajuRKY1lVX6oVDZXaKrVDxpVWt7Pxezu06sn6WnM8KCBdA-ALhPchxaSGY9UDe2tu8cZDrrfO-BGE6l46UoSmrZIQO2a9ZU6i5lD9cHO7r0_73XZeQEBaLV8VrXwElOSNVvD8sNwTAH7zogECi_8TZAUQ_2O2bEqW079RIFX5MIqdE1KyYWikWpviH6RsmEmuYAxmz6AJJAVNUNIfUneFkAFymAO0Eyjfcn0eyD8gMnybsHNl67_TYaqtyQKRilE4OHRUvbpHWAYya3Ba1PrugMYoQZLw4Xf94CnJQjswFBzZdDN2VHpkWWbXzqzYRNjr9UlWo3iDwAbm6lXgLc5FtoeszpTB--7sXsFYQFi-jIde5Z1yudgvfjm8yWZIRy2VcHma9-YTR9zM", "description": "Leading Engineering team and set the technology agenda Manage various projects Parallel • Collaborate with cross-functional partners in Sales, General Ganagers, and executive members to define and build a data-informed technology strategy and roadmaps. • Advise GM and priorities regarding design and direction of new developments. • Ensure the engineering team is scheduled and working efficiently while utilizing company equipment and harnessing the rest of the departments. The ideal candidate demonstrates personnel leadership skills, proven technical competence, and the ability to collaborate with others to achieve business objectives.\n\nResponsibilities : • Lead and mentor a team of electrical and mechanical engineers to deliver the best RF/Antenna product to fit the customer need • Conduct presentations to military and commercial engineering team (including PDR, CDR, etc.) • Review SOWs and special requests from clients, evaluate, and raise issues or concerns. • Provide estimated cost of new designs • Support an organizational effort toward better understanding customer needs and pain points, and develop plans that further this goal • Attract and retain new engineering talent • Manage the product portfolio • Champion technical discussion with the client technical staff **Please Apply your CV in WORD Document • 5-10 years of experience as an engineer and/ team leader of engineers • Experience in a military/government company or similar (IAI, Elbit, Rafael, etc.) • Proven success in leading mechanical and electrical engineering teams in rapid product development • Basic understatement of the antennas and RF world • Passionate about the telecommunication market • Knowledge of Microsoft (excel, word, outlook, MS projects) • Must be fluent in English and Hebrew • Have a strong builder mentality, and know how to effectively \"bring people Demonstrated success in building a culture of innovation, ownership, and accountability • Strong strategic business knowledge, change management, and continuous improvement champion • Understatement of concept from the plastic, electronics, and metal industries that relate to the production of antenna productalongShow more Report"}, {"company": "אורגד מאגרים בע''מ", "job": "Junior DFT Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=225&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_47e5f745&cb=1676382863225&jobListingId=1006884230390&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp838vpekhrt801-1goorviu1i7l8800-1867df31ac64a337--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCYQvHrt0AEv4bbv5HwhlTwLBSGHMMScTuhk9ZoyDNzgzQ6_wzhTn3-JAeEUpXPZ8E20vYB5UL-q5yGBH6cjlEJ4TIaxgZM87huT5OIvbYRGK_-vTuWTkpbDA5lRy8vakfPLeWcEi_Ut_zcrg5hN-IrtKuzEFXb0HiaSxjvqSMC20kL7a2VV89CfhqNSShQ78dxEaHLIdkknenozN0yGCkXzWSuZa8SsDpg3Ki4Pi34tW7DXNWNhsVR0K6Yiy4fWUxDOkblJ0wDoydOFtSKQ4DBvHTvtm_ZY85iPjtybXPdoqgl0QR5h_1bI9yYXJJQEdbAI1KajXbGyzF3UqkhtSaw69kwH9tCiyzAydjuNnzSlq-VxfKS6T-bzv492EPnx7I2XsD3Q-NCXlmZ3c3PqD7DyG710Q9hccwrvCQCwnEexu4IWs4j8Pr0tra9WzFSM4gsp5j3azP-TytGTVv0bsj89AjrleSoCA68glw6K0r0OZxZLH1C1ZZtLeB1w_kuAn4NHwizLL17iur8N7Gh7BNxmMWDaVdkLLFwV9j7-OZN7sLyM0EeDUsZ7QOF8b44CgkZsvRBqWJ34R0DlSkkkFbRvoEbvsCSgQ6n2HjCEVOT7M0-jclBwiUfciBBF-wGxzHFyOIaUUxdDM8QiFpHRL5T", "description": "לחברת סמיקונדקטור מעולה מהנדס/ת DFT אפשרי לבוגר , ללא ניסיון B.Sc. or M.Sc. degree in Computer Engineering/Electrical Engineering 0-5 years in a semiconductor company as a DFT engineer Chip design, Verilog and System Verilog Verification, UVM methodologyATPG tools Scan insertion tools Gate-level simulations Static timing analysis Scripting (Perl/Tcl) Familiarity with ATEShow more Report"}, {"company": "RecrutiX", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=226&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b36cf84e&cb=1676382864685&jobListingId=1008393458650&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83917ikuir801-1goorviu1i7l8800-98a03b69ec5dec0a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBd5v_If7FO5aUq39gSkFFiWo0q5cuYpaC2A5ac78RhGMQGvJwCmkWg6gRc0AyihHs6N5kQWl2LkMmHyb0hp1F0gUxqe4vLXCy9vGhogoBOm-OGawOmwaoz_8Uozj_bNd9-xBTfIDa__32nv3IEEVb21YzJ3ZLBgJKdrPXOpT-dRfL2CuXiGrtExsS5SfZ2KNevHVBytNHjyvVbocfRf7e8cC0vDvxeU3-1roXuMcqq67HwEBm9_lIU2I-ItjL85Fj7bPoyQoHhnQPexTNfd9JJ3m41CALpmCUaEnUhTSSp27yzCY3NT7zhdU6FYVY-AHhFYo1u3MiibYABcX9cBQL9sbKxSrkdYILlEgjukPaieMxXehh839q4vrAo2K4tTvEk7gP2l7na7ps90MdPteYadlWNSociKF0UaJAlvwsra4fjlne9q8voiJFBqN67EbRJW7Abg0ztVbuF1VrL-j7mpqATcYAczz9epMlj6W3orcx9YvYDOKeGFr4dO-PV5B8Fl9IlQ69Nby2Oxg5OUpAUAOYqhP59vuHGAQpbfcHhhypv1oQx7LY5hbxXBZ9aGxzzUwW9KKoQifoVFBmw_17X99GKZohElEpW1z8c8bWu9MyCAg8EcexTU_Uja9rsVubKq_VUc8nEMp4DNymx1pMk", "description": "Test documentation creation and supporting (checklists, test cases, mind maps) Issues reporting and further processing Performing functional, UI&UX testing Regular and clear status, progress reporting Work closely with all scrum team/product owners Cooperate and work closely with the development team We offer: - Ability to work remotely (New York time zone); - 8-9 hour working day and 5-day working week; - Corporate events (Remote position, Full Time) 2+ years of experience in testing 1+ year of experience in automation testing (Java Script) Ability to analyze the automation test runs Experience and deep awareness in testing levels and types (smoke, acceptance, system, integration, grey box, regression) Good basis in SQL Data Bases working experience Understanding of scrum methodology Good communication and reporting skills. Be able to effectively cooperate with a development team Good self-organization: be able to switch between tasks quickly without focus lost At least Intermediate level of spoken and written EnglishShow more Report"}, {"company": "פיקארו השמה גיוס וסורסינג בע\"מ", "job": "Junior Embedded Engineer", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "5.0", "link": "", "description": ""}, {"company": "SQLink", "job": "Full stack Engineer לחברה מובילה", "city": "Raanana", "date": "7d", "rating": "3.7", "link": "", "description": ""}, {"company": "מרטנס הופמן מקבוצת Malam Team", "job": "data engineer", "city": "Jerusalem", "date": "16d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=229&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_20af298e&cb=1676382873127&jobListingId=1008423355675&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp8399ep2pv5001-1goorviu1i7l8800-543e8db7adbeee1c--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HL9gN3FSo5qRZL0jbljSAjXZsCRx83YYFDWuW2FV8gw3XgYsZj9h1jUKhHhVBirEMSGV7NkzpkPVUNEJyTaXjytblzeftQRXdi8gN0fJCl_7OaX9CYGU3BgsYCSdp6SYH0ZuBBP3_Q9oyHaE3tSRdEi6SjKNhtPgbkXN4FneHCtkqOa5csVIFYn3YgsMfUMYQ5AA0xl7P4PbWOjLdLWYaDu7fsk5RZN81S6g1ThrScOOC5juyvlnD-q6Gzd6nzqQa3JLtb9K1o6oCFlSDszJziDgwOPU1d_0rcSBNi43aFqDZofyIYjSLtv4rl_66YncLeOhoCdIGbW-S_YFWV-fAYhrQDy19tyRjFjvHkqOCmGkVBVd_paAhqjTAZ4jL_7xNyfYsREOxV9I5xfG59gxOO0eD9yXwLtXDl-TkuZNrF82Nxutu5RSJcBjiqmicToIr95IqUboqNEOT-6B17y-wS45NhLYZS3KvWD9dgVpm9pIAGdGKg9ro2I6Z39EC1i2hyFhjX9dI3fEKL0-GZ3K18CtPPmEYx7jjudzYqF2vPJE2u8TdcTm4MoYMYNhpKM8s0Be0BqRlk1ypf87y8UvABUxp7WMZyGLJa1AWrUrvSGJmhSSUNZnKpAVkysFmLMIjAvgVHH14PZMCn-Zn8bWxYvnpU8AuT3lxY%3D", "description": "למרטנס הופמן מקבוצת MALAM TEAM דרוש\\ה data engineer לארגון מוביל באזור השפלה. ניסיון מעמיק בפיתוח ב- Python- שנתיים לפחות- חובה ניסיון מעמיק בפיתוח בעולמות Azure cloud Data bricks , Data factory ,Data lake – שנתיים לפחות- חובה שליטה טובה ב SQL- חובה. ניסיון בפיתוח ETL בסביבת BIShow more Report"}, {"company": "NetHR", "job": "Sales Engineer", "city": "Jerusalem", "date": "21d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=230&ao=1110586&s=58&guid=0000018631bfcb7fb7d4ba660324527a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d5911dd7&cb=1676382874355&jobListingId=1008413822967&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839al3kuho801-1goorviu1i7l8800-36eb66c795d9bf57--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBUvnGSt1weWMoZSU40N9AjRVafJ9e6GbkUGd3n5iRzVMfZATmCEMjBiaPJDvzvbnyTuc7jCzWvnKxxLFAaqsnlq-6lzajJx1xtVWU2spge3Wr788b30Bnpw2qvvD0zJgD1Cza79Z2nIBMrEWfNaOxPpQKmYKD-50c8JKrFwMeWpnumOa7IdLohKnHINlsn-vUoJFk-D9ni2tPboowthKB9Tdjh90C2W19bUjsT5dhXhUXGAYV9Ccf83MeBNQmS2BfxY-tB_vCLNMpMnSep3wz1xWNn2HNICkSxQpXvifx_R6vwSg8qZmfvgioVLL2u-CasZrttlEiz55l9XryyAaqulbJjgvNsSDeIc-ng33bGG_zxVBb37KEqQ22-9vfRSCwUdGv0hUf6aLcmHCno-xqe62FYqfVujyiPgIglQPlZKJ0ECHjo5UN8L-TFF_3l-KZw0eE9AUox3iS8AtJQ2W0mOdmljWgGDJFiUBEy0XsObhFt3fGaNEHkzlBCSAxwoiTAiwKKNFP_H8jyMDcA5B0vBcnG05tUvPa-G1bW3tE_Oog1WNyDL9i3U00pbGsV37D_lvlfVbqf_KEYwYKdvLCkgSN1c6p-THrE13B7YwLAVIGo2PwEiYQf6cL_VzaabZtCKDwqyFLkaPsk79TdZP5Q", "description": "Responsible for generating existing and/or new sales. Responsible for developing customers and maintaining their satisfaction. Determines and develops approaches to sales assignments to achieve quota/ strategies Leads projects requiring coordination with other functions, organizations Bachelors University Degree in Electronic Engineering or equivalent. Over five years of experience in High Tech Sales, customer Support, Marketing or R&D.\n\nTechnical knowledge in Broadband, Wireless Lan 3G,4G Strong communication skill and the ability to interact with a wide variety of people. Self-motivated and willingness to take up challenging assignments Highly competitive, assertive with a passion to \"win\" and “teach” Comfortable in challenging customers by offering the customer unique perspectives Sociable, people oriented, outgoing, desires lots of quality customer interaction, and wants to earn recognitionShow more Report"}], [{"company": "נישה", "job": "System engineer", "city": "Tel Aviv-Yafo", "date": "13d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=301&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f2c8dfa4&cb=1676382876478&jobListingId=1008430216878&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839cn4j4it801-1goos0dhai3as800-bc9483ccfd35c19a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAZH0JiOdG3yU2XYqbm3NjkdMjy0_Wler44V3qAq_-rgM_Ku4YDLIlKX03vP-9WwqQrK0aUO4ORwO0pgg8vP1qghKeubyXj8B9LDWcr1etjoAfhrjV0RFjruTnC8PlTLJM4XkKICndAF7Eof2Mu1FRupWvIp6TgacQetZF27fKMJeAERElDC4diRQ9ZfXcEiLkVgDb2OQ_PavOlobxHWfzAFyh0VhLURWXfpD7sKjj_JThCgCrww0noz7295_Aa07B6ht5Of6V9uhB-8mbQs9jnrcdXVD3vDuqjcpqTu_ZNuPBZ69gS-Pf6KIHm6JL18xvQ0lVtPYAJ_d650PLxyppSN3LX-2ec5h2jjyaLNpYtV_2QK3pr97p393e7u0-poc9OCceX77sy06YLBcsY1bohq3bN3XlJI6tBYlBeOpa1F-bkflvv8MQSZBKmlp1E5JBXAasnEVCTsHv9o_mp6WOVn-L6Ejv4y-8seyP5yJAAZquUO1XU8qTR-D-fZPLLFHs-W_PZkfbjVUi0t8Z4j-oDhAgH6DMJyibBjJu9CTdsNga0x1TxXJGukmYmgS11YAj_1zPkaKxcLMk64Mu_07QLMuB9-809GTxnP0vhEwX9ANsP_FacMBhBq1ugr2VuGTQ1UrQ_UCBGqbGAEMTIq9PW", "description": "לחברת SU העוסקת בפיתוח מכשור מציל חיים לתחום הקרדיולוגיה, דרוש/ה מהנדס/ת מערכת כחלק ממחלקת הפיתוח תואר ראשון בהנדסת אלקטרוניקה/מכונות/הנדסת מערכת או אחר- חובה לפחות 3 שנות ניסיון בהנדסת מערכת מחברת מכשור רפואי -חובה ניסיון מחברת מכשור רפואי העוסקת בפיתוח מכשור קרדיולוגי/MRI/הדמייה - יתרון משמעותי ניסיון עם מערכות מכשור רפואי גדולות ומורכבות -יתרון ניסיון באחד או יותר מהבאים : עבודה במעבדה, אינטגרציה, כתיבת מסמכי דרישות, מערכות בקנה מידה גדול- יתרון משמעותיShow more Report"}, {"company": "Deloitte", "job": "Senior/Junior Data Engineer", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=302&ao=1136043&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_50f6ce30&cb=1676382877748&jobListingId=1008435556111&jrtk=3-1-1gp839dvfk6dk801-1goos0dhai3as800-b186792f917f6629-", "description": "Description\n\nDeloitte Analytics, a part of Deloitte Israel consulting practice, is looking for a talented Data Engineer to join our growing team!\n\nHow your day will look like:\n\nAs a Data Engineer, you will take an integral part in our local and global projects.\nOur clients come from a wide range of industries and organizations across the globe.\nYou will work in collaboration with the data architect and data scientists and will be responsible for the development and implementation of data gathering, maintenance, deployment of DS pipelines, and helping to build infrastructural solutions that support the data, science teams.\nYou will collaborate with internal teams to facilitate solutions for DMPs.\nRequirements\nMSc/BA in Computer Science or another relevant field.\nA passionate Data Engineer with experience in developing data pipelines using AWS/Azure/other cloud-based technologies and Big Data technology stack to create custom solutions using large data sets.\nExperienced in writing APIs, scrapers, and crawlers.\n2-6 years of experience with Data Modeling and tuning of relational as well as NoSQL datastores (Athena, MongoDB, MySQL, Red-shift, etc.)\n2-6 years experience in ETL development using Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.) – is a plus.\nExperience using cloud-native tools and design patterns (Containers, Serverless, Docker, Kubernetes, etc.) – is a plus.\nFluent in English\nTeam player with a can-do attitude\n\nFull time Job\n\nLocation: Tel Aviv, Hybrid\nWe at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.Show more Report"}, {"company": "נישה", "job": "Document and Quality Control Engineer", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=303&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b2072540&cb=1676382879163&jobListingId=1008423892933&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839f9omfoo801-1goos0dhai3as800-0c05a39f76a13d9d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC0OIaE1NxJ1a3d1v4KqfxBd2SmPBAq3aNAx2x8ecG85NJoPiBWKySX1KpnYznaigusI1GBAZc54qDjwhdItIwYw1lcLtpC0EOu7_Nh9ot7zuMnAloch2vwTJwIM2mo5kcrYr6ARzEoHazy0uQB2kHUWdcA96kCEhFeVkKZMros_tne_2pUZGtx6cIyGf9yFKpv-j8Iagwr3qU14J4gh3cjbatOM_F8KLqwTcX5uFrvzG5IK2ZmFOpUCjrN1wk8M52_hqob0mq2t3aL3iIDZTs7OzBTneklI2aFCQNjx89WlfBRQykjiSzuX9cr-xPck-trYPHbgb6QqPaxCyAdrJcrdzOJyhoCBeJrM5FWHCKpAi6l6DD2NuwWt5UjRpODSwzjDaGNypZsKsy6Y8TaiXVzO2bczhLVsvMmQ-dgIzFnhHr76YBXVD4wyDiHuZy3rrDihOICDqc1niFLSHJxaVKYbmMdYBLypCB__DslED48bDx7wHL003Q0jLvzX5QUmP8O80UkBKpoIt4avTVTAVs2ROQvqceqJx6oA5j0Lr7UWg9kGSkBCz3BwFa1alcI9u4xlj3aE8n6A6zacS8oUlLEhVKZqFFjo5-TuVrVZuKO5yA-G1paxNvY5TfjohZxDbZiTgs8Lsd9rJH89SE4LPN_", "description": "לחברת מיכשור רפואי מובילה ביקנעם דרוש/ה מבקר/ת איכות להצטרף לצוות האיכות דיווח למנהל/ת QC הנדסאי אלקטרוני או מכני תעשייתי (HANDESAI) או תחום דומה . ניסיון של לפחות 3 שנים כמבקר/ת איכות -חובה! מכשור רפואי-יתרון. יכולות טכניות ויכולת גבוהה לפתרון בעיות.\n\nניסיון במערכת ERP יתרון לקורסי QA/QC מיומנויות בינאישיות ותקשורת גבוהות שפה: עברית ואנגלית טובהShow more Report"}, {"company": "MalamTeam3", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4eddfb96&cb=1676382880672&jobListingId=1008070271437&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839gqd20b0001-1goos0dhai3as800-7a9455391c9a46fe--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tCjX7o1y-kWCixrjUB_PGkYSUOmWVwx2KfcRsUteqGCEBugE5FDOTUTFG8sSuROsoskBrpasQJDaD2u4dT9ZC_OxeomsoDt33fiWcjPf1VcB8UeDSffxk0uDxM7T6ZAHnmty7hGNGVkN9JsHCEgZiWVsiD6kpRb630m6yW5nBxuXBKT0vahgL3CsyMjnsex16PKI2e-qo69FOd1038-dvfS82WFayaKICDoUycirOThgi5rm-HXtYEfAzfG0I84pHQBnjDXczSJSmpUuvvR_qa9ZBVKZA3sqpC_7jyE1NvLU-ZxLZym9RGFuDxBAhR1LmJPtAMEaakAeLupugdAXGKlXx4ockxH5iTilHxInqUHFq6OZvXHQ9gW8EJZGYVSXcH0qBKMrH9UnHy1_oNL2wBGTpxudy9xF-P7rXdN90e99H7LkjyUlf8sMG8ymHPCT1lf1bE13JzimxATL25iq1hM6LaC-X_iTIHeMcleW74iutMU6pn_WSl9URpTZzcJvff59pci6fSXEUXCkLmc_PK7edppUmLo3QqpOKIfZ0Xflc7d-hTlzpnK2Ujq2ydMmfPDODVjrhc6lhQm3zVNxABNto-U5UVAlSPlNEZWjI80qPqvb6c70w_7SwwfM5UM-mZkXdTTC6C2IUNrTW2kvvWmpK1f1fLakri3RodsuIcL9zwiBkp5yPBk%3D", "description": "דרוש/ה בודק/ת ידני/ת ואוטומציה לחברת ביטוח מובילה בתחומה במסגרת התפקיד: ביצוע בדיקות ידניות ואוטומטיות לתהליכים במערכות WEB וMOBILE, הבנת דרישות UI/UX, כתיבת מסמכי אפיון ומסמכי STP,STD,STR , עבודה מול בסיס נתונים SQL. ניסיון של 4 שנים כבודק/בודקת תוכנה ידע וניסיון בהרצת בדיקות אוטומטיות עבודה מול בסיס נתונים SQLShow more Report"}, {"company": "Google", "job": "Silicon Validation Engineer, Google Cloud", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "R&D Manager", "city": "Southern", "date": "6d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=306&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2cc6de8a&cb=1676382883164&jobListingId=1008444887754&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839j8qk27b801-1goos0dhai3as800-1d920c0b16636e2d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNANtB5ZZYDlIbgi8f3h3mUvlJHkO6fdk4VOuQsIlauBo5BgnQyiy2oUmCiXk-sfj35eqIh4yo3dtyBsfXoUTd9RUuaTwMI8wHVDDgKOuOtH8T5z0namydoN0RRcjf1BOf7w-PaHm5-WdqcPWrd57p1XYU63ON-9osKaqLvqsAinH3Sut0Hi4jJldAatFTj4ZWOsIIyqKyE6jiAIUOepBM597XrI18IrPRZTex8x1CSxzYxP_juIPqyPIy2VTgHyrUoR8AeJXFnOZrRV3pwOABoQfXLyvFVjcCENgL1pJ4YuqwFEe8dr3SFO16k-Yjf7yyxIGwHJTgg5rcTq8W-zP5LeQ7_DTPpTI1DFywJp4xc0VLDIIcMvctnMdpDCpeWIy4n-LkVsfpWglCUHnfTrmjPxMYEX07rdq0-OgPICked8cc76VvkPpG5q3OEvvnYBL1rvOMP5gsfRbOcodBQXdP4jAON8COqvVfQU5VW-R2uQ_3yeIFGoOTep8jeHCDrTFKfLr_P-jy0wmpWBlVLzmMo_IJ8KNmT54hrBJBT--rdi646OUXcomwmKAQOKEgJGG61wbGzg6k8TWz9LyC4GWgaepCVHM0vWMkSSZJrjTYzLUB0R1WHt3VENb58W8m3DLqDPO8-kDs2ljLz8jZ5gLhCl", "description": "Leading Engineering team and set the technology agenda Manage various projects Parallel • Collaborate with cross-functional partners in Sales, General Ganagers, and executive members to define and build a data-informed technology strategy and roadmaps. • Advise GM and priorities regarding design and direction of new developments. • Ensure the engineering team is scheduled and working efficiently while utilizing company equipment and harnessing the rest of the departments. The ideal candidate demonstrates personnel leadership skills, proven technical competence, and the ability to collaborate with others to achieve business objectives.\n\nResponsibilities : • Lead and mentor a team of electrical and mechanical engineers to deliver the best RF/Antenna product to fit the customer need • Conduct presentations to military and commercial engineering team (including PDR, CDR, etc.) • Review SOWs and special requests from clients, evaluate, and raise issues or concerns. • Provide estimated cost of new designs • Support an organizational effort toward better understanding customer needs and pain points, and develop plans that further this goal • Attract and retain new engineering talent • Manage the product portfolio • Champion technical discussion with the client technical staff **Please Apply your CV in WORD Document • 5-10 years of experience as an engineer and/ team leader of engineers • Experience in a military/government company or similar (IAI, Elbit, Rafael, etc.) • Proven success in leading mechanical and electrical engineering teams in rapid product development • Basic understatement of the antennas and RF world • Passionate about the telecommunication market • Knowledge of Microsoft (excel, word, outlook, MS projects) • Must be fluent in English and Hebrew • Have a strong builder mentality, and know how to effectively \"bring people Demonstrated success in building a culture of innovation, ownership, and accountability • Strong strategic business knowledge, change management, and continuous improvement champion • Understatement of concept from the plastic, electronics, and metal industries that relate to the production of antenna productalongShow more Report"}, {"company": "אורגד מאגרים בע''מ", "job": "Junior DFT Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=307&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f9d1a807&cb=1676382884399&jobListingId=1006884230390&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839kf7kbn7801-1goos0dhai3as800-1867df31ac64a337--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCYQvHrt0AEv4bbv5HwhlTwLBSGHMMScTuhk9ZoyDNzgzQ6_wzhTn3-JAeEUpXPZ8E20vYB5UL-q5yGBH6cjlEJ4TIaxgZM87huT5OIvbYRGK_-vTuWTkpbDA5lRy8vakfPLeWcEi_Ut76MweYV7BiAnqc_UMIKHDhz_4G06YgJr8707_1ZZGveWlxJDVpM7vIh589uD3U234HxrtqE80K914JijEFXHT_uYSgdyuv84H4iL5Ud1mr278XvSbA2Bx9V1QWGy4UFGsUZMRiqSDmRTz-ZMYa3iOlZvz8r4uZ-3GXgyM3ucIkwSaQcRlv8mep0IVSEoKj3_GYuWJTtcPJBBtgnKnxWzEAC5WIKifVsR1W6Avj_rXSyPBkmwKUQZncKPTvxzhIs3_d2RE4PEQUzBWuEpwiHmcv6Jen0bi52X9OqPmLvTgDb5wWHlg6PjJ8tyjq4NdQp7KpuGN2jDfucUEIZFJNYnZ6tmnOTyulWXVEiF_CQ8efLqJRY1YLKgl_VJYDbH21Rf_5gF6Kdk-eS4qmc4ya0jGrvOvIdsP5OGXC1DhCtYHThRaOfWwQZwfoGjQEMsh4Kn0BKF60ukK0lhbn3AbA1uRjdigjQINj-_I79AydNs2mUhIrUBGVrn23oubZTj89sLMTT4D6iJzlv", "description": "לחברת סמיקונדקטור מעולה מהנדס/ת DFT אפשרי לבוגר , ללא ניסיון B.Sc. or M.Sc. degree in Computer Engineering/Electrical Engineering 0-5 years in a semiconductor company as a DFT engineer Chip design, Verilog and System Verilog Verification, UVM methodologyATPG tools Scan insertion tools Gate-level simulations Static timing analysis Scripting (Perl/Tcl) Familiarity with ATEShow more Report"}, {"company": "RecrutiX", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=308&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d8733272&cb=1676382886530&jobListingId=1008393458650&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839mim2gps001-1goos0dhai3as800-98a03b69ec5dec0a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBd5v_If7FO5aUq39gSkFFiWo0q5cuYpaC2A5ac78RhGMQGvJwCmkWg6gRc0AyihHs6N5kQWl2LkMmHyb0hp1F0gUxqe4vLXCy9vGhogoBOm-OGawOmwaoz_8Uozj_bNd9-xBTfIDa__2P4uJ_3I2ehneLM6zMcANGq8Y4iyu16nuj1O3FxpoXbTzjX9X2PSlaz2N23hTZP5dTpxian6MAtp8xuW0uFlkr_8ZBM-vH2q6R5DjBHWtxIwdWE8oAsm6dKCJK9NW6aGH-k8qTuMOGusiFjxHWNV6cHjFhZd89M7-7g6UpoicOsOQpREf1C-qXN-4ITPVCLu8d3ukoctzVTgOusGRQ5IQ1nwYd9C__UvMU45cOhj2LuR2B61d-Yl3oADzeXsbhkqAKZkBdTfFL0Ad7hKLCOnRcu2usphX0o1ls-ojQZ3gR4AaZkBB-DYNMHqHVejR0Oy3eRG3m2oTZo9k6LsePYpqnR53CstrlAUlNTxTiNdXLHvTWrCaa9PtGdUBesXjPOzuhQgQ3e8KSLUeKttYrqCjZBbbbg0uD7Ih1_eBmfEdK2szDI83u1tkjvoATYvi64r8pBCBN8KELLN4r9PiGHgmu3lCIY_7NiOEc2OIbbwHBql5XYRvg-Nhxwreqm7ApCM2EGxowX-vmU", "description": "Test documentation creation and supporting (checklists, test cases, mind maps) Issues reporting and further processing Performing functional, UI&UX testing Regular and clear status, progress reporting Work closely with all scrum team/product owners Cooperate and work closely with the development team We offer: - Ability to work remotely (New York time zone); - 8-9 hour working day and 5-day working week; - Corporate events (Remote position, Full Time) 2+ years of experience in testing 1+ year of experience in automation testing (Java Script) Ability to analyze the automation test runs Experience and deep awareness in testing levels and types (smoke, acceptance, system, integration, grey box, regression) Good basis in SQL Data Bases working experience Understanding of scrum methodology Good communication and reporting skills. Be able to effectively cooperate with a development team Good self-organization: be able to switch between tasks quickly without focus lost At least Intermediate level of spoken and written EnglishShow more Report"}, {"company": "פיקארו השמה גיוס וסורסינג בע\"מ", "job": "Junior Embedded Engineer", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "5.0", "link": "", "description": ""}, {"company": "SQLink", "job": "Full stack Engineer לחברה מובילה", "city": "Raanana", "date": "7d", "rating": "3.7", "link": "", "description": ""}, {"company": "מרטנס הופמן מקבוצת Malam Team", "job": "data engineer", "city": "Jerusalem", "date": "16d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=311&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9e9b76cc&cb=1676382890924&jobListingId=1008423355675&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839qpl2i7f001-1goos0dhai3as800-543e8db7adbeee1c--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HL9gN3FSo5qRZL0jbljSAjXZsCRx83YYFDWuW2FV8gw3XgYsZj9h1jUKhHhVBirEMSGV7NkzpkPVUNEJyTaXjytblzeftQRXdi8gN0fJCl_7OaX9CYGU3BgsYCSdp6SYH0ZuBBP3_Q9o2sh3Ghs51vBJQyRi5TjQMVdYgU0Mfh31DvGw8C-44a-9vjuwQ7w2TbR-pW6Az05PrbCsmTVcjOQfo7nKW-nw_l_39SX6V2H80aj0jO9QbPvHQ_CRI_vtBxpYgK1X8GiboXV_vDN1H7MFNJ_M8Vam7_NOgPmeq1nydBnBE_PVPyEXyvYNappdOXoyOdBE8DW3zqEfoDso-2qDNgPYLoXuFEwzP1I3hyFp8lRF5FYxoI94u4ezZqyctxEf_pIeFW5G20bhnKkHO7u_h7FYq0KwKXaHQEoQxD8pM6yf50yjEgxI1iwDXjp3Vfd_ErDI5TaV88FJip6_2EZj5Tw4zWl28OMLq8XpK9iE6iG1SVQ5i8x7S4s_l4k1o77H1h8dcr78HH8fEy254a7jV2JwX2Y36AiAtIyj2MTXTI1EOYnIcApLXXluRjsZliZXteNeZUsxnmiZW1hC7UQWQpmvl4Wyved0Uhg5m_4FH9BeBSPYlzqhLvzUFn3TZbuVm8IFuL2jqAvZBxumAG3me7wxcS9ris%3D", "description": "למרטנס הופמן מקבוצת MALAM TEAM דרוש\\ה data engineer לארגון מוביל באזור השפלה. ניסיון מעמיק בפיתוח ב- Python- שנתיים לפחות- חובה ניסיון מעמיק בפיתוח בעולמות Azure cloud Data bricks , Data factory ,Data lake – שנתיים לפחות- חובה שליטה טובה ב SQL- חובה. ניסיון בפיתוח ETL בסביבת BIShow more Report"}, {"company": "NetHR", "job": "Sales Engineer", "city": "Jerusalem", "date": "21d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=312&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_14d9fd16&cb=1676382892060&jobListingId=1008413822967&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839rv3kuhv801-1goos0dhai3as800-36eb66c795d9bf57--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBUvnGSt1weWMoZSU40N9AjRVafJ9e6GbkUGd3n5iRzVMfZATmCEMjBiaPJDvzvbnyTuc7jCzWvnKxxLFAaqsnlq-6lzajJx1xtVWU2spge3Wr788b30Bnpw2qvvD0zJgD1Cza79Z2nIBuuBNlQiuxGAfEmBUAU4PnauyeREf6RTXZa1qw3BKheA0d-DjO2lymq6Hp-rUbPWOiZQcZn-vjcYUdEzAhbxTtwK2v134qvQRSL9wMlNAX9zJghDRWaNlrOb0MLGYEELpMNkpzWRqbYqE5vFQhWdZgoBkG3rZeMprbTwn7y3LjDk0XxexSZUV8s6n9n-LDhg3Elhmn6NUfuZ7BdrBHKJJgzgRCXovObfl-jxSSF7PzDZjUubV0-CdJkGkQQh4VdXWrmHp_Km8am69SrPUaXUdCvXYQd1OJVIHdEYr1G_VL2D4DuRN6tFK12Y9ObgQxfA4w5ynlpYlWbPs-MGXtWaawOVvnYoSboPD5V43KIBIriEm1c0Qd1tDyE1Up8-UDZK-qc1BCdYHT3lN49YnUpt1lwywzS-D2hPO3if8b2RNfoRP8zvZIbCPElMNXjNKuCLPpj0AEsqPSbuNzuQ39mEQ70C5L0DhZV7qerAOzA0u46f9IcOw-2GVpxzu4iWEKucVl5CqBxDp0D", "description": "Responsible for generating existing and/or new sales. Responsible for developing customers and maintaining their satisfaction. Determines and develops approaches to sales assignments to achieve quota/ strategies Leads projects requiring coordination with other functions, organizations Bachelors University Degree in Electronic Engineering or equivalent. Over five years of experience in High Tech Sales, customer Support, Marketing or R&D.\n\nTechnical knowledge in Broadband, Wireless Lan 3G,4G Strong communication skill and the ability to interact with a wide variety of people. Self-motivated and willingness to take up challenging assignments Highly competitive, assertive with a passion to \"win\" and “teach” Comfortable in challenging customers by offering the customer unique perspectives Sociable, people oriented, outgoing, desires lots of quality customer interaction, and wants to earn recognitionShow more Report"}, {"company": "Lifetrack Medical Sytems", "job": "Solutions Engineer , EMEA", "city": "Jerusalem", "date": "9d", "rating": "", "link": "", "description": "Core ResponsibilitiesThe Solutions Engineering Lead, EMEA, reporting to the Director of Engineering, will have the following responsibilities:1. Help on business initiatives by supporting the Engineering and Customer Success teams.Assist on any technical matter regarding go-live of new customers with Customer Success teamAssist and collaborate with Customer Technical stakeholders on networking configurations and setup required for successful deployments and integrationsPerform regular preventive maintenance remotely or via onsite visits when requiredAddress, troubleshoot and fix any technical issues raised by customers or escalated by the Customer Support TeamCollaborate and engage with Customer Technical stakeholders and Technical Operation teams when required, conduct technical onboarding, integration implementation and testingAmenable on a scheduled working on site (customer facing work) and do customer onsite visitWilling to work on weekends with flexible schedule2. Oversee the IT requirements of the Lifetrack team.Ensure up-to-date cybersecurity practices are in place for the internal Lifetrack teamProactively be involved in hardware maintenance, software installations, and office networkCoach and train junior members on troubleshooting and maintenance best practices3. Other dutiesSupport other technical team members when required, such as Developers or the Quality Assurance TeamOther related tasks that may be assigned from time to time by the immediate superiorRequired Experience and Skills3-5 years of extensive experience in applications support [deployment, upgrade, troubleshoot, fix] in Linux/Unix based environment in a healthcare IT company.Good understanding of Linux configuration and troubleshooting.Experience in network configuration and troubleshootingShould have skills in Scripting/Coding in at least one languageExcellent written and verbal communication skills in English.Preferred but not required:Good understanding of DICOM and HL7.Experience with tools like Jenkins, TerraformWorking knowledge and experience with deploying solutions in AWS.Operating PrinciplesPurpose-Driven. Being a company with purpose, we also want to have people with purpose- people who are passionate about doing good doing well for a purpose greater than them.Do it right, from the start. We believe in starting from first principles and putting in the hard work now to avoid more work down the future. Our LifeSysTM platform, built from the ground up, reflects this.Radical transparency. We want our people to keep growing and improving. Receiving and giving feedback is critical for this. We expect people to be upfront, open and willing to learn from each other.Crush the bottlenecks. We are always focused on the critical path to achieving results. We expect our members to be relentlessly efficient in clearing the obstacles to this critical path.Going the extra mile. We like and reward team members who are not only good at their jobs, but will raise their hand and propose projects or solutions that help take Lifetrack forward.Job Type: Full-timeAbility to commute/relocate:Jerusalem, מחוז ירושלים: Reliably commute or planning to relocate before starting work (Required)Expected Start Date: 13/02/2023Show more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "System Engineer", "city": "Tel Aviv-Yafo", "date": "5d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cae1f088&cb=1676382894631&jobListingId=1008449839136&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp839uf9i393801-1goos0dhai3as800-19ed1e6a2faae830--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiND__gFkSpEHnk4iQBTbcTEHpUZ52ufA0JQ-BJ3aeNt4cMqEHleHVUkF_uaKUhVJKu7BTP4G1B3tPG9ZW4GBJeJnfcse358-32VHy4SKSpUGqy1GeHzwm08slIXNaMiEkNSKt8d5bpOhlyoyVz1jlRDq_JIV5a7_OUPyuagA6m6v9zC04i9dGG4gBGRtLd8uuOepwS6tW1EVEQWG5RTFI2I9COl4vud_TVQuP5-fVhtRr3sGvNT51Bbc2Z0gnTO3esl215AsE7OTrK6iZ62e4OlCBRt223OT9_LrY8jd4Njn-2JBiphMEs0j5v-6h4r4bNrd30Ni-DM6XAVFriHDn_xVWfn-4M2J0bJ0Z4aTTSfspOIhM1JLD9gQSOP_xSUu-aRaT2U1YEBEQqmqQtPmBcXHBakZ_l1guej4dUjcZt9peTxy3n6wO_NCDNXp8vDm5Q9CtG5APnFhWDsyM7X23iMIt0jtvABhKV8pruIuWyQzMuWCjQCUFt2fSeEFpVtRA9fMPiZ1ilf7S705ol5lNVXT1qHQi7h9EkXDvJ8Zr3X5SG2x3g2cEWOLmPXqf8eJV1FwnTEiA5_kL_uRkzswUsO43KWMoAvuUzy8lhdGlXCdHD9YuiY2_KVVl_HnNDoNs2Kkq9CIPqv87NMKU0iiLswM", "description": "System Engineer & Technical Manager · System and LRU level design. · Documents – specifications for sub-contractor, system documentations, ATP. · System and LRU level hands-on integration, analysis and trouble-shooting. · Overall responsibility for technical project management at R&D, including planning and monitoring of all R&D activities.\n\n\nPlanning and monitoring of project R&D budget and timeline (material and hours). · Technical POC of the project, both for the customer and internally. · Lead the design reviews both with the customer and internally. · Lead and conduct FAT and OSAT with the customer.\nParticipation in Pre-Sale activities. Translating customer requirements to the technical specifications and effort estimation. **Please Apply your CVin WORD Document · BSc/MSc in Electrical/Electronics-Engineering from a known institute. · ME in System Engineering - advantage · 5+ years of experience as part of a development team for multi-disciplinary systems/projects.\nHands-on design of LRUs and cables down to wiring level. · LRU and system levels troubleshooting Experience. · Ability to write technical documents and specifications in English. · Experience in project management through its entire life cycles.\nSelf-learning abilities. · Fluent English - speaking, writing, reading. · Advantages: • Experience with servo and/or control systems. • Experience with RF systems.\nExperience with electro-mechanical systems.\n\nShow more Report"}, {"company": "קווליטסט", "job": "V&V Engineer", "city": "Jerusalem", "date": "22d", "rating": "3.9", "link": "", "description": ""}, {"company": "ESR", "job": "Support Engineer לחברת סייבר מובילה", "city": "Jerusalem", "date": "3d", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=316&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bca61a7f&cb=1676382896949&jobListingId=1008452057938&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83a0nhkhqv801-1goos0dhai3as800-e32d18241b9e4e2a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBPrZ4sBHKR74R8VkEnbF1RrCFDMVvx6wl-cZHLSyXhtJWHkF5OYVLvU_orBM9FMUwMJlQahk64UCitpLV-RCbefXlMGxxqxxG6R3IrrhOFVCno28MUXJn8zRKFN2HgJA8UQASp2DtwW1DsTfnQ9EB7oBz6gJOcX0d5XBP6CcuNcpF5cPjY69ywbopKuNdwRcCKxQYJa3M-vQbDWN8Qk1YyAHfTfNL0qyjbh6FcmMzTFn1YtPLLKf0hxWIrwAdp8PuI2dXe6wLqg22t660gMlEs3xkRy7Nw4Y4uVoX6QWX2DPc84PLWw6igkWVbzgKEFgugIs2lpq_CzclQTPRfX8xsobZkPve-g5egfkRpxG9SDIWlyNZAUTypzsi0eDC_64uF1TL5aC1UZP9_VvYrOpFiqcT0M01_W3rehWgqG362mqEty__npnyeI23l8sqBmwzr92ZVVLj5rE1YE8P-vWg_1Wr4zNLs0176wqSGdTcZEUAJWbEgslelTx2DjXvmqgG16DC_-Ye_9sIYGSNfrl-uFRDQ8w_oXgqsvCSw37hjuMHkLP6uUzo2cef2cb2Ye0gx5PonDPgba6z71DikVdhn8vKHYSyaa66OyzGXuetEjGgMCf7UYUPjpMr6_Rghda9YTC4Wuxx_PA4MnYoZ4RcZ", "description": "לחברה גלובלית המתמחה בעולמות של Cyber Security ופתרונות תקשורת לתשתיות קריטיות דרוש/ה Support Engineer התפקיד כולל עבודה מול לקוחות במהלך ההטמעה הראשונית של המוצר לאחר המכירה שלו, וכמובן תמיכה שוטפת של המערכת באתר הלקוח. ביצוע הדרכות, פתירת בעיות, ניתוח נתונים ועוד. * 3-5 שנות ניסיון כ-Support Engineer- חובה * לפחות שלוש שנות ניסיון עם תשתיות IT/OT * ניסיון עם NETWORKING * ניסיון עם מערכות הפעלה WIM/LINUX * זמינות לנסיעות- חובה * תואר ראשון-יתרוןShow more Report"}, {"company": "Google", "job": "Intellectual Property Commodity Manager", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.5", "link": "", "description": ""}, {"company": "נישה", "job": "Application Engineer", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=318&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_996b15b2&cb=1676382900037&jobListingId=1008443063711&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83a3o2joq6801-1goos0dhai3as800-cc3d6415643356e7--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGglsxWUyJPq3N4ytUV6UVoNCJIVo1-NvAoGCih0P4HBCwTu4SrnDoc6MQkrGCdUYaRRtjs0CWxUgV_jtMDOwBeZ-a-BLD8Axzf3OgclUVVwMIBZI-To5NQRe9wKcZafirkAqxzHp8FRuSpDD6P1MHJswOFaKrS-0pc4dswtbVovUt-GUB_7wpmlweRWgKSZUNf3_gkxEfg0PcXp67EhMwO72y2i8w5UuipGMjsW7xcWI7sYpTQTSb6fbBWfryO7zxVlQn94fF1vo-o3VI7yLnMq83ksXSa04Xa25cm8yoCjUvbmrSM7c_9SS5wkgad-Ecnzf34L4KT31BNBcw4SrPuUgnOGbiU8a5ONjV5CuyD9DKwZ62thB0YYBBLiU6ZNbLld--lDM6jNycouUqXQq5reh8eQ6LWYq-jyOaq7zwLdIqjn4EzfXtXTn8j733sxy7eO8HQHq2D2KAhVE60dtAX3bIclRsI2q4JoeY90wHFJwh7ZNS9vbyguHvRd7oJ_tKDz3YNa1-l0FTxM3FYl5C279-l5DDNSrSUxc2-luEI52vFz8SSggZKn7QEGWrAazzftCZ1NsSClXj8xgS-4Tp_OmmDOzdk5xAg3aJ0i2opD3KJ-FM8ulDMbs445nBS1Z68Hc20LX-hC53HqXcsnVTq41ypJFQGdXQQyZQsAHn9yQ%3D", "description": "לחברה טכנולוגית רב תחומית דרוש/ה מהנדס/ת אפליקציות מספר תקנים למספר אתרים פתח תקווה,קיסריה וכרמיאל. B.Sc. בהנדסת חשמל או השכלה הנדסית דומה לפחות 5 שנות ניסיון באפליקציה/ תמיכה טכנית/שירות לקוחות. מיומנויות תקשורת מעולות (בעל פה ובכתב) באנגלית.\n\nכישורים אישיים טובים. היכרות עם יצרני רכיבים אלקטרוניים - יתרון.Show more Report"}, {"company": "VITEC", "job": "QA Engineer", "city": "Herzliya", "date": "30d+", "rating": "4.7", "link": "", "description": ""}, {"company": "aQurate", "job": "Data Engineer", "city": "Jerusalem", "date": "15d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=320&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_29cdfa12&cb=1676382902553&jobListingId=1008425655823&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83a66ujorf801-1goos0dhai3as800-7cc929cfb778bab1--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDfBiBJGjxBFxY36kytSTyPwSqPI8NRm8kM7jI47LQLKIY7kzmz4t-i13slKKgL31L4SUyb74DrlDwuejpw3obrWv8dX-ECPxyKQ8cWxWAcIlsJE2IOCortfVCgm31SzVRtA8Hnwz6yfhuWCBwwFGj_LkV51W0GSTumUyLYECqsJeYA2wa6kRuhe6yzkf3jbSED3rMebIi73uXnqu07lSiy16G9THhB0nfi7C-IUfyeZPb8DbqGCDLV-sQLCYDTKH8OodM1akeS_Ls7IheVwUYvsNKr3Hi_S3uZwVmjtLrCCgRtIQBXLqBChcr6dV_T7C95P2J8gLNJShRExL9lwvjRZfqtX15fwW9vWgI93hmKr9DfY6opzgNdrGAwZ3LGYulm0L08VICkAd1cgPnPc2JNQZAPgQQTXuF6DrL-Q-6Lr4XnQA-EM-w7j1xGE3JyCQ_ZzZ2wzkPveOnHVUq-x2pJ5eTIf6WwXmrIytuiIKlAQ8DCKaP252wvwZDK0si-EfmlCC_BSHsY-22dQuCgt2xQGOHV0Qju-O1DS5B5gwlHE28njileFKczpqwfm7rkXCi6A7FCXWSmyIYHofeLbu2MLOYfi4J9shtFJ_k_4hWw1FRbSXsATNxnRttHhGr6tcZX91YJAwBoNSv90jT2MX23", "description": "אנחנו מגייסים מפתח מנוסה למחלקת BI ואנליטיקה להוביל את צוות ה Back. תיאור משרה התווית מתודולוגיות פיתוח(code review , נהלי פיתוח, performance.) הובלת תהליכי פיתוח תהליכי ETL ב Python. הובלת תהליכי פיתוח תהליכי ETL בסביבת AZURE עם כלים ייעודיים דוגמת Databricks, data factory. הובלת בניית ארכיטקטורת נתונים במחלקה.\n\nפיתוח והקמת תהליכי ETL מרובי מקורות. עבודה מול מגוון ממשקים טכנולוגיים ועסקיים. התפקיד מצריך יכולת לימוד עצמית, הבנה עסקית ויכולת עבודה והתנהלות עצמאית מול גורמים עסקיים וטכנולוגיים בתוך מחלקת ה BI ומחוצה לה. ניסיון מעמיק בפיתוח ב- Python- שנתיים לפחות- חובה ניסיון מעמיק בפיתוח בעולמות Azure cloud Data bricks , Data factory ,Data lake – שנתיים לפחות- חובה שליטה טובה ב SQL- חובה.\n\nניסיון בפיתוח ETL בסביבת BI מתאים לנשים וגברים כאחד.Show more Report"}, {"company": "אלביט מערכות", "job": "Network Emulation Development Engineer", "city": "Raanana", "date": "3d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=321&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c5e2585e&cb=1676382904689&jobListingId=1008452057963&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83a89cjcbs801-1goos0dhai3as800-73120a3c0dc92423--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HKLxk4J980KdHpdiqjW0uOdctgEDKSVm_RFIUzYifyb-lvCkJJp2T6MKzG9Tvjy1_M_NsJIKcGThsHKOm5ntt6gHq2KOR8j4pd7E_c0NK2ktqDGMjV42BFdivNJyT2_TSyKz7teT_fhKo2fSRjx2PcIojRuEKhEj7ZOWRbZww4ac1TPgZAub2jETiIZnyJRhjwudskYwCcIvRgjELdlW4zyrnzseIcX0MXqjmbq73PjUEh4KoahD8PWrGU52v7ASn0r6e9HPe4sxr4qHmcyc280LCm1ZqJIswRCeM7Ilo1JfsM5RAVKrTdR2c0pgMe-MMEBMX3V1Ov9oQh_SV58oNcbrXIhAuLI-xx6nlzglP7Df1Zyyi1wYapcdLHfIqeoQ-S_wuWqWHhWCK8A2t8I1BEfpOY4esowDQ2XQP96VJYJXU3VleyIPCKNntWicX0S4aiRtjjTTYGYkVJYiftvNc-nL8repHUpH4-APpg3ywH75onURRs1tNqO9ztsvrByBiuk_jz-4RYbPdNXizD7BwASGuMi4FRkWjVFtTBveWa9gnLckTCjOyjr7C_d8cPQR4WZt-hXhS1EwZg2INbidnKw9VBeC9-0r1l_CEFTK2EXB98sGG9N72j8siR4XzPiS9KC0CqBuY7JmLhgA834znPKkc6Pz-45pVE%3D", "description": "Elbit System in Natanya, Radio Department group develops and integrates complex MANET (Mobile Ad-Hoc Networks) systems for tactical communication at the battlefield The MANET systems can contain dozens and even hundreds of Radios that needs to communicate and transfer data, voice and video services throughout the network under tactical environment In order to develop those networks we use intensively network simulations which models the radios and their behaviors within the network As part of the work you will be characterizing, implementing and validating the network’s protocols You will be part of a team that develops capabilities and to analyze large amount of networks with aspects of capacity, QoS, Immunity against communication attacks and to prevent cyber-attacks Engineering graduate in communication and electrical diploma Software development skills in C++ Python knowledge – with efficiency code understanding Second degree is an advantageShow more Report"}, {"company": "AMBITION", "job": "Algorithms Engineer לחברה מצליחה בתל אביב", "city": "Jerusalem", "date": "8d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=322&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3bd54006&cb=1676382906152&jobListingId=1008440029425&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83a9lukbnu801-1goos0dhai3as800-00a9b56d44d77749--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDZeKRTdBB5CzNr-_yf2yCPgXO7oTd5s3frVkZmtUnnPN3OXtbZHUICo8peR4aFaikK1eiq7lQGxIA0khxOucCzGY4dCZ83plvPfevR4LE0qhZ-8qoVp5moqbiGvFaMK287i5268aozwHp3SCVjklW2VSxuGu0HRhd29G6g37MQI1dEslvVdxVtSfdipwz9cJNmatvYkAA4ZZ0hkhQhywRSq2klrQOPB4XAngYov063UgdHIDamJnNgLpaAuyskX9UU6eHOse-F69nlQlLDXljekvQMw_24w8yW_Zct7xc_38aPuVN3f9RFubjeaeQpJicSKGr2hyQ9Nv5MLduvycjmXg0owUYcedP7i3_qDcXEjZDEj0VgiY3BLpiGiGBrIyAvW3Y3Ab1PQmnkSB-Q88HkiandLTyjfTOw04JTptPBZz8gWE0CdG-kefQFxBZ3idHJmZm-1w1Tuz19mAdZ1mWUQtyrfnWHxIYjPVZms9ml_XCTRcJZI-EfiHm3myZqZjOYCHj4UXwsXpUrnBG38WZWIn17AWax1UoSMy8mkLvOTWRt0mDwlH6rL3WMnGOBgF-u5fLDVxB3N6bbdYoDoY2xUacupTcUfv-o-Gwdv88wiReZ6w1duHIqvWYrmRsirySMFZzLZxxHlDsrQDpkcgAH", "description": "Algorithms Engineer לחברה מצליחה בתל אביב Algorithms Engineer לחברה מצליחה בתל אביב Python, Java, TensorFlow, Spark, Kafka, Cassandra, HDFS, ElasticSearch, AirFlow, BigQuery, Google Cloud Platform, Kubernetes and Docker דרישות התפקיד About you: M.Sc. or PhD. in Computer Science, Mathematics, Engineering or a related field Strong knowledge in Python Good knowledge in Java, Scala or C++ Familiarity with statistical modeling techniques 3+ years of hands on experience with coding machine learning/statistical modeling based solutions Experience in data analysis and visualization and strong knowledge in SQL Possess strong problem solving and critical thinking skills Nice to have: Experience in developing models using deep learning techniques and tools Experience in developing software within a distributed computation frameworkShow more Report"}, {"company": "Check Point Software Technologies Ltd.", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=323&ao=1136043&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_138cd3e6&cb=1676382907707&jobListingId=1008455034501&jrtk=3-1-1gp83ab6mkckn801-1goos0dhai3as800-bebcb9b746f0dd9e-", "description": "Your Team\n\nWe are looking for a QA Engineer to join our management group!\nYour Impact & Responsibilities\nCreate complex virtual/physical environments to test CP products.Run QA manual and automatic test run on varied environments and setups.Create test plans for new features, Meet with R&D to learn the design, follow up with tests requirement, and write actual tests to cover all of the feature functionality.Provide reliable real-time status to your manager.\nYour Knowledge & Skills\nStrong networking experience with application protocols, like HTTP/HTTPS.Strong networking experience in TCP/IP.\nKnowledge of the Linux operating system.Knowledge and experience in virtualization solutions such as VMWare.Experience in QA methodologies – test design, test cases, and test cycle. – Advantage.Scripting experience (Bash, Python, or Perl) – Advantage.Excellent spoken and written English.Good written and verbal communication skills.Attention to detail and punctuality.Independent, motivated, and self-managed at workTeam player with good interpersonal skills.Show more Report"}, {"company": "Supplier Management Solutions, LLC", "job": "Aerospace Quality Engineer", "city": "Israel", "date": "4d", "rating": "3.1", "link": "", "description": "The Quality Engineer will evaluate and/or appraise supplier's manufacturing capabilities to baseline their processes for conformance to various documented commodity checklists, and/or QMS special processes. Establishes part quality evaluation plans from materials requests through material receipt (full life-cycle). Provides resolution and disposition of non-conformance materials to ensure adequate corrective action.\nThe Quality Engineer is highly supplier-focused, requiring excellent interpersonal and communication skills (oral and written) to manage supplier quality assurance responsibilities and ensure compliance across and at all levels of the organization on major programs from design through production stages.\nEvaluation of manufacturing functions and processes to ensure Quality Standards are in place\nEvaluation of inspection and testing processes, mechanisms and equipment; and performs statistical analysis to assess the cost of and determine the responsibility for, products or materials that do not meet required standards and specifications.\nParticipate in QMS Audits for process deficiency and correction.\nEnsures that corrective measures meet acceptable reliability standards and that documentation is compliant with requirements.\nInteract in the areas of design, incoming material, production control, product evaluation and reliability, inventory control and/or research and development as they apply to product or process quality.\nInvolved in lean and six-sigma quality engineering methodologies.\nWill have 'hands-on' knowledge and experience of mechanical (Machine Shop) components, assembly, subsystem and system level concepts.\nStrong emphasis on RCCA and CAPA experience.\nUnderstanding of FMEA and Process Improvements and Standardization of Processes\nRequired Skills:\nMinimum 3-5 years with LEAN Manufacturing Application experience.\n3-5 years' experience in areas of Quality Engineering such as: FMEA, SPC, RCCA, Process Control, Product Evaluation and Auditing\n2-3 years' working knowledge and experience with ISO9100 and AS9100 QMS Processes, especially in Production and Quality Engineering\n2-3 years' working knowledge and experience with Aircraft Parts and Material Conformity Inspections\n3-5 years FAI experience with AS9102 (FAI) Protocol\n3-5 years' knowledge and experience with inspection methods, techniques and protocols.\n3-5 years' experience in understanding and the application of Engineering Mechanical Processes, Standard Drawings Conventions, Interpreting Drawing Specifications (ANSI 14.5) and GD&T\n3-5 years' experience in understanding and the application of Electronic Assembly Process and Inspection, Standard Conventions (IPC-610, J-Std-1000), Interpreting Schematic Diagrams and Specifications\nAirframe experience required\nAVMS electronic experience required\nStrong English verbal and written communication skills\nReliable transportation must have current/active drivers' license\nUS citizenship required - Supplier Management Solutions, LLC can restrict hiring to US Citizens when government contracts require us to do so. 8 U.S.C. § 1324b(a)(2)(C).\nRequired Education (including certifications):\nIn lieu of a Degree, 6+ years of hands-on experience as a Quality Engineering in an Aerospace Manufacturing Environment\nHigh School or GED\nPreferred Education and Skills (including certifications):\nBachelor's degree is preferred from an accredited college in technical discipline (e.g., Industrial Engineering, Mechanical Engineering, Quality Management)\nProficient with Microsoft Office Products (Excel, Outlook, PowerPoint, Word)\nCompatible certifications or related college courses\nTeam-minded, communicative, proactive, stress-resistant, assertive\nStrong interpersonal communication and problem-solving skills\nPay Range:\n$30-45/hr. Please note that the salary information is a general guideline only. SMS/Trigo considers factors such as (but not limited to) scope and responsibilities of the position, candidate’s work experience, education/training, key skills, internal peer equity, as well as, market and business considerations when extending an offer.\nCompany Overview\nSupplier Management Solutions (SMS), a TRIGO Company, is the leader in the Aerospace & Defense Industry providing global Supplier Delivery Assurance, Supplier Development and Quality Management Services. SMS provides a fully integrated service solution to optimize Supplier performance through an embedded “boots on the ground” business model to drive systemic changes that enhance Supplier Quality and Supplier Delivery performance. We work as an extension of our Customers to build and maintain supplier and customer collaboration to ensure improved results and provide visibility throughout the supply chain. SMS’ team of dedicated Delivery Assurance Specialists, Supplier Development Specialists, Supplier Quality Engineers and Program Managers support hundreds of Customers and are deployed to thousands of Suppliers worldwide focused on achieving On-Time and On-Quality Delivery results.\nSupplier Management Solutions, LLC (SMS) is an Equal Opportunity Employer, including disabled and veterans, and may require US Citizenship for employment on certain defense contracts subject to ITAR restrictions. All qualified candidates will receive consideration. Except where otherwise provided by law, selection will be made without regard to, and there will be no discrimination because of race, religion, color, national origin, sex, political affiliations, marital status, non-disqualifying physical or mental disability, age, sexual orientation, gender identity, genetic information, membership or non-membership in an employee organization, or on the basis of personal favoritism or other non-merit factors.\n2IQRLLhjkOShow more Report"}, {"company": "מיקרופוקוס", "job": "Software Quality Engineer", "city": "Raanana", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=325&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7c0ab16a&cb=1676382911442&jobListingId=1007779391119&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83aestk60h801-1goos0dhai3as800-7f867036d23bdc51--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBQoLRpKY-IRT53BsSljoPjY8z8bXsE1haLuCHVDbN2zPrc8xU9Jgmc8f_dnM2iq0A4RzgXdr44za-qeeyH7kKCPV4uHQe3CK7DTsxfx4nfoUlcHyYehL9XOBTuo3lF9Q17ouDJLh9o81ZJVL4Z2xy_SV2SKmbBDd3UL2N1j61CUHTs6QXdmZOCdAH786GP5bkH4tat7H3LWygFMZTuJahWHa6PndxcT448qa5L-xDs0ARKrOWCLxAvxBQ85X9x_hE0E9wdWxsdCas9yjympb5BL4gvsPXE0GPIKa_s2ZMYAMYmB4TA81WfuqkXWviTUu0DRwR6V6eaoPzQ3UqETlWMlBywCndDXjfQgkLlAAzpjHTv_ISt3AX4ews9mhCPQKaghkq14l_M9SVZ-sMKZqvWyEY9CtaBStLFY0e6NlKeyJ6NEA4qF0AnbYSa3eUw4saNhCwiCNpp2Y-JdDMk-C4vUhyoRmiCWNKeCm2x9d5EQusQRvP1RSq2ZVGUW6oD_dnEZPPRQG0TgtqByHEQtc0ExmFoWHFpkHUPlBOoo7KCCmwj-zRoTTAjVBOOlEkkSUkS8FBOI11V9qM-Op3eFYrrml8ojkWSQYd2qaQNaiKrauS-LY6Se8H5H93wno2kUID5QEC8b0JpiGms3fNTean_", "description": "Micro Focus is one of the world’s largest enterprise software providers, delivering the mission-critical software that keeps the digital world running. We combine pragmatism, discipline, and customer-centric innovation to deliver trusted, proven solutions that customers need in order to succeed in today’s rapidly evolving marketplace. That’s high tech without the drama. We are looking for a talented Software Quality Engineer to lead our rapid agile plans and join the growing R&D team which builds our LoadRunner Cloud products suite.\n\nResponsibilities: Take full testing ownership and lead the quality of OneAnalysis Product Write automated tests over existing automation framework as well as contributing to extend the frameworks according to product needs File defects with appropriate supporting information for development to investigate and prepare a fix Work with Developers during the entire product lifecycle, Participate in the Agile/SCRUM process Cooperate with UX, UI and functional architect for specifications, user interaction and graphic design Work according to high execution standards, while adhering to project goals and ensuring high quality Qualification’s: Bachelor’s Degree in Computer Science (or equivalent) Demonstrate a strong sense of ownership which drives you to find ways to do things better, faster, and more efficiently Good understanding of the Agile software development lifecycle Solid English communication capabilities (verbal and written) Demonstrate strong knowledge with test strategies, test design and test types Experience with UI testing, and preferably with framework development Experience with JavaScript, TypeScript Experience with Protractor - big advantage Experience in test automation – Prefer, at least 2 years of experience Experience in manual testing – Must, at least 2 years of experienceShow more Report"}, {"company": "אלביט מערכות", "job": "Junior HW Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=326&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5e158cb0&cb=1676382912740&jobListingId=1008333808917&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83ag3cm6rc801-1goos0dhai3as800-ff20e2dd9ba069b1--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HLEiNFa2MbAu6WaA2iIrOeGwaQDHBxeEqEsVU8pSkbCuvttchXEACUV19Oj2zg_uaX7p3Z5PhXqzqQiiM8Gfb81padT-oARFBNAmqjfv4-1hKCyoGqsrQeWD7OSPVXORtW8BiFK8wYAXY8nmeJuK-xvufb6g18RRnQ1hjC3GQivPI1FmgQe8JUu66h8coLr8prRK_nftUhtJA2mVt3_NQDcOLAjAms8e90LCMT60MZzMABwbDU9P-J28gfzDLRR2mrOm08rZP3X-TjuGQatWbvfR_EBi40WPC1nhVFgoUmRiWzh9ldaI85U_2_vfgV7ma4yPy0HG7DGgMtgti3_ZZXFDw42QN_GVqXE9r8mImABEVQFbUTpF6uTz_E7dOvLDwf2XYdWM1sJi74K1u2KqHasQwLUBMhsFbUEBLEkKTehbRKmjxgJYuvtVvOUPs3S4OkWdag4alrDCF6S7RNhK2_-IuI0bfWrt38W8dnQGeGsKJIv8VRxv1gw2UaOi4yToQKJWWxrxOMkxvGDb6Qu4_5s5xV9ZMc-c5UyA62p-3P4QX5nnKHAxzorMHkvPurhZG3lncOTlM9BBQNh8yhnb_7bVo5_mQ4TWg4vMHSiE3Hw94Txb3vCwEgoH7fq9jwrjCk6lprS03lBORgp-wgKbF18DPty5TSsi-c%3D", "description": "אלביט מערכות, חברת ההייטק הבטחוני המובילה בתחומה, מציעה לך כרטיס כניסה לעולם פיתוח הכרטיסים סטודנטית או בוגרת תואר בהנדסת אלקטרוניקה, זאת הזדמנות לקחת חלק בהצלחה הבינלאומית שלנו, הזדמנות לייצר טכנולוגיה פורצת דרך כחלק מקבוצת פיתוח חומרה ברחובות אז מה תעשי במסגרת התפקיד – תשתלבי בצוות הפיתוח של מערכות מרובות כרטיסים אלקטרוניים Board Design אנאלוגי ודיגיטאלי תעסקי בפיתוח של מערכות עיבוד תמונה ומערכות מרובות מעבדים ו- FPGA מהנדסת אלקטרוניקה או לחילופין סטודנטית להנדסת אלקטרוניקה בשנת הלימודים האחרונה הנדסאית או טכנאית - יתרון ניסיון והיכרות עם מעבדות וציוד מדידה היכרות עם תכן VHDL – יתרון נא לצרף גליון ציונים *המודעה מנוסחת בלשון נקבה אך פונה לגברים ולנשים כאחד *רק פניות מתאימות יענוShow more Report"}, {"company": "", "job": "מהנדס חומרים/כימה", "city": "Haifa", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "Qualitest", "job": "CSV Engineer", "city": "Israel", "date": "12d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=328&ao=1136043&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d6a78288&cb=1676382974222&jobListingId=1008431791478&jrtk=3-1-1gp83cc4hkcm4801-1goos0dhai3as800-2302a550b485928e-", "description": "Description\n\nQuaitest is hiring experienced CSV Engineers for the pharma industry!\n\nIn this position you will:\nWrite Computerized systems validation documents and test protocols: IQ,OQ,PQ\nWrite Computerized systems design and summary documents: URS,FRS,VP,VSR\nWrite software applications reject lists, bug identification, report and monitoring.\nFunctional and detailed documented testing of life-science computerized systems.\nComply with healthcare regulation for computerized systems ( 2CFRPART11, CE Annex 11)\nRequirements\n\n\n1 year of experience in healthcare QA\n1 year of experience with software testing specifically and\\or familiar with IT technical issues.\nExperience in computerized system validation in the life science industry( Biotech, Pharma, Medical Device etc.)\n\nBenefits\n\nWhy QualiTest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\nNever stop experimenting and learning with Qualitest Tech academy: training courses, mentorship programs, technical tribes, sponsored certifications, leadership programs and much more\n\nIntrigued to find more about us?\n\nVisit our website at www.qualitestgroup.com\nCheck out our Career page: https://qualitestgroup.com/careers/open-positions/\n\nIf you like what you have read, send us your resume and let’s start talking!Show more Report"}, {"company": "Agmatix", "job": "Data Engineer", "city": "Ramat Gan", "date": "7d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=329&ao=1136043&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4a87c580&cb=1676382976054&jobListingId=1008443326702&jrtk=3-1-1gp83cdvljfn9801-1goos0dhai3as800-fa892940f5ef8d4d-", "description": "About Agmatix\nagmatix’s vision is to create best of class sustainable agriculture for the future by making high quality and standardized agronomic data freely available for ag professionals to translate into impact. To do that, agmatix is building a leading digital field trials technology that is revolutionizing data driven agriculture. Our technology disrupts a domain where lack of common language, connectivity and data curation methodologies are significant barriers for improvements. Implementing agmatix solutions will allow agricultural professionals around the world to increase crops yields while reducing environmental damage and improving crop quality over time.\nagmatix is built on a set of 6 core values, we are proud to say we stick to the following:\nCutting Edge- Constant state of mind to improve, grow and learn\nDaring- We strive to change the world with the best solutions, Reshaping the future of agriculture.\nData-Driven- We live and breathe data-driven decisions in everything we do.\nDetermination- We strive to change the world with the best solutions\nRooted- The fabric of our DNA is connected to the principles that matter to our clients, our people, and the planet\nTrustworthy- We are a source of confidence to our clients, our employees, partners, and colleagues\nWhat You'll Be Doing\nAs a Data software engineer you will explore new technologies and tools to keep us on the cutting edge.\nYou will work closely with business stakeholders to collect product feedback and think of innovative ways to solve problems, address customer needs and drive product adoption.\nYou will be responsible for designing and implanting high quality solutions for different data challenges\nYou will take significant part in the development of the next generation data platform of the company\nyou will be an authority in data related decisions\nAbout You\nYou are an experienced engineer who focuses on the data engineering domain.\nYou have an experience in deep technical expertise in software engineering, Data Engineering, DBA.\nHave an all-around data engineering: experience in experimentation, data visualization, machine learning frameworks, optimization, and big data.\nHands on in Python programming, focusing on delivering data pipelines (ETL/ELT, Modeling, Stream/data processing technologies, and related AWS services).\nYou gained experience in SQL/NoSQL and data modeling according to business requirements.\nHands-on experience developing microservices and backend API (REST or GraphQL), have experience with Git and PR workflow.\nExperience with machine learning frameworks and libraries in AWS, GCP is a plus.\nExperience with graph databases is a plus.\nYou have a BSc/MSc or equivalent experience in a quantitative field (Computer Science, Statistics, Mathematics, Engineering, etc.) is a plus\nYou have a high ability to use new technologies and understand them in depth through rapid self-learning.\nYou are proactive by nature; internal drive for excellence and improvement.\nContinuously evolve yourself by keeping up to date with the latest Data Engineering technologies.\nEnjoy working in a fast paced, high-growth environments and has a insatiable curiosity.Show more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "QA Automation Engineer", "city": "Jerusalem", "date": "2d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=330&ao=1110586&s=58&guid=0000018631c035cd987aa6f058be837b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5fc9b683&cb=1676382977526&jobListingId=1008453967462&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83cfcijc9s801-1goos0dhai3as800-c60014f73686ec9b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAU1QXnNNqBDrCziRksKrcNQ2Lq0DOiEQn_7Smg7qRGLeXBrb7tLQ6-UY-uM0Yq8WV-39Qsi83cN_ZH8MObxNSdR9gif6N5TKHH7u_La2V6vaZSQbr9RKxoVuZIeJSjdHVqZmJKor5HZDSlMLi_SJfr9DX-TrhQ9w4dCKFDkjcEOam6QIjmJVZk8NWBQfVhI7HkSbgfT5JfU1Rbj2MR4GY5MSpkYGc8nBOBoKl_9hiDCBfTQEhcx9lHssl5uzgPmWROIy-OtdTWXlL9Ot55WXNGkuZYITdv_NFKGs_zbsOGMO_gB8DJXp95lng2kcWmt2gRfMFZFXCKTT9HUG6TgskqTQFh1PKFHorzGKYUugbuU4xnAjEv3C7OJlLeWEZdt5h1kznuZlCV2YCMgQF3RydkJx828kXed1HDRWHtrZm8TBwO4xtRSe7eeETvsh_u-J6bf3aAGOTGIMzDjUBMhpSw_fGtu_QUqm0eFIi43B1KpFL4io_T-9YARUhNrSjJEdANQTp-0B7jougDFcoR12muXapp49BuConE4GerLpEgAc4QpwAp4NYygyTHHd-lIXYV5nznTWm65xZJKMOp61vT1KODa4jcrI7oviUh6hC78xH0oq_I4z_NWNKB75q0dPhyErahGggZHKiJHY9QYHVv", "description": "An experienced QA Automation Engineer Join QA team to take care of automation tasks for compnay's on-premise products. Responsibilities: • Design automation test plans based on existing and new product features. • Write and maintain automation tests using Katalon studio and other automation testing platforms. • Identify, document and track defects.\n\n\nReport defects using tracking tools. **Please Apply your CV in WORD Document • At least 3 years of experience in QA Automation (Selenium or similar) • Experience in development of test scenarios, test data, scripts, and exit criteria • Experience in developing automation infrastructure - Advantage • Solid experience with Web-client products • High level of English – A must • Experience with Katalon studio/Python - Advantage • Excellent troubleshooting and analytical skills with the ability to think outside the box • Excellent time management and multi-tasking skills • Self-Learning skills\n\nShow more Report"}]]