[{"company": "אורגד מאגרים בע''מ", "job": "Junior DFT Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=301&ao=1110586&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4b3bc9d2&cb=1676383134779&jobListingId=1006884230390&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83h8t52ing001-1goos4ni228d0000-1867df31ac64a337--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCYQvHrt0AEv4bbv5HwhlTwLBSGHMMScTuhk9ZoyDNzgzQ6_wzhTn3-JAeEUpXPZ8E20vYB5UL-q5yGBH6cjlEJ4TIaxgZM87huT5OIvbYRGK_-vTuWTkpbDA5lRy8vakfPLeWcEi_Ut54wvh9feT-ZoWYinvPPz7quJMCdP6UUvEGfuWG5wVkffU81X44XaG1wnzd1guabjeg5Qh8WAJvjjFNM9Z0_2BH_dIagSzE2qoohfL5NVI5iHurZcnIqID73ICGNfkdDoW0tK0AscZDFrSFcSL_17lJzgJdNc8Bf1685_Mfoy8kYg194OGOBWmMt77bzfaXMP-NKHMNRP34nCfmoAAh7FDN7EnvvnzAGChTW81HwmzqZ_sWv7gUVDLdGU7iJp8BLerLtx1Xven6RDW9D5T5NHLKLhdii852TKivubcvDfru8N1976m_Z9Y-oTLcCiTxq5XT39sFrnZoFoCe253IBXdWkLas8vQQTI8RgAv1X69L8Z_xPxAv46Y-wIfDwW_RTjMt4CYcVt-Od8AefNegY-FXdQXymvRrzRKvN6dKCdomDn_66BdfJnXRbFGE_YnF83t-3AtXCxmFXsTFf7WZu-Y6MCJZMrIxbalpUmNlZpDz7Qetnv5-0cU3cIFvB2agNgHt_1sEuorgk", "description": "לחברת סמיקונדקטור מעולה מהנדס/ת DFT אפשרי לבוגר , ללא ניסיון B.Sc. or M.Sc. degree in Computer Engineering/Electrical Engineering 0-5 years in a semiconductor company as a DFT engineer Chip design, Verilog and System Verilog Verification, UVM methodologyATPG tools Scan insertion tools Gate-level simulations Static timing analysis Scripting (Perl/Tcl) Familiarity with ATEShow more Report"}, {"company": "Apple", "job": "Junior embedded engineer", "city": "Herzliya", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=302&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e622d4ee&cb=1676383136325&jobListingId=1008190195554&jrtk=3-1-1gp83hagg2p8l001-1goos4ni228d0000-f51c6e09d136c7bc-", "description": "Summary\nPosted: Jan 25, 2023\nRole Number:200196581\nJoin us to help deliver the next groundbreaking Apple product. Work with logic designers to understand the operation of the block and system levels. Investigate the use cases, system-level operation, and performance requirements . Develop low-level software to validate functionality, conformance, and performance of the systems.\nKey Qualifications\nStrong knowledge in C\nComputer structure knowledge.\nUnderstanding in HW-SW integrations -advantage.\nDescription\nIn this highly visible position you will be working on best in class Apple SoC. You will be in charge of SW development. You will be working on design, development and integration of complex drivers, tests and SW infrastructure, as well as SoC Bring-ups and complex debug activities. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it.\nEducation & Experience\nBachelors Degree or Master Degree in Electrical Engineering, Computer Engineering or equivalent experience.\nAdditional RequirementsShow more Report"}, {"company": "Moon Active", "job": "Junior Automation Developer", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=303&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4ffa4b6d&cb=1676383137790&jobListingId=1008437832723&jrtk=3-1-1gp83hbs6kbnc801-1goos4ni228d0000-0f51019855310488-", "description": "Moon Active is one of the world's fastest-growing mobile game companies, providing entertainment to millions of active users across the universe. The company is headquartered in the heart of Tel Aviv.\nWe're looking for a Junior Automation Engineer to join our team and create awesome games at a company that puts quality at the forefront. You’ll enable us to move fast all while maintaining excellent quality for our users. You’ll also get the chance to be an industry leader in automation for mobile games. So, think you have what it takes?\nResponsibilities\nDevelop server side tests (API tests, integration, components, E2E).\nTake part in building and improving our automation infrastructure and tools.\nCreate automation services which are effective, seamless and easy to use.\nBe creative and innovative, and build tools to support our daily work and needs.\n\nRequirements\nBachelor’s degree in Computer Science or Software Engineering.\nExperience in Node.js/javascript coding experience.\nSelf-motivated, can-do approach and a team player.\nExcellent interpersonal skills.\nProficiency in verbal and written English.Show more Report"}, {"company": "Iguazio", "job": "Junior Customer Success Engineer", "city": "Herzliya", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f24c0915&cb=1676383138970&jobListingId=1007162902118&jrtk=3-1-1gp83hd2ukluo801-1goos4ni228d0000-dbce8dd378654dcb-", "description": "About The Position\nIguazio is looking for a Data Engineer to be part of our all-star Customer Success Team, that spearheads the company's customer engagements, and play a critical role in our mission delivering a ground-breaking solution to the market.\n\nThe Customer Success Team is responsible for enabling customers to build new data science applications they could only dream of, building batch and real-time data pipelines using serverless distributed frameworks.\n\nYou can expect to drive Data Science Platform POCs for Data Scientists and their Data engineering teams, consult and implement data solutions within Tier1 enterprise customers.\n\n\nWhat You'll Do\n\nEngage directly with customers on data science automation at scale including data pipeline acceleration and optimization\nWork closely with Data scientists and take part in data science tasks\nWork directly with Iguazio teams of Solution Architect, Sales, Product Management and R&D, feeding requirements and priorities\n\n\nEssential Skills\n\nYou must be a fast thinker and executor, have great communication skills, patient, a people's person, sharp and details oriented.\n\n\nDoes This Describe You?\n1-2 years of experience with Python / Scala / Java / GO Coding - must\n1+ years of experience building solutions with the Big Data tools and frameworks such as Spark, Hadoop, Cassandra, NoSQL, etc\nExperience working with external clients as PS engineer/customer engagement and great communication skills\nExperience with Cloud-Native and Cloud Data Services such as GCP, Azure or AWS (DynamoDB, Kinesis, EMR or RedShift) - advantage\nExperience with Docker, Kubernetes and serverless computing and architecture - an advantage\nExperience working closely with Data scientists - big advantage\nExperience working on Data science tasks and/or data science training / courses - big advantage\n\n\nAbout the Company\n\nData science is too important to today's enterprise to be held back by delays and inefficiencies.\n\nWe're building a faster, easier, and smarter way for data science to flow seamlessly from raw idea to real-world impact. This is data science brought to life.\n\nIguazio provides an MLOps (machine learning operations) platform which automates and accelerates the data science process, enabling the rollout of new AI services continuously across the enterprise. The company raised $72M from top financial and strategic VCs, is led by a team of serial entrepreneurs, and serves a diverse set of customers worldwide, ranging from technology companies such as NetApp, financial service companies like Payoneer and healthcare customers like the Sheba Medical Center.\n\nWe're looking for top talent to help us continue our growth — and grow with us!Show more Report"}, {"company": "Medic Vision Imaging Solutions", "job": "JUNIOR APPLICATION SUPPORT ENGINEER", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=305&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5383e4bb&cb=1676383140329&jobListingId=1008257879360&jrtk=3-1-1gp83hebkklv2801-1goos4ni228d0000-db69d3a0a985b129-", "description": "Medic Vision Imaging Solutions Ltd, a world-leading provider of medical imaging solutions is looking for talented junior engineer to join our professional services team, in our Tirat Carmel offices, near MATAM.\nJob Role:\nInstalling and Implementing Medic Vision’s products: Remotely and on-site.\nProviding remote customer support (email, phone)\nSoftware verification and validation\nJob Requirements:\nAt least 1 years’ experience as a verification /application engineer, working in the Medical Devices industry (Either as a full position or as a student)\nB.Sc. in medical engineering, electrical engineering, computer science, or physics from a credited university.\nExcellent engineering skills (will be tested)\nExcellent oral and written communication skills in English (will be tested)\nWillingness to travel (up to 25%).\nSuitable candidates please e-mail your CV to: hr@medicvision.comShow more Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "Junior VLSI Engineer", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=306&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_93d644b6&cb=1676383141667&jobListingId=1005682246282&jrtk=3-1-1gp83hflvjoqr801-1goos4ni228d0000-d8d8aeff47f0d26a-", "description": "מיקום המשרה: השרון\nלחברת Design house, מובילה ומצליחה, דרוש/ה Junior VLSI Engineer\nדרישות:\nBachelor’s degree in Electrical Engineering or Computer Engineering from a leading university\nAt least 1 year of experience in VLSI frontend digital flow – must\nExperience with Verilog OR VHDL design coding – AdvantageShow more Report"}, {"company": "SuperCom", "job": "Junior Technical Support Engineer", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=307&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7184d51f&cb=1676383142943&jobListingId=1008456216747&jrtk=3-1-1gp83hgv1ih5p801-1goos4ni228d0000-abfe362831afe233-", "description": "DESCRIPTION\nSuperCom is seeking an enthusiastic, collaborative, and highly motivated Junior Technical Support Engineer to join our IoT division. We are looking for someone who thrives in a fast-paced environment and welcomes new challenges every day. Providing constant technical support to partners and customers remotely from the company’s headquarters in Tel Aviv using all methods of communication (email, phone, remote sessions, etc.)\nThe position includes:\nWorking days between Monday to Friday.\nProviding support for customers and partners around the world.\nTroubleshooting issues via ticket systems, phone, and email in proficient English.\nIdentifying root causes and proposing test cases and solutions.\nAbility to work well under pressure and maintain a positive attitude.\nProviding timely information to customer-facing teams to improve overall customer satisfaction.\nSupporting customers on non-working days and after business hours when required.\nTraining customers on our solutions and products.\nREQUIREMENTS\nAt least 1 year of experience in technical support for large-scale information systems.\nBSc in Computer Science or equivalent.\nExcellent analytical and problem-solving skills with a strong sense of customer commitment.\nQuick learner & Details oriented\nExperience with tech support web tools such as Jira Service Desk\nExperience in SQL querying and managing data, APIs, and Web systems\nWilling to provide “On Call” support in 24/7 shifts and during weekends when required\nExcellent verbal and written communication skills.\nProficient in English speaking and writing\nTeam Player\nExperience with Jira and Confluence – an advantage\nEU Citizenship – an advantage\nExperience with IIS, Web Services, Linux, AWS - an advantageShow more Report"}, {"company": "QA InfoTech", "job": "Junior QA And Lab Support", "city": "Haifa", "date": "21d", "rating": "3.6", "link": "", "description": "Description\n\nQualitest is the world's largest, independent managed services provider of quality assurance and testing solutions. As a strategic partner, we help brands move beyond functional testing to adopt new innovations such as automation, AI, and crowd-sourced UX testing. We leverage our domain expertise across industries, including financial services, insurance, media and entertainment, retail, technology, gaming, telecom, among others.\n\nAt QualiTest, we provide Software Testing solutions to some of the biggest and innovative companies in the world. We are the world’s largest pure play testing company with over 3,000 employees worldwide and with technology at the heart of most businesses, our mission is to keep their software running smoothly.\nWe are industry pioneers and innovators. For the fifth year in a row, the company was named Visionary in Gartner’s Magic Quadrant for Application Testing Services. Qualitest’s global service delivery platform includes the United States, Israel, UK, India and Romania.\n\nTalented, intelligent and passionate people have made Qualitest the QA leader it is today. If you want to learn from the best, there’s no better place to start!\n\nWe’re looking for Electronics Engineer for a leading project in the Defence industry.\n\nThis is a full time position in Haifa (Matam).\n\nResponsibilities\nElectronics Practical Engineer / Electronics Engineer for the Validation Department\nsoftware & hardware quality through manual testings\nReview and analyze system specifications\nExecute test cases (manual ) and analyze results\nReport bugs and errors to development teams\nHelp troubleshoot issues\nAdvantage for avionics or simulator units or military-guided armaments\nEnglish: at a high technical level\nFull time + overtime if necessary\nA job is located in Haifa\n\nRequirements\nExperience with Test equipment (Scope, Spectrum)- must.\nknowledge in RF - must\nPractical electronics engineer.\nWorking knowledge of test management software SQL.\nExcellent communication skills.\nControlling Microsoft office tools.\nBenefits\n\nWhy QualiTest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\n\nIntrigued to find more about us?\n\nVisit our website at www.qualitestgroup.com\nCheck out our Career page: http://qa-jobs.qualitestgroup.com/Show more Report"}, {"company": "Larch-Networks", "job": "Junior Automation QA Engineer", "city": "Rosh Ha`Ayin", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=309&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a5858a15&cb=1676383145480&jobListingId=1008236293189&jrtk=3-1-1gp83hjcajm6k801-1goos4ni228d0000-25c7ba21118dbba3-", "description": "We invite to join our great team as a Junior QA Automation Engineer for one of our network projects.\nRequired skills:\nKnowledge of Networking (L2/L3 protocols),\nGood level of written and spoken English,\nExperience in configuration of Cisco or some similar network routers via CLI\nUser experience in Linux,\nAbility to configure servers (like Syslog, RADIUS, Samba etc),\nCCNA certification is a big plus,\nExperience in writing scripts (Linux Shell or Python or some other scripting language).\nWe offer:\nCompetitive salaries;Challenging projects;Occasion of business trips (Israel and other countries);Welcoming atmosphere;24 working days paid vacation;Medical insurance\nLarch Networks provides turn-key solutions in the field of Embedded devices, Network and System architecture. We are offering a broad range of development services designed to answer your needs in a fast and highly professional manner.\nOur credentials: https://jobs.dou.ua/companies/larch-networks/reviews/Show more Report"}, {"company": "IDE Technologies.", "job": "Junior Process Engineer (A number of Openings)", "city": "Israel", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=310&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ccc3845b&cb=1676383147100&jobListingId=1005700524521&jrtk=3-1-1gp83hl0tp6ci801-1goos4ni228d0000-ad5f3778ce0417c2-", "description": "Job Description\nOverall responsibility for the process design during the project or preparation of bid\nDefinition of equipment, including work with external contractors and internal interfaces such as purchasing, mechanical departments and more\nThe position is subordinate to the Process department leader\nJob Requirements\nB.Sc. in Mechanical /chemical/environmental Engineering\n1-3 years of experience as a process engineer in water/sewage treatment - mandatory!\nBackground knowledge in P&ID's - mandatory\nBackground knowledge and experience in membranes - an advantage\nExcellent verbal and written communication skills in English\nWillingness to travel abroad (Once a year for a period of 3-4 weeks)\nLocation: Israel, KadimaShow more Report"}, {"company": "Nisha", "job": "junior DevOps engineer", "city": "Central", "date": "30d+", "rating": "5.0", "link": "", "description": "תיאור המשרה:\njunior DevOps engineer\n\n\nדרישות התפקיד:\nניסיון עם Linux\n\nPython, Groovy\n\nDocker, Kubernetes\n\nAWS / Azure-יתרוןShow more Report"}, {"company": "FUNDGUARD", "job": "Junior Automation Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=312&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_08ee640f&cb=1676383149743&jobListingId=1008375490505&jrtk=3-1-1gp83hnjnjc9n801-1goos4ni228d0000-f5aa9e0361ae0c8d-", "description": "DESCRIPTION\nFundGuard is the new generation investment accounting utility for asset managers and their service providers. Our cloud-native, AI-powered operating system and technology platform are transforming investment operations. FundGuard existentially changes asset servicing to enable reduced fees and the ability to offer new and innovative products, including crypto-asset services, at scale, today and tomorrow.\nThe company is led by an experienced team with successful exits and has raised more than $55 million, backed by strategic partners including Citi and State Street Corp, venture firms Blumberg Capital, LionBird Ventures, and Team8 Capital among others.\n﻿Read more about our latest achievements\nFundGuard Named “Tomorrow’s Top Growth Company” by Qumra Capital\nWe offer an exciting work opportunity where you’ll:Use cutting edge cloud technologiesDevelop one of the more robust enterprise applications with deep financial enginesWork with massive sets of dataBuild a highly performant application to serve leading global financial institutionsCollaborate with highly experienced engineering and product team members\nJoin FundGuard at the forefront of innovative financial technology. Work with us!\nVisit us: fundguard.com/careers\nFollow us: linkedin.com/fundguard\nWe are located in Azrieli Center Tel Aviv.\nWhat will you be doing?\nDevelop automated web tests from scratch using Cypress.\nDesign an automation system to execute your testing plans.\nWork closely with developers and product managers in a Scrum methodology\nTake an active role in version testing and pre-release processes.\nPlan, analyze, design, and execute manual and automated e2e tests.\nParticipate in version planning and work in agile scrum teams.\nThe role includes manual testing until the automation will be stabilized.(approx 50% at the beginning)\nREQUIREMENTS\nAt least 1 year of Proven experience in testing web applications.\nExperience in planning and producing test plans and planning and writing test cases.\nWork experience in UI testing using Cypress or similar technologies.\nAt least 1 years of hands-on experience with JavaScript/TypeScript\nCode management tooling such as Git, Github\nExcellent interpersonal and communication skills and Eager to learn.\nExperience with cloud architectures - an advantage.\nExperience with the financial domain - an advantage.Show more Report"}, {"company": "", "job": "Junior DevOps Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=313&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_33808321&cb=1676383151368&jobListingId=1007506906449&jrtk=3-1-1gp83hp65kcm2801-1goos4ni228d0000-4d91934380495aa1-", "description": "A defense company is looking for a Junior DevOps Engineer.\n\nRequirements:\n\nAt least one year experience as a DevOps Engineer\n\nExperience with CI/CD platforms and flows\n\nExperience with Git\n\nExperience with Docker - KubernetesShow more Report"}, {"company": "Apple", "job": "Junior WiFi System Engineer", "city": "Haifa", "date": "5d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_533e5ce6&cb=1676383152589&jobListingId=1008449460541&jrtk=3-1-1gp83hqchkbmr801-1goos4ni228d0000-dfb5177e32e1ea0f-", "description": "Summary\nPosted: Oct 2, 2022\nWeekly Hours: 42\nRole Number:200353300\nImagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Do you want to impact billions of users by developing an extraordinary product with a prime focus on the accuracy, understandability, and performance of the product? You will become part of a hands-on development team that furthers engineering perfection, creativity, and innovation. Dynamic, encouraging people and innovative technologies are the norms here. We are looking for a passionate recent graduate to join our outstanding Wifi System team. If you are a resourceful engineer with the desire to research and develop solutions that do not yet exist, wish to evolve to be an expert in the diverse world surrounding the Wireless domain, then we are looking for someone like you.\nKey Qualifications\nPrevious background in communication systems (i.e., more than one discipline), specific BT / WIFI knowledge – an advantage.\nYou should be a team player with excellent communication skills and the desire to tackle diverse challenges\nKnowledge of verification / ASIC design is - an advantage\nKnowledge in programming system-level simulations in MATLAB / C++ - an advanta\nScripting capabilities (Python/others) – an advantage.\nKnowledge in research areas such as Signal Processing, Computer Networks, VLSI - an advantage\nDescription\nYou will engage in a collaborative, fast-paced environment to integrate new technologies into a product category that represents the frontier of consumer electronics, responsible for ensuring the quality of the SoC Define system-level behavior of the wireless sub-system - HW definitions, HW-FW partition, etc. Write system-level documentation Have strong communication skills combined with a good collaborative approach to lead complex integration efforts in a specific area of the system Strong debug capabilities You will triage problems and understand if it is MAC/PHY, HW/SW and propose FW workaround / HW fixes Work closely with design, FW, and micro-architecture teams to meet the functional & performance goals of the system Work independently & lead deliverables to align with the project goals plus support multi-functional engineering efforts\nEducation & Experience\n- B.Sc / M.Sc in Electrical / Computer Engineering.\nAdditional RequirementsShow more Report"}, {"company": "Cadence Design Systems", "job": "FW/SW Engineer Junior", "city": "Petah Tikva", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=315&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c5eb0fa&cb=1676383154170&jobListingId=1008147048792&jrtk=3-1-1gp83hrtfkbnn801-1goos4ni228d0000-52ed86164a983a79-", "description": "At Cadence, we hire and develop leaders and innovators who want to make an impact on the world of technology.\nCadence’s new Tensilica SW group is looking for R&D FW/SW engineer for new Core technology projects.\nThe R&D engineer mission will be involved in researching and developing FW, Toolchain, and BSP/PSP development for MCU's. All work will be cooperated and synchronized with other team members.\nRequirements:\nBachelor's degree or higher in EE/Computer Science\nMinimum 3-5 years of recent experience in tool-chains/BSP/PSP and low-level embedded FW\nExperience in C/C++ language\nExperience with GNU/LLVM toolchains.\nFamiliar with developing in a Linux and Windows environment.\nPrevious experience in working closely to HW-MCUs/CPUs\nHigh English skills: listening, speaking, reading\nAdvantage:\nExperience in ASM\nExperience with ML frameworks such as pyTorch, TensorFlow, and others…\nExperience with build system concepts (like makefile, cmake, scons)\nPrevious experience in development in LLVM with clang FE and/or GNU (GCC, GDB…)\nLinux Debian environment.\nExperience with GNU LD (linker scripts)\nFamiliar with ELF spec\nFamiliar with DWARF information and/or GDB specs (debugger)\nExperience in JAVA, Python, C++\nSkills:\nWorking in a team and being willing to learn new topics\nOpen-minded to \"brainstorming\"\nShare knowledge and be willing to work together\nSelf-learner and love to learn, willing to challenge the limits of knowledge.\nHigh motivated with the ability to work collaboratively in a fast-paced, team environment.\nWe’re doing work that matters. Help us solve what others can’t.Show more Report"}, {"company": "retrain.ai", "job": "Junior QA Engineer", "city": "Tel Aviv-Yafo", "date": "23d", "rating": "5.0", "link": "", "description": "We seek a Junior Manual QA Engineer to join our Applications Group at retrain.ai. The ideal candidate is a 3rd or 4th-year student studying Information Systems (or similar) who wants to gain experience with test writing, feature testing, and working closely with software development teams.\nretrain.ai offers a dynamic and fast-paced work environment with opportunities for growth and advancement within the Applications Group. If you are passionate about technology and want to work with cutting-edge AI technology, we would love to hear from you.\nLocation: WeWork Azrieli Town\nCulture: collaborate, learn, grow!\nGrowth opportunities\nTeam: Applications\nThis is a temporary position (Six months)\nThis position is also suitable for students.\nPart-Time position, flexible hours, ability to work hybrid from our offices in Tel-Aviv\nVisit our website to read more about responsible AI and why retrain.ai\n(www.retrain.ai)\n\nResponsibilities:\n\n3rd or 4th-year student in Information Systems or related field\nStrong ability to think critically and understand the big picture\nStrong problem-solving skills and attention to detail\nStrong verbal and written communication skills\nAbility to work well in a team environment\nAdvantage:\nExperience with test writing and feature testing\nPrior experience with QA is an advantage\nWork Loction:\n\nHybridShow more Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "Junior Verification Engineer", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=317&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_19af33e8&cb=1676383156853&jobListingId=1005682245785&jrtk=3-1-1gp83huhkk6ep801-1goos4ni228d0000-c09f969ec0ea6826-", "description": "מיקום המשרה: השרון\nIn this role, you will be responsible for taking part of a SoC verification process of a large scale SoC\nדרישות:\nB.Sc. in Electrical engineering or Computer engineering from known university.\n1+ years of experience in chip design OR Verification methodologies – Advantage.\nVerilog OR System-Verilog OR E -Specman knowledge and experience- Advantage.Show more Report"}, {"company": "Mobileye", "job": "Junior Software Embedded Engineer", "city": "Jerusalem", "date": "30d+", "rating": "4.2", "link": "", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWe are looking for a Junior Embedded Software Engineer to join us!\nMobileye's Platform Group in Jerusalem is looking for an embedded SW developer who will be responsible for developing embedded SW products - Low-level drivers, Bring-ups, etc.\nThis is an exciting opportunity to work with highly talented engineers and be a part of product innovation on cutting-edge technologies.\nHow will your job look like?\nResearching, designing, and implementing new SW drivers and Operating System features, as well as, maintaining, and enhancing existing ones.\nResponsible for the integration of the SW solutions in Mobileye's Embedded automotive platforms including the necessary HW bring-up, debug and unit testing to achieve proper operation of the new SW and HW together.\nAll you need is:\nBSC/ MSc in Computer Science, Computer Engineering or related field\nKnowledge of electronic circuits and components with the ability to read schematics and data sheets - an advantage\nExperience in C/C++ programming - an advantage\nExperience in Embedded Platforms (Micro-Controllers) - an advantage\nExperience in HW/SW integration and debugging activities on real HW - an advantage.\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "JobInfo", "job": "Junior QA Manual", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=319&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fb7890ff&cb=1676383159330&jobListingId=1008294253877&jrtk=3-1-1gp83i0usma4i801-1goos4ni228d0000-478c5509044f4480-", "description": "Job Description:\nThe company is a growing cyber security startup that makes segmentation the easiest and most effective way to protect any organization from its next breach. By leveraging automation and self-service adaptive multi-factor authentication, we have brought to market a solution that provides autonomous, airtight network access security at scale.\n\nOkay but why your company?\n\nExcellent question. The short answer is because we are the best at what we do.\n\nThe company recently received Series A funding from a leading VC and has won multiple awards and mentions including Gartner Cool Vendor, being part of the Big50 Startup Report 2021, the 2021 Fortress Cyber Security Award, and for the second year in a row has received the 'Editor's Choice' award from InfoSec.\n\nOur R&D is based in Tel Aviv and we just established our North American HQ team.\n\nWe're looking for a talented Manual QA Engineer, as part of this role you will:\n\" Take a significant part in product specification, find flaws as early as possible\n\" Write test plans\n\" Execute manual tests\n\" Analyze logs and metrics\n\" Ownership of the testing lab and creation of complex environments\nAdditional Positions:\nQA\nCategory:\nSoftware\nJob Qualifications:\nHmm. Not sure but probably if this is you:\n\n\" Engineering technical degree OR equivalent experience from a quality technological unit in the IDF\n\" 2 years of hands-on Manual QA experience, preferred in deep-tech industry (Storage / Cyber / Networking) or from IDF\n\" Excellent troubleshooting skills\n\" Experience with the following technologies (advantage): Kubernetes, PostgreSQL, Elasticsearch, GCP, Grafana, virtualization, Active Directory, Windows internals, Python.\n\" Networking / AD / IT / SOC knowledge and experience - big advantage\n\" Self-learning skills and passion for new technology\nCompany Occupation:\nHigh Tech\nCompany Size:\nSmall (0 - 50)Show more Report"}, {"company": "Mobileye", "job": "Junior Real-Time Software Engineer", "city": "Jerusalem", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=320&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cc976801&cb=1676383160465&jobListingId=1008032932109&jrtk=3-1-1gp83i22fkhqa801-1goos4ni228d0000-b2af33498acaeb58-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nIf you want to work with highly talented engineers, work in Real-Time environment and enable vision and link components that are being used in one of the most cutting-edge technologies -Autonomous vehicle development.\nIf you are a hands-on person, that has experience in low level and real time programming and want to be a part of the Autonomous vehicle revolution, we are looking for you.\n\nAs part of the team, you will work on the latest car vision components from first HW bring-up to integration with the product. Work in RT environment in C/C++ and in Python.\nWhat will your job look like?\nDeveloping for a multi-threaded, multi-core system under a custom real-time operating system as well as embedded Linux.\nDeveloping and debugging of CI test content for infrastructure modules.\nPerformance optimizations and tuning.\nWorking with vision components from bring-up of latest HW through all the flow of image capturing SW, enhancing and synchronize multi components.\nDeveloping of the software infrastructure for existing and new generation EyeQ chips.\nAll you need is:\nBachelor's degree / MSc in Engineering, Computer Science or 2+ years of experience in C++ Real-Time programming skills\nExperience working in Linux Environment\nGood understanding of computer architecture and operating systems\nExperience working on Real-Time operating system or embedded systems - Advantage\nExperience in Python programming skills - Advantage\nExperience working with git, GitLab - Advantage\nExperience in HW/SW integration and debugging activities on real HW - Advantage\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Solaredge", "job": "Junior Power Engineer", "city": "Herzliya", "date": "30d+", "rating": "3.8", "link": "", "description": "Power the Future with us!\nSolarEdge (NASDAQ: SEDG), is a global leader in high-performance smart energy technology, with over 5000 employees, offices in 34 countries, and millions of products installed in over 133 countries.\nOur diverse product offering comprises intelligent solar inverters, battery storage, backup systems, EV charging, and complete home energy management ecosystems.\nBy leveraging world-class engineering capabilities and with a relentless focus on innovation, we strive to create a world where clean, green energy from the sun is the primary source of power for our homes, businesses, and just about everywhere we thrive.\nSolarEdge's power design teams play a crucial role in creating new innovative solutions, owning the process from design & development up to implementation and manufacturing.\nWe are looking for a Junior Power Engineer to join the team.\nWhat will you be doing:\nTaking part in the development of the company’s flagship products\nResponsible for the development from the design stage to the final product, including all tests necessary to deliver the product to mass production.\nWorking with other teams inside the Hardware division and outside of it (such as the Mechanical department, Software, and more)\nRequirements:\n\nRequirements:\nB.Sc. in Electrical engineering- Must\nKnowledge in Analog circuits and Op Amps behavior- Must\nExperience working with lab equipment such as Spectrum, Scope, Electronic Loads, etc.\nKnowledge in circuit design and HW board design – Advantage\nKnowledge of DC2DC converter topologies such as Buck, Boost, Flyback, and forward.\nKnowledge in OrCAD, LTspice, and PSpice– Advantage\nPlease submit a grade sheet with your application.\n﻿\nCountry:\n\nIsrael - Center\n\nCity:\n\nIsrael-HerzliyaShow more Report"}, {"company": "Mobileye", "job": "Junior DFT Engineer", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=322&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c72761fb&cb=1676383163333&jobListingId=1008032932249&jrtk=3-1-1gp83i4r9kbl2801-1goos4ni228d0000-9cd16eeb801f011e-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nMobileye's Automated Driving group in Haifa is looking for an experienced DFT Engineer.\nThis is an exciting opportunity to join a team of highly talented engineers, working on one of the most cutting edge technologies - Autonomous Vehicle (AV) SoC.\nAbout us:\nAt Mobileye's Automated Driving group, we know that the idea of a fully autonomous car is no longer science fiction, but a reality that we are creating!\nWe have spent more than 15 years developing the world's most Advanced Driver Assistance Systems (ADAS) and we are now leading the computer vision and machine learning domain, reaching fully automated driving experience (AV).\nWhat will your job look like:\nYou will learn and be responsible of architecture of the DFT solutions across the SOC (MBIST, SCAN ATPG, LBIST and more)\nDevelop all the necessary HW / FW / SW for the different modules\nVerify and Validate our design\nDebug and analyze coverage and yield loss\nAs a cutting-edge technology company, we are working only with the very advanced DFT tools and features, while developing our own methods and DFT concepts – as it required by the Automotive and Safety related products market (ISO26262).\nAll you need is:\n0-2 years of experience in the ASIC/SoC industry\nKnowledge in either SCAN / MBIST / LBIST tools and flows – Advantage\nKnowledge of TAP protocols IEEE 1149.1/1500/1687 (iJTAG) - Advantage\nKnowledge of Synthesis flows – Advantage\nBasic Skills in Perl / Python / TCL - Advantage\nExcellent communication skills\nBSEE/MSEE is required\nIf you are an HW engineer, seeking to learn, improve and to be challenged by new concepts and complexities in relation to DFT for Automotive - your place is with us!\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "QA InfoTech", "job": "Junior QA engineer (SEA/Recon)(3919)", "city": "Netanya", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=323&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_68a95cfc&cb=1676383164706&jobListingId=1008035488745&jrtk=3-1-1gp83i672grgn801-1goos4ni228d0000-f52ef2b172628876-", "description": "Description\n\nAre you interested in working with the World’s leading AI-powered Quality Engineering Company? Ready to advance your career, team up with global thought leaders across industries, and make a difference every day? Join us at Qualitest!\n\nAt QualiTest, we provide Software & Hardware Testing solutions to some of the biggest and most innovative companies in the world. We are the world’s largest pure-play testing company with over 6,000 employees worldwide and with technology at the heart of most businesses, our mission is to keep their software running smoothly.\n\nQualitest’s global service delivery platform includes the United States, Israel, the UK, India, and Romania.\n\nTalented, intelligent, and passionate people have made Qualitest the QA leader it is today. If you want to learn from the best, there’s no better place to start!\n\nWe’re looking for a Junior QA software tester for a leading project in the Defense industry.\n\nThis is a full-time position in Netanya, On-site.\n\nTo learn more about Qualitest, visit https://www.qualitestgroup.com/\n\nRequirements\nBMS knowledge from Army and Radar and Sensors knowledge (SEA/Recon) - must\nGood English skills (Write & Read) - must\nBenefits\n\nWhy QualiTest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\nNever stop experimenting and learning with Qualitest Tech academy: training courses, mentorship programs, technical tribes, sponsored certifications, leadership programs, and much more\n\nIntrigued to find more about us?\n\nVisit our website at www.qualitestgroup.com\nCheck out our Career page: https://qualitestgroup.com/careers/open-positions/\n\nIf you like what you have read, send us your resume, and let’s start talking!Show more Report"}, {"company": "QA InfoTech", "job": "Junior software integrator", "city": "Netanya", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=324&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cb9b5a5c&cb=1676383166319&jobListingId=1008372903243&jrtk=3-1-1gp83i7pqjor3801-1goos4ni228d0000-2686ff0694ef2d68-", "description": "Description\n\nQualitest is the world's largest, independent managed services provider of quality assurance and testing solutions. As a strategic partner, we help brands move beyond functional testing to adopt new innovations such as automation, AI, and crowd-sourced UX testing. We leverage our domain expertise across industries, including financial services, insurance, media and entertainment, retail, technology, gaming, telecom, among others.\n\nAt QualiTest, we provide Software Testing solutions to some of the biggest and innovative companies in the world. We are the world’s largest pure play testing company with over 3,000 employees worldwide and with technology at the heart of most businesses, our mission is to keep their software running smoothly.\nWe are industry pioneers and innovators. For the fifth year in a row, the company was named Visionary in Gartner’s Magic Quadrant for Application Testing Services. Qualitest’s global service delivery platform includes the United States, Israel, UK, India and Romania.\n\nTalented, intelligent and passionate people have made Qualitest the QA leader it is today. If you want to learn from the best, there’s no better place to start!\n\nWe’re looking for a Practical Software Engineer (junior) for an Integrator position in the Defence industry.\n\nThe position includes Lab maintenance, SW installations, Development of configuration tools.\n\nThis is a full-time position in Netanya and includes occasional travel to field testing in customer sites in israel.\n\nRequirements\n\n\nStrong knowledge and handling in Windows environment - Must\nSW Practical Engineer – Must\nWriting and editing configuration files such as XML – Big Advantage\nWriting and editing scripts such as Batch or Python – Big Advantage\nStrong understanding of computer networks and monitoring tool - Big Advantage\nFamiliar with DevOps tools such as Jenkins/Ansible – Advantage\nLinux – Advantage\n\nBenefits\n\nWhy QualiTest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\n\nIntrigued to find more about us?\n\nVisit our website at https://qualitestgroup.com/\nCheck out our Career page: https://qualitestgroup.com/careers/open-positions//Show more Report"}, {"company": "CPS Jobs", "job": "Junior Full Stack Engineer", "city": "Tel Aviv", "date": "30d+", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=325&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_581cc256&cb=1676383171457&jobListingId=1007017793242&jrtk=3-1-1gp83icomitkk801-1goos4ni228d0000-fedcaa0fdc9456ec-", "description": "תחום:\nA leading company is looking for a Junior Full Stack Engineer\n\nPassionate about code writing\nAbility to work as a team player\nMotivated to learn and enhance skills\nדרישות:\n2+ years experience of developing with backend language- at least one of the following PHP, Python, JAVA, C#\nFamiliar with MVC architecture\nSolid understanding of client-server behaviour\nExperienced with at least one JS based framework (Angular, Backbone, Ember etc)\nExperienced with MYSQL and writing highly complex queries\nExperienced with Laravel framework- Advantages\nExperienced with LAMP- Advantages\nExperienced with building RESTful applications- Advantages\n\nאיזור: גוש דןShow more Report"}, {"company": "QA InfoTech", "job": "Junior Software Tester (system infrastructure)", "city": "Netanya", "date": "30d+", "rating": "3.6", "link": "", "description": "Description\n\nAre you interested in working with the World’s leading AI-powered Quality Engineering Company? Ready to advance your career, team up with global thought leaders across industries, and make a difference every day? Join us at Qualitest!\n\nAt QualiTest, we provide Software & Hardware Testing solutions to some of the biggest and most innovative companies in the world. We are the world’s largest pure-play testing company with over 6,000 employees worldwide and with technology at the heart of most businesses, our mission is to keep their software running smoothly.\n\nQualitest’s global service delivery platform includes the United States, Israel, the UK, India, and Romania.\n\nTalented, intelligent, and passionate people have made Qualitest the QA leader it is today. If you want to learn from the best, there’s no better place to start!\n\nWe are looking for a junior Software Tester for our security group.\n\nThis is a full-time position in Netanya, On-site.\n\nReady to advance your career, team up with global thought leaders across industries, and make a difference every day? Join us at Qualitest!\n\nTo learn more about Qualitest, visit https://www.qualitestgroup.com/\n\nRequirements\nFamiliarity with C4I systems in the army or similar - must\nHigh School Computer graduate / related technology unit graduate / Computer Practical Engineer / hands-on basic programming abilities – must\nUp to 1 year of hands-on experience in manual testing or Testing course - advantage\nExcellent team collaboration and communication skills\nAbility to multitask and work under pressure\nFast learner with the ability to work independently\nA problem solver with a 'can do' attitude\nLeadership ability such as commander in the army, Youth movements guide\n\nJob Description\n\nSoftware tester in the system infrastructure testing team, in-depth testing of software with analysis and reading logs Manual and automated testing Advantage: Excellent team collaboration and communication skills Ability to multitask and work under pressure Fast learner with the ability to work independently A problem solver with 'can do' attitude Background of Practical Engineer or Computer Science Knowledge of Linux OS Knowledge of JavaScript Proven management ability such as command\n\nBenefits\n\nWhy QualiTest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\nNever stop experimenting and learning with Qualitest Tech academy: training courses, mentorship programs, technical tribes, sponsored certifications, leadership programs, and much more\n\nIntrigued to find more about us?\n\nVisit our website at www.qualitestgroup.com\nCheck out our Career page: https://qualitestgroup.com/careers/open-positions/\n\nIf you like what you have read, send us your resume, and let’s start talking!Show more Report"}, {"company": "Synopsys", "job": "SOC Engineer, I", "city": "Herzliya", "date": "10d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=327&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e52055a3&cb=1676383174407&jobListingId=1008435360734&jrtk=3-1-1gp83ifll2i7f001-1goos4ni228d0000-f8d68f30adb160c6-", "description": "42673BR\nISRAEL - Herzelia, ISRAEL - Israel\nJob Description and Requirements\nA degree in Electrical/Electronics Engineering (or equivalent) and must have 3 years or more of industry experience working in digital or physical design role with recent contribution to project tape-outs.\nPrevious experience with Physical Design of IPs or SoCs with ability to handle broad responsibility for block-level physical design implementation and understanding of the full design cycle from RTL to GDSII, including chip level.\nExperience with advanced FinFET nodes, TSMC 16 nanometer or below, including low-power design techniques\nExperience with Synopsys tools or other equivalent tools for Synthesis, P&R, Physical verification, STA, Formal, EM/IR, DFT\nA solid engineering understanding of the underlying concepts of digital design and architecture, implementation flows and physical and timing signoff\nDevelopment of timing constraints and design architectures to ensure on-time delivery, and to meet or exceed power and area targets\nExcellent communication skills, ability to think and communicate at different levels of abstraction.\nExcellent software and scripting skills (Perl, Tcl, Python), understanding of CAD automation methods.\nSolid understanding of the challenges inherent in analog/digital interfaces and the ability to find solutions to complex design issues\nJob Category\nEngineering\nCountry\nIsrael\nJob Subcategory\nSOC Engineering\nHire Type\nEmployeeShow more Report"}, {"company": "Qualitest", "job": "Junior QA And Lab Support", "city": "Haifa", "date": "21d", "rating": "3.9", "link": "", "description": "Description\n\nQualitest is the world's largest, independent managed services provider of quality assurance and testing solutions. As a strategic partner, we help brands move beyond functional testing to adopt new innovations such as automation, AI, and crowd-sourced UX testing. We leverage our domain expertise across industries, including financial services, insurance, media and entertainment, retail, technology, gaming, telecom, among others.\n\nAt QualiTest, we provide Software Testing solutions to some of the biggest and innovative companies in the world. We are the world’s largest pure play testing company with over 3,000 employees worldwide and with technology at the heart of most businesses, our mission is to keep their software running smoothly.\nWe are industry pioneers and innovators. For the fifth year in a row, the company was named Visionary in Gartner’s Magic Quadrant for Application Testing Services. Qualitest’s global service delivery platform includes the United States, Israel, UK, India and Romania.\n\nTalented, intelligent and passionate people have made Qualitest the QA leader it is today. If you want to learn from the best, there’s no better place to start!\n\nWe’re looking for Electronics Engineer for a leading project in the Defence industry.\n\nThis is a full time position in Haifa (Matam).\n\nResponsibilities\nElectronics Practical Engineer / Electronics Engineer for the Validation Department\nsoftware & hardware quality through manual testings\nReview and analyze system specifications\nExecute test cases (manual ) and analyze results\nReport bugs and errors to development teams\nHelp troubleshoot issues\nAdvantage for avionics or simulator units or military-guided armaments\nEnglish: at a high technical level\nFull time + overtime if necessary\nA job is located in Haifa\n\nRequirements\nExperience with Test equipment (Scope, Spectrum)- must.\nknowledge in RF - must\nPractical electronics engineer.\nWorking knowledge of test management software SQL.\nExcellent communication skills.\nControlling Microsoft office tools.\nBenefits\n\nWhy QualiTest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\n\nIntrigued to find more about us?\n\nVisit our website at www.qualitestgroup.com\nCheck out our Career page: http://qa-jobs.qualitestgroup.com/Show more Report"}, {"company": "Team8", "job": "Talon-Junior Technical Support Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "About Us\nOur mission at Talon is to enable and protect the distributed workforce, impacting how hundreds of millions of employees around the globe work. We empower organizations to adopt hybrid, flexible and productive work models while gaining a robust cyber security posture regardless of the device and location. At Talon, we are delivering the first secure enterprise browser designed to secure the distributed workforce, solving a major technical challenge, and seizing a unique business opportunity.\nAs Talonists, we value kindness, excellence, creativity, problem-solving, ownership, personal integrity, teamwork, and professionalism while maintaining a super fun and friendly environment.\nWinner of the Innovation Sandbox Contest at RSA Conference 2022, Talon is partnering with the two leading vendors in endpoint security: CrowdStrike and Microsoft. Talon has raised $126M in funding from top cybersecurity VCs, including Ballistic Ventures, CrowdStrike’s Falcon Fund, Evolution Equity Partners, Lightspeed Venture Partners, Merlin Ventures, Sorenson Ventures, SYN Ventures, and Team8.\nKey responsibilities:\nSolve complicated scenarios by building relevant environments and investigating the issues.\nProvide technical support to customers and partners.\nWork with our Engineering team and influence the operability of the product.\nReview of technical documentation for training materials, technical marketing collateral, manuals, troubleshooting guides, etc.\nRequirements:\n\nTeam player, positive attitude, problem-solver, Hands-on.\nAt least 2 years of experience with technical support or networking.\nProven experience working in the cyber security industry.\nStrong experience with Windows OS, Linux OS, and Mac OS-based applications (Installation, troubleshooting, Debugging).\nHighly proficient with Cloud infrastructure, understanding malware, exploits & operating system structure.\nExperience with Endpoint security software (Antivirus, DLP, IPS, NAC), Knowledge of SIEM, vulnerability management tools, Identity providers, and firewalls.\nAble to effectively communicate to all levels and stakeholders - internally and externally on complex technical issues.\nExcellent verbal and written communication skills in English.\nAdvantages:\nExperience with scripting languages like Python or Bash.\nKnowledge of VDI (VMWare Horizon, Citrix XenApp, and XenDesktop).\nPrevious experience with Datadog.\nFamiliarity with customer care tools like Freshdesk or Zendesk.\nTeam8:\n\nTalonShow more Report"}, {"company": "Visonic", "job": "Junior RF engineer", "city": "Israel", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=330&ao=1136043&s=58&guid=0000018631c25dfd9bcdbdea759f2249&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9938a516&cb=1676383179241&jobListingId=1006020901228&jrtk=3-1-1gp83ikbi2jqa001-1goos4ni228d0000-ebf5720498822647-", "description": "(job # 1062)\nJob description\nA leading global organization looking for a Junior RF Engineer or an to join a team in the organization's development department, a dynamic work environment.\n\nJob requirements\n\nAn electrical engineer with at least 2 years of experience or an experienced engineer with at least 10 years of experience.\nPreferably with experience from an industrial organization in the field of wireless products with low power and low energy.\nMilitary experience in RF - advantage.\nTechnical high school background - advantage.\nExperience in the development of receiver circuits, transmitters, filters, transmission and reception chains, antennas, low power RF and low energy products\nKnowledge of wireless communication techniques and modulation methods.\nSystemic view.\nLaboratory knowledge and license with a wide range of RF testing and measuring equipment.\nExperience with simulation software such as AWR. CST\nExperience in designing multi-layer printed circuit boards in the RF field - an advantage\nFamiliarity with FCC / ETSI standards, - an advantage\nStrictly\nThoroughness\nTeamwork\nIf you are interested in joining the Visonic team, please apply for a specific position listed below, or send your resume to: jobs@visonic.comShow more Report"}]