[{"company": "Atera", "job": "Customer Success Operation - Student Position", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "4.8", "link": "", "description": "We are looking for a self-motivated, responsible, and ambitious team player who wants to join our customer success operation team and assist us with various tasks.\n The CS Operations Specialist will play an active role in driving Atera's customer success operational efforts, focused on complex project planning, managing and execution. The ideal candidate is a hard worker, passionate about solving problems, enjoys working with others, and has a positive can-do approach.\n This is an exciting opportunity to learn about CS and project management from the ground up and to work with all departments: Marketing, Product, Development, BI, Support, and Finance. We would love to have you on board if you are interested in developing these areas of expertise.\nCome be a part of our growing team!\nResponsibilities:\nManage projects from beginning to end, including hands-on work as needed\nBuild workflows and procedures along with tracking projects success\nAssist in day-to-day operational customer related tasks\nCollect outstanding payments from customers\nConduct follow up phone calls to better understand why customers churned\nBecome a coherent partner of the CS ops team\nRequirements:\n\n\nRequirements:\nStudent majoring in industrial engineering & management/information system management or related fields\nThe CS operation student will be expected to work a minimum of 120 monthly hours (at least 60%)\nExcellent English- strong written and verbal communication skills\nFlexible hours\n1+ years of relevant experience in a SaaS company – Advantage\nOutstanding project management skills with the ability to multi-task and manage complex projects with attention to details\nAbility to prioritize workload in a fast phased environment, to ensure high productivity\nSome of our benefits\nAtera is highly collaborative and yes, fun! To support you at work (and play) we offer some fantastic perks: ample time to learn from your teammates and contemporaries, time off to relax and recharge, community volunteer days, an annual budget to support your learning & growth, a company paid trip and lots more.\nMore about Atera\nSmall and medium IT operators are the heroes behind the scenes supporting companies around the world. They care a lot for their clients (external or internal) and often work virtually 24/7. However, small and medium IT service providers have always been underserved.\nAtera was built for exactly that. With the vision to simplify and streamline the work of Managed Service Providers and IT professionals. To create something that saves them time, energy, and money. To free them from needing to constantly put out fires.\nThat vision created the remote-first IT management software – enabling IT professionals to shift from reactive task takers to proactive problem solvers.\nNow operating from our beautiful offices on Rothchild in Tel Aviv, Atera is currently used by thousands and thousands of IT professionals all over the world (105+ countries).\nAs we rapidly grow, our goal remains the same: to transform the IT industry with revolutionary technology, while creating one of the happiest and healthiest work environments in the world.Show more Report"}, {"company": "Zencity", "job": "Operations Manager (Student Position)", "city": "Tel Aviv-Yafo", "date": "28d", "rating": "3.8", "link": "", "description": "Who are we?\nZencity is re-inventing the way governments listen to, understand, and interact with their residents. Our community insights & analytics platform and community survey solution use advanced NLP and ML algorithms to help government organizations be more data-driven. Our global team of urban enthusiasts and data geeks works with 300 cities and counties - from Los Angeles to Chicago, to Tel Aviv. If you’re passionate about joining a growing and dynamic company focused on leveraging data and tech to work on real-world challenges and radically improve life in cities – your place is with us!\nWhat is the role?\nAs an Operations Manager at Zencity, you will join our Business Operations team in a part-time position, and be responsible for making sure our day-to-day financial, business operations and administrative matters are handled professionally and expeditiously. In your role, you will provide value to numerous key stakeholders and you’ll gain a strong foothold in a growing and exciting innovative environment.\nResponsibilities:\nManage the administrative side of our business operations, supporting our go-to-market, finance, and business operations teams.\nImprove the company’s cash flow and cash position by streamlining our collection efforts and making sure the company is paid in a timely fashion.\nManage subscription packages and user administration for key business software.\nMonitor IT equipment inventory levels and replenish stock as needed. Perform complete inventory checks of all stock at scheduled intervals.\nDevelop and implement strategies to improve operational performance and efficiency\nRequirements:\n\nRequirements:\nUniversity or college graduate with good grades and at least 2 years of professional experience (part or full-time).\nExperience in an Office Manager/operation manager role within high-tech organizations - advantage\nFluent professional English - Excellent written and verbal communication skills - must!\nExceptional organizational skills and highly attentive to details.\nAbility to follow processes and help formulate processes.\nStrong proficiency with working on documents and spreadsheets whether in Office or G-Suite environments.\nAssertive yet outgoing and service-oriented personality.\nAvailability to work US West Coast business hours if neededShow more Report"}, {"company": "Applied Materials", "job": "Planning & Control analyst - Student", "city": "Rehovot", "date": "28d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=0000018631c837acbf4a5b051fb94641&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_580d25d3&cb=1676383491198&jobListingId=1008399802228&jrtk=3-1-1gp83s51ikcmj801-1goosge01g2cs800-976f1a6a9638deda-", "description": "We are looking for a highly talented industrial engineering student, eager to learn, grow and contribute.\nWhat’s in it for you?\nIn this role you will get the opportunity to be a key contributor to building the overall programs & portfolio of applied on operational, budget, Headcount, and other planning & control aspects. You will take part of the long-term planning and decisions making impact the entire R&D at Applied Materials Israel. You will get to work with a cross-organizational interfaces from different areas such as project business focals, purchasing, finance and HR.\nOur Group:\nThe Strategic programs group is responsible for Leading the budget and resource planning of the R&D activity and providing a comprehensive decision making platform for applied management\nWhat you'll be doing:\nResponsible for several cross-unit processes and/or practices (may include resource management, governance management, ongoing budget/cost management and more)\nProactively provide integrative view and analysis of the various business aspects across the company / projects to enable better decisions making. Create predictive routines and promotes risks mitigation.\nIdentify & highlight trends/ key issues and present results, pinpointing challenges, areas of concern and possible deviation from established plans in the domains under his responsibility.\nPropose action plans and mitigation activities and/ or opportunities for improvement; Compile information and results from different sources and develop reports, analysis, appropriate briefings as required; Work jointly with management to implement action plans.\nResponsible for the execution of business improvement initiatives, internal/ strategic project; Perform audits/reviews, proactively identify challenges / opportunities and extract lessons-learned to achieve business goals.\nWork to streamline work processes & leverage best practices and standards across the company / projects and design supporting tools for it\nWhat should you have?\nSolid proficiency in MS Office suite\nTeam spirit and service orientation\nStrong analytic skills\nHigh quality of data provided, in terms of accuracy, simplicity, format and frequency of update\nInteracts with Respect\nDisplays Confidence and Curiosity\nDemonstrates Excellence and Professionalism\nWho we are?\nApplied Materials Israel is home to the Process Diagnostics and Control business unit (PDC). Based in Rehovot, we develop, manufacture and market cutting-edge machine learning and computer vision-based metrology and inspection products that are essential elements in wafer fabrication. By playing a significant role in enabling the production of the next generation of microchips, our expertise enables our customers to transform possibilities into reality.\nGet ready to go hybrid!\n#LI\nQualifications\nEducation:\nBachelor's Degree\nSkills\nCertifications:\nLanguages:\nYears of Experience:\nUp to 1 Year\nWork Experience:\nAdditional Information\nTravel:\nNo\nRelocation Eligible:\nNo\nApplied Materials is an Equal Opportunity Employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, citizenship, ancestry, religion, creed, sex, sexual orientation, gender identity, age, disability, veteran or military status, or any other basis prohibited by law.Show more Report"}, {"company": "Attenti", "job": "Finance student", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "", "description": "Leading global high-tech company located at Ramat Hachayal is looking for an Economics/Business Administration student from one of the leading universities or colleges.\nResponsibilities:\nFinancial analysis\nAssisting in building budget and control\nDeveloping of financial models\n\nRequirements:\n\nEconomics/Business Administration Student (first or second year)\nExcel – high level\nStrong analytical capabilities\nCurrent\\NG:\n\nCurrentShow more Report"}, {"company": "Browzwear", "job": "Office Manager-part time &Temp", "city": "Hod HaSharon", "date": "15d", "rating": "4.2", "link": "", "description": "Office Manager - Job description\npart-time position /Replacement for maternity leave\nLocation: Hod Hashron, Israel (working hybrid)\n Browzwear’s mission is to revolutionize the fashion industry with our 3D end-to-end solutions.\n We develop innovative and exciting cutting-edge 3D garment simulation technology which enables digital workflow, creative designs, faster time to market, less garment waste, and a digital shopping experience. You will have a chance to play a leading role at the forefront of the digital revolution in the apparel industry.\n We are looking for a talented person to run our office administration and help create a great working environment. As well as general office and support duties, the successful candidate will be involved in dealing with supplies and suppliers, basic financial controls, arranging internal and external events, visitor hospitality, and all the other little jobs that go towards making the office run smoothly.\nWhat You'll Be Doing\nManage the \"day-to-day\" office routines including office inventory, groceries, office supplies, and maintenance.\nCoordinate and communicate with the office facility’s vendors.\nServe as the focal point for office-related and be the point person to all employees with any ongoing requests including maintenance, mailing, shipping, office supplies, office equipment, and administrative bills.\nSupporting the finance processes such as payment, preparation of invoices, credit cards, employee expense reports, etc.\nManage company’s travel - including flights, hotels)\nEnsure a pleasant working environment and smooth ongoing operation of all administrative needs.\n\nRequirements:\n\nYour Experience & Skills\nExperience as an office manager or any admin role -an advantage\nPeople person with a positive attitude and strong service orientation.\nTime management skills, ability to multitask and prioritize work.\nGood experience with, and reasonable skill level in using a variety of software tools, such as email, Microsoft 365\nFluent in Hebrew and English - both speaking and writing - a must.\nWilling to work part-time.Show more Report"}, {"company": "Oktopost", "job": "Bookkeeper", "city": "Ramat Gan", "date": "30d+", "rating": "4.1", "link": "", "description": "Oktopost is revolutionizing the way companies connect with their customers and audiences. We enable B2B marketers fully manage and optimize social media to drive their businesses forward in a scalable and measurable way. Leading B2B organizations all over the world such as ACI Worldwide, Snowflake and Fujitsu are using Oktopost to improve and understand their social presence in order to make better business decisions. We are a global, fast-paced, and innovative start up with offices in Ramat Gan, London, and Grand Rapids (MI).\nWe’re looking for an experienced Bookkeeper to join our growing Finance team on a part-time basis.\nAs a Bookkeeper, you’ll be responsible for maintaining financial records, managing priorities, invoices, tax payments, overseeing bank reconciliations on a weekly basis, and cash disbursements.\nResponsibilities\nRecord credit card transactions, invoices, payments and monthly reconciliation\nHandle employee expenses\nProcess accounts payable invoices\nPrepare and process payments to suppliers\nAssist and support our Controller\nHelp with month-end book closing\nAssemble information for external auditors\nReport VAT and 856 to Israel Tax Authority monthly\nRequirements\n2+ years of experience as a bookkeeper\nLevel 2 bookkeeper certification\nExperience with Priority System\nExcellent communication and organizational skills\nHigh level of accuracy and attention to detail\nTeam player\nGood written and verbal English\nAbility to work independently and prioritize tasks\nPLEASE SUBMIT YOUR APPLICATION AND RESUME IN ENGLISH.Show more Report"}, {"company": "InspHire", "job": "רפרנט/ית כספים ותפעול | Operation and Finance Referent", "city": "Rishon LeẔiyyon", "date": "30d+", "rating": "5.0", "link": "", "description": "נטוורק בתחום האפיליאציה מחפש רפרנט/ית כספים ותפעול.\nתחומי אחריות עיקריים:\n\nסיוע בתכנון ובנייה של המודל העסקי כולל תמחור מוצרים ושירותים ובדיקת כדאיות.\n\nניהול משא ומתן עם גורמים שונים (ספקים, לקוחות, וכו')\n\nהכנת תקציב שנתי כולל בקרה תקציבית שוטפת\n\nתמיכה בהכנת דוחות רווח והפסד חודשיים/רבעוניים/שנתיים ועבודה שוטפת מול רואה חשבון של החברה.\n\nעבודה מול בנקים\n\nטיפול בחוזים, התקשרויות ותשלומים\n\nמעקב ואחריות על תהליך חיוב לקוחות וגבייה.\nדרישות:\nהשכלה נדרשת - הנהלת חשבונות / תואר ראשון בכלכלה/מנהל עסקים\n\nשליטה באקסל ותוכנות אופיס\n\nניסיון קודם בתפקיד כספים\n\nיכולות בינאישיות גבוהות, שרותיות, יכולת עבודה תחת לחץ, יכולת לעבודה עצמאית, אמינות גבוהה, דייקנות.\n\nהעבודה בכפיפות למנכ\"ל החברה.\n\nהתפקיד אינו תפקיד ניהולי\n\nהמשרה מיועדת לנשים ולגברים כאחד.Show more Report"}, {"company": "Indian River State College", "job": "Adjunct - School of Business", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018631c837acbf4a5b051fb94641&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1b3baa01&cb=1676383498188&jobListingId=1007990864031&jrtk=3-1-1gp83sbrpkuio801-1goosge01g2cs800-e5118f69fb61d629-", "description": "Job Description\nESSENTIAL JOB FUNCTIONS AND RESPONSIBILITIES:\nDelivering high quality instruction in introductory and advanced business, management and leadership courses;\nDelivering training courses in a wide range of settings in the four county area;\nMaintaining effective records of student success;\nCoaching students in a co-curricular occupational student organization;\nContributing to the recruitment and retention of program students.\nQUALIFICATIONS, KNOWLEDGE AND SKILL REQUIREMENTS:\nMaster’s Degree with a minimum of eighteen (18) graduate semester hours in business administration from an accredited institution;\nAbility to deliver high quality instruction in a range of business courses with specific need in the areas of:\nOrganizational Management\nLeadership\nFinance/Corporate Finance\nMarketing\nBusiness Law (JD or Master’s with 18 credits in Business Law)\nHuman Resource\nWillingness to make students active partners in the teaching/learning process;\nStrong student-orientation, and the ability to work effectively with a diverse student population;\nComputer literacy and experience using Learning Management Systems (LMS) and computers in the classroom;\nWillingness to apply technology and innovative approaches to teaching;\nAll instructors must meet the appropriate credentialing requirements for the Southern Association of Colleges and Schools (SACS).\nPreference shall be given to the following:\nMinimum of two (2) years of teaching experience in a college or other post-secondary institution setting;\nPrior experience teaching at the baccalaureate level;\nTeaching experience with diverse adult populations;\nRecent industry experience working with contemporary strategies;\nExperience in distance learning instruction.\nSPECIFIC DUTIES AND RESPONSIBILITIES:\nDelivering effective instruction in a wide range of management courses, using contemporary teaching methods;\nMaintaining and developing skills necessary to integrate and use technology effectively in the classroom and through various modes of delivery;\nServing as the member of an effective team in achieving the overall department and college goals;\nAiding students in overcoming obstacles to successful completion of instructional programs;\nPerforming other duties and responsibilities as assigned;\nFlexibility to work some evenings and weekends.\nPHYSICAL REQUIREMENTS:\nThis position requires an ability to sit and stand for extended periods of time and to present verbal lectures/demonstrations, walk, bend, lift, reach up, stoop, and carry items occasionally in excess of twenty-five (25) pounds. It also requires manual dexterity to operate standard office machines, such as, copier, fax, calculator, telephone, and other equipment as necessary. IRSC expects its employees to follow proper safety standards while employed by the College.\nClassification\nAdjunct\nSupervisory\nNo\nFLSA Exempt\nYes\nEmployment Type\nTemporary (Fixed Term)\nCompensation and Application Deadline\nCommensurate with Degree/Experience Level | Adjunct positions at IRSC are filled on an as needed basis and are permanently posted. You will be contacted for an interview only if the related department has positions to fill.Show more Report"}, {"company": "FBX Group", "job": "Personal Assistant", "city": "Israel", "date": "30d+", "rating": "", "link": "", "description": "Job description:Work closely with Senior manager for whom you will be providing personal assistance,Calendar Management and coordination of meetings,Assist manager with follow up and ensure execution of plans, decisions, tasks, and activities in the Department,Management of meetings (preparation, minutes and follow up on decisions/action items),Maintenance of communication routines in the Department (work with managers and HR to plan, facilitate and monitor),Work with HR in initiating and supporting welfare activities,Responsibility on Department purchase requests, handling expenses in financial systems,Coordination of occasional travel plans including accommodation and flights,Welcoming and looking after the occasional visitor,Creating documents, briefing papers, reports, and presentations,Ongoing maintenance of office related issues and general administrative office tasks,Supporting Department employees,Collaborating with HR & Finance Departments as needed.Requirements:Minimum 2-3 years experience in an administrative role,Excellent interpersonal skills,Good English communication skills (written & verbal),Knowledge of standard desktop applications (MS Word, Excel, PowerPoint, Outlook, Internet tools, etc),Ability to work independently, proactively and setting priorities,Ability to work from the office (based near Beit Shemesh in Har Tuv),Attention to detail and high level of accuracy,High level of commitment, dedication, and discretion.Ability to work under pressure,Preferred Academic degree – advantage,Access to a car,Ability to work outside normal work hours on occasion, if needed.Job Types: Full-time, Part-time, PermanentPart-time hours: 30-42 per weekSalary: 7,000.00₪ - 10,000.00₪ per monthAbility to commute/relocate:Beit-Shemesh, מחוז ירושלים: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Cognyte", "job": "Global Total Rewards - part time (50%), Maternity Leave", "city": "Herzliya", "date": "8d", "rating": "3.9", "link": "", "description": "Role Global Total Rewards Analyst – part time position (50%), Maternity LeaveLocation: Herzliya Part time / hybrid workAt Cognyte we create mind-blowing investigative analytics software to speed up investigations and allow customers to detect and respond to real security threats like terror, crime, fraud, cyber threats, crypto crime, and more.So, if you rock at Global Total Rewards, and want in on the action, let’s talk!As Global Total Rewards you’ll make an impact onRunning the day-to-day rewards initiatives, projects, and processesSupport the annual compensation process (System design and testing, budget allocations, support the HRBPS and managers etc.)Monitoring key HR metrics and processes through advanced analyticsMonitoring rewards data in HR systems to assure data accuracyLeading the processes related to contractors workforce in the companyWorking closely with Finance on wages, bonus and HC budgetSupporting HRBPs with rewards related issuesBeing responsible for global surveys and creating benchmarking to support the company’s rewards strategyRequirements:Your toolbox3+ years’ experience in analytical roles, such as compensation and benefits/People Analytics/EconomistExcellent analytical skillsExcellent MS Office skills (MS Excel, MS PowerPoint) - a mustExcellent attention to details and ability to scale upFluent English both verbal and writtenPast experience in Hi-Tech or public companies – advantageExperience working in a global multi-cultural organization – advantageHands-on experience with HRIS systems (preferably in SuccessFactors)- advantagePart time (50%) maternity leave for 10 monthsWe believe that diverse teams drive the greatness of ideas, products, and companies. Whatever your race, gender, age, creed, or taste in music – if you’ve got the drive, commitment, and dedication to be the best, do your best, and work with the best, then come join us. We’re waiting for you.Curious? Apply now.Start the adventureCareer Page:People, Finance & LegalJob Type: Part-timeShow more Report"}, {"company": "", "job": "Finance Assistant - Part time - Freelancer preferred", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=0000018631c837acbf4a5b051fb94641&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_90597f90&cb=1676383502201&jobListingId=1007297743634&jrtk=3-1-1gp83sfp22gps001-1goosge01g2cs800-f0ebd6697e47a6f9-", "description": "Responsibilities\n\nGeneral support of finance tasks\nRequires alot of Excel work and knowledge\nMany tasks with Excel tables/pivots etc\nOnly Excel experienced candidates please\n\nRequirements:\n\nEnglish mother-tongue level\nBe very well acquainted with Microsoft Excel (pivots etc)\nExcellent organizational skills and in particular working with databases\nWork from home\nApproximately 10 hours per week\nFlex times\nPrefer freelancer\nredray432@gmail.comShow more Report"}, {"company": "", "job": "Financial Administrator & Bookkeeper – Part time, remote", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=0000018631c837acbf4a5b051fb94641&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e66120c3&cb=1676383503448&jobListingId=1007115054718&jrtk=3-1-1gp83sh0hitlo801-1goosge01g2cs800-f7b18511e0e7c2f9-", "description": "JOB DESCRIPTION: Financial Administrator & Bookkeeper – Part time, remote position\n\nImmediate start\n\nM2: The Institute for Experiential Jewish Education is seeking an experienced, self-motivated financial administrator with bookkeeping qualifications. The financial administrator / bookkeeper will provide overall support for financial operations and projects for both our Nonprofit organizations - Israeli חל\"צ and US 501(c)3.\nJOB RESPONSIBILITIES:\n\nAssist the VP of Finance and Administration in bookkeeping, financial management, invoicing and reporting processes.\nProvide support for various financial operations and projects, for both the US based entity and the Israel based entity\nManage relationships with key external vendors, including outsourced accounting/CFO firm and outsourced bookkeeping firms in Israel and the US\n\nSKILLS AND QUALIFICATIONS:\n\nAs a prerequisite, the candidate must believe in the values of M2 and be driven by its mission.\nSolid understanding of bookkeeping and accounts payable/receivable principles\nHands-on experience with accounting and financial software, specifically Hashavshevet. Experience with Quickbooks is a plus.\nProven, hands on, bookkeeping experience, in Israel\nBookkeeping experience in the US and / or bookkeeping experience in nonprofits a plus\nHigh level of proficiency in English a MUST (verbal and written) , all work is in English\nProficiency in MS Office and Mac\nCustomer service orientation and negotiation skills\nAbility to complete work with the highest level of accuracy, attention to detail and efficiency, against effective deadlines.\nExceptional interpersonal / collaborative skills. Must be a team player and work effectively with others to achieve outcomes and solve problems.\nAbility to handle confidential information.\nAbility to work in an entrepreneurial, fast-paced environment with limited supervision.\nDemonstrated resourcefulness in setting priorities, executing multiple tasks, and achieving objectives.\nWHAT M2 OFFERS:\n\nPart time (50%), remote position, (periodically required to come into the office in Jerusalem)\nCompetitive salary\nGenerous paid time off policy, plus Jewish and nationally observed holidays\nA team of professionals seeking to learn, grow, share and make an impact together\n\nTO APPLY:\n\nThis job is a part-time remote position, which may require coming in to the office in Jerusalem periodically. For consideration, please submit a resume to jobs@ieje.org. No phone calls please. Applications will be reviewed on a rolling basis. Due to high volume, only those candidates selected for an interview will be contacted.\nABOUT M2:\n\nM2: The Institute for Experiential Jewish Education helps educators and organizations design meaningful educational experiences. Our mission is to promote a proud and inspired community of Jewish educators who possess the personal and professional capacities to help learners find meaning and relevance in Jewish life.\n\nM2 is an Equal Opportunity employer. Personnel are chosen on the basis of ability without regard to race, color, religion, sex, national origin, disability, marital status or sexual orientation.Show more Report"}]