[{"company": "Mccann", "job": "Client Operations Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.4", "link": "", "description": "Primis is expanding! We are looking for a fresh, hungry, and self-driven individual eager to gain experience in a leading and growing industry from the best people out there!\nOur client operations managers are responsible for managing the ongoing work with clients, providing them with online advertising solutions and analytics in order to achieve the company’s goals.\nIf you are a people-oriented individual, with high analytical skills, multitasker, proactive, ambitious, with high self learning abilities and great customer service skills— this is the right place for you!\nRequirements:\n\nB.A/ B.Sc. degree in Economics/Finance/Statistics/Business Management or equivalent\nFluent English- reading, writing, and speaking- necessary\nHigh attention to details and self learning abilities\nStrong Excel skills\nOne year of proven work experience as an account manager or a similar role in the AdTech industry- advantage\nSub Company:\n\nPrimisShow more Report"}, {"company": "AMBITION", "job": "Finance Director לחברה מעולה בהרצליה (כ - 90 עובדים)", "city": "Jerusalem", "date": "1 day ago", "rating": "3.9", "link": "", "description": "Finance Director לחברה מעולה בהרצליה (כ - 90 עובדים) Finance Director לחברה מעולה בהרצליה (כ - 90 עובדים) CPA, Graduate BIG 4 - must. Experience of at least 3 years outside the office - must. Experience in team management - advantage Priority knowledge - advantage. Good English.Show more Report"}, {"company": "Deloitte", "job": "Administrative & Personal Assistant", "city": "Jerusalem", "date": "3d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1110586&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a8228923&cb=1676383352183&jobListingId=1008452057831&cpc=8795CF9063CD573D&jrtk=3-1-1gp83nt9ci7ma801-1goosd2gg20hg000-42eda9314728c489--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBPrZ4sBHKR7_ZtvNBQPSLEXDvsdEbwbZCSqcmhrxz_rD4icIoSflNHbm2uMTNxDORdMuhhWcG_3vHq4rhNedvFujylZKGZEIxERL6aTU16aYa1-Nq-MT-R_HC7CphT2v2ATrxugU1tKmfCdNOHUb99tsLr-6ZdOcQJS_ILPqnTSuBHliASFPhlqvqEsEyq2xehkZPFaw1Y93c9dX1sjd-o2qMtYJ0Rf74H8B6RnX1yIAaUiJCcUCK8-6jyuhB_ze3zgqmKVE0EYHKksZU2R2lWkinfM7pBjSewTGM3YWFSlcuQRWUTH9DTBHBYGW6xtSysj3r8h8_5e-9tbLLyI3cpHrCB73ZsfBrN3So_BhroM0o1wrAErPPfNL9cttJrzj4PoSZgOENo7JxxFX1dGGfoo80s1Wws9boII_2MvwxyVBv8qL6DMI-avwIU_P2L7wptlJpC9XnHtT5gd8BjQZZgR7C2VZlfxndhKoH4Zn5Hgl46iJjUJHMpKwfp7ehsZ0c7UVrEFjTB2qN84QyQ_BpOkfaXpM0_lSPF6vqNuizeg5mXvE6ZV6yeN7EvKBLmfo4DA_otSbWhaqsfnKLsYgd2_LxK_MCdB315hQUD4xcFjL7D2V2bnaGuW6hy3SuTihxezruDtqQE9WPsVebg11R3", "description": "About the Role: Catalyst is looking for an Administrative & Personal Assistant to the Catalyst Leadership. In this role, you will be responsible for managing partner’s calendar(s), logistically support international delegations and visits of senior executives and support implementation of processes. Responsibilities: • Calendar: o Schedule meetings according to the partner’s requirements o Adjust and shape calendar to fit strategic priorities • Visits and Delegations: o Participate in visit planning and arrangement o Lead logistical planning of visits and delegations o Take care of all administrative aspects of a visit o Elevate standards of hosting on an ongoing basis o Liaise with relevant firm functions (finance, procurement, marketing) as required to execute visits and delegations o Support overall efforts to create a unique and seamless experience for client and Deloitte executives hosted by Catalyst • Process Implementation Support: o Work with different stakeholders within Catalyst to execute and implement various processes relevant to the functioning of Catalyst o Track/monitor and manage tasks and assignments relating to priorities and processes 2-3 years of experience working in a relevant or similar role with at least one of the core role responsibilities (calendar, visits/delegations, or process implementation) • Excellent verbal and written communication skills • High level of proficiency in developing executive level communications/presentations • High level of professionalism and ability to work with executive clients • Well-organized with the ability to handle several projects simultaneously • Ability to succeed in both team-based and independent environments • Language: o Hebrew: Native (or Native Level) - must o English: Fluent (Native language or native level – significant advantage) *We, at Deloitte, believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its formsShow more Report"}, {"company": "Roche", "job": "Customer Care Specialist/Order Management - Diagnostics Israel", "city": "Hod HaSharon", "date": "12d", "rating": "4.3", "link": "", "description": ""}, {"company": "Mobileye", "job": "Logistic Coordinator", "city": "Jerusalem", "date": "2d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c96de8dd&cb=1676383355516&jobListingId=1008452299485&jrtk=3-1-1gp83o0ghm6oi801-1goosd2gg20hg000-98b390b679d62005-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nWhat Will your job look like:\nDelivery execution and Invoicing\nWarehouse and inventory management\nCommunication with customers\nRaising flags and issues in advance to management\nEstablishing automation to avoid manual work\nProblem solving, finding the right solution for customers' needs\nSending reports to management\nHandling Shipments issues with customers\nDefining measurements, KPI and Quality goals\nWorking closely with various teams such as Finance, legal, WH\nLeading lesson learned in the relevant scope\nAll you need is:\nB.Sc. in, Industrial Engineering, Logistics or equivalent\nAt least 3 years experience as logistic coordinator\nExcellent communication skills in English (both verbal and written)\nHighly organized; able to follow-up on multiple complicated tasks in parallel;\nAbility to identify issues, determine root cause and recommend accurate and actionable solutions to improve logistic process.\nSelf-starter, high attention to details and self-learning skills\nAbility to function well under pressure, with heavy workload (tight deadlines) and multitasking abilities\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "INFINIDAT", "job": "Office Manager and HR Admin", "city": "Herzliya", "date": "24h", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ca983232&cb=1676383356794&jobListingId=1008456935493&jrtk=3-1-1gp83o1oqkhpt801-1goosd2gg20hg000-c435a032ffa3b809-", "description": "DESCRIPTION\nINFINIDAT is looking for an Office Manager and PA to join our HR team.\nAs our Office Manager, you will be responsible for major parts of the daily life at our offices and be involved cross-functionally with HR, IT, Procurement, and Finance. You will also serve as the focal point for employees and external service providers regarding your areas of responsibility. This is an office based role 5 days a week at Herzliya.\nAs part of our HR team, you will hold responsibilities of creating special and unique experiences for our employees, partners, and customers, ensuring a high level of service and organizational excellence.\nRESPONSIBILITIES\nManage and execute the day-to-day administrative activity of the company to ensure smooth operations (office equipment, repairs, managing vendor relationships, parking, deliveries, etc…)\nCreate an inclusive environment by greeting guests, candidates, and visitors with a personable and genuine approach\nAdministrate and operate the onboarding process of new employees\nIn charge of office budget from planning to execution\nOwnership of the complete life cycle of office equipment and supplies from procurement to operations\nPlan, lead and operate employee experience projects throughout the company including company events, Happy hours, holidays & birthday gifts etc\nPersonal assistant to the top executives in the company\nOperate the company's cellular plan for employees\nSupport wellbeing activities as part of the HR team\nAssist with cross-functional admin tasks\nREQUIREMENTS\n7+ years of proven experience as an Office/Administrative Manager in a high-tech company\nPrevious experience in a PA function\nStrong interpersonal skills and a team player\nProficient in Microsoft Office and G-Suite\nExcellent written and verbal communication skills - English and Hebrew\nHighly motivated with a strong work ethic and excellent customer service orientation\nAbility to multi-task and fit in a fast-paced and dynamic environment\nResponsible, accountable, dedicated and highly organized.\nAbility to successfully engage with a wide range of stakeholders\nAbout Infinidat\nAward-winning Infinidat is a global provider of enterprise storage platforms and solutions. Installed in Global Fortune 500 companies around the world supporting a wide variety of applications and use cases, our software defined storage architecture delivers microsecond latency, autonomous automation, powerful cyber storage resilience, 100% guaranteed availability, and dramatically reduces enterprise storage CAPEX and OPEX.\nThe company’s portfolio has been named a Leader for four consecutive years in the Gartner® Magic Quadrant™ for primary storage, has received the Gartner Peer Insights Customers’ Choice Award for 3 consecutive years based on end-users’ ratings, as well as numerous other awards from the storage analyst and storage press community.\nOur success continues to be based on the talent, experience, and motivation of employees who leverage their skills and abilities to make a real impact in the industry.\nIf you have the power to be the best of the best, we would love to have you join the Infinidat family and make a mark as an essential player in our company’s growth.Show more Report"}, {"company": "Harris Computer Systems", "job": "Corporate Business Development", "city": "Tel Aviv-Yafo", "date": "13d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0bdc59f0&cb=1676383358035&jobListingId=1008429871581&jrtk=3-1-1gp83o2v4jm4l801-1goosd2gg20hg000-51cb14d9affa2550-", "description": "Harris is an operating group of Constellation Software (CSU:TSX). We acquire, manage, and build mission-critical vertical market software (VMS) companies that are located all over the world. We have acquired over 500 companies across multiple industries including software used in healthcare, public safety, utilities and many more. We acquire small, medium, and large sized companies from owner/operators as well as institutional and corporate shareholders and hold them forever, applying the best practices we have learned as seasoned acquirers of niche software companies.\nWe are seeking a Corporate Development Specialist to work closely with our senior management team in Israel to continue our successful M&A activity in the region. The successful candidate will play a key role in identifying and sourcing potential companies of interest and reaching out to initiate a dialogue and build relationships with founders and senior executives.\nThe ideal candidate understands, appreciates, and enjoys the process that is business development. You might have a sales background, or a background in any industry where building a relationship is key. You understand that successful business development is a volume game that requires precision and consistent effort. You apply rigor to your processes and professionalism to your exchanges.\nThis is a great opportunity to apply your business development skills towards corporate acquisitions.\nAbout the Role:\nThe Corporate Development Specialist will proactively reach out to business owners and management teams of vertical market software companies to build and manage relationships for our M&A team. This is a great opportunity to apply your corporate development skills towards capital deployment in an entrepreneurial environment. We are looking for deal origination driven individuals that are interested in software, M&A and are excited at the prospect of contributing to our growth through capital deployment.Manage and grow our M&A CRM database by identifying small, medium, and large sized software companies that meet our acquisition criteriaInitiate outbound prospecting calls and emails to connect with target companiesDevelop and build relationships with management teams and shareholdersTrack personalized outreach activities weekly and maintain meticulous record keeping in our CRM.\nAbout You:\nYou have an interest in building a career in corporate development and M&A and have strong communication skills and a knack for building rapport with stakeholders. You are proactive, persistent, intelligent, and efficient. You enjoy finding ways to reach out to prospects and find it rewarding to connect with them to share your offering and learn more about their businesses. You have the following attributes:Strong Work Ethic: Demonstrated ability to develop and manage a pipeline. Understanding that M&A prospecting is a balance between volume and precision that requires consistent effort.Entrepreneurial Attitude: Ability to work independently and connect the dots when speaking to business owners. Positive personality with a strong drive to succeed.Maturity: Ability to develop relationships with founders and senior executives that builds trust in our company and investment modelArticulate & Persuasive: Ability to think on your feet and pivot the conversation when necessary. Communicates in a professional, confident, and convincing mannerFinancial Understanding: You have a basic understanding of finance and accounting principles and can use your skills to assess investment opportunities.\nThe Opportunity:\nBring your best self to work! Harris provides a career opportunity like no other. With multiple opportunities for career growth and progression, Harris is a great home for ambitious and driven individuals that are motivated by the ability to really make a difference. Our core values unite and guide us. Learn more about us here: Values (harriscomputer.com) #weareharrisShow more Report"}, {"company": "סיגמא HR", "job": "חשב בדיווח ישיר ל VP Finance של הקבוצה", "city": "Raanana", "date": "24h", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1110586&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6f8d7d12&cb=1676383359228&jobListingId=1008457286138&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83o4642bmk001-1goosd2gg20hg000-a1e5c5f194f4046a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDAxgFh48ON3GuQT9BrQ6YGWyEmaUvxSpPe8KvL73QZUumLyuNyWatK7v7w9JM4608Qy6bcKywQz3vcM2TecNjqlWMAQKr6_p6DBptYTeuJ8VkWJlOgIlAD3qH-55Ov6yvgkeYQ3Q7xVQiGky66cKB63r6RAfxmvZZMVuPv9fVoWu9wkp2WCaeGIuFn3RKiWZOF9Ll7iGmyL4VFlCK2U7EFmczc4t8MtzCZlW3EaircVSgxn_QlP0HkxNyjrX_Ct1GbjWKZcf9jI5aLqvUCuGCVCEN0SUweK0OfDOBPnrt4TIiFm3DYlM3sMT9OuR20dkcYTg7pJ5UcD6xL8Te8ZvQkMjKjoTkOZKhNY0yhA7pggRp53cmSw8uipSqGWXe74q-oX6QdIwF8849H4pBC5iCHI90UrsCx0N2g_iwU5NLuEBkRVHnEtQcAo6aEQ_Qxeh6HgCZJQsYbdQ3ls7d9YGe7oUxxy_cNWQNfr-zFxbPV7Wl_q3F09r11Re-vcJmXU52ndUUojI_Q8FBxEXz6exrAsFvG5HDDn_LreLpofoMaPduZgK_RNVpU1cXl59FL3qHCq3xeK_XTW1090jQJ5divytlHWgkt18TR-jVhdoJWbIbYxcJR6G4NFhdZ473q-VnRNYDIeSoe3X9uYp1pbcV2", "description": "לקבוצה תעשייתית גלובאלית דרוש/ה חשב בדיווח ישיר ל VP Finance תחומי אחריות: איחוד דוחות כספיים חודשיים\\רבעוניים\\שנתיים מיסוי בינלאומי מחירי העברה וחוזים בינחברתיים ליווי עבודות ה SOX, מבקרי הפנים וריכוז עבודה מול המבקרים החיצוניים הכנת חומרים ומצגות לישיבות הדירקטוריון וועדות שונות - ריכוס נתוני אופציות לעובדים וקשר מול הנאמן– ניהול תהליכי הענקה, מעקב ודיווח סיוע ל VP FINANCE בהטמעת פרוייקטים חוצי אירגון בישראל וארה\"ב סיוע בהטמעת מודולים ומערכות מיידע קבוצתיות רו\"ח מוסמך/ת, יוצא/ת ביג 4. ניסיון בחברות תעשייתיות. US GAAP שליטה ברמה גבוהה מאוד באקסל. הבנה וגישה למערכות מיידע וניהול תהליכי בקרות ודיווחים הבנה עסקית וכלכלית ויכולת קריאה של המפה ארגונית.\n\nיכולת אנליטית ברמה גבוהה. יכולת הבעה מצוינת בע\"פ ובכתב באנגלית ובעברית. ניסיון בתפקיד אחד כחשב או כעוזר חשב בחברה גדולה ציבוריתShow more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "Finance Director", "city": "Southern", "date": "3d", "rating": "", "link": "", "description": "Managing and responsible for the bookkeeping and payroll department in Israel. Responsible for all the Group's financial statements including the Group's monthly management reports, quarterly reports, audited annual reports and tax returns. Responsible for the salary. Responsible for reporting to the Chief Scientist.\n\nResponsible for payments to suppliers. Responsible for budget versus actual at the monthly level. Responsible for monthly cash flow. Addressing professional issues in both accounting and taxation.\n\n.**Please Apply your CV in WORD Document CPA, Graduate BIG 4 - must. Experience of at least 3 years outside the office - must. Experience in team management - advantage Priority knowledge - advantage. Good English.\n\nAbility to work under pressure and multitasking.Show more Report"}, {"company": "Chronos Consulting", "job": "Recruitment Specialist Tel Aviv area", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_418ee334&cb=1676383362313&jobListingId=1006039678149&jrtk=3-1-1gp83o75hk27m801-1goosd2gg20hg000-b6d981e238b99f14-", "description": "Chronos Consulting (www.chronosconsulting.com) is part of the Coberon Chronos Group, an award winning global leader in permanent and temporary staffing, RPO and business process automation solutions for global multinationals. The Group owns and operates 42 offices worldwide.\n\nAs the team is expanding, we are seeking a fluent English speaking Senior Consultant for Financial Services Recruitment (Finance/Accounting/Banking/Insurance/Payrolling) with a proven track record and experience in mid to senior level full cycle recruitment. You will build and grow both client and candidate relationships through management of the recruitment process delivery including: sourcing, screening, assessing, and presenting candidates to multinational clients. Career growth opportunities to build and manage a team of Recruiters and Researchers and expand into Asia/Africa/Latam/Europe for the ideal candidate.\n\nThe Role:\nAs he Recruitment Specialist you will:\n\nResearch, identify, and present candidates for mid- to senior-level executive positions, ideally exposure with a wide range of diverse industries (IT/Telecom, Manufacturing, Engineering, Pharmaceuticals, Consumer Packaged Goods).\nIdentify recruitment sources, networking leads, social media, advertising resources, and other tools to attract candidates.\nCoordinate client & candidate relationships, deliver solutions in a timely, professional, and responsive manner.\nCreate and update Progress Reports to track research and recruitment process, proposals, and support in responses for RFIs and RFPs.\n\nThe Requirements:\n3+ years’ experience in full cycle recruitment (job description creation, posting, sourcing, screening, interviewing, presenting & closing)\nExperience with a variety of sourcing methodologies to include: headhunting, market mapping, Boolean searches, social media recruitment strategies, career sites, among others\nInteracting with clients (both local and international) and key stake holders throughout the recruitment process\nCustomer focus with a sense of urgency while maintaining quality control\nStrong negotiation, verbal and written communication skills with attention to detail\nEntrepreneurial spirit and driven for growth and expansion\nAbility to work independently, strong team player and/ or manage international offices and Consultants\nFluent English mandatory. 2nd language a huge plus. French, Polish German, Spanish, Portuguese, Russian, Arabic, Turkish, Hebrew etc.\n\nWhat we offer:\nGood salary\nTop bonus scheme\nEquity participation\nHealthcare\nFree financial advice\nFreedom\nFlexible working timesShow more Report"}, {"company": "Jifiti", "job": "VP Finance", "city": "Israel", "date": "29d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7ffb8427&cb=1676383363702&jobListingId=1008395684824&jrtk=3-1-1gp83o8hjkbn7801-1goosd2gg20hg000-d89be49552dc69a4-", "description": "About The PositionJifiti is a cutting-edge fintech company that's driving the technology for leading banks and retailers worldwide.The successful candidate will be a individual with 7-10 years of managerial, accounting and financial management experience in a rapidly growing start-up environment, reporting directly to the C-level.ResponsibilitiesDirecting all aspects of accounting operations, overseeing all transactions related to general ledger, receivables, payables, payroll and financial reporting.Analyzing company's financial results with respect to profits, trends, costs and compliance with budgets. Issue regular status and ad hoc reports to senior management.Strategizing and presenting financial KPI’s.Developing and coordinating all relationships with financial institutions.Responsible for ongoing training and mentoring of team.Assisting senior management in financial planning and results management. Work with other team members to understand revenue and cost drivers and define appropriate reports for tracking.Coordinating, preparing, and reviewing monthly, quarterly, and annual reports with internal and external stakeholders.Coordinating and/or preparing tax schedules, returns and information.Managing all tax planning and compliance with all required federal, state, local, payroll, property, and other applicable taxes.Managing cash flow.Building a finance department as the company grows.Other finance and administrative duties as required.Requirements7-10 plus years of managerial accounting and financial management experience.Experience working in a growing start-up environment.Experience in international environment with US, Israeli and European entities.Recent experience scaling a finance operation to at least $100 million in annual revenues.Bachelor’s degree in Accounting, Finance or Business.Israeli CPA.Experience working under US GAAP.Strong organizational skills, attention to detail, ability to prioritize and meet deadlines.Experience in a SaaS hitech environment.Ability to multi-task in a fast-paced environment with fluctuating priorities and deadlines.Ability to work without direct supervision, and efficiently manage tasks and time.Job Type: Full-timeShow more Report"}, {"company": "Schindler - Your Finance Team", "job": "VP Finance", "city": "Jerusalem", "date": "10d", "rating": "", "link": "", "description": "Schindler - Your Finance Team המספקת מגוון רחב של שירותים פיננסיים לחברות סטארט אפ, הייטק וחברות בינלאומיות, מחפשת VP Finance לתפקיד דינאמי ומאתגר, אשר כולל אחריות על מערך הכספי של מספר חברות, בניית תקציבים, ליווי חברות סטארט אפ בתהליכי גיוס ו DD, השתתפות ב BOD ועוד. משרה מלאה , קריית מטלון, פתחת תקווה הסמכה בראיית חשבון - חובה ניסיון בתפקידי VP Finance / Finance Director ניסיון עבודה בחברות הייטק/ סטארט אפ-יתרון משמעותי עבודה אל מול המדען הראשי- יתרון אנגלית ברמה גבוהה -חובה יחסיה אנוש טובים, מולטיטסקינג, ראיה עסקית רחבה, יכולת עבודה עצמאית, יכולת ורבלית והצגת נתונים מול חברי הנהלה. הובלת והטמעת תהליכים בארגון.Show more Report"}, {"company": "נישה", "job": "VP finance", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1110586&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9a99dde6&cb=1676383366601&jobListingId=1008380872014&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83obba2dh9001-1goosd2gg20hg000-cbef53c3fd7ba5d3--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBJhd6ZXQ_JFO9Xhey-j6xkv1M3gCDhstZzyXUzWvvF9NnAxUd-b8DZtkdvFV3ivIleV8MhzCZQsWay6tid2kLM0Eu5RqsA34E4C6IhuoufNQmMsMmYLGq0q9pPeoRv2C2mXqd7uUpd9OaQchCRaAxRutYt-lP5-eiCLLob1t4UIRH3GVUKkFlLTxqG7GOpM3VasO3A15rp3Zz1DKGe0UHLBSi-XrIINirgDdToUfcj0hEXuH9aX4lM9_IY1X09zHZ50O_GdQ7C9P60BTSOM8k3zklrWTT6zjWDFxDmqPQZ22AEyf8DwAYrVXo3j6PRce1E5N5m-AZAWfAbvmBATSHCmqlxH68nztuvt7d70ujJhF6McmT4MMoS61sQM8apJGHyVRe6qtP8u8DtaIdQAdi_yxGYfVqXuo-0DZEduJwIqlnbEQ-5CTLwupNDuyvpFWuPaSWrumPVQdvw0FyOOhFbo1tXt6qYKKWxHHFrbxJVgXCeLqkH4L7gb7vaGCp05XEMwbpfDIVNzOWKBN8ukJ9En6JdgRZWqyeQ6bBWhLyUlBakR79q9Iw-7FvRieJZlrEb0la8S4x-c8L5QSJ7JJBmw0C7kQpTkQhDfRutFRi51s5AxOOHGzcOu4r6zeOcl4ynBq9KSFFJgDPnxkOB_x5_", "description": "לחברת פינטק בצמיחה דרוש\\ה VP Finance התפקיד כולל הקמה של המערך פיננסי הפנים ארגוני (מעבר ממיקור חוץ) וניהול של חשב\\ת וצוות של מנהלות חשבונות הובלה ופיקוח על כל הפעולות החשבונאיות, לרבות תשלומים, שכר , מס, יישום חשבונאות ובקרות 4 שנות ניסיון לפחות בחשבונאות ולפחות 3 שנות ניסיון ניהולי • ניסיון קודם בעבודה עם חברות תוכנה\\ טכנולוגיה\\פינטק • ניסיון בתעשייה של SaaS - יתרון משמעותי חוש עסקי חזק עם יכולת לקבל החלטות עסקיות נכונות תוך מינוף ניתוח נתונים. ניסיום עם Power BI והיכרות עם מסדי נתונים. • חייב להיות בעל הבנה מוצקה של עקרונות חשבונאיים • שליטה באנגלית (כתיבה ודיבור).Show more Report"}, {"company": "CrossBoundary", "job": "Associate - Tel Aviv", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "Associate\nAbout the Firm\nCrossBoundary Group is a mission-driven investment and advisory firm that unlocks the power of capital for sustainable growth and strong returns in underserved markets. CrossBoundary Advisory provides transaction and investment advisory services, having developed a specialized expertise in unleashing investment across all sectors in these markets. CrossBoundary Advisory has advised on over US$8bn worth of transactions across 75 countries globally, serving our clients from 20 offices spread across Africa, Asia, Europe, and the Americas. Our advisory clients include governments, development finance institutions, private equity firms, Fortune 100 companies, and research institutions.\nOur investment platforms, CrossBoundary Energy, CrossBoundary Energy Access, and CrossBoundary Educational Infrastructure, directly finance projects to bring cheaper, cleaner, and more reliable electricity, as well as education infrastructure, to developing countries. Anchoring the Group’s work in the renewable energy sector, CrossBoundary Energy is currently active in more than 10 African countries and has a portfolio of over US$100 million of renewable energy projects for commercial and industrial clients across the continent. CrossBoundary Energy Access uses blended finance and an innovative project financing structure to unlock capital for mini-grids with a mission to bring electricity for the first time to more than 170,000 people.\nLearn more at www.crossboundary.com\nJob Description\nCrossBoundary Advisory is recruiting a full-time Associate. We seek candidates with 3+ years of relevant experience working in underserved markets, contacts across the region’s financial services sector, and a thorough understanding of the investment landscape. As an Associate, you will evaluate investment opportunities, conduct macroeconomic market assessments, and provide transaction support to both investors and capital seekers.\nWho We Are\nThe CrossBoundary team is a unique group made up of people who are genuinely excited by the opportunity to make a difference in some of the most challenging yet exciting markets in the world. Team members come from diverse backgrounds but share several qualities: curiosity, humility, integrity, a drive for excellence, and a bias for action.\nWho You Are\nBachelor’s degree required. Advance degree in relevant field regarded favorably.\n3+ years of relevant experience in investment banking, management consulting, private equity, or similar\nExperience living and/or working in underserved markets required; experience in the region applied for highly preferred\nHigh tolerance for ambiguity; able to operate effectively in a changing context\nStrong quantitative skills and analytical abilities: can think clearly, structure problems logically, and then design and implement solutions that focus on the core issues\nFamiliarity with company fundraising process, including investor due diligence processes\nGreat at building and maintaining relationships under stress with colleagues and clients in the sector and/or region\nWilling to take on new types of work, even without prior experience or direct supervision\nExcellent presentation skills: ability to communicate clearly and effectively with diverse audiences\nSelf-starter who is humble and passionate about creating lasting change in underserved markets\nEnthusiastic about working, traveling, and living in sometimes challenging environments\nFluency in Microsoft PowerPoint and Excel\nPrimary Responsibilities\nCompany identification and evaluation\nIdentify and rigorously assess investment opportunities\nMarket assessment and ongoing market analysis\nConduct macroeconomic, regulatory, and operational assessments\nProvide sector analysis of priority areas for investment\nInvestor qualification and relations\nAssist in identifying qualified investors\nManage numerous investor relationships\nTransaction support\nAssist and often lead a team in supporting complex transactions which include but not limited to due diligence support, detailed financial model preparation including valuation\nTeam support\nMentor junior team members\nSupport with recruitment\nThink you have what it takes but not sure you check every box? If you’re passionate about what we’re building, apply! We want to hear from you.\nLocations\nThe chosen candidate will join our team in Tel Aviv. This role will involve travel in and around the region.\nEqual Opportunity Employer\nCrossBoundary is an equal opportunity employer. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to our human.resources@crossboundary.com\nContact\nInterested candidates should apply here\ntbagmEP6r1Show more Report"}, {"company": "Deloitte", "job": "Analyst/Consultant for Deloitte Business Planning Group", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1110586&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7aa4322b&cb=1676383369678&jobListingId=1008380594864&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83oecuk60h801-1goosd2gg20hg000-23bf51175174cf7e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCO9C5Z8XrXfM7b1GiFFE9o3lWHHW-YPqTJjMT6uju9-RZJvB_8f_NvPJhejhxmqK0JGzdmxUvRfyFq6CkxGE5uCtJ-nGVFLYN3Q6XPZPcOfFvKid5EoRT5kkb4xopqHIgrJo9YWyEWZdW6X8DZdsMiN_Fe3zuuhToVtTTIT03CWr-DfrL_uk3BaCYVNh0oKtQxztWLc_1Fal9QGIoGq106QIsLdbKNdiY9O47Y1AjziJsbac-sLP04BzlHm2VLIIV9kue3Q5KY3eYOKVn6D_sXQLxsJuunlmHQmaIiOy0GFEgoC05xKJKkgvGSeGaxmunRhexWx9WzIjjhlWPBx_MflovUPNn5pw7ooDyNeb_an_886G2dx9ys9kdl5Blxfw8VNVOgZC5oTDIP4DivlH1FSIPtnhfeePCdkpSmqA-6vLWnCgNpfYh_yPubESQVOfLuO_59CvQ2GjiyhT55BuTTCic5lsrGzBDoPLkMGXL11jLYLj9k3VSEbeS4udzhYgFsve2yN6EoX_rzceSECsP9O6mJKbmobv8VdTRSgv5nfeTrjYOLZ2UyXXVzU2hQuaNTsbhJ2PL6_5YrZQDkB_HcCukVX8RPaCAJdCBqnGlZHcVKQaojK4GixB50EFV3Nm0Zi7Tdtq8SIEjhIB0wWkbL", "description": "We are seeking highly motivated individuals who aspire to work on the most challenging business problems facing startups and corporate ventures. We offer you a varied, highly client-facing and challenging role in consulting. From your first day as a consultant you will be part of a team advising startups and corporate ventures on various subjects such as commercial strategies for new businesses, analyzing market structures, financial forecasting and strategic modeling for cutting edge technologies, developing business models and go-to-market strategies, supporting buy and sell side M&A and licensing deals. You will attend face to face meetings with C-level clients and will have major influence on critical business decisions.\n\n\nBachelor or Master degree in Economics/ Finance/ Business related discipline from top-tier university with consistent outstanding academic records •Exceptional analytical and quantitative problem solving skills •Knowledge of finance, understanding of modeling and valuation technique is a plus •Ability to communicate complex ideas effectively, both verbally and in writing in English and Hebrew •Ability to work flexibly as part of multiple teams and autonomously •Ability to work under pressure and to meet deadlines •Ability to juggle changing priorities and a varied workload •Personal integrity, initiative, self- motivated and leadership qualities At Deloitte, we believe that an inclusive mindset and diverse workforce are two of our greatest competitive strengths. That’s why we continue to reinforce our commitment to foster inclusion\n\nShow more Report"}, {"company": "SOTI Inc.", "job": "Sales Coordinator", "city": "Israel", "date": "1 day ago", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8fc158e4&cb=1676383370934&jobListingId=1008454737459&jrtk=3-1-1gp83ofjdk6d8801-1goosd2gg20hg000-c0fe1412786b5571-", "description": "SOTI is committed to providing its employees with endless possibilities; learning new things, working with the latest technologies and making a difference in the world.\nJob Title: Sales Coordinator\nPosition Type: Consultant\nLocation: Israel- Remote\nLanguage: Hebrew & English\nWhat We’re Looking For\nWe’re looking for a Sales Coordinator to join our growing team. If you have a passion for cutting-edge technology, combined with the drive to identify and maximize sales opportunities, then we want to hear from you!\nWhat’s in it for you?\nThis is an outstanding opportunity where you will be playing a major role in creation of sales pipeline for SOTI, by qualifying incoming leads to bring qualified sales opportunities that results in closed won business. If you have a strong desire to work in technology sales in a fast-paced environment and an aptitude for learning new technologies, this position offers numerous growth opportunities and a career path, where upon achievement of targets assigned, after a year, you will be given the opportunity to progress within the sales team.\nThe People - From our humble origins in our founder’s basement, to our industry leading position today, SOTI has worked hard to foster a company culture that we can all believe in. A culture that emphasizes personal growth, continuous innovation and fun.\nThe Growth - Our environment fosters new ideas, fresh perspectives, and the ability to take them over the goal line. SOTI is a fast-paced environment with a global reach that encourages you to make your mark and be part of something big!\nThe Technology - You’ll get the chance to work with leading edge technologies and take on complex and interesting projects, as part of highly collaborative and agile teams. You will work alongside SOTI’s partners which include leading tech giants that will keep you on the cusp of emerging technologies.\nWhat You'll do\nWork with the local Sales Team to support them in all CRM matters (SalesForce), especially when it comes to quote creation, order processing, creating reports and analyses\nSupport the Sales Team when it comes to forecasting and tracking key metrics in the Sales people´s opportunities\nCommunicate with our customers and our resellers when it comes to quotes and orders, but also with telephone support in case the respective Sales person is out of office or cannot take the call\nInteract with internal colleagues in different departments like Finance, Legal, Business Operations and SalesForce Administrators\nExperience You'll Bring\n1-2 years experience as an Assistant in Sales or Business Operations\nVery familiar with Excel and a CRM system, knowledge in SalesForce would be a big plus\nStrong analytical skills with respect to working with numbers\nProven ability to work independently in a dynamic, team-oriented sales environment\nGood English language skills, being a native/fluent Hebrew speaker is essential\nDemonstrate a desire to learn and grow within your position, and proactively pursue such growth and learning opportunities\nAbout SOTI\nSOTI is the world's most trusted provider of mobile and IoT management solutions, with more than 17,000 enterprise customers and millions of devices managed worldwide. SOTI's innovative portfolio of solutions and services provide the tools organizations need to truly mobilize their operations and optimize their mobility investments. SOTI extends secure mobility management to provide a total, flexible solution for comprehensive management and security of all mobile devices and connected peripherals deployed in an organization.\nAt SOTI, we celebrate the uniqueness of our global teams and are proud to be an equal opportunity workplace. We are curious problem solvers who are committed to bringing the best mobile and IoT management solutions to market.\nWe offer careers with #EndlessPossibilities.\nWhat are you waiting for? Apply today: https://www.soti.net/careers\nIf you want to bring your ideas to life, apply at SOTI today.\nPlease note that SOTI does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Services Agreement with agency/recruiter, SOTI will not consider or agree to payment of any referral compensation or recruiter fee.Show more Report"}, {"company": "Overwolf", "job": "Head of Bookkeeping", "city": "Ramat Gan", "date": "2d", "rating": "4.3", "link": "", "description": "We’re looking for a valiant Head of Bookkeeping to join our finance team!\nAs Overwolf’s Head of Bookkeeping, you’ll oversee our bookkeeping team, be our expert on best practices, introduce new processes, and ensure financial data and compliance by keeping accurate records of our accounts payable and receivable, payroll, and daily financial transactions.\nRequirements:\n\nאל3+ years of experience managing Bookkeeping teams\n5+ years of relevant experience working in bookkeeping.\n3+ Years of experience with Netsuite - a must!\nProfessional experience in a high-tech environment.\nExperience in both AR and AP.\nExcellent communication skills\nExperience with bank reconciliation.\nDetail-oriented, meticulous.\nFluent in English.\nHigh level of Excel proficiency.\nBonus points for being a gamer.\nAbout Us:\nOverwolf is the world’s leading platform for in-game creators and gamers who build or consume user-generated content around their favorite games. We’re talking about some of the biggest AAA titles out there – games like Minecraft, League of Legends, World of Warcraft, PUBG, and Fortnite – to name a few.\nThe way people create and play games worldwide is changing, and Overwolf is leading the revolution. We empower just about 100K creators to make the best games even better - giving them everything they need to create unique gaming experiences that serve more than 31M gamers every month.\nOur mission is to turn in-game creation into a new profession and build the next generation of games. And we’re just getting started.\nAre you ready to join the pack and shape the future of gaming?\nResponsibilities:\n\nIn this role, you will:\nLead a team of Bookkeepers\nAct as the expert on best practices for Bookkeeping, including optimizing current processes and introducing new processes to support quality assurance\nTake charge of ongoing bookkeeping duties, reconciliation of accounts, fixed assets, and payments\nManage reporting to local authorities.\nMonitoring the monthly and ad hoc payments, posting bank statements\nMaintaining and reconciling Balance Sheet and general ledger accountsShow more Report"}, {"company": "DataRails", "job": "Product Manager", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.0", "link": "", "description": "Datarails is a SaaS B2B solution that tackles one of the biggest challenges in financial departments: the overflowing amount of data that, up until now, was managed by tons of Excel sheets and several internal systems. All those financial reports, forecasts, expenses, analytics? Datarails takes all these financial reports, forecasts, expenses, analytics and integrates it into a one, simple, smart report. It consolidates the information, enables the finance professionals to follow it, manage it, and create the ever-needed order within the realm of finances.\nAbout The Role:\n\nAs a Product Manager in Datarails, you'll join our Product team and play a critical role in building the product department at Datarails, and creating a groundbreaking product.\nWhat You'll Do:\n\nTranslate product strategy into detailed requirements.\nBuild and lead features, capabilities, and domains within the Datarails platform\nWork closely with our Customer Success team as a leisure of customers need to R&D team.\nBecome a subject matter expert and work closely with our R&D teams on building features\nScope and prioritize activities based on business and customer impact.\nCollect and analyze feedback from customers, support, and other stakeholders to shape requirements.\nWhat We Need:\n\n2-3 years in product management roles within the SaaS Data sector\nProven experience working with SaaS B2B products and with complex systems\nBeing able to lead a team of engineers and designers\n﻿Deep UX understanding\nDeep empathy for customer needs, frustrations, and aspirations\nGreat English and communication skills\nProactive, independent, and cooperative (yes, we want it all…)\nAbility to work in a fast pacing and always changing environment\nDeep knowledge of data, analytics, and data analysis tools\nWhat We Offer:\n\nWe offer a supportive, agile and creative work environment with brilliant colleagues!\nCompetitive compensation, ongoing recognition, and most of all, a chance to learn, contribute and develop your skills.\nOpportunity to join an explosive industry, a successful and growing organization, and an unmatched leadership team, passionate about their employees!\nMost of all we will give you fun, enthusiasm, support, a passion for healthy living, and never a dull moment!Show more Report"}, {"company": "Clarivate", "job": "Business Operations Manager", "city": "Jerusalem", "date": "2d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5127a972&cb=1676383375075&jobListingId=1008454154470&jrtk=3-1-1gp83ojk6ii1n801-1goosd2gg20hg000-db8f9aad08ec6fe3-", "description": "EX LIBRIS– Who are we?\nEx Libris, Part of Clarivate, is a global EdTech (Education Technology) industry, leader. We serve some of the most prestigious academic institutions and research Universities around the world, with a total of over 7,500 customers in 90 countries.\nOur SaaS solutions help universities transform academic libraries, maximize the impact of research activities, enhance teaching and learning, and drive student engagement and success. For more information about Ex Libris, see our website, and join us on Facebook, YouTube, LinkedIn, and Twitter.\nWe are looking for a Business Operations Manager to join our team!\nYou will support Quote-To-Cash processes focusing mainly on supporting the sales team. You will be involved with program management for strategic initiatives and programs, identifying, resolving, and improving internal processes and procedures. You will also generate business insights and perform data analysis to support decision-making. If this sounds like an opportunity you are interested in, then we would love to talk to you!\nAbout You – experience, education, skills, and accomplishments\nBachelor’s degree in Industrial Engineering, Business Administration, or a related field; OR equivalent combination of education and work experience.\n3 + years of experience in Sales Operations, Business operations, Business administration, Project management, or Program management.\nKnowledge of Quote-To-Cash processes.\nIt would be great if you also had . . .\nExperience introducing sales methodologies and tools to a globally dispersed sales organization.\nAbility to thoroughly analyze complex data, translating data-driven results into actionable deliverables, messages, and presentations.\nStrong Analytical Skills.\nDemonstrated ability to partner with varying business groups and teams to develop cross-functional tools, approaches, and processes.\nExperience in Enterprise software or SaaS organization.\nSalesforce Admin certification.\nWhat will you be doing in this role?\nServe as an internal expert and primary contact in supporting the sales organization’s use of internal tools, processes, and protocols.\nEnsure data accuracy and completeness in documenting and assessing regional pipelines, forecasts, and bookings.\nEnhance sales productivity, enabling the sales organization to achieve increased success through simplified processes, the introduction of new tools, and streamlined access to information and resources to close sales.\nProactively identify improvement opportunities, leading the capturing and documentation of business requirements through rollout and post-implementation evaluation.\nDrive alignment with the relevant functional groups (ex. MIS, Finance, and Professional Services) through the planning, implementation, and evaluation phases – collectively ideating, problem-solving, and project planning for upcoming projects and initiatives.\nMonitor regional forecast and booking goals, and proactively address and resolve issues impacting the completion of bookings.\nLead and monitor managerial routines such as QBRs\nAbout the Team\nYou will join a global team of Business and Sales operations experts that support the Library Software business collaborating with all org functions, such as Product, Global Sales, and Marketing through our management team.\nHours of Work / More important information for you:\nOur base is in the Jerusalem, Israel office, working in a hybrid model\nThis is a full-time position.\nAlthough duties are typically performed during normal business hours, occasional off-hours work may be required.\nWhy Ex-Libris?\nAt Ex Libris, we value our employees and are striving to create the perfect balance between work and home life. Join us to be part of a family-like environment; enjoy our unique culture and benefits. Be part of a thriving, productive community helping change the future of higher education with the state-of-the-art technology from Ex Libris.\nAt Ex Libris, we work hard and have fun doing it!\nAt Clarivate, we are committed to providing equal employment opportunities for all persons with respect to hiring, compensation, promotion, training, and other terms, conditions, and privileges of employment. We comply with applicable laws and regulations governing non-discrimination in all locations.Show more Report"}, {"company": "Mccann", "job": "Business Development Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.4", "link": "", "description": "Business development managers at Primis do much more than just sales, we prospect our leads, build relationships, and negotiate through long sales cycles with leading sites and publishers worldwide. You must be a people person, someone who can understand the specific needs of each and every publisher, and act accordingly.\nWe are looking for a person with experience in recruiting and working with publishers to join our growing publisher biz dev team. A person that knows publishers inside and outside and is looking to play an essential part in our company’s growth.\nThis role requires a very motivated individual who loves the thrill of a closed deal and can also multitask between recruiting new publishers, supporting the technical onboarding stage, and optimizing new accounts in the most critical phase.\nRequirements:\n\nAt least one year of proven work experience in a similar role in Adtech\nPrevious experience successfully signing deals, driving revenue through prospecting, pitching, negotiating and renewing business with mid-tier & premium digital publishers\nNetwork of digital publishers and direct connection.\nFundamental understanding of the programmatic ecosystem, publisher landscape, and the online advertising industry\nExcellent communication skills (written and verbal)\nHigh attention to detail and powerful analytical skills\nFluent Spanish - reading, writing and speaking\nSelf-motivated, goal and target-oriented executor that desires to be a key contributor and strong team player\nB.A/ B.Sc. degree in Economics/Finance/Communication/Management or equivalent\nStrong Excel skills\nSub Company:\n\nPrimisShow more Report"}, {"company": "Mobileye", "job": "Customer Success Specialist", "city": "Jerusalem", "date": "16d", "rating": "4.2", "link": "", "description": ""}, {"company": "Deloitte", "job": "Financial Analyst", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1110586&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9643fa0b&cb=1676383379145&jobListingId=1007739067197&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83onk62jq8001-1goosd2gg20hg000-93563ccf08b36f16--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC_Wdhu634opPFRSRO45eHnCrACRNcpm9_LaHOMBYvJWmjtte_-uoGgaqL76N8raJUWlnixzaeJwJHSmDqOb8YpFyxJDwxNobjW9szObCVLJ6RfyYhOR9I5cZ8WapCkWpmdQAwlTVOJCXJZ5ZxpybOiRxHi6Ttr80Yh_AuG7ZGBazPGeko6W6vSWpFDOvLrkv9Jhtal4gvl86pQRcndzXe9H0kyXF3naI8_wXPPmyXw0rQrrxBxfEHbJ-aUu3Das3KHlggKdyjnpiq3QeQNLMfGwCBfS8za1VF2mmYiDSezoPqliVXeeQELD--qERZun4VNfwvqV9ISV5htg6l-QFtvx_xG5g6OwOPw70-t0jF_8S5hKX4fi6zln58pAbOQItBY2JIijTbe-1Imsl_Md4foeTiqwK_oZT-e5WOJKd-Oa5pFgHIE0CcnNN7KWPqaGjY3NCFIBG5Ut_RxEnGKISZnlGcHHJowVB173kb-6rEH8WQpVWEAkQR-8BZx0dRCOX-ff-WoiTVnm2rHnC0qk67QWsICJZW_ErlLzYelr0K9-ZWQ6FMc7G5SSLCG4z2QZ8rx3kmTjHAXZwF3_6Hpu7Lf_oYjqfmtNtzL9gjXmr7My9H2SFsHH9CkVXmqvfLeQ3GQQIbzqzw9D7KfX2iWkEcl", "description": "What you will do The Expense Compliance (EC) team is responsible for ensuring Expense Policy compliance and proper internal controls through the auditing and analysis of various expense claims. The team works using various auditing tools and techniques across multiple expense platforms (SAP travel management, Concur, etc.). The EC team also help manage the Firm's corporate card process including application, delinquency monitoring, and reconciliations. As a member of our EC team, you will have the opportunity to interact with many groups across the DTTL network to conduct daily job requirements such as: Review business expenses submitted in Concur for compliance with policy and regulatory requirements Process corporate card applications/cancellations and follow up on delinquent accounts Work with Deloitte professionals at all levels to resolve expense, policy, and corporate card queries Develop in-depth understanding of Firm expense policy and employ advanced auditing techniques to identify items that are out of compliance and/or fraudulent in nature Perform ad hoc analysis and reporting as required Work on special projects to improve service delivery quality and/or operational effectiveness Bachelor's degree in Accounting or Finance Good oral and written communication skills in both Hebrew and English 3-5 years relevant experience Strong business judgment, critical thinking and analytical skills Advanced knowledge of business applications such as: Excel, PowerPoint, Outlook, etc.\n\nAbility to work both independently and collaboratively within a team Must clearly understand how to handle confidential information Ability to quickly understand and learn new skills and technologies Demonstrated problem solving and critical thinking skills Ability to prioritize tasks, work on multiple assignments, and manage ambiguity Knowledge of SAP and Concur is a plusShow more Report"}, {"company": "Deloitte", "job": "Audit & Assurance Staff – US-Israel", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1110586&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_940cc746&cb=1676383380608&jobListingId=1008083059863&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83op05jool801-1goosd2gg20hg000-8359bbd23f72e283--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC_V6sLizfxnd6uUN8x00ViZyWJzJWJVevA74YKulbC_-XItrLKqv4uSi0rfYT3tKo6RKT4NuXpIcs1Inn6E6JlIBiMUR6EbUJLX4Gs5pyL6_pP_BDJRdfwKsB4bczjc_dR-y4KBbmxpw69MfUI2Fo-uzHt-vQeq75LHF9AJPwSjV_7R3E-zqjMjkt0gRj51QzQIZj8Ne2o4ftGNdy6SahHPnLJKBtXw5_GYdguJdPIklRnWlcCnG5Sz7Wbh2QOo7nvwIJDisjI5PjdqFYFz7GhnLAljg2qlG2DwNTObNux2xp21THSAUMVojjQgplUu_eA8V0MkPpkap7uFPdtEXYUBBeXiIgv0W9e8UIigZ9gyygrI4XI_KE98liT74WNAnCysWIKiDxqaxv1wfqfPuVjyL7qw--7DjC1oaBW_pZhOd3jns47jssBQoz617wG0K9yuQO0VWN9mw6QN0uhhiygLuS1k33ezlZTSfwjY_rMrAXUFJ6_PabTQfE5F5C8j16mQMSlTuWoSzUokU3c_MBhhwvE-lZ6oBzvTXxS0VhrjZzmuobEVBhrEgkXwNHbAuIA1jpy6twbE8Hkd6gzt5ZMlSKe3EwnjgVvLZPwAsng6Eay5_7whAKUmNrRyPOwrLY70n39n3wMG02-hGN7Kymn", "description": "As the world changes, join a company leading the way! Financial markets are growing ever more global and more complex. At Deloitte, we have innovated the audit by leveraging cutting-edge technology like data analytics, combined with transformative processes, that evolve our audit and assurance capabilities to meet the dynamic needs of the capital markets. As an Audit & Assurance professional, you have the opportunity to help enhance audit quality, provide deep insights, and deliver a differentiated audit!\n\nAs a full-time audit professional, you'll deliver audit services to our US clients and work cross-functionally with US and Israel Audit team members to design and execute audit procedures based on the client’s business needs, internal controls, and risks. Required: *Bachelor's degree in Accounting or related field (e.g. Business, Finance, Economics). *Experience needed or IL CPA preferred *Fluency in English; Demonstrate effective verbal and written communication skills.\n\n\nThe interview will be held in English *Ability to work effectively in a virtual environment. Preferred: *Work experience with a regional or international accounting firm. *Understanding of broad business & technical (US GAAP) knowledge. Location: Tel Aviv, Beit-Shemesh, Jerusalem, Haifa, Nazareth.\nFlexible hours and hybrid/remote options. *The position is intended for both women and men. * We at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.\n\nShow more Report"}, {"company": "ווין ג׳ובס", "job": "Marketing Manager 162796", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": ".A Finitech company is looking for a Marketing Manager.The company is located in Tel Aviv area.Availability to a full-time work, Sunday-Thursday, 8am-5pm:Job Requirements are.Bachelor's degree in marketing, finance, business administration, or similar.Experience as a marketing manager.Kowledge of marketing strategies, channels, and branding.Full social conditions.It is mandatory to specify salary expectations, inquiries without rate expectations will not be of interestJob Type: Full-timeShow more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "Business Development & Sales Director", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "", "link": "", "description": ""}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "Chief Operating Officer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1110586&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_74bb170e&cb=1676383384292&jobListingId=1008331754847&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83oskqkuir801-1goosd2gg20hg000-abdffcab1977761c--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAh5VetcM878K-aUf10CWFkjfw9RPIfw5ftyW0PI-rgU_4CrLP5GE2EuCU9Sjy1zW59zR1D7yy9EBVZAceJjcVcL1ntDpQlKzew8BZMvANPy3xmbfK5mqAW5f8zxvR9KuMZ8N3_-g2HxapxnIwjU7qp2YmIhvLbsyeqvfG9NcnhUzYkdS_TSmSrYlt7Gnv-qmd2vXpu491qsLIholS4fyQn1EcU4RKMz-htUDN6qeWWVeR0tCeJ8Z-Zv5V8CDDnEtoHH2xjN4dQA_AP6nE-tKk-6Q0WX6Ej7xPmyVbjQrCqgviEfwo0zqV1BxqwvJPn-2d9k9TchaFDKbxG2rwrW6bjjiZuCtE62CggsEWqfyoD2ldFxSviEN60RtqhtGjJMnyiRFdDKC6NPXCSXpjIel41FaIlDlK_HeS5MAQcbijWwJKCOemb4_hq40cBI3wfaKEHQiCXmXUVZUm5hCzU-ORozFOa7nlXD3iY-Vhm6nxp1M9WZHPoHpLHc6wmhvdz2cZHeim8rbHeF0wKqyA35BdKCPn2FaTrHZehjpL573n0uZrWdcj2f4dJhtG0fEuA0v16M9hrdncrfefFqZPJ9aSNGPa4jYjVKo96uoQjT2tggJQm77HUG6-w2bCzgRq_GWslR7jIJA4W0N4jLfYQyL_R", "description": "We are a Beit Shemesh company in the LegalTech space. We provide tech-enabled, high-quality, streamlined services to our clients who are primarily law firms and large corporations. Key Roles and Responsibilities Be a part of the Leadership Team, and evangelize the company’s vision throughout the organization. Become a knowledge body with deep understanding of our Value Chain and the variety of tasks that are a part of it.\n\nDevelop and implement ways to track and measure our performance with respect to the company’s Goals and Targets, set by the board and executive management. Create and own our overall budget, and help the functional managers utilize their individual budgets effectively. Serve as a focal point for inter-departmental meetings and facilitate effective collaboration between other executives and departments Partner with leaders across the organization to evaluate and form relationships with customers, vendors and service providers Lead the R&D department, understand the way our products and SSTs are developed and partner with the CPO to make sure we develop cutting edge solutions. Lead the Finance team and become the company’s “single source of truth” concerning its budget and key metrics Lead the IT team and make sure our different departments are implementing the best solutions to carry out their tasks and communication Requirements: An entrepreneurial mindset, with integrity and ambition Ability to build consensus and relationships among executives, clients, and employees Ability to analyze the organization, define the success metrics to track, and create a framework to track and report on key performance indicators Proven experience in management of R&D and knowledge of R&D methodologies and best practices In depth knowledge and experience reviewing and evaluating financial information and legal documents Proven ability to synthesize complex technical information, and then design strategies, solutions, workflows, and procedures which can then be adopted by stakeholders Deep analytical proficiency and effectiveness working as part of the senior leadership team Strong communication, influence, and cross-functional collaboration skills; able to create clarity and drive focus in complex and dynamic contexts 7+ years of experience as operations executive at medium to large B2B services or SaaS company.\n\nBA, MBA – an advantage Experience in M&A – an advantage Full time availabilityShow more Report"}, {"company": "UVeye", "job": "Director of Finance", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": "UVeye is looking for an experienced and highly motivated corporate Director of Finance to join us and lead our global accounting, reporting and tax functions\nDirect responsibility for the corporate accounting, reporting and tax function with overall global responsibility\nResponsibility for the preparation and analysis of UVeye's consolidated financial statements for both internal and external usage while overseeing UVeye’s subsidiaries’ financial statements and compliance.\nSets and manages internal control systems and S-OX compliance.\nImplement cross-functional processes and policies such as direct & Indirect procure to pay process and fixed assets investments.\nLeads IT projects in the area of finance & responsible for direct and indirect Tax strategy and compliance.\nRequirements:\n\nAt least 8 years of experience in the accounting area.\nAt least 3 years of experience as a Finance Director in a fast paced tech global company.\nExperience working in a manufacturing multidisciplinary company - HW & SW\nExperienced in leading employees & team leaders.\nCPA certificate, Big 4 accounting firm is preferred.\nVast practical experience in US GAAP.\nActual ERP deployment experience.\nExcellent English – both written and verbal skills.\nAbility to work in a fast-paced work environment, meet tight deadlines and handle multiple priorities.\nStrong analytical skills, system & process orientation.Show more Report"}, {"company": "ICON", "job": "Contract and Bidget Negotiator", "city": "Israel", "date": "4d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1b5c1572&cb=1676383386790&jobListingId=1008450004474&jrtk=3-1-1gp83ov37kuiv801-1goosd2gg20hg000-81e499280f8ff55b-", "description": "ICON plc is a world-leading healthcare intelligence and clinical research organisation. From molecule to medicine, we advance clinical research providing outsourced services to pharmaceutical, biotechnology, medical device and government and public health organisations. With our patients at the centre of all that we do, we help to accelerate the development of drugs and devices that save lives and improve quality of life. Our people are our greatest strength, are at the core of our culture, and the driving force behind our success. ICON people have a mission to succeed and a passion that ensures what we do, we do well.\nICON Strategic Solutions (ISS) is looking for qualified candidate to perform the investigator site contracting Services hereunder in order to support a broad range of therapeutic studies across all our sponsor´s divisions in accordance with the requirements described in FSP Program.\nJOB FUNCTIONS/RESPONSIBILITIES\nPerform negotiation of legal terms and budget terms for Clinical Study Agreements (“CSA”) (i.e., investigator site agreements)\nPerform negotiation of legal terms and budget terms for amendments to CSAs\nDraft and negotiate ancillary site contracts (e.g. PI / Sub-I / department agreements /Study Coordinator) as required\nUtilize Sponsor´s provided templates. Sponsor´s requires stand-alone site contracts with the exception of the US, which utilizes master clinical study agreements.\nProduce and maintain site-specific templates where needed to support the Sponsor´s targeted investigator site list, but limited to the sites within the studies assigned\nRecommend country-specific and site /entity-specific modifications to templates based on site and local regulatory requirements\nUtilize previously negotiated terms for existing contracts between same site/entity and Sponsor´s\nPerform submission and oversight of site and study specific local language translations. Candidate will be required to use Sponsor´s preferred translation vendors. Sponsor´s will manage template version control and translations\nAttend weekly study team and country meetings, as needed\nIdentifies risk and mitigation strategies as it relates to meeting contract negotiation timelines\nICON’s Legal team may provide support to ISS personnel. For the avoidance of doubt, ISS is not providing legal advice to Sponsor´s in any capacity.\nFollow Sponsor´s’s legal guidance document and comments and fallbacks\nIdentify contractual and compliance risks for CSA contracting and raise to Sponsor´s\nCollect information from investigator site to complete Foreign Corrupt Practices Act (FCPA) form and submit to Sponsor´s\nPrioritize to meet study timelines to minimize impact to planned Site Initiation Visit (SIV) dates.\nAct independent of CRO managing the study\nPerform quality control checks of contracts and amendments prior to upload to DocuSign for electronic signatures\nIf electronic signatures are not permissible, provide management of hard copy/ local signature process\nContractual Parties:\nEnsure signatory to CSA is authorized to sign on behalf of the party\nEnsure signatory to the CSA will either be responsible for the contractual obligations or operating under a Power of Attorney binding a Sponsor´s entity to the obligations. Sponsor´s preerence is to have Sponsor´s or Sponsor´s Affiliates as the contracting entity for CSAs where possible\nEnsure country - specific singnatory requirements are met (e.g., Some countries require signature by local affiliate (e.g. Italy and Canada))\nSupport and provide country level intelligence into the selection of signing part at the country level which must consider payment impact, tax issues (VAT/R&D/WHT) establishment (I.e. corporate presence) and relationship to sponsor.\n Collection and submission of payment support forms, including, but not limited to Payee information forms and required tax forms\nBudget negotiation specific requirements:\nPre-populate site-specific budget items from prior negotiations following Sponsor´s provided guidelines.\nNegotiate site budgets following Sponsor’s principles document and comments & fallbacks\nActively participate in per-subject cost development meeting. ISS personnel will provide review and input into the country specific budget templates to minimize timelines for site budget negotiations.\nProvide country level expertise to budget related contract terms and conditions\nEscalate out of parameter budget items to Sponsor´s Investigator Contracts Lead (ICL)\nRecord negotiated changes to patient compensation information and provide to Sponsor´s designated contact for Informed Consent Document (ICD)\nDemonstrate effective time management skills; able to independently prioritize multiple tasks.\nDemonstrate the ability to work independently and use initiative to anticipate/resolve issues and complete tasks.\nShows a commitment to and demonstrate the ability to consistently perform high quality work with minimal management oversight.\nContract Management System:\nAriba Contracts Workbench is the current Sponsor´s contract management system.\nISS personnel will utilize the system for all contracts consistent with Sponsor´s provided guidance and training.\nSignature processing:\nISS personnel should first adapt and advocate for Sponsor´s-preferred DocuSign system for electronic signature process. Other options / alternatives may be presented by the ISS personnel and will be reviewed by Sponsor´s\nTrial Master File:\nISS personnel will file CSA and Amendments into the eTMF within required timeframe\nEDUCATION REQUIREMENTS\nBachelor’s Degree or international equivalent in business, finance, health sciences or related field\nRead write and speak fluent English; fluent in host country language required.\n1-2 years Industry experience managing contracts required.\nBenefits of Working in ICON:\n\nOur success depends on the knowledge, capabilities and quality of our people. That’s why we are committed to developing our employees in a continuous learning culture – one where we challenge you with engaging work and where every experience adds to your professional development.\n\nAt ICON, our focus is to provide you with a comprehensive and competitive total reward package that comprises, not only an excellent level of base pay, but also a wide range of variable pay and recognition programs. In addition, our best in class employee benefits, supportive policies and wellbeing initiatives are tailored to support you and your family at all stages of your career - both now, and into the future.\n\nICON, including subsidiaries, is an equal opportunity and inclusive employer and is committed to providing a workplace free of discrimination and harassment. All qualified applicants will receive equal consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nIf, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please let us know.Show more Report"}, {"company": "Barclays", "job": "Banking Analyst - Expert Graduate Programme - 2023", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=0000018631c689c3b04944d2c2b79b1a&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4f701c9c&cb=1676383388173&jobListingId=1008130651163&jrtk=3-1-1gp83p0emih4s801-1goosd2gg20hg000-599d07e4897a5f1f-", "description": "Join the world of banking\n\nEvery day, corporations worldwide come to Barclays for our banking expertise. We help drive global commerce by providing comprehensive financial, advisory and capital-raising services. Our bankers advise on everything from mergers and acquisitions and privatisations to debt and equity financings and restructuring. Want in? Join us as an analyst.\nThe chance to make an impact\n\nAfter several weeks of intensive training to start, you’ll join one of our industry, product or geographic groups and start working on live deals and business development projects right away. Within small deal teams, you’ll quickly play an important role on a variety of demanding assignments. You may work on:\n\nfinancial analysis and modeling\nvaluation\nindustry research\nbusiness evaluation and strategic assessment\nbusiness and idea generation\nexternal and internal stakeholder communication.\n\nA place where you can thrive\nAt Barclays, you’ll be surrounded by people who will help you achieve your ambitions. Our collaborative, supportive environment gives you the chance to build solid relationships with senior leaders, peers and clients alike. What’s more, dedicated programme managers will support and advocate for you throughout the first several years of your career at Barclays, ensuring you develop the skills you need to succeed.\nDuring your analyst years, you’ll also:\n\nparticipate in formal and informal training designed to give you the knowledge you need when you need it\nreceive detailed performance coaching and feedback\nhave opportunities to expand your network and develop leadership skills.\n\nYour role as a Banking analyst will provide you with the skills and experience needed for a successful career in the world of finance. We’ll also provide you a visible path to the necessary steps for promotion to associate and the tools to get you there.\n\nTo be considered for this programme, you must:\nbe motivated with a strong degree or expected degree – in any area.\n\nIdeally you would have:\na strong interest in business and finance, though no specific subject degree is required\na candidate with course experience in accounting (strongly recommended)\nsomeone who shows resourcefulness, team-orientation, enthusiasm and an entrepreneurial spirit, demonstrated through participation in extracurricular activities.\n\nIt is the policy of Barclays to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, protected veteran status, genetic information, or any other basis protected by law.Show more Report"}, {"company": "Google", "job": "Intellectual Property Commodity Manager", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.5", "link": "", "description": ""}]