[{"company": "Procter & Gamble", "job": "Brand Manager P&G Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=301&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_58f53377&cb=1676383441496&jobListingId=1008106611857&jrtk=3-1-1gp83qkcdis35801-1goosfjnegfp8800-adf41c909c3f2027-", "description": "Are you looking for meaningful work? Come to P&G where Brand Management was born!\nDid you know P&G invented the concept of branding and data-driven brand management? Over the years, we have remained consistently among the top in marketing by finding new and exciting ways to reach consumers.\nAs a Brand Manager, you will be responsible for making sure we win with consumers' preferences in each of the following areas: When they learn about our product, When they choose to buy the product, When they use the product at home.\nWe are looking for the world's best marketing pros who follow one simple concept: \"Consumer is boss\".\nWorking in brand management at Procter & Gamble means being more than just a marketer, it means being a total business owner. We need someone who is dedicated and who can guide the vision and strategy behind a brand by developing marketing plans and driving innovation. Our Assistant Brand Managers need to work regularly across functions to identify consumer, shopper, and customer insights and execute marketing tactics that will continue to grow your brand profitably.\nTogether, we'll continue to create leading brand experiences and make a difference for nearly 5 billion consumers every single day. Pretty cool, right?\nWhat we offer you:\nResponsibilities from Day 1 – You will start of working on key brands from the beginning. Over time, as you expand your impact on the business, your responsibility and ownership of a brand will quickly grow.\nRecognized state of the art marketing skills – We will constantly help you improve your marketing knowledge and management abilities.\nContinuous coaching & mentorship– We are passionate about our work. We will make sure you receive both formal training and regular mentorship from your manager and others.\nDynamic and respectful work environment – We live our Purpose, Values, and Principles daily. We value every individual and encourage initiatives promoting agility and work/life balance.\nAs a Brand Manager, you will have opportunity to work on brands, driving the business results. You will engage with multi-disciplinary teams (including Sales, Finance, Product Supply, Advertising, and Media Agencies) to develop top strategies for your brand's success.\nYou will lead a mix of Marketing and Brand Management projects enabling you to show the breadth and depth of your leadership. You will need to derive insights from the data, which will enable brand leaders as they set the direction for brand growth. As your skills increase, you can expect to advance in roles with increased responsibilities. Overall, we want people who aren't afraid to take smart risks and innovate.\nQualifications\n\nWe want someone with:\nStrong academic background\nExcellent visionary, strategic and courageous leadership skills\nStrengths with strategic and analytical thinking\nAn ability to drive innovation and brand growth\nStrong ability to communicate and team capabilities\nUp to 5 years’ experience\nFluency in English\nJob locations:\n\nTel Aviv, Tel Aviv District, Israel Job Type: Full time Job categories: Brand Management/Marketing Req No: R000059810Show more Report"}, {"company": "Tesla", "job": "Tesla Advisor", "city": "Rishon LeẔiyyon", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=302&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_38c6042a&cb=1676383442966&jobListingId=1008157143779&jrtk=3-1-1gp83qlutkhrt801-1goosfjnegfp8800-c77a7b9d52c44775-", "description": "What to Expect\nAs a Tesla Advisor it is your responsibility to offer seamless customer service throughout the entire customer journey. You have relentless determination to succeed and you are driven by the mission of Tesla to accelerate the world’s transition to sustainable energy. You act as a pioneer for Tesla products, sharing your knowledge and building lasting relationships.\nYou are part of a larger sales team who works closely and flexibly on all tasks. You are expected to cooperate frequently and display a one-team mentality to achieve sales and delivery targets.\nWhat You’ll DoTo offer excellent customer service throughout the sales and delivery process.Ensure close and tailored communication with customers at all touch points.Maintain a presentable showroom while proactively addressing all customer queries and appointments.To inform and educate about Tesla at every opportunity.Help create, maintain and develop sales pipelines.Be a strong contributor to achieving store sales and delivery targets.Maintain sales administrative duties including contract completion, finance and ensuring systems are up to date, as well as effectively managing all outbound activities and reporting.Ensure readiness of fleet cars at any given time and have an overview of resources available.Prepare customer vehicles in advance of delivery appointments as well as perform direct deliveries.Manage any additional duties to support wider business requirements.\nWhat You’ll BringExperience in providing excellent customer service in a fast-paced environment.Confident in creating great conversations and relationships tailored to the customer’s need.Ability to thrive in a team-based environment and achieve common goalsGreat problem solving skills, and strong ability to take initiative and be proactive.Ability to effectively handle multiple priorities, organize workload, and meet deadlinesResilience, adaptability and a constant desire to developCapable of working autonomously as well as in a team.Positivity, enthusiasm and a passion towards the mission of Tesla.Confident in learning and adapting to multiple technologies.Able to communicate, read, and write effectively in the English language on all levelsHave the required language skills if required by our local marketsGood knowledge of MS OfficeMust have had a valid driver’s license for minimum of 2 yearsMust have and continue to maintain a valid and safe driving recordShow more Report"}, {"company": "", "job": "Head of operations", "city": "Herzliya", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=303&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fcd3cd76&cb=1676383444098&jobListingId=1008071367524&jrtk=3-1-1gp83qn1vkbn6801-1goosfjnegfp8800-68f12b1a16862ad4-", "description": "הגש מועמדות\n\nהרצליה\nמשרה מלאה\nמעל 5 שנות ניסיון\nתיאור\n\nA leading service provider of solutions for iGaming operators in Herzliya Pituach, is looking for a Head of Operations to come and join our team!\nsupervise and control our clients' operational needs, as a B2B2C service provider you will managing all operational processes for iGaming operators including: Marketing (internal and acquisition), CS, VIP AM, Finance, Risk/ Compliance and etc.\nDevelop high quality business strategies and plans ensuring their alignment with short-term and long-term objectives\n\nדרישות\n\nProven experience as Head of Operations or in other managerial position\nExperience in the field of Online Casino Industry- A MustProficient Technical Knowledge- A mustEnglish High Level/Mother Tongue. Additional European language is an advantage.MSc/MA in business administration or Computer Science.\n\nדרושים בתחום\nמחשבים ותוכנה - מנהל/ת פרוייקטים\nמאפייני משרה\nמעל 5 שנות ניסיוןמשרה מלאה\nשמור משרה\n\nשתף\n\n\n\nDevelop high quality business strategies and plans ensuring their alignment with short-term and long-term objectives\n'>שלח מודעה לחבר\n\nעודShow more Report"}, {"company": "Adidas", "job": "Order Fulfillment Analyst", "city": "Holon", "date": "30d+", "rating": "4.0", "link": "", "description": "Purpose & Overall Relevance for the Organization:\nOBF teams are responsible for controlling and delivering the Order Book of the channels on a seasonal level where customer expectations are met on time and in full as well as all making sure the right product availability is achieved for successfully activating Brand related moments\nThe role will ensure that the order book of Israel is delivered inline with the Service Level agreements in place to relevant sales points in right quantities and on time, provide Order Fulfillment analysis and support for the organization, be accountable for continuous process improvements for Order Fulfillment topics of delivering on time, availability, correct allocation and OTIF. The role will also own all relevant Campaigns within the region and coordinate all the necessary operations around campaigns with the relevant stakeholders\n\nKey Responsibilities:\nDirects and coordinates the process covering planning, prioritization, order creation, pick & pack and delivery of the products to customers and own retail\nEnsure channel success by ensuring high product availability for key launches and campaigns\nCoordinating and following of deliveries of all sales channels.\nTrack and deliver all Campaigns & Launches according to the Brand calendar\nMonitoring and reporting including proposals and recommendations for the management team.\nFollow up the availability and order management- monitor the available products and elaborate availabilities.\nFollowing the launch and campaigns products and inform the warehouse about the launch dates in order to deliver the articles on the right time.\nAnalyze the order book and collaborate across functional areas to achieve overall KPI: OTIF- OTA.\nSell in analysis based on consolidation reports.\nReview and control the allocation status of the available articles in the system (SAP) and take the necessary actions if there’s a problem to be solved.\nCreating delivery notes for selected articles to the Warehouse for picking & packing.\nMaintain the order book with cleansing or updating the sales order accordingly.\nReview of incomplete orders\nValidate the trade terms and sales pricing of the sales orders\nADHOC exception management reporting\n\nKnowledge, Skills and Abilities:\nExpert in order management\nStrong leadership skills\nStrong analytical skills and data driven decision making\nAbility to deliver good results under pressure, accepting and meeting critical deadlines\nAbility to #CreateTheNew by challenging the status-quo\nAbility to act as a catalyst in Change Management projects/initiatives\nMotivated team player and willing to learn,\nStrong and proven analytical and communication skills with attention to details\nExperienced in logistics and supply chain management as well as project management\nCompetence, experienced and high level of IT affinity (MS Office/Teams needed / SAP knowledge is a plus)\nStrong interpersonal and communication skills including the ability to lead and influence discussions in diverse groups of varying size (internal & external)\nEnglish speaking and writing\n\nKey Relationships:\nDC & Transportation teams (Warehousing, Transport, last mile, Documentation and Clearance)\nSCM Israel\nSales & Marketing\nCustomer service\nFinance & Internal Controls - Audit\nIT & Legal\n\nMinimum Qualifications:\nDegree Level Qualification in Engineering or Supply Chain.\nMaster/Post-degree certifications in Supply Chain Management and/or Project Management and/or Engineering are preferred\n3-5 years of experience in Supply Chain, Logistics, Project management,\nProficient user of Microsoft Office applications, ERP/SAP\nExcellent skills in communication and negotiation\n\nAT ADIDAS WE HAVE A WINNING CULTURE. BUT TO WIN, PHYSICAL POWER IS NOT ENOUGH. JUST LIKE ATHLETES OUR EMPLOYEES NEED MENTAL STRENGTH IN THEIR GAME. WE FOSTER THE ATHLETE’S MINDSET THROUGH A SET OF BEHAVIORS THAT WE WANT TO ENABLE AND DEVELOP IN OUR PEOPLE AND THAT ARE AT THE CORE OF OUR UNIQUE COMPANY CULTURE: THIS IS HOW WE WIN WHILE PLAYING FAIR.\nCOURAGE: Speak up when you see an opportunity; step up when you see a need..\nOWNERSHIP: Pick up the ball. Be proactive, take responsibility and follow-through.\nINNOVATION: Elevate to win. Be curious, test and learn new and better ways of doing things.\nTEAMPLAY: Win together. Work collaboratively and cultivate a shared mindset.\nINTEGRITY: Play by the rules. Hold yourself and others accountable to our company’s standards.\nRESPECT: Value all players. Display empathy, be inclusive and show dignity to all.\n\nADIDAS CELEBRATES DIVERSITY, SUPPORTS INCLUSIVENESS AND ENCOURAGES INDIVIDUAL EXPRESSION IN OUR WORKPLACE. WE DO NOT TOLERATE THE HARASSMENT OR DISCRIMINATION TOWARD ANY OF OUR APPLICANTS OR EMPLOYEES. WE ARE AN EQUAL OPPORTUNITY EMPLOYER.\n\nJOB TITLE:\nOrder Fulfillment Analyst\nBRAND:\nadidas\nLOCATION:\nHolon\nTEAM:\nSupply Chain Management\nSTATE:\nM\nCOUNTRY/REGION:\nIL\nCONTRACT TYPE:\nFull time\nNUMBER:\n490939\nDATE:\nFeb 3, 2023Show more Report"}, {"company": "Check Point Software Technologies Ltd.", "job": "Country Manager - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=305&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22a62b9a&cb=1676383447191&jobListingId=1008350788543&jrtk=3-1-1gp83qq1mkhog801-1goosfjnegfp8800-2b767168a340a795-", "description": "Your Impact & Responsibilities\n\nWe are looking for our next Country Manager in Israel to lead our local sales organization to great things! As the country leader, you will be tasked with directly managing the local sales teams (Direct Touch and Channel Sales) as well as indirectly managing the Presales, Marketing and Finance teams. In this key role you will have the opportunity to influence employees, business partners and end customers alike, while making sure that our market share in the local cybersecurity landscape keeps growing. If you are a natural-born leader, we want you on our side!\n\nResponsibilities will include:\n\nAchieving and exceeding the sales targets for Israel\nIncreasing market penetration with the Direct Touch Accounts team\nLeading the Channels team with the development of the channel sales, enhancing the performance of the current partners and extending the market coverage through additional partners\nBuilding strong engagement and relationship with clients, the sales teams and the presales team by executing go to market programs and through account mapping and planning\nManaging pipeline generation and accurate forecasting including new solutions, projects, renewals and refresh\nPushing Security Checkups and POCs to empower direct touch relation\nContributing to increase Check Point awareness in the market place, through direct contacts with large accounts, technology consultants, specialized press and by active presence in trade shows and Check Point organized events\nBeing the brand ambassador of Check Point Israel\nDeveloping local market intelligence and competitive take-out\nDeveloping and coach all sales staff under your supervision\nYour Knowledge & Skills\nAt least 8-10 years of successful experience in IT enterprise sales and channel sales, including at least 5 years in a Team Leader / Sales Director/Country Manager / Regional Director role with direct reports responsibility\nBusiness acumen with good ability to strategize and plan as well as being hands-on when needed\nGood understanding of the IT Security market including local insight on competitors, solutions and current trends\nResult oriented and action driven\nHigh level of spoken and written business EnglishShow more Report"}, {"company": "Cognyte", "job": "Export Control Specialist", "city": "Herzliya", "date": "7d", "rating": "3.9", "link": "", "description": "At Cognyte we create mind-blowing investigative analytics software to speed up investigations and allow customers to detect and respond to real security threats like terror, crime, fraud, cyber threats, crypto crime, and more.So, if you want in on the action, let’s talk!You’ll make an impact onCooperating with different stakeholders within the company, as well as acting as a connecting thread between Cognyte and the Ministry of DefenseSupporting the company’s registration in Defense Export Control Authority (DECA) and handling marketing and export requests as well as encryption licenses.Training company employees, according to DECA guidelines, together with internal company policiesManaging and updating the company's databaseWorking in a team, participating in professional discussions, and being a part of different projectsWorking in a changing and evolving dynamic environmentRequirements:Your tool boxAssertiveness and MotivationAbility to lead independent processesExcellent human relationsTeam worker and a fast learnerCommercial awareness, responsible and accurateOrganization skillsExcellent English – spoken and writtenTechnological background - an advantage*Why Cognyte is your perfect match*We’re a values-driven business with a strong passion for innovation that makes a meaningful impact on the world around us. We are calling out to YOU - the curious minds of the world, who are looking to break new ground and bring innovative ideas to life.If this describes you, we could be your perfect match!Curious? Apply now.Career Page:People, Finance & LegalJob Type: Full-timeShow more Report"}, {"company": "ZIM", "job": "Tax Assistant", "city": "Haifa", "date": "1 day ago", "rating": "4.4", "link": "", "description": "We are looking for a Tax Assistant that will directly supports the Global Tax Director with tax compliance, research, planning, provisions, and audits. This position manages Israeli direct and indirect tax compliance on a monthly, quarterly, and annual basis. Responsibilities will include reconciliations, calculations, document preparation and filing, as well as maintaining matrices. Also responsible for some aspects of international tax compliance management and reporting.\nReporting & Compliance\nResponsible for completion of income tax returns work papers including all related analysis.\nResponsible for completion CbC and MF report work papers including all related analysis\nPrepares income tax accounting records and reports in accordance with applicable tax accounting practices, including analysis of Uncertain Tax Positions.\nTax consulting & Audits\nAssist to manage audits conducted by local / external financial auditors and tax authorities (Income tax, WHT, Payroll tax, VAT).\nAssist payroll group, as needed, to understand payroll tax matters on a global basis\nTax planning & Strategy\nPrepares spreadsheets to assist with understanding global tax impacts related to business expansion, re-structuring and general planning matters\nAssists with research of income tax considerations on a transactional basis\nAssist the management in estimating and monitoring annual cash taxes.\nTax Accounting\nAssist with accounting for income taxes (SFAS No. 109 / IAS12).\nPrepares tax footnote, including quarterly disclosures\nPrepares income tax accounting records and reports in accordance with applicable tax accounting practices, including analysis of Uncertain Tax Positions (UTPs)\nMaintains all income tax accounting balances and schedules\nEnsuring that appropriate internal controls are in place over accounting for income taxes.\n\nRequirements:\n \n5 years as a Certified CPA – BIG4\nTAX related experienceExperience with ERP systems and highly proficient with Excel.Strong research and problem-solving skills Demonstrated ability to prepare and maintain appropriate tax documentation on a quarterly, and annual timeline\nFunction:\n\nFinance\n\nPublish in Internal Career Page:\n\nNoShow more Report"}, {"company": "General Motors", "job": "Finance Controller - Maternity leave", "city": "Herzliya", "date": "24h", "rating": "4.1", "link": "", "description": ""}, {"company": "ธนาคารไทยพาณิชย์", "job": "Associate/Principal, Venture Capital (SCB10X)", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=309&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2e4b6cd2&cb=1676383452571&jobListingId=1007017962825&jrtk=3-1-1gp83qvagihlg801-1goosfjnegfp8800-b438ad8ddee20f6f-", "description": "สมัครโปรดคลิกที่ปุ่ม \"Apply\"\nIf you are an active SCB employee, please apply through Workday by searching \"Find Jobs\".\nIf this is your first time applying you will need to create a candidate account when you click on apply.\nJob Description\nPerform Due Diligence on Venture Capital Investment\nGather information from target company and industry experts\nDo research on the existing references and customers of the target company\nExplore and research potential competitors to the target company\nWork closely with technical/business consultants to evaluate the target company including IPs\nConduct background checks on the current management of the target company\nDevelop financial modelling and valuation analysis and prepare internal investment memo\nPerform market research to help identify new investment trends and opportunities\nManage deal screening; call and/or meet with prospects, evaluate opportunities\nSummarize documentation; call notes, enter deals into CRM\nConnect business network with peers in other Venture Capital Firms\nPerform monitoring and reporting of portfolio companies\nQualification:\nBachelor’s Degree or higher in Business, Finance, Engineering, Accounting discipline preferred\nAt least 5 years’ experience in Venture Capital or related field\nExperience in Investment experience and/or due diligence\nUnderstand both technical and business concepts quickly and effectively with business acumen\nWe're committed to bringing passion and customer focus to the business.\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us.Show more Report"}, {"company": "Applied Materials", "job": "Operational Excellence Program Manager", "city": "Rehovot", "date": "13d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=310&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e94f633d&cb=1676383459691&jobListingId=1008428739030&jrtk=3-1-1gp83r138ncch801-1goosfjnegfp8800-a01c524f2e116cad-", "description": "We are looking for a leader to create and maintain Operational Excellence culture within Applied Materials Israel, and lead the way for Operations to achieve productivity and performance goals\nWhat’s in it for you?\nEnable Applied Materials Israel continuous growth while improving financial results and competitiveness\nMonitor and share Operations Key Performance and Cost indicators vs. desired goals\nLead the way for Operations to achieve productivity and performance goals, identify the potential areas for improvement and what needs to be done to achieve the financial goals\nEngage/Align with Applied Materials Israel overall goals and missions – lead SR and AOP cycles within operations\nReflect Operations’ strategic projects/initiatives progress towards the key goals (QBR, QOR)\nProvide the methods and tools that enables operational excellence – foster lean culture, develop Ops University, lead internal and external benchmarks, nurture universities relations and innovations\nDrive & Manage Cost Related projects\nO ur group:\nOps Strategic Programs group enables continuous growth of large scale ‘mode of operations’ while driving the organization to be cost-efficient, providing roadmap and tools to achieve productivity goals.\nWhat should you have?\nBSc/MSc in Industrial Engineering, Economy, or MBA\nOver 7 years’ experience in the industry, specifically in operations or finance\nKnowledge in Operational KPI and financial aspects\nExperience in leading cross-organizational projects/processes to long term growth and operational productivity improvement\nKnowledge & experience in Lean and continuous improvement methods\nStrong analytical and problem-solving skills, out-of-the-box thinking\nLeadership skills and mindset – Visioning, cares to make and lead change, proactive thinking, see the greater picture, drive to global optimization, conflicts management\nExperience in project management and portfolio management\nStrong communication skills – Verbal and Written, presentation, building and conveying the right messages to a given audience\nIndependent in work, self-motivated, welcome feedback, drive for continues Improvement\nTeam player – ability to work with wide global teams, good interpersonal skills\nWho we are?\nApplied Materials Israel is home to the Process Diagnostics and Control business unit (PDC). Based in Rehovot, we develop, manufacture and market cutting-edge machine learning and computer vision-based metrology and inspection products that are essential elements in wafer fabrication. By playing a significant role in enabling the production of the next generation of microchips, our expertise enables our customers to transform possibilities into reality.\n#LI\nQualifications\nEducation:\nBachelor's Degree\nSkills\nCertifications:\nLanguages:\nYears of Experience:\n10 - 15 Years\nWork Experience:\nAdditional Information\nTravel:\nYes, 10% of the Time\nRelocation Eligible:\nNo\nApplied Materials is an Equal Opportunity Employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, citizenship, ancestry, religion, creed, sex, sexual orientation, gender identity, age, disability, veteran or military status, or any other basis prohibited by law.Show more Report"}, {"company": "Mobileye", "job": "Operation Manager for Sales Team", "city": "Jerusalem", "date": "7d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=311&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ae46c9ce&cb=1676383460923&jobListingId=1008443679409&jrtk=3-1-1gp83r7fli3bf801-1goosfjnegfp8800-ab173095f8841a15-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nThe Sales Operation Manager provides vital support to the Company’s sales team. The successful candidate will maintain the sales pipeline, process orders, assist management with forecasting, and act as an extension of the sales team. An efficient Sales Operation Support contributes to quality customer service and helps the sales team meet its targets. The candidate will collaborate with team members in Sales, Operations, Finance and Mobileye's clients to ensure flawless customer service. The sales operation manager will maintain the data integrity and accuracy in the Company’s information systems.\nwhat your job will look like:\nAdminister and maintain the Sales Team Pipeline and data in Salesforce, provide a business overview and accurate sales revenue\nMaintain and monitor all sales reports and work with the team to ensure all payments and POs are on track\nCollaborate with logistics department to ensure timely deliveries, and identify potential delivery issues in advanced\nWork with Finance & logistics departments to setup new customers, escalate overdue invoices and approve part numbers for orders\nMaintain updated price lists and reference documentation for the sales team\nAssist the Sales Team with Salesforce data entry and maintain sales records\nWork with management to create and improve Salesforce dashboards and reporting\nWork closely with Mobileye’s Salesforce Administrator team to improve processes and ensure Salesforce efficiency\nAlert representatives regarding urgent issues and update them on order status and delivery details so they can keep customers informed\nDistribute weekly sales activity reports to the relevant team members\nProvide periodic reports on various activities\nProcess customer purchase orders\nPrioritize tasks\nAll you need is:\n B.Sc. in industrial engineering and management or information systems\n2 years of experience as Sales Operation Manager or equivalent experience\nProficiency in Salesforce – a must (NetSuite- advantage)\nExperience in BI systems- a must (power BI, Qlik sense etc.)\nExcellent administrative and record keeping skills\nExcellent communications, interpersonal and customer service skills\nExcellent written and verbal English\nAccuracy and attention to detail along with great organizational skills\nProficient in MS-Office Suite\nA team player\nAbility to Work under pressure\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Barclays", "job": "Director - Global Markets", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.0", "link": "", "description": "Barclays Overview\nBarclays is a British universal bank. We are diversified by business, by different types of customers and clients, and by geography. Our businesses include consumer banking and payments operations around the world, as well as a top-tier, full service, global corporate and investment bank, all of which are supported by our service company which provides technology, operations and functional services across the Group.\n\nWe are an equal opportunity employer and we are opposed to discrimination on any grounds.\n\nDynamic working gives everyone at Barclays the opportunity to integrate professional and personal lives, if you have a need for flexibility then please discuss this with the hiring manager.\n\nAbout Macro\nUnderstanding the interconnectivity between Interest Rate and FX markets has become increasingly important to both our institutional and corporate clients. Our Macro business combines coverage of these asset classes to respond better to their needs.\nAbout Credit Structuring\nCredit Structuring sits within Markets and is part of the Cross Asset Sales and Structuring division. The group provides best-in-class structuring expertise to clients and internal stakeholders in the Credit Trading business in the context of a wide range of transactions, including structured financing, CLOs, credit linked notes and other exotic credit products.\n\nAbout EM Origination\nThe EM origination team is responsible for covering local markets clients with a cross-asset class mandate on both developed market and Emerging markets products. To achieve this, the team works cooperatively with various functions including trading, structuring, legal and compliance across the value chain to deliver a seamless execution to clients while factoring in the regulatory, market, credit, legal and cross-border considerations\n\nOverall purpose of role\n\nOversee sales and origination for Israel.\nKey Accountabilities\nWork with the EM Origination, Structuring and Trading teams to originate structured finance transactions in specificized coverage region.\nIncrease the client footprint by developing new relationships especially with EM sovereigns and quasi sovereign entities as well as other state-owned corporations\nParticipate in defining the Origination strategy for EMEA, generating new initiatives and enhancing the product offering based on latest market dynamics while managing financial resource consumption and credit limits\nBe responsible for updating the Credit Risk team on credit limit utilisation rates and the pipeline\n\nStakeholder Management and Leadership\nKey stakeholders and relationships:\nSales, trading and structuring partners within the Macro & Credit businesses\nInfrastructure partners in Operations, Legal, Credit and Onboarding\nIB, CB and PB coverage bankers\nSovereigns, Corporates, Funds, Investment Companies\nDecision-making and Problem Solving\nRequires strong judgement and analytical skills\n\nRisk and Control Objective\nEnsure that all activities and duties are carried out in full compliance with regulatory requirements, Enterprise Wide Risk Management Framework and internal Barclays Policies and Policy Standards\n\nPerson Specification\nStrong interest in business and finance\nResourcefulness, team-orientation, enthusiasm and an entrepreneurial spirit\nSignificant industry experience with multilateral banks, project finance and the public sector\nEntrepreneurial. Must be able to form strong relationships and be collaborative with Front-office and Infrastructure teams\nPassionate, motivated and resilient\nExcellent written and oral communicator in English and other local languages.\nStrong analytical and quantitative skills\n\nEssential Skills/Basic Qualifications:\nBachelor’s degree in Finance, Business Administration, Economics, Financial Engineering or closely related field\nExperience in Origination and Project Finance\nExisting client base in Sub Saharan Africa and other EM markets especially with the Sovereign and Quasi-Sovereign Entities\nSME in local business practices/culture. Knowledge of local languages.\n\nDesirable skills/Preferred Qualifications:\nMaster’s Degree in Finance, Business Administration or Public Administration\nSolid experience in Origination and Project Finance in CEEMEA\nExisting client base in CEEMEA especially with the Sovereign and Quasi-Sovereign Entities\n\nRegulated Role\nFCA certification\nThis role is deemed as a Certified role under the PRA & UK Financial Conduct Authority - Individual Accountabilities Regulations and may require the role holder to hold mandatory regulatory qualifications or the minimum qualifications to meet internal company benchmarks.\n\nBarclays Values & Diversity\nDynamic working gives everyone at Barclays the opportunity to integrate professional and personal lives, if you have a need for flexibility then please discuss this with the hiring manager. We are an equal opportunity employer and we are opposed to discrimination on any grounds. It is the policy of Barclays to ensure equal employment opportunity without discrimination or harassment on the basis of race, colour, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, veteran status, genetic information, or any other basis protected by law.\nPurpose and Values\nOur purpose is creating opportunities to rise. We support sustainable and inclusive growth by connecting the ideas, innovations and aspirations of our customers and clients to the capital that can bring them to life. For over 325 years we have funded progress, and today we remain committed to helping make our world more sustainable, more inclusive and more connected.\n\nOur values underpin everything we do: Respect, Integrity, Service, Excellence and Stewardship.\n\nRespect\nWe respect and value those we work with, and the contribution that they make.\nIntegrity\nWe act fairly, ethically and openly in all we do.\nService\nWe put our clients and customers at the centre of what we do.\nExcellence\nWe use our energy, skills and resources to deliver the best, sustainable results.\nStewardship\nWe are passionate about leaving things better than we found them.Show more Report"}, {"company": "Millennium Management LLC", "job": "Quantitative Researcher", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=313&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_89df0ecb&cb=1676383463958&jobListingId=1007903520665&jrtk=3-1-1gp83raerj4it801-1goosfjnegfp8800-be1a414df78c944d-", "description": "Quantitative Researcher\nWe are assembling a strong Quant Technology team to build our next generation of in-house analytics and trader support tools. This team will develop and maintain the in-house models and pricing libraries to support trading in Fixed Income, Commodities, Credit and FX derivatives, leveraging state-of-the-art mathematical modelling and financial engineering methods to provide our traders with the best analytics and support tools in the business.\nCandidate will need to have strong mathematical education (probabilities, statistics, calculous, etc) to understand, implement and develop state-of-the-art pricing models.\nWe generously reward hard work and outstanding performance, offering a unique opportunity for personal growth and building one’s career path in the lucrative and exciting world of global finance.\nThis is a singular opportunity to join one of the top hedge funds in the world and enter the fast-growing world of FinTech, learning from the best in the field how it is done at the highest levels. No prior experience in finance is required. We offer a dynamic environment and a culture that nurtures learning and growth, with excellent international opportunities.\nResponsibilities:\n Develop fixed-income pricing and risk analytics for our in-house pricing library\nDevelop pre-trade analysis tools for Portfolio Managers\nHelp maintain and enhance our C++ financial analytics library and derivative pricing and risk framework\nMandatory Requirements:\n1 - 2 years of C++ work experience\nStrong analytical and mathematical skills\nStrong problem solving capabilities\nB.A. with a strong quantitative training such as Math, Physics, Computer Science or Electrical Engineering with high grades\nVery strong English written and verbal skills. It is essential the candidate can clearly and fluently communicate in English\nSolid communication skills.\nAble to work independently in a fast-paced environment.\nDetail oriented, organized, demonstrating thoroughness and strong ownership of work\nExperience working in a production environment.\nAdditional valuable skills (nice to have):\nExperience with financial mathematics and derivative pricing.\nExperience in the financial industry\nExperience with Python\nAn M.A. or PhD degreeShow more Report"}, {"company": "Tailor Brands", "job": "Financial Controller", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "4.3", "link": "", "description": "With over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone - we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nJoin our Finance department to oversee all financial aspects of the company, including general accounting, month close, business support, tax returns, audits, operations, cash management, payroll and much more\nAnalyze financial results (monthly, quarterly, and annual reports) with respect to cash burn, trends, costs, and compliance with budgets\nPrepare investors and management periodical packs\nCash management and cash projections\nEquity related matters, including managing the cap table, option plans etc.\nInteract with other departments to provide consultative support for planning initiatives through financial analysis, reports, and recommendations\nWork with the Company’s external auditors and ensure the timely and accurate filing of the Company’s financial reports\nPrepare tax returns and other statutory reports, including tax planning\nEnhance and implement financial and accounting system processes, tools, and controls\nRequirements:\n\nProfessional certification (CPA)\nInternship from one of the Big 4 firms\nAt least 2 years of experience as an assistant controller/controller in a global high-tech company - Startup is a big advantage\nGreat communication skills and ability to collaborate with other departments and external 3rd parties\nExperience in preparing financial statements according to US GAAP\nAbility to prioritize tasks, meet deadlines, well organized and function as a team member to accomplish job roles\nGreat attention to details and problem-solving skills\nSuperb written and verbal communication skills both in English and Hebrew\nWorking knowledge of MS Office (especially Excel) and Priority accounting software - Advantage\nFamiliarity with SaaS metrics (especially in B2C) - an advantageShow more Report"}, {"company": "NNG LLC", "job": "SDR and Sales Ops", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=315&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_222c188e&cb=1676383466562&jobListingId=1008124264923&jrtk=3-1-1gp83rcuoi6gq801-1goosfjnegfp8800-75717af82e4d5bc5-", "description": "Arilou in a Nutshell\nArilou is the pioneer of cyber-security solutions for the automotive industry. Innovation is part of who we are, and every moment is invested in creating cutting-edge technology. In 2019 we were awarded Frost and Sullivan’s Best practices Award for Technology Innovation.\nAs the first company to introduce in-vehicle network security systems, Arilou continues to push the limits of automotive cyber security and is constantly evolving. A growing list of partnerships featuring OEMs (car makers) and many other industry leaders, including ARM, STMicroelectronics, Alpine Electronics, and Green Hills Software, offers a wide range of challenges.\nWe are looking for top talent to join our team, and work at the leading edge of automotive cyber-security research and design.\nJob description:\nThis position is a unique opportunity enabling you to combine a an SDR & Sales operations r responsibilities\nProactively seek new business opportunities in the market, qualify the leads, and present the company’s product to potential clients.\nCreate and manage lead generation campaigns via different channels; communicate with prospects through LinkedIn, cold calls, and emails.\nDevelop and execute lead generation strategies to schedule a targeted number of appointments for the sales team.\nImplement call scripts, campaigns, email pitches, and other outreach to improve leads generated.\nAccomplish meaningful metrics and reports to measure productivity and quota attainment.\nMaintaining database records.\nRaising Invoices, sales orders, and quotations.\nAnswering sales team queries and Supporting the Sales and Marketing users with all ERP-related requests.\nNew users training and implementing new procedures.\nMonitoring ongoing orders, payments, and shipping.\nEnforce Sales procedures.\nWork closely with the Finance team on revenue recognition and related transactions.\nRequirements:\nHigh level of English – must. Additional languages – advantage.\nProven work experience as an SDR/BDR of at least 1 year, Sales Ops experience – An advantage\nUnderstanding of sales performance metrics.\nA team player with a high level of dedication.\nBe comfortable speaking with decision-makers via various mediums (social, email, phone, and video).\nExcellent verbal and written communication skills.\nHands-on experience with CRM- Must, email automation tools, Excel, and data analysis.\nExpertise in the APAC, US, and western Europe enterprises – advantage.\nExperience in the IoT/OT cyber – advantage.Show more Report"}, {"company": "OrCam", "job": "Europe Regional Director", "city": "Jerusalem", "date": "15d", "rating": "3.6", "link": "", "description": ""}, {"company": "Elementor", "job": "Senior Product Analyst", "city": "Ramat Gan", "date": "6d", "rating": "4.1", "link": "", "description": "We are looking for a sharp and highly analytical Product Analyst to join our fast-growing company and help us make data-driven decisions for performance optimization.\nAs a Product Analyst, you will play a key role in shaping Elementor's product and business strategy, defining our KPIs, and identifying business opportunities.\nAs a member of the Analytics team in our Data department, you will work across the organization and provide key insights to multiple departments (Marketing, Product, Finance, Business Strategy, CX, and more), helping them focus on what’s important.\nThis position is located in Israel only.\nRequirements:\n\n4+ years of experience in quantitative analysis, preferably at an internet company\nExcellent communication skills with the ability to deliver results of analyses clearly and effectively\nExcellent SQL skills - a must\nExperience with at least one of the following visualization tools: QlikView, Qlik Sense, Power BI, Tableau - a must\nStrong Python capabilities - a major advantage\nExperience working with big data tools: Redshift, BigQuery, Databricks, etc. - a must\nA highly independent and creative team player who works well with others\nHands-on technical experience with Google Analytics, Google Ads, and Facebook Ads - an advantage\nWork Environment:\n\nWhat do we do?\nElementor is the leading website building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 12M websites powered by Elementor. More than 8% of all websites around the world are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe believe in empowering both our employees and our users.\nElementor is a place where you can truly grow professionally and personally.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey. We take great pride in Elementor's constant scaling.\nResponsibilities:\n\nWork with various managers to learn their business insight needs, including tracking metrics, dashboards, and reports\nAct as a bridge between units’ business needs and the BI department, ensuring high-quality execution quality, data integrity of analyzed insights, and reporting deliverables\nEstablish reporting methodologies and cross-department standards\nGo beyond the numbers to communicate, influence, support, and execute business decisionsShow more Report"}, {"company": "Diageo", "job": "Manager, Field RGM – Strategic Accounts", "city": "Central", "date": "21d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=318&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_efcb6042&cb=1676383470271&jobListingId=1008414623788&jrtk=3-1-1gp83rgjgklto801-1goosfjnegfp8800-c0096a3e99801582-", "description": "Job Description :\nAre you looking to play a pivotal role in attracting the next generation of best-in-class talent for one of the worlds most respected fast moving CPG’s?\nDiageo is a global leader in beverage alcohol with an outstanding collection of brands including Johnnie Walker, Crown Royal, Bulleit and Buchanan's whiskies, Smirnoff, Cîroc and Ketel One vodkas, Captain Morgan, Baileys, Don Julio, Tanqueray and Guinness.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. It is central to our purpose to celebrate life, every day, everywhere.\nWe are a global leader in beverage alcohol with an outstanding collection of brands across spirits and beer! We produce an assortment of over 200 amazing brands – old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world!\nDiageo is listed on both the New York Stock Exchange (DEO) and the London Stock Exchange (DGE). For more information about Diageo, our people, our brands, and performance, visit us at www.diageo.com. Visit Diageo's global responsible drinking resource, www.DRINKiQ.com, for information, initiatives, and ways to share standard methodology.\nManager Field RGM – Strategic Accounts\nKey Outputs/Deliverables\nEnsures the DIAGEO US Spirits pricing agenda and related NRM processes run efficiently in order for Diageo to optimize Diageo NA NSV / GP growth\nIdentifies key market level RGM opportunities\nImproves trade spend efficiencies in order to drive net revenue and profitability for DIAGEO\nDrives internal and external organizational capabilities, processes, and tools in the NRM space in order to accelerate data insights into commercial action\nPerformance Management\nDeliver RGM value through price and mix that is ahead of the industry\nLeads the development of annual discount plans, and promotion calendar\nDrives Strategic Account level RGM Optimization Missions\nImplement price direction for both headline price and promotional guidelines in strategic accounts\nFacilitate monthly strategic account reviews\nReview and approve gap close programs and communicate impact to central finance\nEnsure team is using system based M&E tool to make data backed decisions in gap close process as well consistent post M&E reviews\nLeverage TRAX, Nielsen, and NABCA data to inform annual price planning process as well as retailer profitability\nWorks with distributor and central Rev Mgmt team to identify pricing opportunities\nLeads development, maintenance and communication of price changes and promotional calendars.\nAnalytics\nCreates insightful and practical monthly analysis of pricing results\nReviews trends and competitive activity throughout the year to identify additional suggested pricing opportunities or risks\nDrives deal level analytics, Diageo / Distributor suggested margin analysis, conduct project based analytics and scenario planning to make informed suggested pricing recommendations\nResolves distributor inquiries on pricing process/data/reporting analytics\nSystems\nPrice Model Administration - maintain frontline price changes, support calendar, suggested price models and local pricing data (taxes, freight, etc) – multiple systems: VIP/DO, RM/Anaplan, MSBI, AIP/Qlik\nExperience:\nUndergraduate required; MBA preferred\nMust have 3-5 years of cross functional commercial experience, with strong analytical and technical skills.\nProven track record of being able to manage and influence a wide array of senior leaders\nHave sophisticated skills in analytics and data insights. Must understand and apply data analysis to drive effective portfolio strategies and business performance. Must know how to use and implement metrics to measure performance\nWorker Type :\nRegular\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2023-01-18-08:00\nSalary Range:\nMinimum Salary:\n$105105\nMaximum Salary:\n$175175\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US-based employees are eligible for healthcare benefits, retirement benefits , short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.Show more Report"}, {"company": "ZIM", "job": "Advocate", "city": "Haifa", "date": "30d+", "rating": "4.4", "link": "", "description": "We are looking for an Advocate that will handle the following:\nMain Purpose of the Role\nLegal review of the company’s maritime contractual engagements’ documentation, including improving and drafting of same, mainly on responsibility, liability and indemnification aspects\nLegal Review of Company’s Contracts\nIdentify and provide analysis of legal risks in contracts, insurance policies/certificates and LOI that expose the company to greater liability and responsibility, as well as indemnification and insurance obligations and provide legal solutions\nNegotiate contract terms and insurance cover terms with vendors and suggest legal solutions\nMonitor the implementation of the suggested solutions towards signing the contract\nLegal Support to Company’s Units in Liability and Insurance Related Issues\nAdvising the relevant company units in regard of liability and insurance related issues (DG, claims, procurement, Key accounts, Administration, HR, etc.)\nAssisting in improvement of the company’s procedures\nImproving Company’s Standard Wordings\nStriving to improve the company’s standard contract wording in accordance with the developments in the industry and to implement the standard wording in contracts.\nRequirements:\n\nAcademic education: L.L.B. M.A- Advantage.\nCertified lawyer in Israel, admitted to the Israeli Bar Association\n2 years’ experience working on commercial contracts including interface with clients and negotiating\nExperience in a global company – an advantage\nKnowledge of insurance - an advantage\nStrong negotiating skills\nExcellent English level written and spoken, including high ability to negotiate and present in English and knowledge of legal terms in English\nFunction:\n\nFinance\n\nPublish in Internal Career Page:\n\nNoShow more Report"}, {"company": "ธนาคารไทยพาณิชย์", "job": "E-Commerce Business Development Manager (SCB10X)", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=320&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ef1b0630&cb=1676383472692&jobListingId=1006933644952&jrtk=3-1-1gp83rj03kbl2801-1goosfjnegfp8800-9ad49da3ec3a0b90-", "description": "สมัครโปรดคลิกที่ปุ่ม \"Apply\"\nIf you are an active SCB employee, please apply through Workday by searching \"Find Jobs\".\nIf this is your first time applying you will need to create a candidate account when you click on apply.\nJob Description\nDevelop and implement innovative beauty E-commerce marketing, merchandising, pricing, profitable sales strategy, and programs to drive joint business plans and exceed sales objectives\nDevelop and coordinate distribution programs to reduce costs and provide exceptional customer service\nControl sales budget and promotion expenses to contribute to profitable objectives and investments\nServe as liaison between beauty E-commerce contacts, sales team counterparts and internal support team members to foster culture of growth and collaborations\nAnalyze and interpret beauty E-commerce trends and demographic data with project short-term forecasts out 2-3 years to ensure action plans meet future demands\nPerform strategic analyses, and design strategic business presentations tailored to achieve realistic customer performance, and support planning process with proficient in business and financial/budget analysis with an understanding of omni-channel dynamics, insights, and profitability metrics\nQualifications:\nBachelor’s degree or higher in Business Administration, Finance or related field\nAt least 3 years of experiences in business, customer management and customer development to beauty E-Commerce industry\nUnderstanding of beauty E-commerce dynamics and class of trade strategies, including new and emerging areas within the omnichannel space. Knowledge supply and demand, including integrated customer business planning process and operations of Business Planner software\nPassion for driving E-commerce growth is a must with results, strategy and vision orientation\nUnderstanding of Sales, E-commerce sales, cross-functional, persuasive, prioritization and time management, resources and team management, complex problem solving, active listening, coaching, adaptability, and social perspectives\nStrong oral and written communication with building relationships\nWe're committed to bringing passion and customer focus to the business.\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us.Show more Report"}, {"company": "NICE", "job": "Corporate Partners Director", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "", "job": "Assistent Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=322&ao=1110586&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4af68900&cb=1676383475058&jobListingId=1008336722641&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83rl8bkcml801-1goosfjnegfp8800-2ef3e6eea696b16d--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiND6v8RYfoEeWxBI7ZqGWN1UlgGtZT0MeK0SXYB5FYt1gsyzCTK7y6Gv1SnGv-LalNk3-PxzybKW4391b81Z6etKEEJzSEFbyDvUlsYiXkKYRr1Uu9xINzmjZ3DMpiFDnVO3A0LK0FbEeu9muA50qlwqTO9ua5_wflck_7GpW7gY7CUJkGai-4Q9szb7K5WmbSLLsina8g-CU6aUrZ3xwWbHhDV8ACA7jZAMTQY-_sXA_X72LQm7jFUar-605vWasdYS9O8Vbx230oGxdMcJLbLHTQE00pY6o6qbVmC65lgJlrcE396th_DtKBhogGsCqDH4Zq5ot923S3_gQEsDdhk7rabe8j9egBCH47S9OgMOvQ0T46Fsq6ghByLjXHlNX-OCAzDnZ2Ns5uGEal6iCNWE7Yz9N-IWf3WutncNIkq3ged8OdgxLFrs86Fdp3g7htOcPFcp3RTAPH58ZzX2Wx9CXz5y89vOJZFqI5vQ6L0C-LyTYyWIsxRXZqzO4ckUja3hwsehYBiEj3KXVq0lCMJAXk8INC_LZjlNtaJr9zBTwMZeWn8C6lqssbBgIta-E55JleUpx3Fb7qSEmP6B12R-fOmtPzeW5Dx8JTkY1ODzYbpxCkhZ4QzwF0xs23wSE5cWhxLJMo6nWsxXtfUDsNX0", "description": "Consumer-tech company in Tel-Aviv is lookomng for an Assistant Controller Main Responsibilities: • Manage and monitor all accounts, ledgers, and reporting systems, ensuring compliance with applicable GAAP standards. • Assist in the monthly and quarterly closing process, including preparing working papers, calculating accruals, tax calculations, preparing reporting packages, and performing analytical procedures. • Provide comprehensive financial updates to management by evaluating, analyzing, and raising flags as needed. • Plan, develop and implement new financial working processes and procedures within the finance team.\n\n\nManage the Company's cash flow. • Work with the Company's external auditors on quarterly reviews and annual audits • Undertaking ad-hoc corporate financial tasks • CPA with 1-2 years of experience • Bachelor’s degree in Accounting from a university or a leading college - must • Excellent English (writing and speaking) - must • Background from one of the BIG 4 – must\n\nShow more Report"}, {"company": "סיגמא HR", "job": "Senior financial Analyst", "city": "Southern", "date": "5d", "rating": "", "link": "", "description": "לחברת הייטק גדולה ומבילה דרוש/ה Senior financial Analyst Developing financial models and methodologies based on historical data and forecasting based on a variety of specific operating parameters. Introduce new models, KPIs, trends estimation and analysis Analysis, identification and gathering of data requirements for model tracking and derivation. Appropriate sensitivity and scenario analysis help assist investment decisions. Take leading part in the company’s portfolio analysis process.\n\nResponsible for Cashflow modeling and forecast Be the focal point for complex financial modeling, providing value-added insights to management to support business decisions. Partner with the relevant Executive Management to support decision-making and provide insights. Requirements: Bachelor's Degree in Economics or Finance, MBA is an advantage 6+ years of relevant experience including modeling, forecasting, and financial analysis Deep understanding of accounting concepts (Rev Rec, CF, accruals, etc.) Strong analytical skills with an emphasis on high-level Excel A high level of commitment and motivation Able to meet tight deadlines and has multitasking abilities High standards of accuracy and precision; highly organized Ability to think creatively and self-motivated Passionate about automation, efficiency and tools Strong communication and interpersonal skills Excellent analytical, decision-making, and problem-solving skillsShow more Report"}, {"company": "Google", "job": "Product Manager, Data Movement, Google Cloud", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "4.5", "link": "", "description": ""}, {"company": "Adidas", "job": "HR Data Specialist (Temp)", "city": "Holon", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=325&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_181404d2&cb=1676383479370&jobListingId=1008331311019&jrtk=3-1-1gp83rpgipke0801-1goosfjnegfp8800-212d24ce8ea3a0be-", "description": "Purpose:\nAs part of the HR services team, provide support in all administrational tasks and processes as part of the Service Catalogue. Support and assist in undertaking all HR related tasks to ensure we are delivering best in class HR support and quality service to our business partners, line managers, and employees.\nKey Responsibilities:\nMaintain current HR systems and Data and be responsible for data accuracy management\nResponsible for monthly local and global reporting activities including non-payroll relevant data audits and standard reporting\nTracking of paperwork and employee eFile maintenance\nExecute seamless on-boarding and exit processes of employees in the respective business areas including facilitating all necessary process steps.\nSupport all administrative tasks with regard to employee changes, such as issuing new letters or other required documents\nFirst point of contact for employees and line managers for all standard questions (or re-routing to payroll/benefits). Processes and answers all incoming tickets, phone calls and emails within the scope of service catalogue.\nProblem-solving skills\nWork closely with Payroll department to ensure employee data integrity\nOwnership of ticketing for respective HR Management and business area.\nPartners to ensure constant and proper information flow. Process requests timely to meet deadlines in accordance with service level agreements (SLAs).\nKeep knowledge base up to date in close cooperation with all HR Services Specialists\nHigh level of Hebrew and English – a must\nKnowledge, Skills and Abilities:\n\nSAC RFC Light monthly submission\nEnsuring the alignment of HRBP and Finance team for FTE's\nChange request Management - from HRBP's and Managers\nHR Data management - cleaning and maintaining Employee database for Israel\nSupporting HRBP, TA, Talent and Rewards Team with any data related query/requirement\nSupport GBS implementation in Israel by providing support in terms of Data/Report\nCreate and maintain New templates wherever required\nCreating Dashboards to present the HR Key Metrices in a PPT/PowerBI\nHelp the team in automating their daily tasks through available tools (MS Office, Power Platforms etc.)\nSupporting EM HUB Team with any data/report request for Israel as a HR Data Champion\nExcellent interpersonal skills & Customer Service attitude\nExcellent verbal and written communication in English\nExcellent organization skills with a strong attention to detail\nAble to prioritize multiple tasks simultaneously\nEnergetic, proactive manner and action oriented behavior\nAbility to multi-task and prioritize workload in a fast paced environment.\nStrong interpersonal and relationship building skills.\nAbility to set clear goals and deliver into key objectives with minimal supervision.\nAction oriented and proactive approach to working with hiring managers, HR teams.\nAbility to exercise good judgment and decision making skills. Able to manage confidential and sensitive information and use appropriately.\nAdvanced SAP-HR and MS Office skills and experience in applicant tracking systems\nAbility to communicate effectively in English, both written and oral.\n\nKey Relationships:\nHR Business Partners (Junior Management up to Senior Management)\nHR Services & Rewards Teams\nHR Management & Talent Acquisition\nLine Managers\nEmployees\n\nMinimum Qualifications:\nUniversity degree\nMinimum 3 years of experience as HR Specialist / Junior HRPB – a must Fluent in labour law – a must\nSpecialization in HR world preferred.\nStrong MS-Office (MS-Excel, MS-Word, MS-PowerPoint) user-knowledge\nHigh level of Hebrew and English\nSAP-HR - a Must\nStrong proficiency with technology and grasping new technology solutions\n\nAT ADIDAS WE HAVE A WINNING CULTURE. BUT TO WIN, PHYSICAL POWER IS NOT ENOUGH. JUST LIKE ATHLETES OUR EMPLOYEES NEED MENTAL STRENGTH IN THEIR GAME. WE FOSTER THE ATHLETE’S MINDSET THROUGH A SET OF BEHAVIORS THAT WE WANT TO ENABLE AND DEVELOP IN OUR PEOPLE AND THAT ARE AT THE CORE OF OUR UNIQUE COMPANY CULTURE: THIS IS HOW WE WIN WHILE PLAYING FAIR.\nCOURAGE: Speak up when you see an opportunity; step up when you see a need..\nOWNERSHIP: Pick up the ball. Be proactive, take responsibility and follow-through.\nINNOVATION: Elevate to win. Be curious, test and learn new and better ways of doing things.\nTEAMPLAY: Win together. Work collaboratively and cultivate a shared mindset.\nINTEGRITY: Play by the rules. Hold yourself and others accountable to our company’s standards.\nRESPECT: Value all players. Display empathy, be inclusive and show dignity to all.\n\nADIDAS CELEBRATES DIVERSITY, SUPPORTS INCLUSIVENESS AND ENCOURAGES INDIVIDUAL EXPRESSION IN OUR WORKPLACE. WE DO NOT TOLERATE THE HARASSMENT OR DISCRIMINATION TOWARD ANY OF OUR APPLICANTS OR EMPLOYEES. WE ARE AN EQUAL OPPORTUNITY EMPLOYER.\n\nJOB TITLE:\nHR Data Specialist (Temp)\nBRAND:\nadidas\nLOCATION:\nHolon\nTEAM:\nHuman Resources\nSTATE:\nM\nCOUNTRY/REGION:\nIL\nCONTRACT TYPE:\nFull time\nNUMBER:\n491629\nDATE:\nFeb 2, 2023Show more Report"}, {"company": "Kennedys", "job": "Associate, Corporate, 2+ years' experience", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=326&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ca9437bb&cb=1676383480945&jobListingId=1007606006986&jrtk=3-1-1gp83rr0skf2e801-1goosfjnegfp8800-3b6dd551a8928172-", "description": "Kennedys is looking for an Associate to work on corporate commercial matters.\nThe role involves advising local Israeli as well as non-Israeli clients in the insurance and finance industry.\nLegal work is of a wide and business oriented nature, such as drafting commercial agreements, conducting legal search, researching legal matters, overseeing legal disputes, advising on the appropriate course and if advisable settlements, reviewing relevant regulations and advising on their implementations.\nThis is an exciting opportunity to grow, learn and develop to be well knowledgeable corporate commercial lawyer in the fields of insurance and finance.\n\nTeam\n\nKennedys' commercial team consists of specialist lawyers who advise on a wide range of commercial services covers a broad spectrum including corporate, employment, property, construction, insolvency, international litigation and arbitration. We support our clients with commercial contracts, data protection, cyber-security, IP/IT, e-commerce, procurement, state aid and competition.\n\nOur Israel practice consists of a team of skilled, multilingual lawyers (including Hebrew speakers and Israeliqualified lawyers) who understand and have experience of Israeli business and culture. We aim to give rapid and practical legal advice tailored to your needs. We provide our London and international insurer clients with insurance and reinsurance coverage advice as well as monitoring, claims administration, management and coordination services relating to Israeli risks.\n\nClients\n\nLocal and international clients\nInsurers/reinsurers\n\nCases\n\nA mixed corporate and Commercial caseload.\n\nRequired experience\n\n2+ years' qualified with the relevant experience*\nPrior knowledge in the finance and insurance industry(including Fintech and Insurtech) is a major advantage\nMust have English as a first language or be as proficient in this language.\n\nAbout Kennedys\n\nKennedys is a global law firm with expertise in dispute resolution and advisory services. With over 2,300 people worldwide across 43 offices in the UK, Europe, Middle East, Asia Pacific and America we have some of the most respected legal minds in their field.\n\nOur lawyers handle both contentious and non-contentious matters, and provide a range of specialist legal services, for many industry sectors but we have particular expertise in litigation and dispute resolution, especially in defending insurance and liability claims.\n\nWe're a fresh-thinking firm, and we're not afraid to bring challenging new perspectives to the table way beyond the traditional realm of legal services. We empower our clients with a diverse range of ideas, tools and technology to make their lives easier, as well as delivering exceptional results, every time.\n\nWhat do we have to offer?\n\nWe welcome high-performing lawyers, business services professionals, secretaries, graduates and apprentices to join our rapidly expanding global firm. Whatever your role at Kennedys, you'll be involved in exciting and stimulating work, where your input will make a difference.\n\nOur culture and values form a big part of who we are and we take them seriously. We make a difference by being approachable,straightforward, supportive and distinctive. Our values are at the core of who we are and what make us a great firm to work with and for.\n\nWe develop careers in an innovative and collaborative global environment, with our values at the core. We believe that supporting individual growth and development puts us in the best position to attract and retain talented individuals. Regardless of role or level, everyone has access to virtual learning to help you develop your skills, wherever you are in the world. A variety of other exciting opportunities are available including secondments to clients and our global offices as well as a comprehensive benefits package (details are available upon request).\n\nWe've created a culture based on client service, professional excellence, hard work and trust. We deeply value the relationships we build with our clients and we know that they value our warm, friendly human approach. We are here to provide answers, recommendations, strategy and tactics.\n\nKennedys is an equal opportunities employer and is committed to ensuring our recruitment processes are as inclusive as possible. We expect all employees to be aware of and comply with all relevant policies and procedures within their jurisdiction, including those relating to Information Security, Data Protection and Quality Management, refer any breach promptly to Risk & Compliance and to complete all mandatory training when requested.\n\n*Where a level of experience is indicated, this is a guideline only and represents the amount of time we would usually expect a candidate to accumulate the requisite level of experience. This does not preclude applications from candidates with more or less experience.Show more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "Algorithms Developer", "city": "Raanana", "date": "19d", "rating": "", "link": "", "description": ""}, {"company": "MSD", "job": "Sr. Clinical Research Associate", "city": "Hod HaSharon", "date": "24h", "rating": "4.1", "link": "", "description": "Job Description\nThe role is accountable for performance and compliance for assigned protocols and sites in a country.\nUnder the oversight of the CRA manager or CRD, the person ensures compliance of study conduct with ICH/GCP and country regulations, Merck/MSD policies and procedures, quality standards and adverse event reporting requirements internally and externally. Acts as primary site contact and site manager throughout all phases of a clinical research study, taking overall responsibility of allocated sites. Actively develops and expands the territory for clinical research, finding and developing new sites. Participates in internal meetings and workstreams as SME for monitoring processes and systems.\nResponsibilities include, but are not limited to:\nDevelops strong site relationships and ensures continuity of site relationships through all phases of the trial.\nPerforms clinical study site management/monitoring activities in compliance with ICH-GCP, Sponsor SOPs, Local Laws & Regulations, Protocol, Site Monitoring Plan and associated documents.\nGains an in-depth understanding of the study protocol and related procedures.Coordinates & manages various tasks in collaboration with other sponsor roles to achieve Site Ready.Participates & provides inputs on site selection and validation activities.Performs remote and on-site monitoring & oversight activities using various tools to ensure:\noData generated at site are complete, accurate and unbiased.\noSubjects’ right, safety and well-being are protected.Conducts site visits including but not limited to validation visits, initiation visits, monitoring visits, close-out visits and records clear, comprehensive and accurate visit & non-visit contact reports appropriately in a timely manner.Collects, reviews, and monitors required regulatory documentation for study start-up, study maintenance and study close-out.Communicates with Investigators and site staff on issues related to protocol conduct, recruitment, retention, protocol deviations, regulatory documentation, site audits/inspections and overall site performance.Identifies, assesses and resolves site performance, quality or compliance problems and escalates per defined CRA Escalation Pathway as appropriate in collaboration with CRA Manager, CRM, TA Head and CRD as needed.Works in partnership internally with GCTO country operations, finance, regulatory affairs, pharmacovigilance, legal and regional operations, HQ functional areas and externally with vendors and IRB/IECs and Regulatory Authorities in support of assigned sites.Manages and maintains information and documentation in CTMS, eTMF and various other systems as appropriate and per timelines.\n•Contributes strongly to CRA team knowledge by acting as process Subject Matter Expert (SME), sharing best practices, making recommendations for continuous improvement and providing training as appropriate/required.•Supports and/or leads audit/inspection activities as needed.\n•Following the country strategy defined by CRD and CRA manager, contributes to the identification of new potential sites and works closely with them to develop strong clinical research capabilities.•Mentors / buddies junior CRAs on process/study requirements and performs co-monitoring visits where appropriate.\nCORE Competency Expectations:\nFluent in Local Languages and English (verbal and written) and excellent communication skills, including the ability to understand and present technical information effectively.\n•Excellent understanding and working knowledge of clinical research, phases of clinical trials, current GCP/ICH & country clinical research law & guidelines. •Excellent understanding of Global, Country/Regional Clinical Research Guidelines and ability to work within these guidelines.\nDemonstrated ability to mentor/lead.\nHands on knowledge of Good Documentation Practices.\nProven Skills in Site Management including independent management of site performance and patient recruitment.Demonstrated high level of monitoring skill with independent professional judgment.Good IT skills (Use of MS office, use of various clinical IT applications on computer, tablet and mobile devices) and ability to adapt to new IT applications on various devices.Ability to understand and analyse data/metrics and act appropriately, also in a virtual environment.\n•Experience with conducting site motivational visit designed to boost site enrollment. •Capable of managing complex issues, works in a solution-oriented manner.Performs root cause analysis and implements preventative and corrective action.Capable of mentoring junior CRAs on process/study requirements and is able to perform co-monitoring visits where appropriate.\nBehavioural Competency Expectations:\nEffective time management, organizational and interpersonal skills, conflict management, problem solving skills.Able to work highly independently across multiple protocols, sites and therapy areas.High sense of accountability / urgency. Ability to set priorities and handle multiple tasks simultaneously in a changing environment.\nWorks effectively in a matrix multicultural environment. Ability to establish and maintain culturally sensitive working relationships.Demonstrates commitment to Customer focus.Works with high quality and compliance mind-set.Positive mindset, growth mindset, capable of working independently and being self-driven.Demonstrates and projects professional demeanor and communication consistent with organizational policies and practices.\nExperience Requirements:\nRequired:Min. 4 years of direct site management (monitoring) experience in a bio/pharma/CRO.\nEducationalRequirements:\nPreferred:\nB.A./B.S. with strong emphasis in science and/or biology.\nCurrent Employees apply HERE\nCurrent Contingent Workers apply HERE\nSearch Firm Representatives Please Read Carefully\nMerck & Co., Inc., Rahway, NJ, USA, also known as Merck Sharp & Dohme LLC, Rahway, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails.\nEmployee Status:\nRegular\nRelocation:\nNo relocation\nVISA Sponsorship:\nTravel Requirements:\n75%\nFlexible Work Arrangements:\nShift:\nValid Driving License:\nHazardous Material(s):\nNumber of Openings:\n1\nRequisition ID:R225422Show more Report"}, {"company": "Seperia", "job": "Product Marketing TL", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "", "description": "Who We Are:\n\nSeperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for an ambitious and talented Product Marketing Team Lead to join the team.\n\nWhat You Will Do:\n\nLeading a small team of Project Managers, including (but not limited to): hiring, training and responsibility for personal development.\nDrive the execution of our products (review sites) through their entire lifecycle: market research, competitive analysis, planning, positioning, roadmap development and ongoing product optimization.\nManage communication with international brands, evaluate their performance metrics, and drive product monetization.\nAnalyze users’ needs, web page performance, market trends and partnerships from an ROI perspective.\nEstablish project management processes, data-driven & measurability as a culture in your team.\nWork closely with external development teams to track progress and ensure timely and high-quality deliverables.\nWork closely with marketing teams, design and finance.\n\nWhat You Need:\n\nGreat written & verbal communication skills (Hebrew & English) – must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n2+ years of experience in web product management, marketing project management or global website management – must.\nManagerial experience – must.\nWeb-savvy individual.\nTechnical capabilities & experience working with developers.\n\nExtra beneficial skills:\n\nExperience in managing websites via WordPress.\nKnowledge in online advertising.\n\nWhat We Offer:\n\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance product company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}, {"company": "Pixellot", "job": "Senior FP&A", "city": "Israel", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=330&ao=1136043&s=58&guid=0000018631c7ce838d54c9c6b9670706&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ed278c0d&cb=1676383486812&jobListingId=1008280033879&jrtk=3-1-1gp83s0ork6ep801-1goosfjnegfp8800-afa07bbc72854c04-", "description": "Israel · Full-time · Senior\nAbout The Position\nAre you an ‘Excelloholic’? Do you find yourself losing hours of sleep at night thinking about the design of a new financial analysis?\nDo you want to design and improve processes that help drive the revolution that is changing the world of Sports? If yes, you belong with Pixellot.\nPixellot, leading the AI revolution in sports production, is looking for a dedicated Senior FP&A, to join our amazing finance team, and play a key role in supporting Pixellot's strategy & FP&A processes.\nWith more than 150,000 games produced and streamed live every month, Pixellot is the world’s largest producer of live sports content. The company pioneered the concept of automated sports production as an affordable alternative to traditional video capture, production, and distribution, for professional, semi-professional, and grassroots games. Pixellot produced games that are delivered both live and on demand, through a variety of distribution channels to fans, families, athletes, coaches, scouts, and sports betting organizations.\nIf you are passionate about joining a growing and dynamic company focused on revolutionizing Sports production and working with game-changers and out-of-the-box teammates, Lets talk!\n As part of your work you will:Be responsible for planning, analysing, and developing new KPIsTake a part in Implementation of new systems & design of new financial practices to address business needsDevelop and maintain periodically KPI reports to management and the board of directorsDevelop and maintain a sales compensation structureAssist in maintaining and updating the company's pricing strategyBe involved in analyses of the company's M&A activities\n You should bring with you:At least 5+ years’ experience in a SaaS company with annual revenue of at least $50mSelf-motivation and the ability to take initative, prioritize with minimal supervision and work independentlyStrong interest and experience in developing process improvementsAdvanced Microsoft Excel skillsExcellent communication, creative problem-solving & strong organization skills.High level of English, verbal and writtenDiscretion in working with confidential informationAttention to detailsBI SkillsShow more Report"}]