[{"company": "Walnut", "job": "Office Manager & Executive Assistant", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "4.8", "link": "", "description": "Who We Are\n\nWalnut is a fast growing startup in the sales automation space, backed by top-notch investors.\n\nWe help some of the best sales teams in the world to dramatically perform better, by easily creating failure-free, interactive, and personalized demo experiences for each prospect - without coding.\n\nWe are a young company that values culture, transparency, and achievements, and put our founding members at the very heart of our company.\nYou will join the energetic team at Walnut TLV and will become a focal point to all admin needs. We are growing rapidly and need someone who is detail-oriented, communicative, and cares about others. You will have the opportunity to put your creativity and operational skills into action and grow with us. A can-do attitude is a must.\n\nThis is an exciting opportunity to join the most promising startup in Israel and make a true impact.\n\nYou will be working from our TLV office and support our global employees needs.\n\nWhat your day to day will look like:\nWelcome visitors and provide support and direction to guests, candidates, etc.\nOwn full employees life cycle, from on-boarding new hires to off-boarding\nFocal point for IT and supporting all technical issues\nSupport HR & Finance tasks including payroll and legal requirements relate to local regulations\nSolely responsible for the day-to-day of TLV office and facilities management, including: monitor cleaning, maintenance, ordering refreshment and office supplies\nManaging the CEO calendar\nManage office budget and expenses: money wiring, receipts handling, etc.\nManage inventory, ordering, and stocking of office and kitchen supplies.\nManage vendor relationships. Conduct research and vendor searches as needed.\nCoordinate meetings, business travel, and schedules\nAssist in executing team social & wellness activities: happy hours, holidays, events, and more.\nPerform other administrative duties and special projects as required.\n\nRequirements:\n\nProven experience in a similar role for 2+ years in a global company\nHigh level of English - a must\nEnergetic and proactive with a strong can-do approach\nHighly organized and detailed oriented, strong multi tasking abilities\nResults-driven, with excellent prioritization of workload and deadlines\nFlexible, cooperative, and a team player who loves to help others\nHas the ability to communicate well with all levels (internal and external)\n\nIn the News:\n\nThe 5 Next Billion-Dollar Start-Ups of 2023\n\n4 Tech CEOs Building Iconic Brands\n\nLinkedIn Top Startups 2022: The 15 Israeli Companies on the Rise\n\nYou better believe it! We raised $35 million in our Round B!\n\nTech Crunch: Walnut Growing 700% in 4 months!\n\nWorld Financial Review: Walnut Raises #35 million\n\nTed Talk: How Walnut is Reshaping the Greater B2B Sales ExperienceShow more Report"}, {"company": "Deloitte", "job": "Audit & Assurance Staff – US-Israel", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=202&ao=1110586&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d586d176&cb=1676383655096&jobListingId=1008083059863&cpc=8795CF9063CD573D&jrtk=3-1-1gp8414u0j45o801-1goosm0qli7l8800-8359bbd23f72e283--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC_V6sLizfxnd6uUN8x00ViZyWJzJWJVevA74YKulbC_-XItrLKqv4uSi0rfYT3tKo6RKT4NuXpIcs1Inn6E6JlIBiMUR6EbUJLX4Gs5pyL6_pP_BDJRdfwKsB4bczjc_dR-y4KBbmxpz934E3J3astkL4MZjjpXLzOlH12RDmBmaWa3dKGgxJkKL1R2ZvFGgDRRHHHv6LMZzDpQOQlzZINR6iqFgzKCCMWC519D-7tLssYTqZZ9CodUvlH3t2MSHWKShYUO7FABOcGC_gXB0zZcqb3bZqCpqiVU2H5BZdU7d6I689enmErpsNJbtCJo91w0CsV5bQKgNj1m_AIIXEB0A6wSanwKDKCOOXPnIOv9Bw4T5BGo37-vpEs_HAAHAoBh5wnh_NP3BdVPmO70IzuKX0G1HrWYKXeimmD35FbguDtbQ9qEdhJM_S39Vo5ERONw2Y3Xh37OYBp_MupIVAyNDOu-7Csk6bf6379YKEaqtocVVdORGGmOs9yTpJCzlOj7yLSfz9O7h6U0w0ajS9-I0JqdJ0XOqPCsVdwF0CmtK0uPu9MKTp6z0ty4Tx_cVaGiOxelWgz2Ni4EKJ_GeQtUwzvc5fMqsEZwfgil3P6Xu3lv-X-zvH5MhPHqEPRNuRSt-rQnxdARQ1jtopCdNl2", "description": "As the world changes, join a company leading the way! Financial markets are growing ever more global and more complex. At Deloitte, we have innovated the audit by leveraging cutting-edge technology like data analytics, combined with transformative processes, that evolve our audit and assurance capabilities to meet the dynamic needs of the capital markets. As an Audit & Assurance professional, you have the opportunity to help enhance audit quality, provide deep insights, and deliver a differentiated audit!\n\nAs a full-time audit professional, you'll deliver audit services to our US clients and work cross-functionally with US and Israel Audit team members to design and execute audit procedures based on the client’s business needs, internal controls, and risks. Required: *Bachelor's degree in Accounting or related field (e.g. Business, Finance, Economics). *Experience needed or IL CPA preferred *Fluency in English; Demonstrate effective verbal and written communication skills.\n\n\nThe interview will be held in English *Ability to work effectively in a virtual environment. Preferred: *Work experience with a regional or international accounting firm. *Understanding of broad business & technical (US GAAP) knowledge. Location: Tel Aviv, Beit-Shemesh, Jerusalem, Haifa, Nazareth.\nFlexible hours and hybrid/remote options. *The position is intended for both women and men. * We at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.\n\nShow more Report"}, {"company": "Barclays", "job": "Banking Analyst - Expert Graduate Programme - 2023", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "Join the world of banking\n\nEvery day, corporations worldwide come to Barclays for our banking expertise. We help drive global commerce by providing comprehensive financial, advisory and capital-raising services. Our bankers advise on everything from mergers and acquisitions and privatisations to debt and equity financings and restructuring. Want in? Join us as an analyst.\nThe chance to make an impact\n\nAfter several weeks of intensive training to start, you’ll join one of our industry, product or geographic groups and start working on live deals and business development projects right away. Within small deal teams, you’ll quickly play an important role on a variety of demanding assignments. You may work on:\n\nfinancial analysis and modeling\nvaluation\nindustry research\nbusiness evaluation and strategic assessment\nbusiness and idea generation\nexternal and internal stakeholder communication.\n\nA place where you can thrive\nAt Barclays, you’ll be surrounded by people who will help you achieve your ambitions. Our collaborative, supportive environment gives you the chance to build solid relationships with senior leaders, peers and clients alike. What’s more, dedicated programme managers will support and advocate for you throughout the first several years of your career at Barclays, ensuring you develop the skills you need to succeed.\nDuring your analyst years, you’ll also:\n\nparticipate in formal and informal training designed to give you the knowledge you need when you need it\nreceive detailed performance coaching and feedback\nhave opportunities to expand your network and develop leadership skills.\n\nYour role as a Banking analyst will provide you with the skills and experience needed for a successful career in the world of finance. We’ll also provide you a visible path to the necessary steps for promotion to associate and the tools to get you there.\n\nTo be considered for this programme, you must:\nbe motivated with a strong degree or expected degree – in any area.\n\nIdeally you would have:\na strong interest in business and finance, though no specific subject degree is required\na candidate with course experience in accounting (strongly recommended)\nsomeone who shows resourcefulness, team-orientation, enthusiasm and an entrepreneurial spirit, demonstrated through participation in extracurricular activities.\n\nIt is the policy of Barclays to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, protected veteran status, genetic information, or any other basis protected by law.Show more Report"}, {"company": "Cisco Systems", "job": "Associate Sales Representative - Bachelor/Master (Graduate) - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=204&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6f57bf45&cb=1676383657500&jobListingId=1008368670948&jrtk=3-1-1gp8417eikbmm801-1goosm0qli7l8800-cfcea023f83b1fc1-", "description": "Location\nTraining Hub Location: Amsterdam, Netherlands\nLocation After Training: Tel-Aviv, Israel\nStart date: 31st July 2023\nWhat You’ll Do:\nCisco Sales Associates Program (CSAP) offers a global environment that provides structured training and on-the-job-experience. We will develop your sales, technical and communication skills and you will be offered the opportunity to rotate and understand diverse areas of Sales via our model of Education Exposure Experience. You will learn how to position Cisco’s architectures, solutions and products to our customers.\nYour career will continue as a Virtual Account Manager (VAM) role as part of Cisco’s Global Virtual Sales (GVS) Team. The GVS organization is passionate about driving sales productivity breakthrough and building compelling business value for our partners while nurturing our partner relationships. As a VAM, you’ll build positive relationships with existing customers and partners, working closely with them to understand their business strategy and uncover new business opportunities, whilst achieving their desired business outcomes. You’ll partner with Sales Engineers and together you’ll position the benefits of our Cisco solutions to your customer, using our best-in-class collaboration tools.\nFrom there, your career can develop and grow into a variety of sales opportunities at Cisco.\nWhile challenging, it will push you to become the best version of yourself. You will achieve industry-standard certifications, as part of our perpetual learning approach, and be assessed and mentored through customer simulations and on-the-job activities. We’ll offer you a safe and fun environment to practice what you’ve learnt, all the while providing you with feedback to develop your potential.\nWho You'll Work With:\nYou’ll be part of CSAP, an award-winning and industry recognized early-in-career development program for top university graduates from around the world. You’ll train alongside incredibly talented individuals, like yourself, from different countries and a diverse group of backgrounds. Early on, you’ll make long-lasting friendships and belong to a rich human network that will support you throughout your career.\nAs a successful Associate Sales Representative (ASR), you’ll learn to discover, build and drive new opportunities to our customers, with our Cisco partners, while collaborating with Cisco engineers to provide technical solutions that drive business outcomes for our customers.\nYou’ll learn from top authorities and coaches in an unrivalled setting using our own leading-edge technology. You’ll have your own mentor, a CSAP alumnus who’s been in your shoes and will help guide you in your first year. With a strong Cisco team committed to your success, you’ll gain hands-on education and experience, while receiving an attractive salary and pursuing your career dreams!\nWhat we offer\nAt Cisco, we strongly believe in the wellbeing of our employees and work life balance, and our benefits package is designed to reflect this. On top of your remuneration package and 25 days annual leave, you may be entitled to receive these Benefits & Perks as part of our People Deal and benefits package. (May vary location.)\nWho You Are:\nRecent graduate or on your final year of studies towards a degree or related program or other academic certification, ideally in any of: Business and Management, Finance, Marketing, Entrepreneurship, MIS, Engineering or other related degrees.Fluent in English and HebrewWilling to relocate for 12 months to a designated CSAP training hub as required. Immigration and relocation support will be provided should the program be delivered in training hubs as opposed to virtually.Technology enthusiast who enjoys innovatingDemonstrate an eagerness to establish a long-term Sales career with Cisco UKIApproach situations with an open and curious mind, taking on challenges with an eye for opportunity.Ability to take complex problems, simplify them and thinking creatively to solve them.A strong communicator with the confidence to engage and talk to a wide range of people and who and views team collaboration as instrumental to achieving success.\nWhy Cisco\nCisco is an Equal Opportunity Employer and you will receive consideration for employment without regard to race, colour, religion, gender, sexual orientation, national origin, genetic information, age, disability, or any other legally protected basis.\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\nWe embrace digital, and help our customers implement change in their digital businesses.\nBut \"Digital Transformation\" is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!\nCisco are always looking to identify talented people. If you are reading this posting then we may not have an open job right now, however it is highly likely we will in the future. If you are interested in working for Cisco in this capacity then please submit your details and CV or resume against this requisition so that when a suitable vacancy arises a Cisco representative can contact you directly.\nPlease note that vacancies will be filled on a rolling basis after opening and we will close applications as offers are accepted; possibly before the stated deadline. Therefore, we highly recommend you submit your application as early as possible in order to be considered for the opportunity of your choice\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "Lemonade Insurance Company", "job": "Office Operations Lead, Site Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "", "description": "Tel Aviv, IL | Facilities & IT | Full-time\nNot your everyday company\nLemonade completely reinvented how insurance works. As a customer-centric tech company, we created an insurance experience that is smart, instant, and delightful.\nAt Lemonade, you’ll be working with a group of like-minded makers, who get a kick out of moving fast and delivering great products. We surround ourselves with some of the smartest, most motivated, creative people who are filled with positive energy and good karma.\nUnlike most publicly traded companies, we’re nimble and efficient. We take pride in the fact that we still think and operate like a startup. We don’t care much about titles and hierarchy and instead focus on innovation, bold moves, and challenging the status quo.\nWe’re built as a lean, data-driven organization that relies on a common understating of objectives and goals to provide teams with autonomy and ownership. We don’t like spending our days in meetings and we skip committees altogether. At Lemonade, there’s no such thing as going over someone’s head. We have zero tolerance for bureaucracy, office politics, and lean-back personalities.\nAs a Public Benefit Corporation and a certified B-Corp, we deliver environmental and social impact using our products and tech. Through our Giveback program, we partner with organizations such as the ACLU, New Story, The Humane Society, Malala Fund, American Red Cross, 360.org, charity: water, and dozens of others, and have donated millions towards reforestation, education, animal rights, LGBTQ+ causes, access to water, and more.\nAwarded ‘best workplace’\nBest Workplace and Best-Led Company by Inc. Magazine\nHigh 4.4 rating on Glassdoor ️\nOur Founders listed among Glassdoor’s Top CEOs\n“World Changing” by Fast Company\nRecognized as a World Changing Idea by Fast Company Magazine\nRanked #1 Home insurance in America\nWon best renters and homeowners insurance in America by US News, and others\nBest Pet Insurance in America\nRated “Best Overall Pet Insurance” by Better Homes & Gardens\nRated 4.9 on the Apple App Store\nAmong the highest rated apps of all time\nWhat you’re applying for\nLemonade is looking for a big hearted Office Operations Lead to manage our Office Ops team and oversee our vibrant and growing TLV site. This people person should be detail oriented, customer-obsessed, and ready to lead the team who manages ongoing daily operations and logistics, facilities, events planning, and office life for our +300 TLV Makers. This role collaborates closely with other teams to manage processes with a broader impact on our employees’ experience to ensure we provide a best in-class, delightful, and unique workplace experience for our Lemonade Makers.\n\nWe’re looking for a person who shines in the role of a “generalist”, is resourceful and creative, and has great project management skills. In this position you will manage the local Office Operations team while working closely with managers and leadership across the organization, and also with external parties.\n\nWe’re looking for an Office Operations Lead who has a passion for high quality delivery of everything employee-experience related, and can ensure new employees have a positive employee lifecycle (soft landing, anniversaries, termination, etc.). In your day-to-day, you would be expected to plan and execute large-scale company-wide initiatives, which means you’ll drive strategy, work with internal and external stakeholders, build budgets, communicate and execute plans, and collect feedback and share recommendations with leadership. You’ll also do everything from picking the perfect color temperature of a light bulb, to organizing holiday toasts and ‘extracurricular’ activities, to negotiating the best deals for the employees’ benefits, and making sure everything runs smoothly and with ease.\n\nYou’ll work closely with many stakeholders - both managers and leadership from different teams: People Operations, IT, Finance, Legal, Talent Acquisition, and other support functions. You’ll identify problems, build communication plans, lead and execute projects, and do that whilst being legally compliant, creative, on schedule, on budget, and with a drop of humor.\n\nYou will manage our TLV Office Operations team and oversee the employee experiences. You will liaise between administration, facilities, office life, and events to ensure we provide our employees with the best working experience possible.\nIn this role you’ll\nOversee all office operations projects and processes\nManage the local Office Operations team\nPartner with different support functions such as People Ops, Finance, Legal, IT and Talent Acquisition to create a delightful, compliant and unique employee experience\nCreate, implement and monitor company and site policies\nWhat you’ll need\n+8 years of operations and managerial experience\nExperience in hyper-growth organizations with +300 employees\nAn extraordinary communicator, with fantastic verbal and written communication skills\nTo know a bit in many employee experience related fields\nLearn new things quickly and independently\nEndless creativity and a “can solve any problem” attitude\nAn execution state of mind, with no hesitation to take on hands-on work and drive the team to deliver faster\nSuperior attention to details (while keeping seeing the big picture) and an enthusiasm for delighting employees\nGreat English\nAbility to remain organized while adapting in a dynamic environment\nExceptional EQ - natural ability to ‘read’ and influence people\nGreat project management skills\nPassion to create a “best in class” workplace environment\nThings to know…\nLemonade is an equal opportunity employer committed to diversity and inclusivity. We never discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. If you require reasonable accommodations due to religious beliefs, pregnancy, or disabilities, let us know at any time.Show more Report"}, {"company": "ธนาคารไทยพาณิชย์", "job": "Associate/Principal, Venture Capital (SCB10X)", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=206&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ecbaa3e5&cb=1676383660007&jobListingId=1007017962825&jrtk=3-1-1gp8419spkbm3801-1goosm0qli7l8800-b438ad8ddee20f6f-", "description": "สมัครโปรดคลิกที่ปุ่ม \"Apply\"\nIf you are an active SCB employee, please apply through Workday by searching \"Find Jobs\".\nIf this is your first time applying you will need to create a candidate account when you click on apply.\nJob Description\nPerform Due Diligence on Venture Capital Investment\nGather information from target company and industry experts\nDo research on the existing references and customers of the target company\nExplore and research potential competitors to the target company\nWork closely with technical/business consultants to evaluate the target company including IPs\nConduct background checks on the current management of the target company\nDevelop financial modelling and valuation analysis and prepare internal investment memo\nPerform market research to help identify new investment trends and opportunities\nManage deal screening; call and/or meet with prospects, evaluate opportunities\nSummarize documentation; call notes, enter deals into CRM\nConnect business network with peers in other Venture Capital Firms\nPerform monitoring and reporting of portfolio companies\nQualification:\nBachelor’s Degree or higher in Business, Finance, Engineering, Accounting discipline preferred\nAt least 5 years’ experience in Venture Capital or related field\nExperience in Investment experience and/or due diligence\nUnderstand both technical and business concepts quickly and effectively with business acumen\nWe're committed to bringing passion and customer focus to the business.\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us.Show more Report"}, {"company": "CyberArk", "job": "Travel Manager", "city": "Petah Tikva", "date": "8d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=207&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_29f1e234&cb=1676383661276&jobListingId=1008439704431&jrtk=3-1-1gp841b4vkhog801-1goosm0qli7l8800-ca1ae7a8856e28e4-", "description": "Date: Jan 31, 2023\nLocation:\nIsrael, Petach Tikva\nJob Category: Finance\nDepartment: Corporate Functions (HR, Finance, Legal)\nWho we are:\nCyberArk (NASDAQ: CYBR), the global leader in Identity Security, Centered on privileged access management, CyberArk provides the most comprehensive security offering for any identity – human or machine – across business applications, distributed workforces, hybrid cloud workloads and throughout the DevOps lifecycle. The world’s leading organizations trust CyberArk to help secure their most critical assets\n\nWhat will you do:\nFull ownership of travel policy including updates, common and best practices and follow-up with travelers.\nGather, produce, and analyze global travel data. Communication of relevant data to management via periodic reports.\nVarious Travel tools administrator such as Global booking tool, global expense reimbursement tool, travel credit cards etc.\nProvide Support, training and guidance for employees to all travel systems, processes and policies.\nTravel coordinator and support for company special events and gatherings.\nAddress for employees with all travel and booking related issues.\nPoint of contact for travel systems vendors – enhancement requests tracking, system improvements initiatives, real time problem solving for employees.\nLevel of service global coordinator.\nManage relationships and build partnerships to ensure corporate travelers receive exceptional customer service and secure best rates.\nGlobal insurance, visa and travel documents admin for employees.\nEnsure and establish travel efficiency by utilizing special bonus plans, points and loyalty plans (credit cards, airlines, and hotels).\nTrack and approve overseas gatherings to align to approved budget.\nSupport procurement with Ad hock travel related assignments.\n\nWhat you need to succeed:\nMinimum 4 years experience as a travel manager, preferably from a high-tech company\nTravel industry expert with proven knowledge of best practices\nFluent English (written and verbal)\nProven experience in setting up and managing corporate travel platforms such us Expensify, Egencia, Trip Actions, and similar tools\nInterpersonal and customer service skills\nProactive and able to take initiative.\nStrong attention to detail and ability to identify and resolve issues quickly and effectively.\nGood organizational, management and negotiation skills\n\nTo learn more about CyberArk, visit https://www.cyberark.com, read the CyberArk blogs or follow on Twitter via @CyberArk, LinkedIn or Facebook.\n#LI-OC1Show more Report"}, {"company": "Elementor", "job": "Senior Product Analyst", "city": "Ramat Gan", "date": "6d", "rating": "4.1", "link": "", "description": "We are looking for a sharp and highly analytical Product Analyst to join our fast-growing company and help us make data-driven decisions for performance optimization.\nAs a Product Analyst, you will play a key role in shaping Elementor's product and business strategy, defining our KPIs, and identifying business opportunities.\nAs a member of the Analytics team in our Data department, you will work across the organization and provide key insights to multiple departments (Marketing, Product, Finance, Business Strategy, CX, and more), helping them focus on what’s important.\nThis position is located in Israel only.\nRequirements:\n\n4+ years of experience in quantitative analysis, preferably at an internet company\nExcellent communication skills with the ability to deliver results of analyses clearly and effectively\nExcellent SQL skills - a must\nExperience with at least one of the following visualization tools: QlikView, Qlik Sense, Power BI, Tableau - a must\nStrong Python capabilities - a major advantage\nExperience working with big data tools: Redshift, BigQuery, Databricks, etc. - a must\nA highly independent and creative team player who works well with others\nHands-on technical experience with Google Analytics, Google Ads, and Facebook Ads - an advantage\nWork Environment:\n\nWhat do we do?\nElementor is the leading website building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 12M websites powered by Elementor. More than 8% of all websites around the world are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe believe in empowering both our employees and our users.\nElementor is a place where you can truly grow professionally and personally.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey. We take great pride in Elementor's constant scaling.\nResponsibilities:\n\nWork with various managers to learn their business insight needs, including tracking metrics, dashboards, and reports\nAct as a bridge between units’ business needs and the BI department, ensuring high-quality execution quality, data integrity of analyzed insights, and reporting deliverables\nEstablish reporting methodologies and cross-department standards\nGo beyond the numbers to communicate, influence, support, and execute business decisionsShow more Report"}, {"company": "IVC Research Center", "job": "Sales Development Representative (SDR) / Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=209&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_25d66482&cb=1676383663861&jobListingId=1008371867078&jrtk=3-1-1gp841dluj4j1801-1goosm0qli7l8800-311832bbee8b9197-", "description": "Responsibilities\nDevelop new business leads\nExpand the portfolio by handling up-sales and potential new accounts, including cold calls\nManage all account-related processes and projects - from lead generation, pre to post sale, consulting, support, and back-office management\nHandle an existing account portfolio to preserve the customer base\nAttend industry conferences and meet-ups to represent the company, network and gather leads\nRequirements\n2-5 years’ experience as an account manager in a business-oriented market OR equivalent sales track record in successful B2B sales - a must\nAbility to withstand tight deadlines and ambitious goals\nBA degree – a must.\nBA in business, finance, marketing, economics, communications, technology, or related field – an advantage.\nStrong negotiation and presentation skills.\nExperience working with CRM Systems and Marketing automation systems.\nExcellent spoken and written skills in Hebrew and English. Other languages – an advantage.\nFamiliarity with technology, high-tech or investments markets - definite advantage\nReferences will be requiredShow more Report"}, {"company": "סיגמא HR", "job": "Senior financial Analyst", "city": "Southern", "date": "5d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=210&ao=1110586&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_95a692c4&cb=1676383665013&jobListingId=1008447681004&cpc=8795CF9063CD573D&jrtk=3-1-1gp841epajc9h801-1goosm0qli7l8800-fa74aabcdbd36ac5--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBS1vTd51cVeH6UkGsoXfT88MkUWC1CR20oMHYME8H7aQztLFTnsO6TXIOw7DiFn2MfLKqIv9a8qRZmidRreVrdNQg84C57iJ6Fd0X6r3C0zLkMK_mQOq5vSpyRUHbBckrellqHSg9v-WN6tCf9c5yeeQFeVGJxf2pXtDeDEzB-OoDnaWHtuDCsghuolJlnaBw_5sWvi2hcpC3qlM2Ur_P3R4ifCJOmg4e8fXgdaGMdvVF_0pAlQpWovhhpaqv0_YOizlmJRKEN3q-N3Jt6bwotS4p4P-zx9fQxwBFPSFutaLgonH4XYy9w_4eSQSwoG11rqyHwGFXlf9clmiMYwSG3eZNj6vn7ynPwjOwZCjYdnpAp9x4pXewZDRK-xw2ZIkRXzBuxzVp2_FyIC-SyHmv2V6aF7k6qbsHUYUucQdxJK3hGo1cnI0lYShX19SgnyZlmb9gxfGut0qFx-3tqzlARAJeFRatvaBKlOPLmO_jkoAmSQR-B2ycjru1GL_UrDUe6KoiwHmEhfo-J7EJ0jxox77WcXUXfbHVjPP588j8n2r3nvgsl8J8G9wEAAQrRdQC3N-FiUUeq3CCbbFknk_dNnP8V7dOCufLbsouMQkdoLsrzw7tmGCn3eDbFibPI-Yqa5VJ7QZcdaf83Pt2e70GG", "description": "לחברת הייטק גדולה ומבילה דרוש/ה Senior financial Analyst Developing financial models and methodologies based on historical data and forecasting based on a variety of specific operating parameters. Introduce new models, KPIs, trends estimation and analysis Analysis, identification and gathering of data requirements for model tracking and derivation. Appropriate sensitivity and scenario analysis help assist investment decisions. Take leading part in the company’s portfolio analysis process.\n\nResponsible for Cashflow modeling and forecast Be the focal point for complex financial modeling, providing value-added insights to management to support business decisions. Partner with the relevant Executive Management to support decision-making and provide insights. Requirements: Bachelor's Degree in Economics or Finance, MBA is an advantage 6+ years of relevant experience including modeling, forecasting, and financial analysis Deep understanding of accounting concepts (Rev Rec, CF, accruals, etc.) Strong analytical skills with an emphasis on high-level Excel A high level of commitment and motivation Able to meet tight deadlines and has multitasking abilities High standards of accuracy and precision; highly organized Ability to think creatively and self-motivated Passionate about automation, efficiency and tools Strong communication and interpersonal skills Excellent analytical, decision-making, and problem-solving skillsShow more Report"}, {"company": "Kennedys", "job": "Associate, Corporate, 2+ years' experience", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=211&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c3f9681b&cb=1676383666370&jobListingId=1007606006986&jrtk=3-1-1gp841g3ai7ma801-1goosm0qli7l8800-3b6dd551a8928172-", "description": "Kennedys is looking for an Associate to work on corporate commercial matters.\nThe role involves advising local Israeli as well as non-Israeli clients in the insurance and finance industry.\nLegal work is of a wide and business oriented nature, such as drafting commercial agreements, conducting legal search, researching legal matters, overseeing legal disputes, advising on the appropriate course and if advisable settlements, reviewing relevant regulations and advising on their implementations.\nThis is an exciting opportunity to grow, learn and develop to be well knowledgeable corporate commercial lawyer in the fields of insurance and finance.\n\nTeam\n\nKennedys' commercial team consists of specialist lawyers who advise on a wide range of commercial services covers a broad spectrum including corporate, employment, property, construction, insolvency, international litigation and arbitration. We support our clients with commercial contracts, data protection, cyber-security, IP/IT, e-commerce, procurement, state aid and competition.\n\nOur Israel practice consists of a team of skilled, multilingual lawyers (including Hebrew speakers and Israeliqualified lawyers) who understand and have experience of Israeli business and culture. We aim to give rapid and practical legal advice tailored to your needs. We provide our London and international insurer clients with insurance and reinsurance coverage advice as well as monitoring, claims administration, management and coordination services relating to Israeli risks.\n\nClients\n\nLocal and international clients\nInsurers/reinsurers\n\nCases\n\nA mixed corporate and Commercial caseload.\n\nRequired experience\n\n2+ years' qualified with the relevant experience*\nPrior knowledge in the finance and insurance industry(including Fintech and Insurtech) is a major advantage\nMust have English as a first language or be as proficient in this language.\n\nAbout Kennedys\n\nKennedys is a global law firm with expertise in dispute resolution and advisory services. With over 2,300 people worldwide across 43 offices in the UK, Europe, Middle East, Asia Pacific and America we have some of the most respected legal minds in their field.\n\nOur lawyers handle both contentious and non-contentious matters, and provide a range of specialist legal services, for many industry sectors but we have particular expertise in litigation and dispute resolution, especially in defending insurance and liability claims.\n\nWe're a fresh-thinking firm, and we're not afraid to bring challenging new perspectives to the table way beyond the traditional realm of legal services. We empower our clients with a diverse range of ideas, tools and technology to make their lives easier, as well as delivering exceptional results, every time.\n\nWhat do we have to offer?\n\nWe welcome high-performing lawyers, business services professionals, secretaries, graduates and apprentices to join our rapidly expanding global firm. Whatever your role at Kennedys, you'll be involved in exciting and stimulating work, where your input will make a difference.\n\nOur culture and values form a big part of who we are and we take them seriously. We make a difference by being approachable,straightforward, supportive and distinctive. Our values are at the core of who we are and what make us a great firm to work with and for.\n\nWe develop careers in an innovative and collaborative global environment, with our values at the core. We believe that supporting individual growth and development puts us in the best position to attract and retain talented individuals. Regardless of role or level, everyone has access to virtual learning to help you develop your skills, wherever you are in the world. A variety of other exciting opportunities are available including secondments to clients and our global offices as well as a comprehensive benefits package (details are available upon request).\n\nWe've created a culture based on client service, professional excellence, hard work and trust. We deeply value the relationships we build with our clients and we know that they value our warm, friendly human approach. We are here to provide answers, recommendations, strategy and tactics.\n\nKennedys is an equal opportunities employer and is committed to ensuring our recruitment processes are as inclusive as possible. We expect all employees to be aware of and comply with all relevant policies and procedures within their jurisdiction, including those relating to Information Security, Data Protection and Quality Management, refer any breach promptly to Risk & Compliance and to complete all mandatory training when requested.\n\n*Where a level of experience is indicated, this is a guideline only and represents the amount of time we would usually expect a candidate to accumulate the requisite level of experience. This does not preclude applications from candidates with more or less experience.Show more Report"}, {"company": "MSD", "job": "Sr. Clinical Research Associate", "city": "Hod HaSharon", "date": "24h", "rating": "4.1", "link": "", "description": ""}, {"company": "Pixellot", "job": "Senior FP&A", "city": "Israel", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=213&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_840b0b82&cb=1676383669696&jobListingId=1008280033879&jrtk=3-1-1gp841jbtkckn801-1goosm0qli7l8800-afa07bbc72854c04-", "description": "Israel · Full-time · Senior\nAbout The Position\nAre you an ‘Excelloholic’? Do you find yourself losing hours of sleep at night thinking about the design of a new financial analysis?\nDo you want to design and improve processes that help drive the revolution that is changing the world of Sports? If yes, you belong with Pixellot.\nPixellot, leading the AI revolution in sports production, is looking for a dedicated Senior FP&A, to join our amazing finance team, and play a key role in supporting Pixellot's strategy & FP&A processes.\nWith more than 150,000 games produced and streamed live every month, Pixellot is the world’s largest producer of live sports content. The company pioneered the concept of automated sports production as an affordable alternative to traditional video capture, production, and distribution, for professional, semi-professional, and grassroots games. Pixellot produced games that are delivered both live and on demand, through a variety of distribution channels to fans, families, athletes, coaches, scouts, and sports betting organizations.\nIf you are passionate about joining a growing and dynamic company focused on revolutionizing Sports production and working with game-changers and out-of-the-box teammates, Lets talk!\n As part of your work you will:Be responsible for planning, analysing, and developing new KPIsTake a part in Implementation of new systems & design of new financial practices to address business needsDevelop and maintain periodically KPI reports to management and the board of directorsDevelop and maintain a sales compensation structureAssist in maintaining and updating the company's pricing strategyBe involved in analyses of the company's M&A activities\n You should bring with you:At least 5+ years’ experience in a SaaS company with annual revenue of at least $50mSelf-motivation and the ability to take initative, prioritize with minimal supervision and work independentlyStrong interest and experience in developing process improvementsAdvanced Microsoft Excel skillsExcellent communication, creative problem-solving & strong organization skills.High level of English, verbal and writtenDiscretion in working with confidential informationAttention to detailsBI SkillsShow more Report"}, {"company": "Protiviti", "job": "Americas Delivery Center Senior Analyst- Finance and Accounting", "city": "Central", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=214&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1d8129d1&cb=1676383670917&jobListingId=1008455050972&jrtk=3-1-1gp841khhkugg801-1goosm0qli7l8800-624b325073cb29b9-", "description": "JOB REQUISITION\nAmericas Delivery Center Senior Analyst- Finance and Accounting\nLOCATION\nAMERICAS DELIVERY CENTER\nADDITIONAL LOCATION\nJOB DESCRIPTION\nAre You Ready to Live Protiviti?\nThe Protiviti Career provides opportunity to learn, inspire, and advance within a collaborative and diverse culture. We hire curious individuals for whom learning is a passion. Together, we focus on our mission of delivering confidence in a dynamic world – and the world has perhaps never been more dynamic.\nAt every level, we champion leaders who live our values of integrity, inclusion, innovation and commitment to success. Imagining our work as a journey, we believe integrity guides our way, inclusion moves us forward together, and innovation creates new destinations.\nLiving our values every day. That's Living Protiviti.\nAre you inspired to make a difference?\nYou’ve come to the right place.\nWHERE WE NEED YOU\nThe Protiviti Americas Delivery Center is seeking a Senior Analyst to join our growing team. Embracing Protiviti’s vision of “Bringing Confidence to a Dynamic World,” Americas Delivery Center (ADC) provides cost-effective, tech-enabled, and standardized services at scale, to drive efficiency into our service delivery processes in support of our global clients.\nAs part of the Protiviti ADC team, you will collaborate with a team of professionals striving to deliver service excellence for our clients around the globe. On a typical day, our delivery center staff will collaborate and execute tasks for the project assigned to them in support of Protiviti’s Solution offerings – Technology, Risk and Compliance, Internal Audit & Financial Advisory, and Business Performance Improvement. The site capabilities may include research, development, maintenance, testing, validation, reporting, and other activities based on client needs.\nWHAT YOU’LL FOCUS ON\nDeveloping an understanding of business processes, technical skills, project requirements, and the client’s business in a variety of industries.\nConducting testing of business process and IT controls, performing data migrations and data analyses and assisting in development and testing of Governance, Risk and Compliance (GRC) frameworks.\nEnsuring timely and quality completion of assigned project phases within a defined budget.\nAssisting with the preparation of client deliverables, including agendas, status reports, and final reports.\nMentoring Analysts by demonstrating the attributes of excellent client service, technical, and professional knowledge.\nReviewing Analysts’ project work for quality and accuracy and providing valuable feedback on areas of improvement.\nAssisting in scheduling and project prioritization for Analysts.\nCommunicating findings, roadblocks, and project status to the project team management.\nIdentifying areas for improvement within processes or providing improvement suggestions when challenges arise.\nIndependently interviewing client teams to understand current state system and processes.\nFostering and maintaining meaningful client relationships.\nUpon hire, you will be provided with comprehensive training sessions. Depending on your project work, day-to-day activities may include one or more of the following:\nAnalysis\nPerforming testing of internal and IT controls using pre-defined instructions/guidance within recognized frameworks (e.g., Sarbanes-Oxley, NIST CSF, etc.).\nPerforming support for accounting activities such as preparation and computation of financial records, reviewing invoices, preparing data for entry into systems, and evaluating transactions for accuracy.\nReporting\nPreparing project status reports including outlining key accomplishments, items for discussion, and next steps.\nPerforming budget vs. actuals findings by comparing project hours incurred to overall project budget.\nPreparing reports (summarizing work performed) including detailed findings and result dashboards.\nInnovation and Learning\nIdentifying areas of professional interest (i.e., cybersecurity, privacy, financial crimes compliance, accounting, etc.) and completing trainings to expand knowledge in the designated area.\nSupporting Innovation activities by providing internal recommendations related to improving the way in which we deliver services to clients (e.g., through Automation, increased standardization etc.)\nWHAT WILL HELP YOU BE SUCCESSFUL\nYou learn quickly and have the flexibility to adapt to changing roles and requests.\nYou enjoy working in a team environment and serving as a mentor to others.\nYou are highly organized and have familiarity with project management concepts.\nYou enjoy problem solving and have the ability to bring order to unstructured problems.\nYou have the ability to foster relationships with colleagues and with clients.\nYou can leverage listening skills to determine the best course of action for our clients.\nYou possess excellent written communication skills (experience with business writing preferred.)\nYOUR EDUCATIONAL & PROFESSIONAL CREDENTIALS\nBachelors Degree and 2+ years' experience with internal or external audit or controls testing.\nStrong skills in Microsoft Office suite applications with emphasis on Excel, Word, and PowerPoint.\nProtiviti is not registered to hire or employ personnel in the following states – West Virginia, Alaska.\nProtiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.\nProtiviti is an Equal Opportunity Employer. M/F/Disability/Veteran\nAs part of Protiviti’s employment process, any offer of employment is contingent upon successful completion of a background check.\nProtiviti is committed to being an equal employment employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to HRSolutions@roberthalf.com or call 1.855.744.6947 for assistance.\nIn your email please include the following:\nThe specific accommodation requested to complete the employment application.\nThe location(s) (city, state) to which you would like to apply.\nFor positions located in San Francisco, CA: Protiviti will consider qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.\nFor positions located in Los Angeles, CA: Protiviti will consider for employment qualified Applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\nProtiviti is not registered to hire or employ personnel in the following states – West Virginia, Alaska.\nProtiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.\nJOB LOCATION\nOH PRO AMERICAS DELIVERY CENTERShow more Report"}, {"company": "Elementor", "job": "Senior Data Analyst", "city": "Ramat Gan", "date": "30d+", "rating": "4.1", "link": "", "description": "We are looking for a sharp and highly analytical Data Analyst to join our fast-growing company and help us make data-driven decisions for performance optimization.\nAs a Data Analyst, you will play a key role in shaping Elementor's product and business strategy, defining our KPIs, and identifying business opportunities.\nAs a member of the Analytics team in our Data department, you will work across the organization and provide key insights to multiple departments (Marketing, Product, Finance, Business Strategy, CX, and more), helping them focus on what’s important.\nThis position is located in Israel only.\nRequirements:\n\n4+ years of experience in quantitative analysis, preferably at an internet company\nExcellent communication skills with the ability to deliver results of analyses clearly and effectively\nExcellent SQL skills - a must\nExperience with at least one of the following visualization tools: QlikView, Qlik Sense, Power BI, Tableau - a must\nStrong Python capabilities - a major advantage\nExperience working with big data tools: Redshift, BigQuery, Databricks, etc. - a must\nA highly independent and creative team player who works well with others\nHands-on technical experience with Google Analytics, Google Ads, and Facebook Ads - an advantage\nBSc/BA in a highly quantitative field such as mathematics, statistics, economics, or engineering - an advantage\nWork Environment:\n\nWhat do we do?\nElementor is the leading website building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 12M websites powered by Elementor. More than 8% of all websites around the world are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe believe in empowering both our employees and our users.\nElementor is a place where you can truly grow professionally and personally.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey. We take great pride in Elementor's constant scaling.\nResponsibilities:\n\nWork with various managers to learn their business insight needs, including tracking metrics, dashboards, and reports\nAct as a bridge between units’ business needs and the BI department, ensuring high-quality execution quality, data integrity of analyzed insights, and reporting deliverables\nEstablish reporting methodologies and cross-department standards\nGo beyond the numbers to communicate, influence, support, and execute business decisionsShow more Report"}, {"company": "", "job": "Senior Bookkeeper", "city": "Southern", "date": "13d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=216&ao=1110586&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_96a3a848&cb=1676383673378&jobListingId=1008429561304&cpc=8795CF9063CD573D&jrtk=3-1-1gp841mu8is1r801-1goosm0qli7l8800-108e105c6549d161--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBkYcbWazZZBXDumdHppuRS_1p417k_VMSkuTZxlPJrHYhVHE4JXDZYGADkLZza_VS_uwjByWFHUen7Snu8OCoGrxYf5p2lYSLkkpIlM3fODSEVok85KidTkdrd3oI0X3GN6qVgspYwEIHnVTRqO0xki7qafFDmjUTP2PQtPgUvBrHDbVnlse502v1fJhZcuvoQvmMOEcBuzlHFXsB5OUn6JzwDeSlet_NJ3Chj7fe-XhbIes5ct3s20GkTx7crBYGPIsU8QStyVoWwcmWYuNyW_ZxRCawnP9AgerXgQPnluoMHhnc896SkAfitnQ-Ai_UZw1-yPYZaIYdiDIfXPrX2ieCEDmbKAN45c5Nf-lKdjblcoPX7UxNjBfaKFIw6NR4MDH2dZPz3zUxae1X5C380pt8XLXpHR-my6HyIlEF0vpfhHCJYHd5RAhIde85oRF8FTjYm0PPcgByQB8kyrFqesNJbtu9lrSP02IeKofaUKT6h8H8lkgK4BdwQbnWJfMq7d5s32sBlmsEi_eUq2fM4lPfSYMtlyUI8hPSZzOIGx0AwGmgDMXfEyB1FR-_sOmqmUKF9aak5mxsNDBrbaI-OvJUl5LQrKIel1ojFEjnWo4gSpR0ucnJFJ_9D-ddf3nh1wCjSZiEEjTXhicyCV3BA", "description": "Job Summary: As a Payroll Accountant and Bookkeeper, you will join our finance team, reporting to our Director of Finance. You will handle our day-to-day financial activities, bookkeeping and accounting functions and will be in charge of the company’s end to end bookkeeping. Essential Duties and Responsibilities · Handling employee full life cycle including onboarding, termination of employees and all salary related updates. · Processing Israeli payroll, laws, and procedures.\n\nTimely execution of tax, National Insurance and benefit related payments · Support the sales team and ongoing review of the company’s revenue cycle (invoices to customer, AR, billing) · GR’s review and reconciliation to relevant expense, review of production accounts and assistance with periodically inventory closing. · Ad hoc reports, assistance with analysis and relevant programs (incentive programs) · Bank accounts managing, monthly reconciliation and reports. · IC reconciliation, conduct periodic reconciliations of all accounts to ensure their accuracy · Overall review of the trial balance and specific accounts. · Conduct periodic reconciliations of all accounts to ensure their accuracy.\n\n\nEagerness to learn and self-motivated personality . · Ability to manage multiple projects simultaneously . · Certified bookkeeper- Minimum level 2. · Experience with Multi Monetary bookkeeping and accounting systems.\nPrevious experience in a multinational company – A must. · Strong written and oral communication skills. High level of English (Both written and Oral) – A must. · Ability to work independently in accordance with established policies and regulations.\nStrong Microsoft Excel including formula integration (sumif, vlookup etc.).\n\nShow more Report"}, {"company": "Papaya Global", "job": "Payroll Operations Group Lead", "city": "Herzliya", "date": "30d+", "rating": "3.6", "link": "", "description": "Who are we?\nPapaya Global is an established B2B tech unicorn in hypergrowth. We are on a mission to reimagine the payroll category with a game-changing, disruptive technology.\nPapaya Global is reinventing workforce management, global payroll and payroll payments to remove the friction of complexity and regulation create. Our automated platform helps companies hire, onboard, manage, and pay people in more than 160 countries.\nWe don’t just cover the globe with our solution; we are global. We are comprised of people from different countries, different cultures, and different backgrounds. Diversity is our secret weapon.\nWe are looking for a Payroll Operations Group Lead to join our team. We work closely with fast-growing companies worldwide, managing their global payroll through our SaaS platform. We are looking for a candidate with a passion for details, timelines, and global operations.\nYou will:\nManage the Global Operations team to ensure that goals and tasks are achieved and completed in the required timeline.\n Improve existing work processes to achieve better efficiency and scalability\nLearn a lot about global payroll calculation and be exposed to a wide variety of payment systems and suppliers.\nResolve payroll discrepancies\nBe accountable for Papaya’s suppliers to ensure E2E accuracy of payroll data streamline.\nBuild trusted relationships with Papaya's suppliers for future growth and commitment\nEnsure teamwork responsibilities and a commitment to meeting timelines and quality\nRequirements:\n\nBachelor’s degree in Business, Finance, and/or Economics\nExperience managing complex finance operation teams and past experience with managing managers.\nStrong teamwork-leading skills, ability to adapt to a fast-paced, international work environment with a passion for making an impact\nFluent English and excellent communications skills. Additional languages are an advantage.\nExperience with business reporting and analytics\nExperience with payroll reporting is an advantage.\nProficient in Excel (Pivot & Vlookup)Show more Report"}, {"company": "PayPal", "job": "Lead Decision Scientist", "city": "Tel Aviv-Yafo", "date": "19d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4d72e695&cb=1676383676592&jobListingId=1008418271247&jrtk=3-1-1gp841q332jq8001-1goosm0qli7l8800-cc240413c8029979-", "description": "At PayPal (NASDAQ: PYPL), we believe that every person has the right to participate fully in the global economy. Our mission is to democratize financial services to ensure that everyone, regardless of background or economic standing, has access to affordable, convenient, and secure products and services to take control of their financial lives.\nJob Description Summary: What you need to know about the role- Decision scientists are highly motivated team players with strong analytical skills who specialize in creating, driving and executing initiatives to mitigate fraud on PayPal’s platform and improve the experience for PayPal’s hundreds of millions of customers, while guaranteeing compliance with regulations. Meet our team Decision scientists in the Digital Identity and Authentication team are problem solvers suited to approach varied challenges in complex big data environments. As part of our day-to-day job, we are collaborating with a wide variety of partners in the company, such as product experts, data scientists and engineers to bring our analytical insights to life, impacting the experience and security of millions of users around the globe.\nJob Description:\nYour way to impact\nDecision scientists deeply understand PayPal’s business objectives, as their impact on PayPal’s top and bottom lines is immense. As a Lead Decision Scientist, you will analyse key performance indicators and track financial and operational metrics with the aim of adapting PayPal’s advanced proprietary fraud prevention and experience mechanisms and enabling growth.\nYour day to day\nIn your role as a Lead Decision Scientist, you will:\nDevelop and own data-driven risk decision strategies to support PayPal’s global financial business goals\nPlan and execute long-term projects from start to finish\nDrive end-to-end processes with partners across many organizations\nWork with product and platform teams to develop cutting edge, scalable and safe products, to enhance the experience for our global customers\nUtilize bottom-up, story based, innovative techniques to apply analytical know how onto PayPal’s risk strategies\nMeasure performance against KPIs and goals\nMaintain ongoing communication with stakeholders and peers across the company and share updates with senior leaders in a clear manner\nWhat do you need to bring-\nBachelor’s Degree or above in one of the following: economics, finance, engineering, exact sciences, etc. (MBA – an advantage)\n5+ years of work experience in relevant positions (e.g. Decision scientist, data analyst, statistician, data scientist, FP&A, product/process manager, risk management, army intelligence units)\nProven analytical skills\nTechnical orientation; Experience in SQL / R / Python / other programming language – a must\nExcellent English verbal and written communication skills\nQuick-thinker, fast learner, wide general knowledge, problem solver\n**We know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates. Please don't hesitate to apply.\nOur Benefits:\nAt PayPal, we’re committed to building an equitable and inclusive global economy. And we can’t do this without our most important asset—you. That’s why we offer benefits to help you thrive in every stage of life. We champion your financial, physical, and mental health by offering valuable benefits and resources to help you care for the whole you.\nWe have great benefits including a flexible work environment, employee shares options, health and life insurance and more. To learn more about our benefits please visit https://www.paypalbenefits.com\n\nWho We Are:\nTo learn more about our culture and community visit https://about.pypl.com/who-we-are/default.aspx\n\nPayPal has remained at the forefront of the digital payment revolution for more than 20 years. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, the PayPal platform is empowering more than 400 million consumers and merchants in more than 200 markets to join and thrive in the global economy. For more information, visit paypal.com.\nPayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at paypalglobaltalentacquisition@paypal.com.\n\nAs part of PayPal’s commitment to employees’ health and safety, we have established in-office Covid-19 protocols and requirements, based on expert guidance. Depending on location, this might include a Covid-19 vaccination requirement for any employee whose role requires them to work onsite. Employees may request reasonable accommodation based on a medical condition or religious belief that prevents them from being vaccinated.Show more Report"}, {"company": "CyberArk", "job": "Purchasing Manager", "city": "Petah Tikva", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=219&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d029d81a&cb=1676383677844&jobListingId=1008348450809&jrtk=3-1-1gp841rajkf26801-1goosm0qli7l8800-49df92e66bb93794-", "description": "Date: Feb 10, 2023\nLocation:\nIsrael, Petach Tikva\nJob Category: Finance\nDepartment: Corporate Functions (HR, Finance, Legal)\nWho we are:\nCyberArk (NASDAQ: CYBR), the global leader in Identity Security, Centered on privileged access management, CyberArk provides the most comprehensive security offering for any identity – human or machine – across business applications, distributed workforces, hybrid cloud workloads and throughout the DevOps lifecycle. The world’s leading organizations trust CyberArk to help secure their most critical assets\n\nWhat will you do:\nCyberArk Software is seeking a highly motivated Sourcing Manager to join our Global Procurement Team. The Sourcing Manager is purchasing professional who can deliver improved value and contract closure, across a wide range of business areas in respect to IT, R&D and Cloud contracts in a complex, ever changing and fast-moving environment.\nThe Sourcing Manager will oversee the purchasing process and ensure internal satisfaction and compliance. This is role includes hands-on activities and the ability to multitask and work with others is essential. This role will report to the Global Procurement Director.\nManager purchasing process including coordination and follow up on orders, product delivery dates and internal customer satisfaction\nMaintain excellent relationships with internal customers and vendors\nResearching new suppliers per the business needs\nNegotiating with suppliers and building positive, long-term relationships\nWork closely with finance and accounting team (PR/PO/Invoice/payments)\nResolve day-to-day issues that arise relating to purchasing and materials\nProviding support to all procurement-related tasks & special projects as needed\nWhat you need to succeed:\nDegree in business, economics, procurement or related field\n5+ years of similar experience as a Purchasing Manager, Sourcing Manager, Procurement Specialist, or other relevant experience\nFamiliarity with IT domain, Cloud, and R&D types of engagements\nHigh level of Business understanding\nExcellent ability to negotiation and leading commercial engagements with international vendors\nExperience in closing large agreements - major advantage\nExperience with ERP software, proficiency in Microsoft Office\nStrong interpersonal skills, team player, experience working in cross-cultural environments\nExperience in working for an international company in the global environment - advantage\nExperience working with all levels of management and consulting with key business stakeholders\nAbility to work independently with minimal supervision, motivated self-starter\n\nTo learn more about CyberArk, visit https://www.cyberark.com, read the CyberArk blogs or follow on Twitter via @CyberArk, LinkedIn or Facebook.\n#LI-OC1Show more Report"}, {"company": "Klips", "job": "Senior Product Designer", "city": "Ramat Gan", "date": "24h", "rating": "2.0", "link": "", "description": "Klips is a fast-growing innovative Fintech company, creator of next generation Financial Hub including Crypto trading, CFD trading, Digital Banking facilities, Shares dealing, Payments, and CRM, using cutting-edge technologies to bring a new era in financial freedom terms.\nWe solve real day-to-day problems by unifying financial services and making them accessible while reducing the friction caused by using multiple service providers. We are now recruiting the Klips core team! This is your opportunity to take part in changing the financial world.\nKlips is a global company with offices in Israel, Cyprus, Romania, and South Africa.\nWorking in Klips means enjoying the flexibility, personal growth, and professional development.\nJOIN US!\nRequirements:\n\nStrong UI and UX design ability\nFluent English communication capability is required\nBachelor or Master degree in Art/Design, or equivalent professional experience\n8+ years of professional user experience/product design experience\nGlobal design project experience is nice to have\nExperience on branding design is nice to have\nWorking experience in big companies is nice to have\nExperience in trading, crypto, banking & finance is a big advantage\nResponsibilities:\n\nResponsible for the product design of Klips(UX/UI), improving user experience of all products.\nDiscovering design optimization points, improving design standards, and promoting implementation.\nUnderstand and respond to user problems and data (measurement tests, usability studies) to provide design decisions and recommendations.\nWork with a cross-functional, cross-regional team of designers, product managers, developers and other stakeholders.\nBalance user needs with technical constraints to help realize the team’s ideas, translating these ideas into extraordinary visuals.\nJoin projects at varying stages of production, ranging from prototyping to providing scalable production resources, to polishing and optimizing UI assets for shipping, working closely with engineering to ensure a high-quality product.\nParticipating in Design System building.\nWhat we offer:\n\nWorking at Klips\nDo something meaningful; Be a part of the future of finance technology and one of the leading company in the new industry vision\nFast moving, challenging and unique business problems\nInternational work environment, flat organization, flexible working hours\nGreat career development opportunities in a growing companyShow more Report"}, {"company": "Deloitte", "job": "Business Controller Lead", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a28b8b78&cb=1676383680942&jobListingId=1008447188229&jrtk=3-1-1gp841ub7kuif801-1goosm0qli7l8800-24ba1cf5e47a3e22-", "description": "Description\n\nDeloitte Israel is looking for a business corporate controller to join our finance team.\n\nThe successful candidate will lead the controllership team, will be involved in all the financial processing, and manage all aspects of the finance department’s daily operations.\n\nDeloitte Israel has been an integral part of the US firm since 2019 when the US-Israel member firms combination agreement was executed. The Finance team is managed on a single platform and the continuation of the finance transformation is supported through integration with state-of-the-art technology systems and processes.\n\nThe position is open to both women and men\n\nThe job is full-time and hybrid in Azrieli Towers, Tel Aviv/from home\n\nResponsibilities:\n\nManage the controllership team in Israel and collaborate with US and global finance teams across the organization\nDrive the consolidated periodic financial statement close process, implement controls, monitor changes, oversee the close execution with global teams.\nResponsible for all accounting issues, operations and activities, guide controllers, implement new processes and improve existing analysis and controls.\nOversee and review the financial data, AR, collection, AP, GL maintenance, Capex, reconciliations, allocation, FX gain/loss ect…\nManage day to day analyses and management reporting, ensure proper internal controls\nDevelop relationships with global teams\nRequirements\n\nRequirements:\n\nCPA (BIG 4), BA in Accounting, MBA (is a plus)\n10+ years experience as a controller\nMust have strong accounting knowledge and strong business perspective.\nProven experience as a controller in global company\nProblem solving skills\nStrong management capabilities and proactive leader\nTeam player – excellent interpersonal skills\nExcellent written and verbal communication skills, English and Hebrew\nExperience working with SAP is an advantage\nReporting to the VP Finance\n\nAt Deloitte, we believe that an inclusive mindset and diverse workforce are two of our greatest competitive strengths. That’s why we continue to reinforce our commitment to foster inclusionShow more Report"}, {"company": "Immunai", "job": "Data Protection Compliance Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "Data Protection Compliance Manager\nBackground\nAt Immunai, we’re on a mission to revolutionize the way we treat immune diseases. We believe that by harnessing the power of immunomics and machine learning, we can unlock the key to developing the next generation of immunomodulatory drugs.\nOur team, comprised of immunologists, engineers, drug developers, computer scientists, and entrepreneurs, uses cutting-edge technology like single-cell multiomics and functional genomics to map the human immune system like never before. We’re delving deep into its inner workings and uncovering novel insights into immune disease pathology.\nWith the use of neural networks and transfer learning, we’re sifting through a massive immune database and deciphering the mechanisms of action and resistance of existing drugs. This information is helping us identify and validate new immune targets and target combinations and supports the development of improved therapeutics.\nOur ultimate goal is to bring breakthrough medicines to patients as quickly and successfully as possible. With our engineering-first approach, we’re confident we can make it happen. Together, we’re shaping the future of immune disease treatment.\nLocation – Tel Aviv (Hybrid)\nFor details - www.immunai.com, shlomit@immunai.com\nResponsibilities\nWe seek an exceptionally motivated individual to join our talented team in a highly collaborative startup environment at the intersection of immunology, AI, and new genomic technologies.\nThis role's responsibilities are:\nCreate the company’s Data Protection and Privacy policies and procedures in compliance with ISO27001, GDPR, and customers' requirements. Examples of required policies are Privacy policies, Supplier management, Tools management, Access and permissions management, Data classification, DR plan, BCP Plan, Risk management, etc.\nWork with IT, Legal, HR, Finance, RD, DevOps, Product, and Project teams to design and create relevant work instructions to comply with the relevant Data Protection and Privacy policies.\nAssess the company’s information systems regularly to ensure proper data protection\nClassify the company’s data and enforce relevant protection mechanisms per classification\nFacilitate relevant data protection activities on a regular basis across all relevant company teams\nFacilitate formal ISO audits\nRequirements:\n\nRequirements:\n1+ years experience with Information security standards and procedures\nDealing with ISO27001 standard\nGood ability to read, understand and interpret ISO27001 requirements, GDPR requirements, and customer contracts.\nExcellent interpersonal capabilities, ability to interact with all company functions, set and facilitate meetings, derive action items, and pursue progress from all relevant stakeholders.\nBasic ability to learn and understand basic IT systems and security configuration\nExcellent ability to generate procedures/SOPs documentation in English while using the expected level of verbiage (similar to SOPs verbiage).\nExcellent ability to generate simple checklists work instructions and forms that translate formal procedures into day-to-day working documents.\nStrong analytical skills, problem-solving ability, attention to detail, and innovation atitude\nBe very organized, process-oriented, and accurate (for executing and maintaining the activities that will be defined as part of this new procedure)\nFamiliarity with life sciences is an advantage\nDesired Personal traits\nYou want to make an impact on humankind\nYou prioritize “We” over “I”\nYou enjoy getting things done - with super high quality\nYou collaborate effectively with people of diverse backgrounds and cultures\nYou have superior skills and experience, and constantly strive to be world-class in what you do\nYou constantly challenge your own assumptions, pushing for continuous improvement\nYou have a growth mindset\nYou take pride in owning crucial tasks and successfully executing them\nNo problem is not your problem\nYou make decisions that favor the company, not yourself or your teamShow more Report"}, {"company": "Edwards Lifesciences", "job": "Senior Sales Specialist - Distributor Surgical", "city": "Tel Aviv-Yafo", "date": "5d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=223&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_881b945c&cb=1676383687805&jobListingId=1008447723501&jrtk=3-1-1gp8424vmjoq8801-1goosm0qli7l8800-b120728b73f7bd86-", "description": "Advise sales management on distributed sales customer information, market trends, and Edwards' historical sales data for development of strategies to achieve business development goals. Ensure validity of all distributed sales transactions and pricing.\n\nBe the primary contact with Israeli cardiac surgeons and hospital staff to ensure sales and promotion of the Surgical portfolio in collaboration with local distributor.\n\nKey Responsibilities:\n\nLead in analyzing customer pricing data, and developing and updating customer pricing data reports for provision to Distributors, in keeping with Distributor agreement\nAnalyze Distributor chargeback/rebate claims; negotiate and provide solutions to resolve discrepancies with Distributors\nLead in analyzing Distribution sales trends, develop findings, and propose solutions for sales management\nResolve complex Distributor issues and propose solutions to achieve desired sales results\nAssess and prioritize Distributor AR account issues in collaboration with Finance to allocate resources to address discrepancies\nConfirm accuracy of sales tracings and Distributor sales shipments\nWorks independently on complex projects and/or lines of work\n\nEducation and Experience:\nBachelor's Degree in in related field of study, previous commercial background, business analysis experience including, spreadsheets, database management systems, and word processing Required\n\nAdditional Skills:\n\nProven expertise in MS Office Suite including Word, PowerPoint, Access, and Excel; Qlik experience preferred\nExcellent written and verbal communication skills and interpersonal relationship skills including consultative and relationship management skills\nAbility to quantify abstract conceptual data into concrete analysis\nAdhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control\nExperience with distribution contracts preferred\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "ICL Group", "job": "Senior Corporate FP&A Analysist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=224&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0ac38b0c&cb=1676383689242&jobListingId=1008271477481&jrtk=3-1-1gp8426djp6ci801-1goosm0qli7l8800-5e938ce343041446-", "description": "Company: ICL\nProfessional/management:Professional\nDepartment: Corporate FP&A\nLocation: Tel Aviv\n:Department/ unit description\nFull time job, reporting directly to Corporate FP&A Manager ( based in Tel-Aviv, Israel). Department structured of 5FTEs working in local HQ offices\n\n:Brief job description\nAreas of responsibility\nWe are seeking for a Senior FP&A Analyst who will play a key role in supporting ICL’s strategy & FP&A processes\nThis person should be highly motivated, passionate and willing to work in a dynamic and fast paced environment; be a cross-functional team player with outstanding analytical skills and “out of the box” mindset. An ability to see the strategic BIG picture whilst managing skillfull financial details\n\n:Job demands\nBA degree required, preferably in Finance, Economics, Accounting (CPA)\n 5years of professional experience in FP&A roles+\nManage multiple tasks in a deadline driven environment whilst maintaining high level of quality & precision\n“Out of the Box” mindset\nEnglish/Hebrew Proficiency\nExperience with SAP, ERP, BI systems – an advantage\nStrong demonstrable experience in constructing & analyzing financial models, including DCFs – an advantage\nStrong qualitative and quantitative research & analytical abilitiesShow more Report"}, {"company": "Fireblocks", "job": "Senior Product Manager - Wallet", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.7", "link": "", "description": "Fireblocks is one of the most well-funded and fastest-growing start-ups in the crypto and blockchain space. We're on a mission to enable every business in the world to securely and easily support digital assets and cryptocurrencies. Today, over 1500 customers rely on the Fireblocks platform to store, transfer and issue digital assets – and we're just getting started.\n\n\nWe are looking for an experienced hands-on product manager to expand Fireblocks' domination of the digital asset market. You will join the Wallet product team, leading our products for holding digital assets.\n\n\nYou will:\n\nOwn a product domain. Identify and define the goals and initiatives for making an impact on the product's growth, efficiency and stability while ensuring an excellent user experience.\nGather feedback on our existing and new solutions from our customer experts at Fireblocks as well as from an assembled customer advisory board.\nDefine our product success metrics and clarify the requirements with our execution team - R&D, Product Design & Data.\nEnsure successful features' rollout by working with our Customer Success, Customer Support, Sales, Marketing, Legal & Finance, run beta programs and measure the features' success.\n\nRequirements\n\n4+ years of Product Management experience\nExperience as a Software Developer or a Product Manager for developer products - Must\nAnalytical thinking and ability to prioritize based on measured impact\nAbility to empathize with customers and to communicate their needs\nExcellent interpersonal skills and ability to work in harmony in a cross-functional team\nGreat verbal & written communication skills, always aiming for clarity and no ambiguity when describing use cases and features\nObsession with user experience and a need to continuously simplify complicated subjects\nCyber or fintech background - an advantage\n\nFireblocks' mission is to enable every business to easily and securely access digital assets and cryptocurrencies. In order to do that, we strongly believe our workforce should be as diverse as our clients, and this is why we embrace diversity and inclusion in all its forms.\n\nPlease see our candidate privacy policy here.Show more Report"}, {"company": "MSD", "job": "Financial Planning and Analysis Manager - Israel & Gulf/Levant", "city": "Netanya", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=226&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7ad0f0de&cb=1676383692132&jobListingId=1008246693564&jrtk=3-1-1gp842993klv0801-1goosm0qli7l8800-96339e1b6911cc75-", "description": "Job Description\nOur Finance team brings together our financial perspectives into our overall strategic and tactical decision making. We use state-of-the-art techniques for financial analysis, planning, accounting, reporting and performance evaluation. This allows the organization to continue advancing medical innovation and improve lives.\nDuties & Responsibilities:\nProviding financial analysis and guidance to commercial leads and business units to ensure a maximum return on investment.\nParticipate in and support the financial planning processes by providing timely analysis to commercial leads.\nEvaluates cluster and country financial results to ensure optimization of resources – making trade-offs across the business to identify opportunities and ideas for ensuring the appropriate investments for maximized return.\nAct as a business partner with commercial business units and leads to support optimal business decisions.\nWork collaboratively with Business Support Center and to align and deliver local market finance and business objectives.\nPerforms special assignments on an ad hoc basis.\nEnsure compliance with company policies and procedures and supporting the company mission, values and standards of ethics and integrity.\nSkills and Competencies:\nBachelor’s or Master’s Degree in Business Administration, Accounting or Finance.\nMinimum 5 years of experience in the field of Finance. Preferably working experience in Finance with experience in a multinational company or Pharma background in Financial Planning and Analysis.\nStrong business acumen and working knowledge of applications/business processes.\nAbility to work in a fast-pace environment and under pressure.\nHighly engaged, collaborative and a strong team player.\nStrong communication, interpersonal, and organization skills required.\nBusiness-level English skills (speaking and writing) required.\nOur Support Functions deliver services and make recommendations about ways to enhance our workplace and the culture of our organization. Our Support Functions include HR, Finance, Information Technology, Legal, Procurement, Administration, Facilities and Security.\nWho we are …\nWe are known as Merck & Co., Inc., Rahway, New Jersey, USA in the United States and Canada and MSD everywhere else. For more than a century, we have been inventing for life, bringing forward medicines and vaccines for many of the world's most challenging diseases.\nToday, our company continues to be at the forefront of research to deliver innovative health solutions and advance the prevention and treatment of diseases that threaten people and animals around the world.\nWhat we look for …\nImagine getting up in the morning for a job as important as helping to save and improve lives around the world. Here, you have that opportunity. You can put your empathy, creativity, digital mastery, or scientific genius to work in collaboration with a diverse group of colleagues who pursue and bring hope to countless people who are battling some of the most challenging diseases of our time. Our team is constantly evolving, so if you are among the intellectually curious, join us—and start making your impact today.\nCurrent Employees apply HERE\nCurrent Contingent Workers apply HERE\nSearch Firm Representatives Please Read Carefully\nMerck & Co., Inc., Rahway, NJ, USA, also known as Merck Sharp & Dohme LLC, Rahway, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails.\nEmployee Status:\nRegular\nRelocation:\nNo relocation\nVISA Sponsorship:\nTravel Requirements:\n10%\nFlexible Work Arrangements:\nHybrid\nShift:\nValid Driving License:\nHazardous Material(s):\nNumber of Openings:\n1\nRequisition ID:R198984Show more Report"}, {"company": "AppsFlyer", "job": "Regional Marketing Manager SANI", "city": "Herzliya", "date": "21d", "rating": "4.5", "link": "", "description": "Are you a passionate B2B marketer with experience in hyper-growth SaaS and mobile businesses? If you are, read on!\n\nOur mission at AppsFlyer is to give digital marketers the very best tools and insights to help them be as successful as they can be. With a highly talented, global team of over 1,500 people, and growing, we're only just getting started.\n\nWe're looking for a hungry, passionate, tech-savvy B2B marketer to join our vibrant, friendly office in Herzliya and lead our field marketing programs and customer lifecycle activities in SANI region (South Europe, Africa, Nordics, Israel). You'll be taking a market-leading, mission critical SaaS offering out to digital marketers and brands in the region.\n\nIn your B2B toolkit, you'll be highly analytical, independent, a competent storyteller, a first class project manager and have a flair for putting together exceptional events and experiences.\n\nWorking closely with your local colleagues in Sales, Customer Success and Partnership Development, as well as a large, cross-functional team of marketing experts in our Global HQ. You'll be responsible for planning, coordinating, executing and reporting all revenue-focused marketing programs for each individual market to deliver new customer leads, existing customer engagement and partnership development goals.\n\nThe role reports to the Managing Director of EMEA-SANI, and to the Head of Marketing for those respective markets\n\nThis position is temporary for one year\n\nWhat you'll do:\n\nEvents - You're passionate and hands-on about events and will work with Sales, Customer Success, Partnership Development and third party partners, such as trade associations and conference organizers, to create a pipeline of events across all markets that help raise AppsFlyer's brand awareness, position the business as the domain authority for mobile measurement and drive new demand and upsell opportunities.\n\nContent, thought leadership & PR - You enjoy creative copywriting and are responsible for positioning AppsFlyer as the market leader in your local markets. You'll be working closely with the Global Content & Mobile Insights + Comms teams, as well as local PR partners, you'll create thought leadership campaigns to promote AppsFlyer's portfolio or cross-device measurement and fraud protection services. These could be anything from blogs and white papers, to major PR campaigns or event content\n\nData - You're all about the numbers. As the lead for the individual country growth squads, you'll be responsible for managing ongoing growth initiatives, reporting the results of our time and financial investments and optimizing our activities on an ongoing basis. You'll have the support of our Global Marketing Operations team to do so, as well as numerous BI tools\n\nTeam player - You're a go getter and problem solver with a great team spirit. You're happy being part of a close knit team that works hard and plays hard and you're not afraid to roll your sleeves up and do what's right for the team\n\nWhat you have:\n\n3-5 years of experience in B2B marketing roles ideally within the technology, SaaS or mobile software sectors\nProven track record of planning and executing on field marketing campaigns, generating pipeline and strengthening customer relationships.\nExceptional project management skills, writing, communication, and presentation in English.\nPassionate about technology and the latest trends and best practice in B2B marketing\n\nBonus Points:\n\nA degree in Marketing or related subject area\nExperience in CRM and events systems (Salesforce, Splash & Marketo as advantage).\nCompetitive analysis and account mapping experience - an advantage\nAbility to speak an additional relevant language other than English is highly desirable, but not a must have\nKnowledge of the E-commerce, gaming or finance mobile marketing world an advantage\n\nAs a global company operating from 20 offices worldwide, we reflect the human mosaic of the diverse and multicultural world in which we live. We ensure equal opportunities for all of our employees and promote the recruitment of diverse talents to our global teams without consideration of race, gender, culture, or sexual orientation. We value and encourage curiosity, diversity, and innovation from all our employees, customers, and partners.\n\n\"As a Customer Obsessed company, we must first be Employee Obsessed. We need to make sure that we provide the team with the tools and resources they need to go All-In.\" Oren Kaniel, CEOShow more Report"}, {"company": "BlackSwan Technologies.", "job": "Technical Delivery Lead - Israel", "city": "Israel", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=228&ao=1136043&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8289a39d&cb=1676383694981&jobListingId=1008279440954&jrtk=3-1-1gp842c25jc92801-1goosm0qli7l8800-d2148a402550f681-", "description": "BlackSwan Technologies is forming a group that will spearhead the delivery of our engagements. We are seeking a group of select few natural leaders, technology savvy, delivery experts, with a passion to disrupt digital transformation. These individuals will own the successful delivery of cutting-edge, highly scalable, mission critical, enterprise software embedded with the future of knowledge technologies, Composite AI, and open source intelligence on top of a cloud agnostic, serverless architecture.\n\nIf you are a seasoned professional able to demonstrate strategic thinking, strong work ethics and business results orientation, coupled with strong delivery acumen, excellent communication and negotiation skills, leadership by example, and exceptional problem-solving capabilities, you have found your match.\n\nResponsibilities:\n\nLead engagements with massive multinational organizations - Be the Technical, Functional and Non-Functional SME and primary point of contact for the client(s) throughout the engagement life-cycle\nBecome a trusted advisor, by maintaining expert knowledge of the software, and the customer business, with the ability to identify risks, issues, impacts and recommend end-to-end solutioning throughout the engagement lifecycle\nRepresent the Delivery organization in new engagements scoping, enforcing delivery strategy and planning\nFacilitate strategic conversations with clients to identify and explore opportunities, promote synergies and overcome challenges\nFacilitate the escalation of critical issues and assist in value-based issues prioritization\nOversee tracking aspects of engagement delivery from inception to BaU, and improve the ways of working, in close collaboration with the Project Manager (which owns the engagement governance)\nOversee and ensure adherence to all QA processes and offer SME acumen during Internal and client acceptance testing and defect triages\nEnsure measurable customer satisfaction through successful delivery of defined scope\n\nRequirements:\n\nBachelor's/Master’s Degree in Computer Science, Engineering, IT, Mathematics, or comparable field preferred\n3+ years of experience successfully leading delivery/implementation efforts for enterprise-scale software development products/projects from concept to launch in a delivery/tech-lead role, or similar\n4+ years of proven experience with mission critical projects/programs in a software/platform architect/devops/engineering/similar role, with highly advanced technical knowledge in assigned specialism\n2+ years In depth cloud experience with AWS, Azure and/or GCP\nFunctional knowledge of programming/scripting languages, such as JavaScript, PowerShell, Python, Bash, SQL, .NET, Java, PHP, Ruby, PERL, C++, R, etc. Hands on experience with Gremlin, SPARQL and GraphQL is highly desirable\nAbility to learn new technologies fast, work independently and multi-task to meet deadlines\nProven Agile experience using Jira, Confluence\nBusiness knowledge of Finance, Compliance, Health Domains is highly desirable\nPeople who speak their mind\n\nWe Appreciate Those Who Have:\n\nExcellent understanding of large enterprises, in particular Financial Institutions, their ecosystem, constraints, and business drivers\nPeople leadership, good interpersonal skills and ability to influence senior stakeholders, internal and external, through trustworthiness, comprehensive communication and diplomacy skills\nExperience of working with multi-disciplinary teams and ability to manage and lead outside of reporting lines\nStrong Technical knowledge and experience in delivering software / platform engineering solutions, providing extensive technical advice and managing user requirements and process and standards maintenance\nStrong work ethics, service mindset and, excellent people skills\nDesire to proactively drive change in a fast-paced environment\nDesire to solve a problem once so it will never repeat\nAbility to simplify complex issues communication to stakeholders but go into the finest details when working with the team\nStrong understanding of version control systems (Git / codecommit) and application lifecycle management\nHighly proficient with IaC and Configuration Management tooling (Terraform, Ansible, Puppet, Chef)\nStrong understanding of CI/CD pipelines\nExperience working with Kubernetes, microservice architectures\nExperience with ECS, Fargate, S3, RDS\n\nWe Offer:\n\nA high-impact and high-profile role in an incredibly fast-paced growth environment\nPossibility to master cutting edge technologies, AI, deep learning, NLP, Serverless, Cloud Native, and more\nOpportunity to lead multinational teams in engagements with some of the worlds largest global enterprises\nA competitive remuneration package\nStable work based on employment contract\nFlexible and remote friendly working environment\n\nWho We Are:\n\nBlackSwan Technologies is reinventing enterprise software through Agile Intelligence for the Enterprise – a fusion of data, artificial intelligence, and cloud technologies that provides unparalleled business value. Our multi-tiered enterprise offerings include the award-winning platform-as-a-service, ELEMENT™, which enables organizations to build enterprise AI applications at scale, for any domain, quickly and at a fraction of the cost of alternatives. BlackSwan and its global partners also provide industry-proven applications that are ready-made and fully customisable for rapid ROI. These offerings are generating billions of dollars in economic value through digital transformation at renowned global brands. The private company maintains gravity centers in the UK, Germany, Poland, Israel, the US, and Sri Lanka.\n\nwww.blackswantechnologies.ai\n\nEqual Opportunities:\n\nAt BlackSwan Technologies, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace, from our community to our product. BlackSwan Technologies is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, BlackSwan Technologies will accommodate individuals with disabilities or a special need.Show more Report"}, {"company": "Plus500", "job": "Affiliate Manager", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "", "description": "500Affiliates is one of the most well-known affiliation programs in the fintech area.\nWith more than thousands of registered affiliates, we keep on growing, strengthening our relationship with our partners, and penetrating new markets.\nWe are looking for a new affiliate manager who is passionate about online marketing and ready to build long-term relationships with some of the most well-known publishers. This person will join our top team and take part in our current team efforts and growth areas.\nWhat you will do?\nExpand our affiliation program by searching for new partners and identifying new opportunities worldwide\nUpscale the current efforts - Collaborate with different teams to build and uplift the activity with our partners in order to achieve the main goals\nConduct various campaigns and working methods to improve profitability\nProactively track, report, analyze, and optimize the performance of the partnerships, including identifying issues as they arise, assessing possible solutions, and executing them\nManaging financial activities, responsible for monthly payments, fraud detection, and special deals\nWorking closely with the compliance teams to ensure the affiliates' activity complies with our guidelines\nExhibit and represent the 500Affiliates program in conferences and in-person meetings with affiliates\nRequirements:\n\nB.A / B.S.c degree\nProven experience in managing sales-related partnerships/user acquisition\nStrong communication, negotiation, and interpersonal skills\nStrong analytical skills\nFluency in English (additional languages is an advantage)\nPassionate about finance and online marketing - an advantage\nSelf-starter and independent. Ability to take an entire project from A to Z\nA people person and a team playerShow more Report"}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "Senior Automation Engineer", "city": "Jerusalem", "date": "6d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=230&ao=1110586&s=58&guid=0000018631cb030ea413bdaeeff20f8b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1e0c5ccf&cb=1676383698442&jobListingId=1008447190869&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp842fc7is35801-1goosm0qli7l8800-3cb2c19d6354d25b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAVbP2zSPzHZadxzjq9z7qSb6kn1y4FuQab9pfXWKezjGgTWdaeULsLBVh1jEOjP-Ep0_Pc7pCsTMEby8K_MZpYnVAJTtYYUFpoFs1od4kXs7HrpyFNJnT52V2aVz3SzsFEuk9J5VUXXhiZPXMQ6O88gS62bHXsSL0bSKwmliPr97F7IOD9aoQCocTTuAH3ijrBEh8Y4jWQEk4Lcs9-FTklY-efSHPz2TGwRWqQEWdvznMbL2Qvxf2A8dxzDpxM0Mv3rIdwqATW_5rFoy21Bd8UM9vFn-77wsIpFmu90oKJdcU1oipRu4F_comI_slw9tJYqXZbgj-g3Nml5ziE53nr2V1G0NfSS0Wr76L5k0V5ZiIkOr9nHVRZsOJDd_-vwHoswV3Cznhaw0wxBXNDt3Hz7eZ_v2e8OgOXD0PXNT0_guFKjYQR2EbNI0DkLFaCI3Zl1fj6H1rAfUZvUm0J2IAW_To0zKoo0aOu1jLAFp8vMKmh6SW5lBd7zODWsyLv3I-5lOkrvA3vM77qZiqyq5cE0WPcAzHkXjhi9tvjAe3Tb5QN13ivwth2Z08ypj8UBZU6HVE9qLaAwFS2z2IzxJcaRg14BYyi63uMI8aNa83-rhm57sBaDloMgS2l-ri_ZKfyzonWLNiSe5AvgbZYmVjx", "description": "Description: A rapidly growing fintech company that provides technology infrastructure powering the future of financial services. Leveraging our proprietary real-time banking core, we deliver innovative and scalable embedded payments, cards, lending and crypto solutions to millions of consumers and businesses. We are backed by leading investors and serve the world’s most essential fintech and technology companies. Together with our partners, we are reshaping global finance and financial inclusion.\n\nWhile our company is based in the United States, a majority of development activity is based in Israel. Our main office is in Har Hotzvim, Jerusalem, but our development teams work almost exclusively from home. Responsibilities: Work as part an Agile scrum team in the software development organization Design and develop clean, high-quality code that tests API and backend functionality automatically and is robust enough not to generate false positives Enhance the automation framework in collaboration with the automation framework team to add all necessary functionality to test your product Define test plans and test cases Log and document bugs in tracking system Requirements: At least 5 years of experience in automation tests using Java or C# Deep understanding of OO programming Experience with multi-threading Experience writing automation framework code Strong hands-on design, coding, and debugging skills High level of English (both written and spoken) It's a bonus if you have: Experience with Jenkins Experience with load and performance testingShow more Report"}]