[{"company": "Diageo", "job": "2023 MBA Summer Internship, Finance", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=0000018631c8ce66a899be2f55d29aa2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_02beeac0&cb=1676383505401&jobListingId=1008115081246&jrtk=3-1-1gp83sir9ncdv801-1gooshjljjijq801-7da8b3ecf589cc22-", "description": "Job Description :\nDiageo is a global leader in beverage alcohol with an outstanding collection of over 200 brands - old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world! Brands like Crown Royal, Ciroc, Johnnie Walker, Guinness, Tanqueray, Captain Morgan, Baileys, Smirnoff, Bulleit, Ketel One and Don Julio are at the very heart of what we do. Global or local, every one of our brands has a story - all have a unique purpose and role to play in creating enduring connections with people.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. This, as well as celebrating our inclusive and diverse culture, is core to our purpose of “celebrating life, every day, everywhere”!\nYOUR ROLE\nAs a 2023 summer intern, you will get first-hand experience with our work, people, values, and culture. Summer interns are given responsibilities and challenges with projects that have an immediate impact on the business. Throughout the summer, you are given multiple opportunities to engage with senior management through both project work, as well as informative and cultural events. All interns receive individual coaching and training from their immediate manager and program buddy. You are encouraged to perform to our high standards and are given the same kind of performance feedback we give our full-time employees.\nDuring the 10-week summer internship, you will be immersed in one of our key organizational business units and develop a business plan proposal that will get us a step closer in achieving our ambition.\nSample Finance Projects from past internships\nDevelop pricing strategies and consumer insights to promote growth within tequila and convenience brands\nBuild competitive benchmarking template to drive understanding of competitive landscape for luxury and reserve brands\nIdentify P&L impacts on Diageo Beer Company to forecast category trends and future commercial impacts\nProvide transparency into financial impact of cost components, structures, and drivers across North American market to drive cost savings\nKey Qualifications\nCurrently enrolled in an MBA program\nFinance MBA interns typically have 2 to 5 years of work experience\nSelf-starter; ability to work independently and own summer project\nProblem solving and critical thinking skills\nShown analytical / financial modeling skills\nExcellent verbal, written and interpersonal communication skills\nHighly ambitious, geographically mobile, and high level of business maturity\nProven high analytical capabilities and insight generation, emerging high potential future leader\nSalary Range:\nMinimum Salary:\n$50.00/hour\nMaximum Salary:\n$50.00/hour\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US based employees are eligible for healthcare benefits, retirement benefits, short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the roles primary location.\nWorker Type :\nInternship (Fixed Term)\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2022-09-02-07:00Show more Report"}, {"company": "Barclays", "job": "Banking Analyst - Expert Off Cycle Intern Programme - 2023", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=0000018631c8ce66a899be2f55d29aa2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_62d08ac6&cb=1676383506573&jobListingId=1008193780531&jrtk=3-1-1gp83sk1th7hn801-1gooshjljjijq801-98562c927cc73f1a-", "description": "Join the world of banking\n\nFeel the pace of international finance as you get involved in delivering financial advisory, capital raising, financing and risk management services to clients worldwide. Our bankers advise on everything from privatisations and mergers and acquisitions to debt and equity financings and restructuring. Want in? Apply to become an Off-Cycle Analyst.\nThe chance to make an impact\n\nAs an Off-Cycle Analyst, you’ll be surprised by what you can achieve. This is a unique opportunity to work within one of our Banking teams for an extended period of time, allowing you to truly immerse yourself in our work and culture and gain invaluable insight. You'll have ample opportunities to expand your horizons across different sectors and products within Banking, and across the Investment Bank as a whole. The internship programme will provide you with the support and networking opportunities you need to find your place in our world. You may also work on projects that include:\n\nfinancial analysis and modeling\nvaluation\nindustry research\nclient due diligence\ndeveloping written materials, including offering memoranda and new business presentations.\n\nA place where you can thrive\nAt Barclays, you’ll be surrounded by people who will help you achieve your ambitions. Our collaborative, supportive environment gives you the chance to build solid relationships with senior leaders and peers alike. During the programme, you’ll also:\n\nparticipate in formal and informal training\nconnect with junior and senior mentors\nattend dedicated networking sessions and other programme events\nreceive detailed performance feedback\ngive back to the community through volunteer events.\n\nAnd if you really impress us, this could be the beginning of an incredible career. We invite top-performing, eligible Off-Cycle Analysts to join us as full-time Banking Analysts after graduation.\n\nTo be considered for this programme, you must:\ncurrently be pursuing an undergraduate degree with anticipated graduation year of 2023 or 2024\nMeet the following language requirements for the location you are applying to\nAmsterdam – Mandatory: Dutch and English\nDubai – Mandatory: English, Desirable: Arabic\nFrankfurt – Mandatory: German and English\nMadrid – Mandatory: Spanish and English\nMilan – Mandatory: Italian and English\nParis – Mandatory: French and English\nStockholm – Mandatory: one of the following - Swedish / Norwegian / Danish / Finnish + English\nTel Aviv - Mandatory: Hebrew and English\nIdeally, you would also have:\n\nenthusiasm, drive and an aptitude for identifying opportunities and solving problems for clients.\nan ambitious problem-solver.\n\nIt is the policy of Barclays to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, protected veteran status, genetic information, or any other basis protected by law.Show more Report"}, {"company": "Driscoll Health", "job": "", "city": "Central", "date": "", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=343&guid=0000018631c8d019bde3890c2768084b&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_ebbb0b0e&cb=1676383507883&jobListingId=1008258377365&cpc=0AD3DB1A95BF4639&jrtk=3-1-1gp83sla7i7kt801-1gooshkaah7h6800-1f376e1bc8395338--6NYlbfkN0CNm3PQhVQL26QWFq7acN2axG3nvaiWZ3xVvjxZ1gvo8Wb6xNYctLE2fVVxE17FbRaC7LSWIAGMc7uqw_tFQQJg60HvTj7tPAmXMbMfidhk54Qs5XoyQBm_XnyQg5XBsx6UFOA98poLfuDxyZJsmTq3Vo3zD6pX-k2pgLqfjjdVuT9viLshVOxY67xwCgs9aM3UalG5Zsk9QG07woMjbmTKbcLJt-tCDfijB1N82FuhQyTBtNriRaQThxJ6dlCOqJj4NfTsI1ufGj_67YcwX77hWoR3faWK7A10dingoO7dOg9STMQ-WCzC4ym-6TiGXMnVtJcxcOMxxkfKfhXAvzFDRlA860Jg5ETO0VVrzQJf1RSV1t-NIJStXlPlsYaezOybSVDPtYg9Qcm8rfSOkTW9m222ShRhBCL20o4T5UEgGpmSqnij2SD-eQ0LfxvH7Vh0O-Gtnw6ge7Vy_S9kw-rXyH9fzit84F_h68j0iWoaLidCiJrEljKUljUnk-_iMJVA5P8BoGfvRupGOyG_qD5QXs8PgBvaI4smRNCYo5oN2FoZuMSxf9ZEcKFy9mmY1aE6myd5egE6Ei8BIyO1Wadkmv2QMnNd3Od0JmlliEqgsqjdHbokoOie6bU2MO6JrAuyvwe8sulVh0NmKQ4K8_FdmD6UquHNkO721eb2xX5t2w%3D%3D", "description": "Where compassion meets innovation and technology and our employees are family.\nThank you for your interest in joining our team! Please review the job information below.\nGeneral Purpose of Job:\nReporting to the department manager/director, this position is responsible for the support functions necessary to accomplishing the objective of the department. These include, but are not limited to functions under the categories of telephone support, patient accounting, clinical support, patient scheduling, registration and patient discharge.\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job description is not intended to be all-inclusive; employees will perform other reasonably related business duties as assigned by the immediate supervisor and/or hospital administration as required.\nGeneral Requirements\nMaintains utmost level of confidentiality at all times.\nAdheres to hospital policies and procedures.\nDemonstrates business practices and personal actions that are ethical and adhere to corporate compliance and integrity guidelines.\nAdheres and complies with customer service standards and dress code as set forth by the hospital and the department.\nDemonstrates thoroughness and dependability.\nDemonstrates excellent organizational skills.\nMust be detail-oriented.\nMust be able to manage multiple tasks in a busy medical office environment.\nMust be able to effectively communicate and work with patients, family and physicians.\nMust be able to effectively work as a team member.\nOther duties as assigned.\nScheduling/Telephone Support\nSchedule patients for necessary procedures using the appropriate scheduling system.\nGather pre-registration/pre-admission information.\nReschedule patients upon patient/physician request.\nDocument cancellations/no-shows in the appropriate scheduling system.\nPage medical staff when appropriate.\nDocument telephone encounters as appropriate to clinic/department.\nManage an appointment waiting list.\nContact patients for appointment scheduling from a follow-up list.\nCall patients to confirm appointment times and offer any other pertinent information such as attendance requirements, education, directions, parking information, etc.\nPatient Accounting\nReview schedule/pre-registrations to identify potential duplicate medical record numbers.\nIdentify patients with multiple same-day visits to match demographic and insurance data for each pre-registration.\nVerify insurance eligibility and coverage for anticipated procedures.\nObtain insurance authorizations from referring physicians when necessary/appropriate.\nObtain insurance authorizations from payors when necessary/appropriate.\nIdentify co-payment agreements in preparation for collection at the time of service.\nMaintain correct balance of petty cash on a daily basis.\nClose recurring accounts when appropriate.\nReconcile insurance card copies with completed registrations.\nClinical Support\nDisseminate incoming office mail.\nReview schedules prior to appointment date and assist in resolving scheduling conflicts.\nPrepare medical records prior to appointment (i.e. request medical records from file room, prepare forms packets, gather and attach necessary diagnostic reports, etc.).\nBatch appointment cancellation/no-show letters to families and physicians.\nPatient Registration\nAccurately register patients according to training guidelines when the patient presents for services.\nCollect and record co-payments or prompt payment agreements and issue receipt of payment to payor.\nMake a clear copy of insurance card.\nEnsures consent for appropriate level of care is obtained and any additional documentation necessary from the family is obtained and copied.\nIssue patient identification card or wrist-band as appropriate.\nPatient Discharge\nPerform necessary follow-up scheduling at discharge.\nReconcile medical records.\nProcess physician orders and/or referrals.\nMark no-shows and no-shows to reschedule in the appropriate scheduling system.\nEducation and/or Experience:\n High school diploma or general education degree (GED); or one to three months related experience and/or training; or equivalent combination of education and experience.Show more Report"}, {"company": "Driscoll Health", "job": "", "city": "Central", "date": "", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1110586&s=343&guid=0000018631c8d019bde3890c2768084b&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_41c62e9a&cb=1676383509196&jobListingId=1007765049011&cpc=3B54C55687EAAB5E&jrtk=3-1-1gp83smirkhqa801-1gooshkaah7h6800-d18d81fec80f2bb6--6NYlbfkN0CNm3PQhVQL26QWFq7acN2axG3nvaiWZ3xVvjxZ1gvo8Wb6xNYctLE2fVVxE17FbRYd5Xpvo9atSZ19IdFiIKL6G5hIMwSPCJWr_lFhgbB6m9QCboCOzOKUUu_H42JVmNzt7Rv-PD6EpBKACnz70eFPPELdfF_tOPt3L49CTG87gWJNuDJExmWbg57xV4xhXMVBavkMykWFYAqlBX8oA9him1zG6gZd29oapAywTRUrNd6Ousl9NLIuF-hMEAr1HoXrvc_ldkrJjHp7Nd00wS1e1iDyrUZXkW8UxrmwHfzksMmm9It0SCnllw33zo3ZbugFkGC6NI7i0e5WjNDKgAdgoBuDV_g62hQDjL7-1QIoT1jEH9UwHx1AbfyHEe6bNnOZt_ZSsBem2hKznP2NsL2_f2v6UH6BrGgQ4RDRg3X4VdPgAnVeyOKEHtGRmzx2eN1Nil6Xjr1wvbvWNPyilQVRaBQnZa1fLp6awAHcycXGPDdttQaPCuk48-gHlCMktGGS9-d5UVm56i7ja-pEJ50vrXyIMRevF2_HeIa7Vu2QqqbAGk-q11G_erdo5KTXmcnTjoOBq3QrY_zTgaEm_eK5H0QihAtf7tgs8U37tZQO_7xxr1ZSQKaZh9domDrK4aYjDUEBzN4R87rQFinF8rEUX1fy5g03_JX8N27M-NgJR80DAeh-0Wr_", "description": "Where compassion meets innovation and technology and our employees are family.\nThank you for your interest in joining our team! Please review the job information below.\nGENERAL PURPOSE OF JOB:\nTo provide and coordinate education support for service line staff. The NICU Clinical Educator Coordinator will support the day-today operation of Driscoll Children's Hospital vision of excellent and integrated patient care delivery; engenders and participates in collaborative decision-making; ensures compliance with established standards; and contributes to creating an environment that fosters patient advocacy and competence. The Clinical\nEducator Coordinator will provide NICU service line specific professional development under the supervision of the NICU Director/Manager .in collaboration with the Perinatal Service Clinical Educator. To ensure effective and efficient implementation of the key educational processes at the unit level and to assist in the implementation of designated centralized components of the key educational processes in conjunction with the Perinatal Service Clinical Educator. The key processes are: leading organizational change, orientation, annual competence assessment, preceptor development, required ongoing training, patient education, student affiliations, and enculturation of evidence-based practice.\nAGE/POPULATION SPECIFIC COMPETENCE:\nMust demonstrate the knowledge and skill necessary to provide individualized appropriate care to the patient population served. Must have a working knowledge of the principles of growth and development and possess the ability to assess data reflective of the patient’s status and interpret the appropriate information needed to identify each patient’s requirements relative to their needs. Demonstrates the knowledge and skills necessary to provide individualized patient care based upon considerations of age-specific needs and issues for all age groups.\nImplements appropriate age-specific safety measures, equipment usage and communication skills with interaction and teaching customers, patients, and families.\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job description is not intended to be all-inclusive; employees will perform other reasonably related business duties as assigned by the immediate supervisor and/or hospital administration as required.\nAssesses, plans, implements, coordinates, evaluates and documents age/population appropriate patient care to identified unit populations.\nProvides and documents safe and effective holistic care, reflective of the nursing process of the patient population served in the service line area when needed.\nActs as a leader and resource for front line staff to implement high-quality, cost-effective patient care and establishes therapeutic interventions according to the evidence based practice and appropriate policies and procedures related to the delivery of care.\nAbility to function as a staffing resource in area of expertise\nEnsures the design, implementation and evaluation of a cost-effective unit-based orientation process that focuses on knowledge skills and relationships.\nDesigns, implements and evaluates on an annual basis, a competency based effective unit-based orientation individualized to meet the specific learning needs of staff.\nCreates and maintains orientation schedules for preceptors and orientees and ensure communication of schedule.\nActs as a role model in building supportive and collaborative work relationships.\nReviews and discusses orientee’s progress at least weekly with orientee and unit director.\nDevelops education action plans in collaboration with the unit director.\nMonitors the orientation process and identifies/improves problematic trends.\nTeaches, facilitates or develops staff designee to participate in centralized professional development activities/planning.\nProvides feedback to CPDP to improve centralized clinical orientation as measured by Leadership and CPDP Team.\nOrients and develops preceptors.\nDevelops, implements and sustains a process for unit specific orientation, professional development and support of preceptors.\nFacilitates preceptor participation in ongoing centralized development.\nServes as a resource to preceptors by providing coaching and support in difficult situations.\nAssesses learning needs of preceptors and provides unit-based development activities in conjunction with centralized curriculum.\nReviews orientation paperwork to ensure timely documentation, submission upon completion, and accurate competence assessment and validation.\nCoordinates the annual assessment and validation of priority high risk skills.\nFacilitates the identification and validation of high risk unit-specific skills annually according to DCH established guidelines and timeframes.\nCoordinates the assessment and validation of high risk unit-specific skills according to DCH established guidelines and timeframes.\nParticipates in the assessment and validation of house-wide high risk skills.\nReports results of assessments of unit and house-wide high risk skills to unit director and CPDP.\nCoordinates and conducts required training to close performance gaps in knowledge and skills.\nMaintains instructorship status in the identified Basic and/or Advanced Life Support Program i.e BLS, PALS, NRP, etc. needed to support their service line\nDetermines performance gaps using organizational/unit-specific policies, procedures and guidelines, performance improvement data, and accrediting and regulatory standards.\nDevelops and/or implements required unit-specific training activities that address performance gaps.\nEvaluates, documents, and reports training outcomes (level 1 and 2 evaluations).\nEstablishes a process to track and report compliance/attendance for unit-specific training activities to NICU Leadership and CPDP.\nTracks and reports attendance for house-wide required training activities.\nImplements a unit-based plan for advancing competence of staff on all shifts that result in improved performance.\nAssesses needs for continuing development for each job/role using feedback from staff, and Leadership.\nCompiles and analyzes needs assessment, reports outcomes to NICU Leadership and CPDP.\nAssists in analyzing house-wide data to determine needs for centralized development activities and in implementing centralized development activities that support unit-specific needs.\nPrioritizes unit-specific development needs, designs and markets plans to address needs on all shifts.\nUtilizes a variety of cost-effective teaching learning strategies that incorporate adult learning principles and increases competence of all staff.\nEvaluates, documents and reports outcomes of development activities.\nProvides staff with individualized feedback on development activities.\nCollaborates with CPDP as needed to assess, plan, design, implement and evaluate unit-specific development activities that support validation of competencies and ongoing development as it relates to provision of safe patient care.\nCoordinates the unit-based clinical experience for students.\nImplements a unit-based process that facilitates a positive and effective clinical experience for students.\nCoordinates orientation of students/faculty to unit.\nAssists with centralized student/faculty orientation.\nSupports and provides feedback for staff acting as preceptors for students.\nAssists with student tours and career activities related to unit.\nFacilitates the unit-based PI process.\nCollaborates with Leadership in reviewing, analyzing data and performance gaps indicated by data, and in establishing action plans to improve performance issues.\nIncorporates knowledge of performance improvement initiatives into development activities.\nEvaluates, documents and reports outcomes of development activities.\nProvides administrative support for NICU operations.\nStarts and completes tasks with minimum of prompting. Willing to make recommendations and assume additional responsibilities to improve workflow, workload and efficiency.\nAdjusts and updates schedule to facilitate orientation needs of new staff.\nWill assume role of charge nurse and/or staff when deemed necessary\nEDUCATION AND/OR EXPERIENCE:\nCurrent RN license in the State of Texas\nA minimum Bachelor's degree (B. S.) from four-year college or university in nursing required. MSN or equivalent preferred.\nBroad knowledge of nursing functions, specific knowledge of patient care activities on assigned unit(s) and knowledge of key educational processes.\nFive (5) years clinical nursing experience, with a two years experience as a preceptor preferred.\nEducation and/or presentation skills preferred.\nCERTIFICATES, LICENSES, REGISTRATIONS.\nList the licenses, certificates, or registrations that are required to perform the essential duties of this job.\nCurrent RN Texas license\nBasic Life Support Provider / AHA\nPediatric Advanced Life Support Provider\nNeonatal resuscitation Provider\nAdvanced Cardiac Life Support Provider (if applicable to unit).\nSpecialty Certification in clinical area and/or professional development required upon reaching eligibility.Show more Report"}, {"company": "EisnerAmper LLP", "job": "", "city": "Israel", "date": "", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1110586&s=343&guid=0000018631c8d019bde3890c2768084b&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_e9eb9ca4&cb=1676383510696&jobListingId=1007954211867&cpc=70D6958B2CFB98E6&jrtk=3-1-1gp83so2ujcbj801-1gooshkaah7h6800-017bd2c5145eced4--6NYlbfkN0B59FvENQ1PoESRw5gnAKNar20u3UYxwrwjmE7U3P3yjcM0YAVk_sAPPhn-zC-_zaFO9GGGVuLx5z3wdfqPZ156tGejtbAQbF1P5hQ3NCtq4Owe1RB2tLyOmeqOsgccsnhDmzWmbNR0Ek5zePosJzDYZcQ9NRFoURzlUsbn5wifSVWr1LTXubK_00qAfQ_g3a1xHwhHwrvrthDpG0Bo3FQl99FX3J_2rZh_Un-OSN1w8NHlwkpPh13WDOh5aXKGVg4GupQQ79xV_FeTMhNkVcnUM9Xuze7yyVKHwAx4vKNjOAuWdQ-w_B5nIZk4x7pLeYvXNf0MfNdK-83-YnXuXbt2Iro__xMQqu-Bii-Ke6Kviv5E4mJNEXOP36nH-APftX1Dl7ZIJqr0EVPKjfPCzNWi4oFNMwdd62TPWtrNCy8IjuK7AzzaxMEaGo8g86K8IN_vmrT6eaj8MvNcnOQ-KfF8mjvGsyaTmWcGXftzNoaM_kZqNzj8luVk-vj8oSbWi_7c0tcRHjTcRsLEvbvV3BfvYp6_adP3Wb0-BzZYWxjFi7tV5Umh2J8OYJnSHikPVxryQCBs1uXXSHGz8PltVHw-49rHmCB6c-NcDOppLDAcvj6ZfjZ8R_-wcikNh8mH0S5NfhIcu7eEMr_bTgIlnPkm", "description": "Job Description\nEisnerAmper is currently seeking a Tax Manager - Corporate to join our firm for our Israel location. This individual will work with other members of our corporate tax practice to develop and sustain excellent client relationships. They will advise clients primarily within corporate sector public and private in various industries including Financial Services, Tech, Healthcare, Manufacturing & Distribution. The individual will oversee preparing or reviewing various tax provisions, manage the preparation of tax compliance and assist with planning. They will also ensure that our tax personnel keep up to date on current tax practices and changes in tax law and have the ability to provide our clients with in-depth industry knowledge.\nWhat you’ll be doing:\nResponsible for managing and coordinating tax compliance and advisory work for clients\nReview Federal, Multi-National, Multi-State Partnership tax returns\nLead client relationships on day-to-day tax matters supporting partners with service execution and development of extended services\nResearch and consult on technical matters and special projects\nProactively build relationships and communicate effectively with the client to provide superior client service\nActively participate in business development efforts to include working collaboratively with partners and marketing professionals to target and build relationships with client prospects\nManage, train and develop staff. Participate in the performance review process\nWe’re looking for someone who has:\nBachelor’s degree in Accounting or related field required; Master of Tax preferred\nMinimum 5 years of experience in a public accounting firm or related experience\nCPA required\nProficient with corporate tax provisions and FIN 48\nPrevious experience supervising and training Staff and Seniors preferred\nExcellent written and verbal communication and interpersonal skills\nStrong organizational techniques are required\nMust be highly motivated and experienced in managing multiple client engagements\nMust begin to attain visibility and recognition within their industry specialization\nProficient with Microsoft Office (Word, Excel, PowerPoint, Outlook)\nWe’re looking for someone who has:\nMaster’s degree in Tax\nProficient in corporate taxation; individual and pass through a plus\nAbout our Tax Team:\nAs the largest service line within the firm, EisnerAmper’s Tax Group does not only provide trusted and innovative tax solutions to its clients, but it creates new opportunities for employees to grow, both personally and professionally. With a range of specialties based on location and industry, employees have the flexibility to focus on the work they want to do and the autonomy to shape their careers in a fulfilling way.\nA hybrid between a general tax practice and a hyper-specialized firm, our culture is based on collaboration, innovation and transparency. For us, success is defined by working together, sometimes across specialties, to provide the best tax solutions to meet our clients’ unique needs.\nTax regulations and procedures are always changing, and so are we. All EisnerAmper tax employees are empowered to challenge the status quo by thinking outside the box and bringing new ideas to the table. Because when we can identify creative ways to reduce filing turnarounds or streamline compliance work, we're able spend more time conducting impactful business advisory services for our clients.\nAbout EisnerAmper:\nEisnerAmper is one of the largest accounting, tax and business advisory firms in the U.S., with more than 3,000 employees and over 300 partners across the country. We combine responsiveness with a long-range perspective; to help clients meet the pressing issues they face today, and position them for success tomorrow.\nOur clients are enterprises as diverse as sophisticated financial institutions and start-ups, global public firms and middle-market companies, as well as high net worth individuals, family offices, not-for-profit organizations, and entrepreneurial ventures across a variety of industries. We are also engaged by the attorneys, financial professionals, bankers and investors who serve these clients.\nOur reach extends globally, with offices in the United Kingdom, Israel, India, the Cayman Islands, Singapore, and Ireland.\nEisnerAmper is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n#LI-PS1\nPreferred Location:\nIsraelShow more Report"}, {"company": "EOS", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "3.8", "link": "", "description": "WHO WE ARE:\n\nEOS IT Solutions is a family run Global Technology and Logistics company, providing Collaboration and Business IT Support services to some of the world's largest industry leaders, delivering forward-thinking solutions based on multi-domain architecture. Customer satisfaction and commitment to superior quality of service are our top business priorities, along with investing in and supporting our partners and employees.\n\nWe are a true International IT provider and are proud to deliver our services through global simplicity with trusted transparency.\n\nPrimary Function of this Position:\n\nManage IT Facilities Infrastructure Projects to include corporate and manufacturing areas in structured cabling, WAN/LAN/WLAN, audio visual/collaboration, Voice, and cyber-Security. Project manager will lead high visible projects from envisioning to closure. We are looking for an experienced individual who can adopt to Intuitive Surgical's (ISI) Project planning and delivery processes, as well as contribute to strategy, roadmap discussions, project execution and delivery of our engagements.\n\nAbility to demonstrate collaboration, conflict resolution, risk mitigation, resource management and vendor management skills. Proven experience in a result driven environment. Experience and skills necessary to continuously improve, develop and deliver ISI initiatives. Demonstrate PMO organizational skills to enhance data integrity and accuracy.\n\n\nThe role needs to perform in unique high energy and multi-cultural work society. Self-starter working with minimal guidance. Ideal candidate will have excellent communication skills. Strong proven experience using Project Management Tools (such as Anaplan, Smartsheet, and MS Project), expert in using Office 365 applications. Fluent in working multiple collaboration tools such as Zoom, Cisco WebEx, Slack.\n\nRoles and Responsibilities:\n\nLead and facilitate regular Project team meetings, team coordination, action item tracking, record minutes and communicate\nManage and prioritize multiple tasks while meeting project management deliverables\nPlan, coordinate and manage a large IT Initiatives while anticipating, and mitigating risks\nBuild out and manage integrated dashboards based on data sets using multiple PPM tools such as Anaplan, Smartsheet and Microsoft Office Project\nManage & influence large cross-functional team(s)\nHelp with the deployment of IT Project Management Tools ecosystem, while driving project maturity & discipline\nDefine and communicate target change schedule\nProvide inputs for Demand Management for Infrastructure and Security Project\n\n\nSkills/Job Requirements:\n\n\n8–10 years of IT Facilities Infrastructure Project Management/PMO experience\nExperience driving Project Planning sessions; Have used various frameworks to prioritize work based on ROI/Business Value\nClearly articulate the Business Value (in terms of ROI) for the work/projects committed to the leadership team\nPossess solid communication skills, strong Waterfall methodology processes\nProven experience in managing multiple projects and releases in an enterprise organization\nSolid analytical mindset. Ability to define and build dashboards for C-level executives\nSelf-starter with strong decision-making abilities who can drive projects to completion\nProven track record of achieving results through collaboration and teamwork\nAbility to effectively and clearly communicate with all levels within the organization\nStrong prioritization skills and the ability to handle multiple job duties in a fast-paced IT infrastructure projects\nProject management certifications preferred but not required\n\nEOS is committed to creating a diverse and inclusive work environment and is proud to be an equal opportunity employer. We invite you to consider opportunities at EOS regardless of your gender; gender identity; gender reassignment; age; religious or similar philosophical belief; race; national origin; political opinion; sexual orientation; disability; marital or civil partnership status or other non-merit factor.\n\n\n#indeedhpShow more Report"}, {"company": "LANDMARK COMPANIES LLC", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "", "link": "", "description": "Job Description· Evaluating new investment opportunities, including funds, institutional investors, private investors and direct investments to companies’ projects· Performing due diligence evaluations of potential partners, lenders, funds, and private investors· Performing industry research, including competitor analysis for improvement company’s portfolio· Evaluate new opportunities by reviewing offering memoranda for new funds and participating in external manager meetings· Assisting company’s portfolio with business development, future funding and other strategic initiatives by raising equity· Conducting market analysis and equity opportunity identification via academic research, customer interviews, conferences, incubators· Assist in the underwriting of co-investment opportunities, including working with financial models, evaluating commercial diligence materials, engaging with industry experts· Support the team’s market mapping, initial screening and subsequent deep due diligence of potential investments· Support development of diligence materials, valuation/exit models, and Investment Memo/Scorecard to assess market sizing, talent assessment, product-market fit, key metrics/financials, capital structure, valuation modeling and exit scenarios, risks, etc.· Liaise with team members to support diligence and support the Associate team to complete the investment process· Support company’s portfolio around product strategy, talent sourcing, business development, regional market and global expansion and support for future financing· Help gather and manage portfolio performance, metrics, and financials on a Quarterly basis· Support capital raising for the firm and company’s portfolio follow-on round growth financingsDesired Skills and Experience:· 2-4 years of previous work experience, ideally with a background in venture capital, private equity, investment banking, and/or FinTech operating roles.· Strong Excel modeling and PowerPoint presentation development skills· Alignment with Fin’s values in working in collaborative teams, high integrity, merit-driven and no ego/entitlement.· B.A. or B.S. in related fieldsPay: From 12,500.00₪ per monthAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}]