[{"company": "PRIMIS", "job": "Junior Publisher Success Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c02bbf53&cb=1676383515930&jobListingId=1008181334493&jrtk=3-1-1gp83st5hjfko801-1goosich5k63s800-4abea4b1250958ee-", "description": "A Bit About Us\nWe are an ever-evolving company, driven by our passion for video.\nWe’ve grown from a small start-up to a thriving business,\nand have been a part of the biggest global ad agency for ten years.\n\nOur main priority is maintaining our fun and determined environment\nand keeping our employees engaged in their work.\nWe need people that are as passionate about video and the ad tech industry.\nIf you are ambitious, hardworking, and motivated, we want to get to know you!\nAbout the Position\nAre you a people person? Great at building relationships and getting sh** done!? Primis is looking for a Junior Publisher Success Manager with the wow factor. We are leading the way in video monetization, and we work hard and play hard. We need high-energy people who are ready to bring their A-game. You will be handed the reins to exciting accounts, working day-to-day to strengthen relationships and maximize the potential revenues of our partners. If you think you know what \"success\" really means, we want to hear from you.\nQualifications\nB.A/ B.Sc. degree in Economics/Finance/Communication/Management or equivalent\n\nFluent English – reading, writing, and speaking\n\nExcellent communication skills (Both in person and over the phone)\n\nExcellent writing skills and email communication strategies\n\nHigh attention to detail and strong analytical skills\n\nStrong Excel skills\n\nExperience in sales is an advantageShow more Report"}, {"company": "iCloudius", "job": "Junior Salesforce Implementer", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "2.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c0698b35&cb=1676383517254&jobListingId=1008439485940&jrtk=3-1-1gp83sufokckn801-1goosich5k63s800-780a0b7e43d22048-", "description": "i-Cloudius is a boutique Cloud service vendor with mainly tech clients.This is a junior implementation position that includes hands-on technical work and knowledge on the Salesforce.com platform such as data migration, data manipulation and system customizations.You will proactively identify and implement operational improvements, enhancements, and system customizations that meet business requirements and take part at projects in various fields such as: Service Cloud, Sales Cloud, Customer and Partner Communities, Integrations.Requirements:Bachelors’ degree preferably in industrial engineering and management, management Information Systems, business, Finance, accountingAt least one year of proven experience in the information systems fieldInterpersonal skills and the ability to work with various customers at a timeStrong communication skills mainly in EnglishShow more Report"}, {"company": "ZIM", "job": "Tax Assistant", "city": "Haifa", "date": "1 day ago", "rating": "4.4", "link": "", "description": "We are looking for a Tax Assistant that will directly supports the Global Tax Director with tax compliance, research, planning, provisions, and audits. This position manages Israeli direct and indirect tax compliance on a monthly, quarterly, and annual basis. Responsibilities will include reconciliations, calculations, document preparation and filing, as well as maintaining matrices. Also responsible for some aspects of international tax compliance management and reporting.\nReporting & Compliance\nResponsible for completion of income tax returns work papers including all related analysis.\nResponsible for completion CbC and MF report work papers including all related analysis\nPrepares income tax accounting records and reports in accordance with applicable tax accounting practices, including analysis of Uncertain Tax Positions.\nTax consulting & Audits\nAssist to manage audits conducted by local / external financial auditors and tax authorities (Income tax, WHT, Payroll tax, VAT).\nAssist payroll group, as needed, to understand payroll tax matters on a global basis\nTax planning & Strategy\nPrepares spreadsheets to assist with understanding global tax impacts related to business expansion, re-structuring and general planning matters\nAssists with research of income tax considerations on a transactional basis\nAssist the management in estimating and monitoring annual cash taxes.\nTax Accounting\nAssist with accounting for income taxes (SFAS No. 109 / IAS12).\nPrepares tax footnote, including quarterly disclosures\nPrepares income tax accounting records and reports in accordance with applicable tax accounting practices, including analysis of Uncertain Tax Positions (UTPs)\nMaintains all income tax accounting balances and schedules\nEnsuring that appropriate internal controls are in place over accounting for income taxes.\n\nRequirements:\n \n5 years as a Certified CPA – BIG4\nTAX related experienceExperience with ERP systems and highly proficient with Excel.Strong research and problem-solving skills Demonstrated ability to prepare and maintain appropriate tax documentation on a quarterly, and annual timeline\nFunction:\n\nFinance\n\nPublish in Internal Career Page:\n\nNoShow more Report"}, {"company": "Eaton", "job": "Customer Support and Logistics Assistant", "city": "Raanana", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_739c75f2&cb=1676383520080&jobListingId=1008285526047&jrtk=3-1-1gp83t1802dus001-1goosich5k63s800-3b6355c115d4a193-", "description": "Managing the working flow with global forwarding company.\nManaging the customs clearance process and costs.\nManaging the standarts institution process and costs.\nControl goods stream by sea and air.\nCommunicate lead times to customers \\ sales.\nManaging the goods received in the warehouse.\nResponsible and manage the material flow to Israel warehouse (3PL).\nImproving costs of shipments -sea and air.\nMaintaining and improving the processes, striving for continuous improvement!\nQualifications\nPreferred a professional education in supply chain, industrial business management or similar.\nMinimum 2 years of professional experience – required.\nExperiences in SAP – advantage.\nExperiences in customs / forwarding companies – advantage.\nExperiences of working in global corporate environment – advantage.\nExcel – full working proficiency – required.\nEnglish and Hebrew fluency – required.\nGood analytical skills\nWork with multiple interfaces as sales, manufacturing, marketing, finance, etc.\nStrong communication and collaboration skills.\nResults oriented.\nWhat you will get from us\nEaton’s mission is to improve the quality of life and the environment through the use of power management technologies and services. We provide sustainable solutions that help our customers effectively manage electrical, hydraulic and mechanical power – more safely, more efficiently and more reliably. Making what matters work at Eaton takes the passion of every employee around the world. We create an environment where creativity, invention and discovery become reality, each day. It’s where bold, bright professionals like you can reach your full potential—and where you can help us reach ours. Eaton’s 2020 revenues were $17.9 billion, and we sell products to customers in more than 175 countries. We have approximately 85,000 employees.\nWe make work exciting, engaging and meaningful for our employees through our dedication to tackling some of the toughest power management challenges on the planet and by never losing sight of what matters. Our culture is built on a strong commitment to practicing our core values and supporting our employees with the tools they need to succeed. We pledge to always foster a diverse and inclusive environment, including inclusion resource groups that bring together employees who share a common purpose, interest or background. In the past year, our company has received top employment recognition by the Human Rights Campaign and almost fifty percent of our Board of Directors represented diverse groups. When we embrace the different ideas, perspectives and backgrounds that make each of us unique, we — as individuals and as a company — are stronger.\nWe have demonstrated our passion for sustainability with the recent announcement of cutting carbon emissions from the company’s operations by at least 50 percent by 2030. We are ethical, passionate, accountable, efficient, transparent and committed to learning. We are confident we can deliver on our promise to improve the quality of life and the environment because of the attributes that our employees embody.\nWe are committed to ensuring equal employment opportunities for all job applicants and employees. Employment decisions are based upon job-related reasons regardless of an applicant's race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability, marital status, genetic information, protected veteran status, or any other status protected by law.\nJob: Supply Chain / Logistics\nRegion: Europe, Middle East, Africa\nOrganization: ES EMEA Sales and Marketing Customer Experience\nJob Level: Individual Contributor\nSchedule: Full-time\nIs remote work (i.e. working from home or another Eaton facility) allowed for this position?: Yes – Hybrid\nDoes this position offer relocation?: No\nTravel: NoShow more Report"}, {"company": "Candex", "job": "Junior Operations Associate", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "Junior Operations Associate\nAbout Candex\n\nCandex is a rapidly growing fintech player in the B2B payments market, which is one of the hottest markets in technology. Our solution is used by the Global 2000 to pay vendors in 30+ countries, fast & compliantly - clients include brands like 3M, Starbucks, Dell, Pfizer, Danone, L'Oréal, HSBC, Roche, Colgate, and many others. We have a world-class management team and $37m in funding from investors like Amex, JP Morgan, Altos, NFX, and Partech. As a member of our company, you will have a golden opportunity to reshape and impact how the biggest companies in the world manage a meaningful part of their business.\n\nThe company is growing rapidly, and we seek a Junior Operations Associate. This position will report to the VP of Operations. This is an opportunity to join the Candex Finance team and make a significant impact at a rapidly growing multinational fintech company.\n\nThe Role\n\nThis is a key role in delivering supreme support and service to our customers. You will be a valuable resource throughout the payment process and a crucial point of contact for our customers. If you have excellent interpersonal and communication expertise, strong writing and analytical skills and a desire to leverage your knowledge of fintech and payments; this opportunity is a perfect fit.\n\n\nResponsibilities:\n\nHandle day to day customer email/phone support related to the entire payment process.\nProvide guidance to new customers to ensure they are on-boarded successfully.\nAdminister pending payments and registrations.\nWork with customers to correct payment details provided or to obtain any missing information.\nSend out client invoices ensuring they are accurate and compliant.\nReview customer invoices received ensuring their accuracy and timeliness.\nReconcile bank payments received against invoices.\nPrepare bank transfers and ensure that customer bank details are verified.\nVerify customer data by performing compliance checks.\n\nRequirements:\n\nUndergraduate Bachelor's degree in economics/finance/accounting is preferred.\nFluent English language skills – written and verbal – a must.\nFintech/Hi-tech experience is preferred.\nAble to accommodate global working hours - Mon-Thurs 11am-7pm, Fri 10am-5pm.\nImpressive interpersonal and communication skills.\nStrong computer skills with advanced Excel skills.\nOutstanding attention to detail, with an ability to spot numerical errors.\nHighly organized with the ability to multitask and work under pressure.\nTech savvy and the ability to pick up new technology quickly.Show more Report"}, {"company": "Gett", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_236b6ab6&cb=1676383527251&jobListingId=1008446952538&jrtk=3-1-1gp83t88th7hn801-1goosich5k63s800-01409bc78f1fbd9b-", "description": "We are looking for a highly motivated Assistant Controller to join our finance team. This is a key role in IL finance department, with material impact.\nResponsibilities:\nAssisting in the daily operations of the accounting department\nReporting to IL Controller\nManage the monthly, quarterly and annual financial close process\nAd-hoc analytical reviews\nPreparation of statutory reports (annual financial reports and tax reports)\nWeekly & monthly cash flow reporting including forecast\nFocal point for Corporate Finance\nOversight of Bookkeepers daily work\nRequirements\nCPA from a Big 4 accounting firm, with minimum 3 years of experience\nExperience as an assistant controller\nFluency in English (spoken and written)\nOutstanding attention to details and excellent time management skills\nAbility to work in a fast-paced work environment and meet tight deadlines\nRequires enthusiasm, team communications, hard work and follow‐throughShow more Report"}, {"company": "Tenengroup Ltd.", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": "Tenengroup is shaping the personalized eCommerce experience to customers around the world.\nA global End-to-End e-commerce house of brands, that works with more than 30 websites around the world.\nBy using high-end data tools to leverage market trends and needs, we give our customers a personalized and unique online shopping experience.\nWe are looking for an amazing Controller Assistant to join our team.\nAs a part of your role, your main goal will be to manage all off-shore group activity being the main professional focal point to all relevant interfaces.\nAlso, ensure accuracy over Company’s Revenues & Payments.\nRequirements:\n\nAccountant, At least 3 years of experience - priority for Big 4 firm\nExperience with offshore subsidiaries - Advantage\nHi tech/ E-commerce division – Advantage\nAbility to analyze data at a high level, systemic vision, self-learning ability, responsibility, ability to work in a team and manage interfaces in the organization.\nEnglish – at a high level – must!\nControl of office applications.\nFamiliarity with system – SAP Business One – an advantage.\nSkilled in time management and the ability to prioritize tasks while meeting deadlines\nAccurate and detail-oriented and organized.\nResponsibilities:\n\nFull responsibility for offshore subsidiaries - including working with accountants and tax consultants abroad.\nControl measured for Company’s Revenues & Payment\nControl measures for the accounting department.\nAssist in preparations of Tax reports.\nEnsure the accuracy of financial transactions.\nWork with colleagues and finance team members to ensure consistency and accuracy of the company’s global financial information.\nDivision:\n\nFinanceShow more Report"}, {"company": "Sungrow - EMEA", "job": "Finance Assistant- Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_94725c5e&cb=1676383531948&jobListingId=1008360818112&jrtk=3-1-1gp83tcr4jfmv801-1goosich5k63s800-31ca77cffd7db55e-", "description": "Your mission\nHello and Welcome to Sungrow!\nWe are excited to welcome You to our newest opportunity in Israel!\nAct as business unit Finance partner and cooperate with the BU operation leader.\nyou will be a member of the regional finance team, and implement the group, regional and BU strategy\nExpert at understanding the operations of the BU and responsible for driving financial analysis and using its insights to contribute to the decision making by the BU operations.\nContributes to the strategic and tactical decision making from the financial and economic perspective such as contract reviewing and business model optimization\nCollaborates with other areas of the Finance function to ensure reliable, timely and correct supply of information and the proper set-up and functioning of the BU planning & control-processes, administrative organization, internal controls and information systems and tax compliance.\nBudget preparation and forecasting; comparing actual to planned.\nYour profile\nAll good, that sounded great right? Now let`s have a look at your background, so you get a feeling if this could be the right challenge for you:\nBachelor/Master’s degree in economics, finance, accounting, business administration or equivalent, graduated from 985/211 school or international equivalence.\n3+ years of experience in multiple finance positions in an industrial/manufacturing environment with multinational corporation\nLanguage: Hebrew and English at least C1 Level, Mandarin is a plus\nHigh proficiency in SAP and other business applications\nBusiness acumen, highly analytical, with problem-solving and pragmatic skills\nStrong team player with good interpersonal skills, able to build networks within the organization and manage changes\nHands-on patience with a can-do mentality\nLiving in the center of Israel\nWhy us?\nThis decade might be overshadowed by Covid19, but sooner or later we will beat and overcome that son of a germ, am I right?\nBut the true topic for this decade lies in energy！\nWe are more than happy to state that not only We are leading this discourse, we also offer the fitting solutions for it. We have the strongest PV-Inverter R&D there is and became the world`s biggest Inverter Manufacturer, which we are extremely proud of!And now, for this decade, we are increasing our game, and You, You might become part of it! Besides that, many things await You:\nOpportunities for Career advancement\nBonus payment based on pre-agreed and signed KPI agreements\nA multinational team awaits You with lots of european and transeuropean exchange!\nPossibility for technical and commercial knowledge increasement in regard to string inverters, central inverters, inverter stations including transformer and switch gear and storage solutions\nTechnical and commercial training in our headquarter in Germany and even visits to the big R&D factory\nWe are a green tech company unlike any other green tech company. We are a team of lateral thinkers, young professionals, and creative minds. We are fighting every day to make our mission happen – Clean Power For All!\nWith nearly 300GW (!) of clean power presently installed worldwide, we are more than ready to sate the worlds hunger for clean energy!\nWelcome at Sungrow\nSungrow is the global leading inverter solution supplier for renewables. We are proud to look back to a success story that already began in 1997, but we never stopped striving for more. We want to give fresh impulses, inspire, and contribute to a sustainable development of our planet, that’s why we constantly improve our portfolio.\nFrom floating solar plants to large-scale utility projects and to small residential products we always offer the best and most suitable solution. At Sungrow we hold more than 1500 patents – no wonder as we employ the biggest research and development team of the whole industry. 40 % of all Sungrow workforce is continuously investigating on how to further improve the existing portfolio.\nWant to know more? Check out what working with us is like!Show more Report"}, {"company": "Via", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "", "description": "Via's Finance team is growing!\n\nWe are looking for a highly qualified and motivated Assistant Controller to join Via's Finance team and take a key role in our Tel Aviv office.\n\nAs Assistant Controller, you will take a key role in our finance organization and be instrumental in the success of our accounting and reporting processes. You should have solid analytical and accounting skills and a knack for working in a high-growth, mission-driven environment.\n\nResponsibilities\n\nBe involved in the daily tasks of the Finance Department.\nTake a significant part in the monthly closing process.\nMonitor and perform accounting analysis to ensure accuracy.\nReconcile intercompany balances.\nPrepare statutory reports – annual financial reports and tax reports.\nWork with external auditors and advisors.\nParticipate in SOX implementation and maintenance.\nAssist in budget and forecast preparation and tracking.\nTake an active role in managing projects and improving processes.\n\nRequirements\n\nTeam player with good interpersonal and communication skills.\nBachelor's degree in Accounting.\nCPA from a Big 4 firm with at least 1-2 years after internship – Hi-tech department (preference).\nAble to work in a high-growth, fast-paced environment.\nDetails oriented with a high level of analytical and professional skills.\nStrong knowledge of and experience in US-GAAP accounting.\nFluent in English (both spoken and written).\nAdvanced skills in Microsoft Excel.\nExcellent organizational and time management skills.\n\n\nWe're Via, and we build technology that changes the way the world moves. We pioneered the TransitTech category to ensure that the future of transportation is shared, dynamic public mobility — the kind that reduces carbon emissions across congested cities, minimizes reliance on private cars, and provides everyone with accessible, efficient, and affordable ways of getting around.\n\nWith the addition of Remix into our portfolio, we created the first end-to-end TransitTech solution for cities and transit agencies, offering world-class software, service design, and operational expertise to fundamentally improve the way the world moves.\n\n\nWe're committed to building and nurturing a team as diverse as the communities we serve. Bringing transportation equity to the world begins with championing equal opportunity in our own offices. All backgrounds, identities, and voices are welcomed and celebrated here.\n\nReady to join the ride?Show more Report"}, {"company": "Zota Technology Limited", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.6", "link": "", "description": "WHO WE ARE\nZotaPay, a well-established technology company specializing in online payments, is in Tel Aviv. As an Assistant Controller, we seek a motivated, hardworking, and reliable individual. This position will report directly to Controller.\n\nResponsibilities:\n\nPreparing internal reports, including periodic financial reports for the\ncompany group.\nPlaying a key role in the preparation of financial statements in compliance\nwith official guidelines and requirements.\nUtilizing IT systems to facilitate accounting processes and record-keeping.\nSupporting the Controller with various tasks, especially in ERP\nimplementation.\nParticipating in month-end and year-end close processes and assisting with\ntax returns.\nCPA with 1-3 years of experience, including internships.\nExperience in audit of global companies with full operations that generate\nrevenues in different sites around the world.\nKnowledge of daily accounting and finance operations.\nSkills and Characteristics.\nExcellent knowledge of accounting and financial processes\nStrong analytical and problem-solving skills\nExcellent communication skills in English, both verbal and written\nAmbitious and able to work well under pressure\nOrganized with attention to detail\nReliable and able to work independently and collaboratively.\nThis is an excellent opportunity for a highly motivated and detail-oriented professional to take the next step in their accounting career, in a fast-paced technology company atmosphere.Show more Report"}, {"company": "Cymulate", "job": "Assistant Controller", "city": "Holon", "date": "7d", "rating": "4.4", "link": "", "description": "Make Your Mark\n\nCymulate's Continuous Security Validation enables companies to challenge, assess and optimize their cyber-security posture against the evolving cyberthreat landscape, simply and continuously.\n\nWith world-class clients like YMCA, Brinks, and EuroNext we strive to bring the highest level of service to everything we do. Our team is made up of the very best people for the job and as we grow, we're always on the lookout for people with the skills, experience, and personality that will let us both shine. With high scores on Gartner and Glassdoor, our clients and employees have let us know what they love about us.\nDESCRIPTION\n\nAssist in monthly, quarterly, and annual book closings processes\nAssist in preparations of annual financial statements and tax return\nManage month-end closing process for all subsidiaries\nWork with colleagues and finance team members to ensure consistency and accuracy of the company's global financial informationMonitor bookkeepers and review the accuracy of financial data\nSupports all accounting-related activities\nManaging the collection process of the entire company\nAssist with ad-hoc tasks, as necessary\n\n\nREQUIREMENTS\n\nCPA from a Big 4 accounting firm – audit department – Must\nStrong knowledge in and experience in US-GAAP accounting and tax-related matters\nFluent in English, both writing and speaking - Must\nHighly organized and independent with the ability to manage multiple priorities, thrive, and deliver results in an ambiguous, fast-paced, and dynamic environment\nExpert in Microsoft Excel\nTeam player with excellent interpersonal skillsShow more Report"}, {"company": "", "job": "Junior business analyst:", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e0d1129f&cb=1676383538122&jobListingId=1006911405839&jrtk=3-1-1gp83tisii7kt801-1goosich5k63s800-dec039d409f7d480-", "description": "A global law firm located in the heart of Tel Aviv is looking for a junior business analyst to join their Finance department.\n\nRequirements:\n\n·Native English level with conversational Hebrew\n\n·University degree\n\n·Similar previous position - super analytical\n\n·Excellent time management skills\n\n·Strong communication skills\n\nPlease send CV in English (Word doc.) to: jobs@leap-now.comShow more Report"}, {"company": "QA InfoTech", "job": "QA Software Tester (junior)", "city": "Jerusalem", "date": "27d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_97a057fa&cb=1676383539453&jobListingId=1008402587154&jrtk=3-1-1gp83tk5pjoro801-1goosich5k63s800-2fcf762a9d8fc4e1-", "description": "Description\n\nAre you interested in working with the World’s leading AI-powered Quality Engineering Company? Ready to advance your career, team up with global thought leaders across industries, and make a difference every day? Join us at Qualitest!\n\nAt QualiTest, we provide Software & Hardware Testing solutions to some of the biggest and most innovative companies in the world. We are the world’s largest pure-play testing company with over 6,000 employees worldwide and with technology at the heart of most businesses, our mission is to keep their software running smoothly.\n\nQualitest’s global service delivery platform includes the United States, Israel, the UK, India, and Romania.\n\nTalented, intelligent, and passionate people have made Qualitest the QA leader it is today. If you want to learn from the best, there’s no better place to start!\n\nWe are looking for a Junior QA software tester for a leading project in our finance team.\n\nThis is a full-time position in Jerusalem,\n\nTo learn more about Qualitest, visit https://www.qualitestgroup.com/\n\nResponsibilities\nIdentify, record, document thoroughly and track bugs\nStay up-to-date with new testing tools and test strategies\nReview and analyze system specifications\nExecute test cases (manual or automated) and analyze results\nReport bugs and errors to development teams\nSuggest fixes and improvements\nAnalyze test results, detect issues and track root causes\nRequirements\nRelevant QA course - ISTQB - must\nHigh-level of English - must\nPC and basic networking (IP, cmd) - must\nKnowledge of PC & what include like PC technician\nHigh motivation and independent learning ability\n\nBenefits\n\nWhy Qualitest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\n\nIntrigued to find more about us?\n\nVisit our website at www.qualitestgroup.com\nCheck out our Career page: http://qa-jobs.qualitestgroup.com/Show more Report"}, {"company": "VAST Data", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "Responsibility and Impact\nAssist with monthly and quarterly closing.\nAssist with annual financial statements and audit processes.\nPrepare management reports, expense analysis and accruals, A/R, inventory, and cost accounting, across several legal entities.\nWork with external advisors to maintain statutory compliance for our Israeli entity and its subsidiaries.\nTake part in establishing additional subsidiaries in Europe and Asia or elsewhere as needed.\nSystems: support NetSuite ERP improvements, Define reports in BI tools to analyze company results.\nWork closely with Operations and Sales Operations teams on supply chain management, inventory valuation and related processes, monitor A/R Aging, collection, and cash flow.\nSupport the finance team with ongoing tasks such as materials to board presentations, company budget etc.\nRequirements:\n\nMinimum Qualifications\no BA in Accounting and Economics, CPA\no 3-4 years of experience in US GAAP financial reporting, including internship. Big 4 accounting firm experience.\no Knowledge in NetSuite – significant advantage.\no Experience with Startups, technology, or manufacturing businesses - advantage.\nSkills and Qualities\no Excellent written and verbal communication skills in both Hebrew and English.\no Strong attention to detail.\no Hands-on and able to create independent work products and reports.\no Time and tasks management skills, ability to meet deadlines.\no IT system skills, ability to define cross-functional processes in ERP and CRM applications. Proficient in MS Office.\no Collaborative, open-minded, and able to work in a fast-paced environment with changing priorities. Responsibility and ImpactShow more Report"}, {"company": "Qualitest", "job": "QA Software Tester (junior)", "city": "Jerusalem", "date": "26d", "rating": "3.9", "link": "", "description": "Description\n\nAre you interested in working with the World’s leading AI-powered Quality Engineering Company? Ready to advance your career, team up with global thought leaders across industries, and make a difference every day? Join us at Qualitest!\n\nAt QualiTest, we provide Software & Hardware Testing solutions to some of the biggest and most innovative companies in the world. We are the world’s largest pure-play testing company with over 6,000 employees worldwide and with technology at the heart of most businesses, our mission is to keep their software running smoothly.\n\nQualitest’s global service delivery platform includes the United States, Israel, the UK, India, and Romania.\n\nTalented, intelligent, and passionate people have made Qualitest the QA leader it is today. If you want to learn from the best, there’s no better place to start!\n\nWe are looking for a Junior QA software tester for a leading project in our finance team.\n\nThis is a full-time position in Jerusalem,\n\nTo learn more about Qualitest, visit https://www.qualitestgroup.com/\n\nResponsibilities\nIdentify, record, document thoroughly and track bugs\nStay up-to-date with new testing tools and test strategies\nReview and analyze system specifications\nExecute test cases (manual or automated) and analyze results\nReport bugs and errors to development teams\nSuggest fixes and improvements\nAnalyze test results, detect issues and track root causes\nRequirements\nRelevant QA course - ISTQB - must\nHigh-level of English - must\nPC and basic networking (IP, cmd) - must\nKnowledge of PC & what include like PC technician\nHigh motivation and independent learning ability\n\nBenefits\n\nWhy Qualitest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\n\nIntrigued to find more about us?\n\nVisit our website at www.qualitestgroup.com\nCheck out our Career page: http://qa-jobs.qualitestgroup.com/Show more Report"}, {"company": "Keshet-tv", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "24d", "rating": "", "link": "", "description": "Keshet International (KI) is looking for a skilled Assistant Controller to become an integral part of our Finance team.Role and Key ResponsibilitiesManage accounting records and Preparation of consolidated financial statements according to IFRS.Assist with preparation of management reports.Assist in analyzing monthly and quarterly budgets Vs Actuals, forecasts and company goals.Global and local tax matters and fillings.Oversee the subsidiaries' financials.Oversight of the day-to-day accounting and financial operations.Work with the Company's external auditors/advisors on audit, accounting, and other matters.Assist in establishing and maintaining financial key policies, procedures, and controls throughout the entire reporting process.Support the accounting team in various tasks and reporting.Assist with managing cash flow and preparing ad hoc reports.Oversee billing and collection process.Take an active role in managing projects and improving processes.Job RequirementsCPA with a Big 5 firm experience.Strong Knowledge of IFRS.Strong analytical, problem-solving, and decision–making skills.Excellent English.Advanced Excel skills.Ability to work independently.Ability to work in a fast-paced multinational and multicurrency environment.Personal SkillsStrong analytical, interpersonal, and communication skills.Team player and service oriented.Detail-oriented but yet a big picture thinker.Well organized with a can do approach, a multi-tasker with attention to detailsIntensive work that often requires long hours and flexibility.Job Type: Full-timeAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Preferred)Show more Report"}, {"company": "Harman International", "job": "Controller Assistant", "city": "Hod HaSharon", "date": "15d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cb03fdfe&cb=1676383545064&jobListingId=1008425861405&jrtk=3-1-1gp83tpkdkuio801-1goosich5k63s800-96f52a14c2e031f2-", "description": "A Career at HARMAN\nAs a technology leader that is rapidly on the move, HARMAN is filled with people who are focused on making life better. Innovation, inclusivity and teamwork are a part of our DNA. When you add that to the challenges we take on and solve together, you’ll discover that at HARMAN you can grow, make a difference and be proud of the work you do every day.\nHARMAN Israel is a software company specializing in the automotive \"Connected Car\" field,\nLocated in Hod-Hasharon.\nHARMAN Israel is a synergy of leading automotive technology solutions who are owned by Harman International, a Samsung company: IGNITE, OTA, Cybersecurity & ADAS\nAt HARMAN, we combine passion and purpose to deliver smart products, systems, software and services that connect people wherever they are.\nWe are seeking for an experienced CPA Assistant Controller to join our Finance team\nKey Responsibilities:\nMonitoring subsidiaries reporting to ensure smooth delivery of day-to-day financial operations of AP, AR, Fixed Assets, GL and statutory reporting.\nOverseeing the month-end/quarter-end and year-end closing process, review/prepare journal entries and general ledger reconciliations.\nParticipating in the monthly and quarterly financial closing, consolidation, reporting process of the company and additional data as required by the corporate reporting package.\nParticipating part in the annual budget process and preform monthly actual vs. budget analysis.\nAssisting in preparation of the statuary financial statements and tax return reports.\nOverseeing accounting procedures and internal procedures.\nWorking with department managers, corporate staff, and subsidiaries finance\nAd-Hoc financial tasks and projects.\nRequired Skills & Qualifications\nCPA, experience from the big 4 - MUST!\nFluent English- MUST!\nFamiliarity with IFRS - advantage\nFamiliar with ERP (“SAP R3” an advantage)\nAbility to analyze financial data and prepare financial reports and statements\nGreat attention to details and ability to multitask\nStrong analytical, interpersonal and communications skills\nHARMAN is an Equal Opportunity /Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race,color, religion, sex, sexual orientation, gender identity, national origin,disability or Protected Veterans status. HARMAN offers a great work environment, challenging career opportunities, professional training and competitive compensation. (www.harman.com)Show more Report"}, {"company": "", "job": "Bookkeeper / Finance Assistant", "city": "Herzliya", "date": "5d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2569fc8d&cb=1676383546415&jobListingId=1008447588911&jrtk=3-1-1gp83tqvijfmv801-1goosich5k63s800-30e11fededba09df-", "description": "הגש מועמדות\n\nהרצליה\nמשרה מלאה\nמעל שנתיים ניסיון\nתיאור\n\nIn this role, as the right hand & assistant to VP finance you will be part of the Finance\nand Accounting team. The role requires a very detail-oriented person, responsible and\naccountable of the financial duties, outstanding attention to detail with excellent\n\nדרישות\n\nCertified Bookkeeper (Type 2) . At least 2-4 years’ experience of bookkeeping (global company - Advantage).  Advanced English level (both spoken and written) . Advanced skills in Microsoft Excel / Google Spreadsheet – Advantage. Organized, pay attention to details and accuracy. Knowledge in Sap Business 1 and/or QuickBooks – Advantage. Ability to work independently in a fast-paced environment. Ability to prioritize workload.\n\nדרושים בתחום\nחשבונאות וכספים - מנהל/ת חשבונותחשבונאות וכספים - פקיד/ת הנהח\"ש\nמאפייני משרה\nמעל שנתיים ניסיוןמשרה מיידיתמשרה מלאה\nשמור משרה\n\nשתף\n\nשלח מודעה לחבר\n\nעודShow more Report"}, {"company": "SysAid Technologies", "job": "Assistant Controller", "city": "Lod", "date": "2d", "rating": "3.8", "link": "", "description": ""}, {"company": "ironSource", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "4.4", "link": "", "description": "At ironSource, we’re driven by people. ironSource is a place to grow personally and professionally by challenging yourself, bringing in new ideas, and simply daring to explore. We’re always looking for like-minded professionals to join our amazing team. Come grow with us!\nWe are looking for a talented Assistant Controller to join our growing finance team!\nRequirements:\n\nCertified Public Accountant.\nAt least 2 years of professional experience (BIG4 or international company)\nStrong analytical skills, out of the box thinking, multi-tasking skills, independent, highly motivated and committed.\nAbility to work in a fast-paced work environment and meet tight deadlines.\nExperience in preparing financial statements and consolidated reports according to US GAAP.\nFluent English (both spoken and written).\nHigh proficiency in Excel and PowerPoint.\nFamiliarity with BI systems and Netsuite ERP will be an advantage.\nRole:\n\nParticipation in month-end closing procedures and assist in the preparation of financial statements in compliance with US-GAAP.\nAnalysis of Company’s results on a monthly basis.\nWorking closely with the Group Controller team.\nInvolvement in cross-company initiatives and process improvement changes.\nProvide professional guidance and assistance for the bookkeeping staff.\nManage monthly and annual statutory financial reporting requirements.\nParticipate in preparations for the annual audit and SOX.\nBusiness Unit:\n\nLeagal & FinanceShow more Report"}, {"company": "At-Bay", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.8", "link": "", "description": "About At-Bay\n\nAt-Bay combines world-class technology with industry-leading insurance to help clients meet risk head-on. Partnering with brokers and business owners alike, we provide modern insurance products and active risk monitoring services for companies of every size and in every industry. Our team boasts many backgrounds and skills, from analysts and developers to designers and underwriters and everything in between — all working together to redefine what it means to be an insurance company.\n\nWe're proud to be a diverse company and to have expertise from multiple industries driving our culture. At-Bay is expanding rapidly, and as we grow, we're prioritizing inclusive hiring practices and supportive team environments. We're committed to building a company culture where people of all identities and backgrounds are empowered to thrive, develop their careers, and bring their full selves to work.\n\nAt-Bay is a globally distributed company with hubs in Atlanta, New York City, San Francisco, and Tel Aviv. To date, we have raised $292 million in funding from Acrew Capital, Glilot Capital, Icon Ventures, ION Crossover Partners, Khosla Ventures, Lightspeed Venture Partners, M12, entrepreneur Shlomo Kramer, and Qumra Capital.\n\nThe team\n\nOur Finance team in Israel is composed of a Sr. Accountant & Payroll specialist and an AP accountant. The rest of the Finance team is located in the US. This role will report to the Controller in the US.\n\nResponsibilities:\nResponsible for the financial reporting of the Israeli entity in accordance with US GAAP, Israel GAAP, and the Company's policies.\nPerform month end close procedures for the Israeli entity and proactively identify areas for process improvement and automation to improve existing procedures.\nPreparing the statutory financial statements and the tax returns for the entity.\nSupervising the intercompany billing process to ensure its correct performance per the TP study.\nManaging and supervising the finance team in Israel.\nOngoing communication with the finance team in the USA.\nMonitoring and reviewing the company's payroll process.\nManage AP expenses based on budget, AP payments, and cash flow needs\nAssist and manage new processes as required.\nWorking with the Company's external auditors/advisors.\nAssisting with the implementation of policies.\nAssisting with ad hoc tasks as needed.\nQualifications:\nBachelor's degree in Accounting and a CPA – Mandatory\n2-3 years of audit experience from an accounting firm (big 4) – Mandatory\n1-2 years of experience as an accountant in Hi-tech companies – Mandatory\nA high level of English proficiency, both written and spoken – Mandatory.\nProficient computer skills, particularly with Excel- Pivot, formulas, etc.\nExperience with NetSuite and expense management platforms preferred.\nAttention to detail, creativity, independence, and strong interpersonal skills.\nQuick learner, responsible, and personally dedicated to accomplishing objectives.\nExcellent prioritization and organization skills.\nAbility to work collaboratively in a fast-paced environment.Show more Report"}, {"company": "Tremor International", "job": "Assistant Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "", "description": "Who is Tremor International?\nWe're a global fast-growing, publicly- traded company committed to developing first-class products for our partners and clients around the world. As a leader in digital video advertising, Tremor International enables quality advertising wherever consumers are viewing digital content. We're made up of a collection of brands – including Tremor Video and Unruly – and we give our partners the tools to find the right audience for their marketing needs in real-time, tailoring ads to create an optimal experience for each unique consumer.\n\nWhy Join the Tremor International Team?\nAt Tremor International, you are a part of something bigger. We are a global community of forward thinkers, uniting creativity, data, and technology across the open internet. With a marketplace of over 80% comprised of premium video and Connected TV content, we're taking a steady hand to develop our strategy, backed by our expertise, track record of prescient thinking and powerful technology, so that we can continue our rapid growth in the fastest-growing segments.\n\nOur Values\nEvery member of Tremor International encapsulates the words, \"I C.A.N.\" Each day, we strive to be as Innovative, Committed + Collaborative and Authentic as possible, with No Ego.\n\nWe're looking for an Assistant Controller to join our Finance team in Tel Aviv.\n\nIn this position, you'll be part of our growing Finance department that supports our 60 branches worldwide. The right person for the Assistant Controller job should be a team player at heart, who aspires to specialize in a global company with professional challenges, while contributing to its financial success and growth.\n\nWhat You'll Do:\n\nInvolvement in the daily financial processes of the company\nPreparation of financial reports according to IFRS.\nRevenue analysis for board and management presentations\nTax calculations in accordance to local and international laws and regulations\nCash flow management\nCollaborating with colleagues, mangers, and advisers.\nDrive system enhancements and identify opportunities to optimize processes\n\nWhat will I bring?\n\nBA degree in accounting and CPA certification - must\nInternship in one of the big 4 accounting firms – high tech division (advantage)\nIndependent and well-organized with multi-tasking skills and ability to prioritize\nExcellent interpersonal skills and ability to work effectively with people at all levels within the organization and externally, including global functions\nVersatile and flexible, with ability to thrive in a dynamic, fast-paced working environment\nExcellent Excel skills (must) and NetSuite experience (advantage)\nHigh level of English\n\nAt Tremor International, we value our differences, varied experiences, and collective contribution. We know that not everyone takes the same career path, so if you don't match this job description perfectly, don't worry! We would rather see your application than risk missing out on your potential to make an impact.\n\nWhat if I have any questions before I apply?\nAll applications need to be submitted online, however to discuss any adjustments you may require ahead of submitting your application, please email Smann@tremorinternational.com\n\n#LI-SR1\n\n #LI-HYBRIDShow more Report"}, {"company": "InspHire", "job": "Bookkeeper/Finance Assistant", "city": "Herzliya", "date": "11d", "rating": "5.0", "link": "", "description": "We're looking for a Bookkeeper/Finance Assistant to join a digital publishing house that owns and operates a collection of highly successful humor and entertainment websites.\nIn this role, as the right hand & assistant to VP finance you will be part of the Finance and Accounting team. The role requires a very detail-oriented person, responsible and accountable of the financial duties, outstanding attention to detail with excellent organizational skills\n\nWhat will you actually be doing?\nRecording daily financial transactions.\nPrepare and manage payments cycle to Local & Global vendors.\nTrack bank account balances and perform bank reconciliation.\nTravel reports and personal expenses reimbursement.\nSupport in EOM closing.\nPerform other bookkeeping and accounting tasks as requested.\nWork in a multi-currency environment.\nSkills & Requirements\nCertified Bookkeeper (Type 2) – Mandatory.\nAt least 2-4 years’ experience of bookkeeping (global company - Advantage).\nAdvanced English level (both spoken and written) – Mandatory.\nAdvanced skills in Microsoft Excel / Google Spreadsheet – Advantage.\nOrganized, pay attention to details and accuracy – Mandatory.\nKnowledge in Sap Business 1 and/or QuickBooks – Advantage.\nAbility to work independently in a fast-paced environment.\nAbility to prioritize workload.\nAbility to work in a team and be a team player.\nFull time positionShow more Report"}, {"company": "", "job": "Assistant Finance Person", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a8cb564e&cb=1676383554614&jobListingId=1006930724029&jrtk=3-1-1gp83u2v02pv5001-1goosich5k63s800-f41dc0da09407f6f-", "description": "A marketing company needs a finance person to assist the VP Finance\n\nThe position can suit an economist or bookkeeper or a person with an orientation to finance/accounting/economics/bookkeeping etc\n\nThe role is part time and is working from home\n\nThe role involves extracting data, analyzing, building reports\n\nREQUIRES\n\nHigh level of Excel – advanced formulas, pivot tables etc\n\nAll the work is in English\n\nMust be able to work independently\n\nFlexible hoursShow more Report"}, {"company": "InspHire", "job": "Accounting Assistant", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "An affiliate network dedicated to its customers and their results is seeking a finance person with strong learning abilities, and accounting knowledge for their finance department.\n\nRoles and responsibilities\n\nFollow-up on suppliers and customers, including payments, receipts, and collections.\n\nHandling of bank accounts and end-of-month adjustments.\n\nCredit cards, vendor-customer adjustments.\n\nThe preparation of management reports\n\nAssistance with and management of finance-related projects\n\nWorking closely with the company's CFO and accountant\n\nThe requirements\n\nLearning ability and a \"can-do\" attitude\n\nAdaptability to a dynamic and changing environment\n\nExcel proficiency\n\nAn advantage would be to have a higher education in finance (accounting, economics, financial management).\n\nAccounting knowledge is required\n\nProficiency in English\n\nHaving the ability to work independently as well as in a teamShow more Report"}, {"company": "Stratasys, Inc.", "job": "Assistant Controller", "city": "Rehovot", "date": "30d+", "rating": "3.6", "link": "", "description": ""}, {"company": "XPLORE Consulting", "job": "SAP Junior Business Analyst", "city": "Raanana", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6f7e0cc7&cb=1676383558906&jobListingId=1005749696844&jrtk=3-1-1gp83u75ui6gq801-1goosich5k63s800-fdb8d99e8459ea22-", "description": "What Does a Junior Business Analyst do?\n\nA junior business analyst role is to assist the senior analyst in gathering, validating, and documenting various system information areas and business requirements.\nThe job description of the junior business analyst is to carry out an in-depth evaluation and verification of the capabilities of systems, serving as a middleman between the end/key users and project team.\nHe/she will participate in the solution development and maintenance life cycle, and as such will be available to carry out instructions as directed by the lead analyst.\nOnce the requirements baseline is established, it is the responsibility of the junior analyst to maintain and verify requirements specifications accordingly.\nAs an analyst, he/she is always on the move, sourcing, documenting.\nWith the experience, he/she will become a business expert, by making a priority to stay up to date with latest trends, to expand his knowledge in the business world.\n\nDescription for the position of Business Analyst\nLiaise with consultants and managers to document business processes effectively\nLiaise with software developers by sharing business processes, by challenging systems solution and by communicating on specifications of requirements.\nDocument requirements and specifications on multiple business areas such as Sales, Procurement, Finance, ...\nEnsure consistency, availability and “freshness” of the knowledge base (documents, manuals, policy documents, etc.).\nChallenging customer requirements relevancy\nImplement business processes and functional requirements within the solution\nDevelopment supervision\nExtensive testings supervision (integration tests, user acceptance tests) by providing scenarii, test plans and procedure\nKnowledge transfer to the customer teams by training, communication, and documentation\n\n\nPersonal Requirements – Qualities – Skills, Knowledge, and Abilities for the Junior Business Analyst Position\nHave the ability to plan, organize, and structure work.\nHighly skilled in Excel, Word, and other office software programs.\nShowcase good analytical and evaluative skills in tasks.\nShowcase good written and oral communication skills.\nAbility to multitask.\nHave good interpersonal skills.\nExcellent Ability to self-learning.\nAbility to initiate new ideas.\n\n\nOther requirements – Education, Language\nBachelor’s degree or higher in engineering, scientific, computer science, operations research, business, or related field, or equivalent experience directly related to the functional responsibilities of the position\n1-3 years of relevant professional work experience\nExperience working as a SAP system user is a plus\nDatabase knowledge is a plus\nGood Hebrew / English skills\nFrench is a plusShow more Report"}, {"company": "", "job": "Finance Assistant (ISR)", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_63639784&cb=1676383560369&jobListingId=1008376643162&jrtk=3-1-1gp83u8j3kbnu801-1goosich5k63s800-aee7902a58d63010-", "description": "Friedrich Naumann Foundation for Freedom (FNF) is looking for a position as Finance Assistant for our Jerusalem office.\n\nStart Date: January 15th, 2023\n\nType of contract: Part/Full-time position (30-40 hours)\nDuration of contract: permanent contract with 3-month probation time\n\nLocation: Jerusalem\nThe submission deadline for applications: January 1st, 2023\n\nFor our unique Israeli-Palestinian team in Jerusalem we need help with documentation, accounting, payments and other finance and administration related tasks to support our work so we can be a platform of innovation for enhancing freedom in society, strengthening dialogue with the European Union and contribute to the advancement of Israeli-Palestinian dialogue. Together with our partners, we want to strengthen liberal core values like the rule of law and democracy, the respect of human dignity with civil and human rights, market economy principles and entrepreneurship and a democratic culture of tolerance and pluralism.\n\nOur Vision: The Friedrich Naumann Foundation for Freedom is the creative platform of innovation for enhancing freedom in society\n\nOur Mission: Our work addresses interested people that share the core values of the foundation. We consult, inspire and motivate change makers in society and create, design and promote innovative concepts of freedom for today and tomorrow.\n\nFinance Assistant Roles and Responsibilities\n\n• Assisting the finance coordinator with all financial procedures in regards to project administration at FNF Jerusalem, including advising and helping other team members• Assisting with planning and overseeing project budgets, budget spending and the financial management of the Israelproject according to the Foundation’s Guidelines with permanent evaluation of actual and upcoming expenditures, assisting with planning of project activities • Monitoring, transferring and operating funds; cash and cheque payments for project expenses• Reporting with regular complete and correct balancing / accounting statements, followed by answering auditors’ questions in audit reports• Bookkeeping and data entry of all payments and receipts of the responsible projects to the accounting system; Scan, upload and filing of reporting documents • Making and ensuring price comparison and document the respective quotations• Ensure translation of financial documents, bills and receipts into either German or English• Complete reports with all supporting documents (e.g. participants list, program, report)• Correspond with Israeli tax authorities, social security institutions and health insurances, the same as the CPA of FNF Jerusalem • Ensure calculation of employee’s salaries, income tax, social security contributions and other deductions with CPA• Correspond with banks and other FNF Offices on financial and reporting related matters.• Monitor and manage bank accounts, project cash box and inventory lists\nQualifications and Skills\n\n• University graduate with degree in accounting or similar / having acquired equivalent experience. • Proficient in Microsoft Office and ready to learn specialized software of FNF• Careful, honest, work well with numbers. Commitment to liberal values.• Ability to work in a diverse team and desire to learn new things • Excellent English and Hebrew skills, both written and verbal • Knowledge of Arabic and German a bonus\n\nWorking Hours\nThe working hours are 30 hours per week. The working hours can be extended to 40 hours, depending on workload and mutual agreement.\n\nEqual Opportunity\n\nFNF is committed to provide equal employment opportunity to all persons regardless of age, color, national origin, race, religion, creed, gender, marital status, or any other characteristic are encouraged to apply.\n\nApplication Instruction and documents required\nIf interested to apply, send an e-mail with e-mail subject: “Finance Assistant Xxx (your first name) Yyy (your last name)” to jerusalem@freiheit.org; please have the following documents attached:\n1. An updated resume (highlighting relevant experiences)\n\n2. A brief cover letter (with short reasoning why you apply to this position with FNF Jerusalem).\n3. Your salary expectations.\nKindly note that applications without all documents will not be considered.\nNotes:\n• We thank all candidates for their interest, however, we are only able to contact those who are shortlisted. • Assessment Evaluation of qualified candidates for this position may include a written test, which will be followed by a competency-based interview. • Interviews will take place during the month of December at the FNF office or onlineShow more Report"}, {"company": "", "job": "Assistant Controller", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=0000018631c93154a677ec348be2f6e2&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8fd93400&cb=1676383561916&jobListingId=1007297535879&jrtk=3-1-1gp83ua3nghpc801-1goosich5k63s800-3ec742803f5fe55d-", "description": "OurCrowd, a leading global platform VC firm, is looking to hire a talented Assistant Controller to join our growing finance team. The position is fully based in the Jerusalem office.\n\nResponsibilities:\n\nAssist in monthly, quarterly, and annual book closings of all management subsidiaries, according to US GAAP.\nMonitor bookkeepers and review the accuracy of financial data.\nOversee implementation of internal processes and policies.\nAssist with external audits and tax reports.\nTake part in the company’s annual budget process and perform monthly actual vs. budget analysis.\nAssist in revenue accounting process.\nUndertake ad-hoc financial tasks and projects.\nRequirements:\n\nA licensed CPA in Israel, from a Big 4 firm\nHigh-tech, VC experience – an advantage\nTeam player with good interpersonal skills\nStrong analytical skills, detail-oriented, and multi-tasking skills with the ability to work independently.\n2-3 years accounting experience from an audit firm or high-tech company (or equivalent)\nVery responsible, diligent with an ability to work in a high-pressure environment.\nUS-GAAP knowledge – an advantage\nAdvanced MS Office skills, especially Excel\nProficient in English and Hebrew\nSalesforce and Priority experience – an advantage\nFull-time position in JLM officeShow more Report"}, {"company": "", "job": "Entry Level Tax Preperation", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": "great firm is hiring for tax preparation positions\n\nwilling to train candidates with knowledge or a background in finance/accounting/bookkeeping\n\nposition is in Jerusalem office, great environment, 9-5 ( may be an option for a bit of an earlier end time )\n\nemail asteinhardt@outsourcingtoisrael.com or apply here: https://www.outsourcingtoisrael.com/job-board/#!/14a41caa-127a-4932-979f-711ff142ed50/detailShow more Report"}]