[{"company": "Clarivate", "job": "Business Operations Manager", "city": "Jerusalem", "date": "2d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=201&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f5191521&cb=1676383392321&jobListingId=1008454154470&jrtk=3-1-1gp83p4g8jigt801-1goose8rugai5800-db8f9aad08ec6fe3-", "description": "EX LIBRIS– Who are we?\nEx Libris, Part of Clarivate, is a global EdTech (Education Technology) industry, leader. We serve some of the most prestigious academic institutions and research Universities around the world, with a total of over 7,500 customers in 90 countries.\nOur SaaS solutions help universities transform academic libraries, maximize the impact of research activities, enhance teaching and learning, and drive student engagement and success. For more information about Ex Libris, see our website, and join us on Facebook, YouTube, LinkedIn, and Twitter.\nWe are looking for a Business Operations Manager to join our team!\nYou will support Quote-To-Cash processes focusing mainly on supporting the sales team. You will be involved with program management for strategic initiatives and programs, identifying, resolving, and improving internal processes and procedures. You will also generate business insights and perform data analysis to support decision-making. If this sounds like an opportunity you are interested in, then we would love to talk to you!\nAbout You – experience, education, skills, and accomplishments\nBachelor’s degree in Industrial Engineering, Business Administration, or a related field; OR equivalent combination of education and work experience.\n3 + years of experience in Sales Operations, Business operations, Business administration, Project management, or Program management.\nKnowledge of Quote-To-Cash processes.\nIt would be great if you also had . . .\nExperience introducing sales methodologies and tools to a globally dispersed sales organization.\nAbility to thoroughly analyze complex data, translating data-driven results into actionable deliverables, messages, and presentations.\nStrong Analytical Skills.\nDemonstrated ability to partner with varying business groups and teams to develop cross-functional tools, approaches, and processes.\nExperience in Enterprise software or SaaS organization.\nSalesforce Admin certification.\nWhat will you be doing in this role?\nServe as an internal expert and primary contact in supporting the sales organization’s use of internal tools, processes, and protocols.\nEnsure data accuracy and completeness in documenting and assessing regional pipelines, forecasts, and bookings.\nEnhance sales productivity, enabling the sales organization to achieve increased success through simplified processes, the introduction of new tools, and streamlined access to information and resources to close sales.\nProactively identify improvement opportunities, leading the capturing and documentation of business requirements through rollout and post-implementation evaluation.\nDrive alignment with the relevant functional groups (ex. MIS, Finance, and Professional Services) through the planning, implementation, and evaluation phases – collectively ideating, problem-solving, and project planning for upcoming projects and initiatives.\nMonitor regional forecast and booking goals, and proactively address and resolve issues impacting the completion of bookings.\nLead and monitor managerial routines such as QBRs\nAbout the Team\nYou will join a global team of Business and Sales operations experts that support the Library Software business collaborating with all org functions, such as Product, Global Sales, and Marketing through our management team.\nHours of Work / More important information for you:\nOur base is in the Jerusalem, Israel office, working in a hybrid model\nThis is a full-time position.\nAlthough duties are typically performed during normal business hours, occasional off-hours work may be required.\nWhy Ex-Libris?\nAt Ex Libris, we value our employees and are striving to create the perfect balance between work and home life. Join us to be part of a family-like environment; enjoy our unique culture and benefits. Be part of a thriving, productive community helping change the future of higher education with the state-of-the-art technology from Ex Libris.\nAt Ex Libris, we work hard and have fun doing it!\nAt Clarivate, we are committed to providing equal employment opportunities for all persons with respect to hiring, compensation, promotion, training, and other terms, conditions, and privileges of employment. We comply with applicable laws and regulations governing non-discrimination in all locations.Show more Report"}, {"company": "Mccann", "job": "Business Development Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.4", "link": "", "description": "Business development managers at Primis do much more than just sales, we prospect our leads, build relationships, and negotiate through long sales cycles with leading sites and publishers worldwide. You must be a people person, someone who can understand the specific needs of each and every publisher, and act accordingly.\nWe are looking for a person with experience in recruiting and working with publishers to join our growing publisher biz dev team. A person that knows publishers inside and outside and is looking to play an essential part in our company’s growth.\nThis role requires a very motivated individual who loves the thrill of a closed deal and can also multitask between recruiting new publishers, supporting the technical onboarding stage, and optimizing new accounts in the most critical phase.\nRequirements:\n\nAt least one year of proven work experience in a similar role in Adtech\nPrevious experience successfully signing deals, driving revenue through prospecting, pitching, negotiating and renewing business with mid-tier & premium digital publishers\nNetwork of digital publishers and direct connection.\nFundamental understanding of the programmatic ecosystem, publisher landscape, and the online advertising industry\nExcellent communication skills (written and verbal)\nHigh attention to detail and powerful analytical skills\nFluent Spanish - reading, writing and speaking\nSelf-motivated, goal and target-oriented executor that desires to be a key contributor and strong team player\nB.A/ B.Sc. degree in Economics/Finance/Communication/Management or equivalent\nStrong Excel skills\nSub Company:\n\nPrimisShow more Report"}, {"company": "Mobileye", "job": "Customer Success Specialist", "city": "Jerusalem", "date": "16d", "rating": "4.2", "link": "", "description": ""}, {"company": "Deloitte", "job": "Financial Analyst", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=204&ao=1110586&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_982a6ca5&cb=1676383396457&jobListingId=1007739067197&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83p8gqj4h3801-1goose8rugai5800-93563ccf08b36f16--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC_Wdhu634opPFRSRO45eHnCrACRNcpm9_LaHOMBYvJWmjtte_-uoGgaqL76N8raJUWlnixzaeJwJHSmDqOb8YpFyxJDwxNobjW9szObCVLJ6RfyYhOR9I5cZ8WapCkWpmdQAwlTVOJCXJZ5ZxpybOin-Ax_OPWL_8DB_mTHpbTz1G3z-vqFLGS1GIj87YMJwqidJCbpmC46Yq7LTTH4BbOu_sZMPine0hWEpimGw5sw54eLANg9uMBi-RiY_m1ulH7fU8sW2VCXkjkoxzFY-pZ2dnHSwetin82KtNh-2J-SljdFXsdW8JG2LuhdEQ5YQ4wDWO9k4TZWPt6yZOjJitFyNnuj1HoKBoEf83NjY--J2KMVuATpAe38rUXVZtikgTOBBRdJptNZoj2AmCXOPR8JlE5M_ku4VqIcdRZ57EOvuL2bKiTPIfheKZWhm7e1DQNwba02aH8cTmdHiPcFhyBduabr-4uTaj8dcYza4pW1EWFXxjUN6xDp3ErBj4p5gFKGR7-VW8f-4vQvu_DXwFR_9awwRj13SMoGnJEF_lgeTjPMDn6-3IItEZZps0qfNmmoKvrxCkAp6iPYaJDK16mTmL-xjr0hMwP-vUB5wrrufzwMCkHlvp77HAANEx1YUmPJZhoxaLcosCXys48gUfD", "description": "What you will do The Expense Compliance (EC) team is responsible for ensuring Expense Policy compliance and proper internal controls through the auditing and analysis of various expense claims. The team works using various auditing tools and techniques across multiple expense platforms (SAP travel management, Concur, etc.). The EC team also help manage the Firm's corporate card process including application, delinquency monitoring, and reconciliations. As a member of our EC team, you will have the opportunity to interact with many groups across the DTTL network to conduct daily job requirements such as: Review business expenses submitted in Concur for compliance with policy and regulatory requirements Process corporate card applications/cancellations and follow up on delinquent accounts Work with Deloitte professionals at all levels to resolve expense, policy, and corporate card queries Develop in-depth understanding of Firm expense policy and employ advanced auditing techniques to identify items that are out of compliance and/or fraudulent in nature Perform ad hoc analysis and reporting as required Work on special projects to improve service delivery quality and/or operational effectiveness Bachelor's degree in Accounting or Finance Good oral and written communication skills in both Hebrew and English 3-5 years relevant experience Strong business judgment, critical thinking and analytical skills Advanced knowledge of business applications such as: Excel, PowerPoint, Outlook, etc.\n\nAbility to work both independently and collaboratively within a team Must clearly understand how to handle confidential information Ability to quickly understand and learn new skills and technologies Demonstrated problem solving and critical thinking skills Ability to prioritize tasks, work on multiple assignments, and manage ambiguity Knowledge of SAP and Concur is a plusShow more Report"}, {"company": "Deloitte", "job": "Audit & Assurance Staff – US-Israel", "city": "Jerusalem", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=205&ao=1110586&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9a6551e8&cb=1676383397713&jobListingId=1008083059863&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83p9oqkcml801-1goose8rugai5800-8359bbd23f72e283--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC_V6sLizfxnd6uUN8x00ViZyWJzJWJVevA74YKulbC_-XItrLKqv4uSi0rfYT3tKo6RKT4NuXpIcs1Inn6E6JlIBiMUR6EbUJLX4Gs5pyL6_pP_BDJRdfwKsB4bczjc_dR-y4KBbmxpw69MfUI2Fo-qyEjBu01xwSPHKQhPuS_3McbG_PAsa5XRrbslQMvIMCJiBx-Ma8K5Bl9icD8j2pO81CaQzfTsy4b9I76aXln7bNlKbwTfw5XKWetfWUoq0x9kDRDnz1UT8GuCTG_bfviCGSW-lh22Aht26KJFygp3z2mauz3KgwxdzSN-KrE1kDlnPzj7lVkkwYhDIbZsQqu5emjxIZmxSvUyptE4pgvWnvCDuwYbcgOH-UFB5An548ZUdqXxyYt4-7k9nxG3tZQKyAXrSxR8eCPMgftjjxfp_JE05Of1kpNJwcmTKMmd7qeE8Q-wjMYbSHu41OyWxqsYSTerdYWCrG05Oc-hcFvUEpP7pTdcPz6z1T5gcMTS46EoAqMJ1-ym6Sd8A6UtB57GzyhdUjrY7rRtkvpUj9bg_HNOWHwU4PuSib_u0l_hkuHdp7-IH6MOu-i5B60W9Wmed54GK1Gs7cTdB8hDF3zbcMLMcstyir2gnSbKynPTZBUFIZaClMQd1s2-sRfBujw", "description": "As the world changes, join a company leading the way! Financial markets are growing ever more global and more complex. At Deloitte, we have innovated the audit by leveraging cutting-edge technology like data analytics, combined with transformative processes, that evolve our audit and assurance capabilities to meet the dynamic needs of the capital markets. As an Audit & Assurance professional, you have the opportunity to help enhance audit quality, provide deep insights, and deliver a differentiated audit!\n\nAs a full-time audit professional, you'll deliver audit services to our US clients and work cross-functionally with US and Israel Audit team members to design and execute audit procedures based on the client’s business needs, internal controls, and risks. Required: *Bachelor's degree in Accounting or related field (e.g. Business, Finance, Economics). *Experience needed or IL CPA preferred *Fluency in English; Demonstrate effective verbal and written communication skills.\n\n\nThe interview will be held in English *Ability to work effectively in a virtual environment. Preferred: *Work experience with a regional or international accounting firm. *Understanding of broad business & technical (US GAAP) knowledge. Location: Tel Aviv, Beit-Shemesh, Jerusalem, Haifa, Nazareth.\nFlexible hours and hybrid/remote options. *The position is intended for both women and men. * We at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.\n\nShow more Report"}, {"company": "ווין ג׳ובס", "job": "Marketing Manager 162796", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": ".A Finitech company is looking for a Marketing Manager.The company is located in Tel Aviv area.Availability to a full-time work, Sunday-Thursday, 8am-5pm:Job Requirements are.Bachelor's degree in marketing, finance, business administration, or similar.Experience as a marketing manager.Kowledge of marketing strategies, channels, and branding.Full social conditions.It is mandatory to specify salary expectations, inquiries without rate expectations will not be of interestJob Type: Full-timeShow more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "Business Development & Sales Director", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "", "link": "", "description": ""}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "Chief Operating Officer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=208&ao=1110586&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c52c8e7c&cb=1676383403748&jobListingId=1008331754847&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83pfj8j45o801-1goose8rugai5800-abdffcab1977761c--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAh5VetcM878K-aUf10CWFkjfw9RPIfw5ftyW0PI-rgU_4CrLP5GE2EuCU9Sjy1zW59zR1D7yy9EBVZAceJjcVcL1ntDpQlKzew8BZMvANPy3xmbfK5mqAW5f8zxvR9KuMZ8N3_-g2HxapxnIwjU7qpWw_vmTVyUZhCOwEPHA8iOeYbl7pf3YAGSzQkl8CT1wR72JVoEXWX1DREEaFSF8d8w4j2eG40S8Qv5Owe7CHaiRSzDP3LRe0O008Czh_8d7px5_WOiqR9aRK7pdoOxbHEY6nhdqK5HK56Wc2mn4gTpSxe8RqKhqXh1Y_S8o8d8_4vtrAc-3oRDnO56dGNtrL_OJuurT96PY4GnvB3UBuIx7H9f3DXufQ9l2wU2BGe1-ub9b8eCAP9LQcvK_AWaESaD6VjCtL8LUtDiASW86tO3n1n_CCctNyZ8mXR55H0g6FfeNG02qsFa8a8aPeY9d8QwkacIGUlxKlZEhFFjovOqCCtENZx0LFblPqQ1hFGVsIxwX47m99u8jCeW3bv2G0i5N1wXt4RrJFE4qsJ3G8dN9FvnwGVGQsT2QXj8v9la6ToGgOd9xYUlQqePw1pgc6tDQ8RIDNhCw9xTAmenFcmGLnHW_u62wNMy9nGuJLndQdPmCpgkh7KFiYNiViWe0i2", "description": "We are a Beit Shemesh company in the LegalTech space. We provide tech-enabled, high-quality, streamlined services to our clients who are primarily law firms and large corporations. Key Roles and Responsibilities Be a part of the Leadership Team, and evangelize the company’s vision throughout the organization. Become a knowledge body with deep understanding of our Value Chain and the variety of tasks that are a part of it.\n\nDevelop and implement ways to track and measure our performance with respect to the company’s Goals and Targets, set by the board and executive management. Create and own our overall budget, and help the functional managers utilize their individual budgets effectively. Serve as a focal point for inter-departmental meetings and facilitate effective collaboration between other executives and departments Partner with leaders across the organization to evaluate and form relationships with customers, vendors and service providers Lead the R&D department, understand the way our products and SSTs are developed and partner with the CPO to make sure we develop cutting edge solutions. Lead the Finance team and become the company’s “single source of truth” concerning its budget and key metrics Lead the IT team and make sure our different departments are implementing the best solutions to carry out their tasks and communication Requirements: An entrepreneurial mindset, with integrity and ambition Ability to build consensus and relationships among executives, clients, and employees Ability to analyze the organization, define the success metrics to track, and create a framework to track and report on key performance indicators Proven experience in management of R&D and knowledge of R&D methodologies and best practices In depth knowledge and experience reviewing and evaluating financial information and legal documents Proven ability to synthesize complex technical information, and then design strategies, solutions, workflows, and procedures which can then be adopted by stakeholders Deep analytical proficiency and effectiveness working as part of the senior leadership team Strong communication, influence, and cross-functional collaboration skills; able to create clarity and drive focus in complex and dynamic contexts 7+ years of experience as operations executive at medium to large B2B services or SaaS company.\n\nBA, MBA – an advantage Experience in M&A – an advantage Full time availabilityShow more Report"}, {"company": "UVeye", "job": "Director of Finance", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": "UVeye is looking for an experienced and highly motivated corporate Director of Finance to join us and lead our global accounting, reporting and tax functions\nDirect responsibility for the corporate accounting, reporting and tax function with overall global responsibility\nResponsibility for the preparation and analysis of UVeye's consolidated financial statements for both internal and external usage while overseeing UVeye’s subsidiaries’ financial statements and compliance.\nSets and manages internal control systems and S-OX compliance.\nImplement cross-functional processes and policies such as direct & Indirect procure to pay process and fixed assets investments.\nLeads IT projects in the area of finance & responsible for direct and indirect Tax strategy and compliance.\nRequirements:\n\nAt least 8 years of experience in the accounting area.\nAt least 3 years of experience as a Finance Director in a fast paced tech global company.\nExperience working in a manufacturing multidisciplinary company - HW & SW\nExperienced in leading employees & team leaders.\nCPA certificate, Big 4 accounting firm is preferred.\nVast practical experience in US GAAP.\nActual ERP deployment experience.\nExcellent English – both written and verbal skills.\nAbility to work in a fast-paced work environment, meet tight deadlines and handle multiple priorities.\nStrong analytical skills, system & process orientation.Show more Report"}, {"company": "ICON", "job": "Contract and Bidget Negotiator", "city": "Israel", "date": "4d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=210&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_57a697b6&cb=1676383406870&jobListingId=1008450004474&jrtk=3-1-1gp83pim9jm51801-1goose8rugai5800-81e499280f8ff55b-", "description": "ICON plc is a world-leading healthcare intelligence and clinical research organisation. From molecule to medicine, we advance clinical research providing outsourced services to pharmaceutical, biotechnology, medical device and government and public health organisations. With our patients at the centre of all that we do, we help to accelerate the development of drugs and devices that save lives and improve quality of life. Our people are our greatest strength, are at the core of our culture, and the driving force behind our success. ICON people have a mission to succeed and a passion that ensures what we do, we do well.\nICON Strategic Solutions (ISS) is looking for qualified candidate to perform the investigator site contracting Services hereunder in order to support a broad range of therapeutic studies across all our sponsor´s divisions in accordance with the requirements described in FSP Program.\nJOB FUNCTIONS/RESPONSIBILITIES\nPerform negotiation of legal terms and budget terms for Clinical Study Agreements (“CSA”) (i.e., investigator site agreements)\nPerform negotiation of legal terms and budget terms for amendments to CSAs\nDraft and negotiate ancillary site contracts (e.g. PI / Sub-I / department agreements /Study Coordinator) as required\nUtilize Sponsor´s provided templates. Sponsor´s requires stand-alone site contracts with the exception of the US, which utilizes master clinical study agreements.\nProduce and maintain site-specific templates where needed to support the Sponsor´s targeted investigator site list, but limited to the sites within the studies assigned\nRecommend country-specific and site /entity-specific modifications to templates based on site and local regulatory requirements\nUtilize previously negotiated terms for existing contracts between same site/entity and Sponsor´s\nPerform submission and oversight of site and study specific local language translations. Candidate will be required to use Sponsor´s preferred translation vendors. Sponsor´s will manage template version control and translations\nAttend weekly study team and country meetings, as needed\nIdentifies risk and mitigation strategies as it relates to meeting contract negotiation timelines\nICON’s Legal team may provide support to ISS personnel. For the avoidance of doubt, ISS is not providing legal advice to Sponsor´s in any capacity.\nFollow Sponsor´s’s legal guidance document and comments and fallbacks\nIdentify contractual and compliance risks for CSA contracting and raise to Sponsor´s\nCollect information from investigator site to complete Foreign Corrupt Practices Act (FCPA) form and submit to Sponsor´s\nPrioritize to meet study timelines to minimize impact to planned Site Initiation Visit (SIV) dates.\nAct independent of CRO managing the study\nPerform quality control checks of contracts and amendments prior to upload to DocuSign for electronic signatures\nIf electronic signatures are not permissible, provide management of hard copy/ local signature process\nContractual Parties:\nEnsure signatory to CSA is authorized to sign on behalf of the party\nEnsure signatory to the CSA will either be responsible for the contractual obligations or operating under a Power of Attorney binding a Sponsor´s entity to the obligations. Sponsor´s preerence is to have Sponsor´s or Sponsor´s Affiliates as the contracting entity for CSAs where possible\nEnsure country - specific singnatory requirements are met (e.g., Some countries require signature by local affiliate (e.g. Italy and Canada))\nSupport and provide country level intelligence into the selection of signing part at the country level which must consider payment impact, tax issues (VAT/R&D/WHT) establishment (I.e. corporate presence) and relationship to sponsor.\n Collection and submission of payment support forms, including, but not limited to Payee information forms and required tax forms\nBudget negotiation specific requirements:\nPre-populate site-specific budget items from prior negotiations following Sponsor´s provided guidelines.\nNegotiate site budgets following Sponsor’s principles document and comments & fallbacks\nActively participate in per-subject cost development meeting. ISS personnel will provide review and input into the country specific budget templates to minimize timelines for site budget negotiations.\nProvide country level expertise to budget related contract terms and conditions\nEscalate out of parameter budget items to Sponsor´s Investigator Contracts Lead (ICL)\nRecord negotiated changes to patient compensation information and provide to Sponsor´s designated contact for Informed Consent Document (ICD)\nDemonstrate effective time management skills; able to independently prioritize multiple tasks.\nDemonstrate the ability to work independently and use initiative to anticipate/resolve issues and complete tasks.\nShows a commitment to and demonstrate the ability to consistently perform high quality work with minimal management oversight.\nContract Management System:\nAriba Contracts Workbench is the current Sponsor´s contract management system.\nISS personnel will utilize the system for all contracts consistent with Sponsor´s provided guidance and training.\nSignature processing:\nISS personnel should first adapt and advocate for Sponsor´s-preferred DocuSign system for electronic signature process. Other options / alternatives may be presented by the ISS personnel and will be reviewed by Sponsor´s\nTrial Master File:\nISS personnel will file CSA and Amendments into the eTMF within required timeframe\nEDUCATION REQUIREMENTS\nBachelor’s Degree or international equivalent in business, finance, health sciences or related field\nRead write and speak fluent English; fluent in host country language required.\n1-2 years Industry experience managing contracts required.\nBenefits of Working in ICON:\n\nOur success depends on the knowledge, capabilities and quality of our people. That’s why we are committed to developing our employees in a continuous learning culture – one where we challenge you with engaging work and where every experience adds to your professional development.\n\nAt ICON, our focus is to provide you with a comprehensive and competitive total reward package that comprises, not only an excellent level of base pay, but also a wide range of variable pay and recognition programs. In addition, our best in class employee benefits, supportive policies and wellbeing initiatives are tailored to support you and your family at all stages of your career - both now, and into the future.\n\nICON, including subsidiaries, is an equal opportunity and inclusive employer and is committed to providing a workplace free of discrimination and harassment. All qualified applicants will receive equal consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nIf, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please let us know.Show more Report"}, {"company": "Barclays", "job": "Banking Analyst - Expert Graduate Programme - 2023", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=211&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_038a9e58&cb=1676383411869&jobListingId=1008130651163&jrtk=3-1-1gp83pnigj4h3801-1goose8rugai5800-599d07e4897a5f1f-", "description": "Join the world of banking\n\nEvery day, corporations worldwide come to Barclays for our banking expertise. We help drive global commerce by providing comprehensive financial, advisory and capital-raising services. Our bankers advise on everything from mergers and acquisitions and privatisations to debt and equity financings and restructuring. Want in? Join us as an analyst.\nThe chance to make an impact\n\nAfter several weeks of intensive training to start, you’ll join one of our industry, product or geographic groups and start working on live deals and business development projects right away. Within small deal teams, you’ll quickly play an important role on a variety of demanding assignments. You may work on:\n\nfinancial analysis and modeling\nvaluation\nindustry research\nbusiness evaluation and strategic assessment\nbusiness and idea generation\nexternal and internal stakeholder communication.\n\nA place where you can thrive\nAt Barclays, you’ll be surrounded by people who will help you achieve your ambitions. Our collaborative, supportive environment gives you the chance to build solid relationships with senior leaders, peers and clients alike. What’s more, dedicated programme managers will support and advocate for you throughout the first several years of your career at Barclays, ensuring you develop the skills you need to succeed.\nDuring your analyst years, you’ll also:\n\nparticipate in formal and informal training designed to give you the knowledge you need when you need it\nreceive detailed performance coaching and feedback\nhave opportunities to expand your network and develop leadership skills.\n\nYour role as a Banking analyst will provide you with the skills and experience needed for a successful career in the world of finance. We’ll also provide you a visible path to the necessary steps for promotion to associate and the tools to get you there.\n\nTo be considered for this programme, you must:\nbe motivated with a strong degree or expected degree – in any area.\n\nIdeally you would have:\na strong interest in business and finance, though no specific subject degree is required\na candidate with course experience in accounting (strongly recommended)\nsomeone who shows resourcefulness, team-orientation, enthusiasm and an entrepreneurial spirit, demonstrated through participation in extracurricular activities.\n\nIt is the policy of Barclays to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, protected veteran status, genetic information, or any other basis protected by law.Show more Report"}, {"company": "Google", "job": "Intellectual Property Commodity Manager", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.5", "link": "", "description": ""}, {"company": "Lemonade Insurance Company", "job": "Office Operations Lead, Site Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=213&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d81f5723&cb=1676383414125&jobListingId=1008146310570&jrtk=3-1-1gp83ppp4joq2801-1goose8rugai5800-4bf88883bbcb6e37-", "description": "Tel Aviv, IL | Facilities & IT | Full-time\nNot your everyday company\nLemonade completely reinvented how insurance works. As a customer-centric tech company, we created an insurance experience that is smart, instant, and delightful.\nAt Lemonade, you’ll be working with a group of like-minded makers, who get a kick out of moving fast and delivering great products. We surround ourselves with some of the smartest, most motivated, creative people who are filled with positive energy and good karma.\nUnlike most publicly traded companies, we’re nimble and efficient. We take pride in the fact that we still think and operate like a startup. We don’t care much about titles and hierarchy and instead focus on innovation, bold moves, and challenging the status quo.\nWe’re built as a lean, data-driven organization that relies on a common understating of objectives and goals to provide teams with autonomy and ownership. We don’t like spending our days in meetings and we skip committees altogether. At Lemonade, there’s no such thing as going over someone’s head. We have zero tolerance for bureaucracy, office politics, and lean-back personalities.\nAs a Public Benefit Corporation and a certified B-Corp, we deliver environmental and social impact using our products and tech. Through our Giveback program, we partner with organizations such as the ACLU, New Story, The Humane Society, Malala Fund, American Red Cross, 360.org, charity: water, and dozens of others, and have donated millions towards reforestation, education, animal rights, LGBTQ+ causes, access to water, and more.\nAwarded ‘best workplace’\nBest Workplace and Best-Led Company by Inc. Magazine\nHigh 4.4 rating on Glassdoor ️\nOur Founders listed among Glassdoor’s Top CEOs\n“World Changing” by Fast Company\nRecognized as a World Changing Idea by Fast Company Magazine\nRanked #1 Home insurance in America\nWon best renters and homeowners insurance in America by US News, and others\nBest Pet Insurance in America\nRated “Best Overall Pet Insurance” by Better Homes & Gardens\nRated 4.9 on the Apple App Store\nAmong the highest rated apps of all time\nWhat you’re applying for\nLemonade is looking for a big hearted Office Operations Lead to manage our Office Ops team and oversee our vibrant and growing TLV site. This people person should be detail oriented, customer-obsessed, and ready to lead the team who manages ongoing daily operations and logistics, facilities, events planning, and office life for our +300 TLV Makers. This role collaborates closely with other teams to manage processes with a broader impact on our employees’ experience to ensure we provide a best in-class, delightful, and unique workplace experience for our Lemonade Makers.\n\nWe’re looking for a person who shines in the role of a “generalist”, is resourceful and creative, and has great project management skills. In this position you will manage the local Office Operations team while working closely with managers and leadership across the organization, and also with external parties.\n\nWe’re looking for an Office Operations Lead who has a passion for high quality delivery of everything employee-experience related, and can ensure new employees have a positive employee lifecycle (soft landing, anniversaries, termination, etc.). In your day-to-day, you would be expected to plan and execute large-scale company-wide initiatives, which means you’ll drive strategy, work with internal and external stakeholders, build budgets, communicate and execute plans, and collect feedback and share recommendations with leadership. You’ll also do everything from picking the perfect color temperature of a light bulb, to organizing holiday toasts and ‘extracurricular’ activities, to negotiating the best deals for the employees’ benefits, and making sure everything runs smoothly and with ease.\n\nYou’ll work closely with many stakeholders - both managers and leadership from different teams: People Operations, IT, Finance, Legal, Talent Acquisition, and other support functions. You’ll identify problems, build communication plans, lead and execute projects, and do that whilst being legally compliant, creative, on schedule, on budget, and with a drop of humor.\n\nYou will manage our TLV Office Operations team and oversee the employee experiences. You will liaise between administration, facilities, office life, and events to ensure we provide our employees with the best working experience possible.\nIn this role you’ll\nOversee all office operations projects and processes\nManage the local Office Operations team\nPartner with different support functions such as People Ops, Finance, Legal, IT and Talent Acquisition to create a delightful, compliant and unique employee experience\nCreate, implement and monitor company and site policies\nWhat you’ll need\n+8 years of operations and managerial experience\nExperience in hyper-growth organizations with +300 employees\nAn extraordinary communicator, with fantastic verbal and written communication skills\nTo know a bit in many employee experience related fields\nLearn new things quickly and independently\nEndless creativity and a “can solve any problem” attitude\nAn execution state of mind, with no hesitation to take on hands-on work and drive the team to deliver faster\nSuperior attention to details (while keeping seeing the big picture) and an enthusiasm for delighting employees\nGreat English\nAbility to remain organized while adapting in a dynamic environment\nExceptional EQ - natural ability to ‘read’ and influence people\nGreat project management skills\nPassion to create a “best in class” workplace environment\nThings to know…\nLemonade is an equal opportunity employer committed to diversity and inclusivity. We never discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. If you require reasonable accommodations due to religious beliefs, pregnancy, or disabilities, let us know at any time.Show more Report"}, {"company": "ביו טכנולוגיה כללית (ישראל)", "job": "IT Business Analyst / System Analyst", "city": "Jerusalem", "date": "16d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=214&ao=1110586&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_79790c56&cb=1676383415351&jobListingId=1008423893833&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp83pqvdkbl2801-1goose8rugai5800-441d92d0afaf80c1--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDB9mTe_BtXuR18XkQ73q0hR2FBLtKEeN_nDpkHNNI-f2NbBZQDHqGxVnbdS0d28zGGr-uTdDBF-Z2qQPjt-HZIbp7qK87gMDdWSwBZiu1G8uCWyROaRM0gwEuWLP-H1N-BNzVWf0Xr2l8GQ-FT1wlAwOaClvv6ttpeXiNWGjJc8l9jGnkibjpe0mXOWDpaZnzqTLQfbuEkBNH6iypc73pTbPAFdbDnfc0KeDKNhayWUYuB22WD1WAhjQHJzUBsiIeycTVMy343MpXvnRWJDQtd6ARfSANN7CliMzVNAExmbHpnp_w-P5Glc6siN3G81Ocp4Ro0hf8xxA8UP5HrZZSbyj7ye3YjKF9bXSA6jUfOMtVQ1tPcph1Djv4EW92wonDBCuf0Kes2J1Tf4kEsOsv6yuxo1nFR2Fw04SqM2IP8huYrtQ2u6h8237YEkCTIYxRONpk9DKTRsi4D4vVDXK_tH9_MMsyP1848PIKvJzOI873TgJ1fjWrxn4rizErBscilrVTdyRYaK0238Pl1PyMQX9Bx8PrCSBwtD0fMb-fKdxnHcm2_B7s2pEdNyMKgqdx9wd28MISnnh_ebenXS8vLG48gf4ay0jeEnoVh42IpbuapbL_CFRk_jXPX9_r7VArNkKwAxpFQCHfoIwdKg60N", "description": "We are seeking for an experienced IT Business Analyst to design and implement functional and cost-efficient IT systems. Main responsibilities include: IT Responsibilities for the cross organizational efficient performance of software and application: Production, Laboratories, Development, Finance. Producing specifications and Design solution for new systems or upgrades. Providing technical support across the company.\n\nPlan oversee and perform projects (e.g. upgrades, hardware/software installations) Full IT Support for the company computerized systems during its life cycle management stages. Responsible for user training and feedback knowledge experience as an IT Analyst, IT Consultant or similar role. Hands on knowledge of Microsoft OS: Servers + Clients.\n\nHands on knowledge of backup solution and reliable data protection for Enterprises Hands on Knowledge with networking Cisco environment. Experience in project management. Understanding of business practices Excellent communication skills Analytical mindset Problem-solving aptitudeShow more Report"}, {"company": "Procter & Gamble", "job": "Brand Manager P&G Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=215&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cada1b72&cb=1676383417322&jobListingId=1008106611857&jrtk=3-1-1gp83pstkh4dl801-1goose8rugai5800-adf41c909c3f2027-", "description": "Are you looking for meaningful work? Come to P&G where Brand Management was born!\nDid you know P&G invented the concept of branding and data-driven brand management? Over the years, we have remained consistently among the top in marketing by finding new and exciting ways to reach consumers.\nAs a Brand Manager, you will be responsible for making sure we win with consumers' preferences in each of the following areas: When they learn about our product, When they choose to buy the product, When they use the product at home.\nWe are looking for the world's best marketing pros who follow one simple concept: \"Consumer is boss\".\nWorking in brand management at Procter & Gamble means being more than just a marketer, it means being a total business owner. We need someone who is dedicated and who can guide the vision and strategy behind a brand by developing marketing plans and driving innovation. Our Assistant Brand Managers need to work regularly across functions to identify consumer, shopper, and customer insights and execute marketing tactics that will continue to grow your brand profitably.\nTogether, we'll continue to create leading brand experiences and make a difference for nearly 5 billion consumers every single day. Pretty cool, right?\nWhat we offer you:\nResponsibilities from Day 1 – You will start of working on key brands from the beginning. Over time, as you expand your impact on the business, your responsibility and ownership of a brand will quickly grow.\nRecognized state of the art marketing skills – We will constantly help you improve your marketing knowledge and management abilities.\nContinuous coaching & mentorship– We are passionate about our work. We will make sure you receive both formal training and regular mentorship from your manager and others.\nDynamic and respectful work environment – We live our Purpose, Values, and Principles daily. We value every individual and encourage initiatives promoting agility and work/life balance.\nAs a Brand Manager, you will have opportunity to work on brands, driving the business results. You will engage with multi-disciplinary teams (including Sales, Finance, Product Supply, Advertising, and Media Agencies) to develop top strategies for your brand's success.\nYou will lead a mix of Marketing and Brand Management projects enabling you to show the breadth and depth of your leadership. You will need to derive insights from the data, which will enable brand leaders as they set the direction for brand growth. As your skills increase, you can expect to advance in roles with increased responsibilities. Overall, we want people who aren't afraid to take smart risks and innovate.\nQualifications\n\nWe want someone with:\nStrong academic background\nExcellent visionary, strategic and courageous leadership skills\nStrengths with strategic and analytical thinking\nAn ability to drive innovation and brand growth\nStrong ability to communicate and team capabilities\nUp to 5 years’ experience\nFluency in English\nJob locations:\n\nTel Aviv, Tel Aviv District, Israel Job Type: Full time Job categories: Brand Management/Marketing Req No: R000059810Show more Report"}, {"company": "Tesla", "job": "Tesla Advisor", "city": "Rishon LeẔiyyon", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=216&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d59593ac&cb=1676383418524&jobListingId=1008157143779&jrtk=3-1-1gp83pu2njij3801-1goose8rugai5800-c77a7b9d52c44775-", "description": "What to Expect\nAs a Tesla Advisor it is your responsibility to offer seamless customer service throughout the entire customer journey. You have relentless determination to succeed and you are driven by the mission of Tesla to accelerate the world’s transition to sustainable energy. You act as a pioneer for Tesla products, sharing your knowledge and building lasting relationships.\nYou are part of a larger sales team who works closely and flexibly on all tasks. You are expected to cooperate frequently and display a one-team mentality to achieve sales and delivery targets.\nWhat You’ll DoTo offer excellent customer service throughout the sales and delivery process.Ensure close and tailored communication with customers at all touch points.Maintain a presentable showroom while proactively addressing all customer queries and appointments.To inform and educate about Tesla at every opportunity.Help create, maintain and develop sales pipelines.Be a strong contributor to achieving store sales and delivery targets.Maintain sales administrative duties including contract completion, finance and ensuring systems are up to date, as well as effectively managing all outbound activities and reporting.Ensure readiness of fleet cars at any given time and have an overview of resources available.Prepare customer vehicles in advance of delivery appointments as well as perform direct deliveries.Manage any additional duties to support wider business requirements.\nWhat You’ll BringExperience in providing excellent customer service in a fast-paced environment.Confident in creating great conversations and relationships tailored to the customer’s need.Ability to thrive in a team-based environment and achieve common goalsGreat problem solving skills, and strong ability to take initiative and be proactive.Ability to effectively handle multiple priorities, organize workload, and meet deadlinesResilience, adaptability and a constant desire to developCapable of working autonomously as well as in a team.Positivity, enthusiasm and a passion towards the mission of Tesla.Confident in learning and adapting to multiple technologies.Able to communicate, read, and write effectively in the English language on all levelsHave the required language skills if required by our local marketsGood knowledge of MS OfficeMust have had a valid driver’s license for minimum of 2 yearsMust have and continue to maintain a valid and safe driving recordShow more Report"}, {"company": "", "job": "Head of operations", "city": "Herzliya", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=217&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_11805af0&cb=1676383420245&jobListingId=1008071367524&jrtk=3-1-1gp83pvopjrp9801-1goose8rugai5800-68f12b1a16862ad4-", "description": "הגש מועמדות\n\nהרצליה\nמשרה מלאה\nמעל 5 שנות ניסיון\nתיאור\n\nA leading service provider of solutions for iGaming operators in Herzliya Pituach, is looking for a Head of Operations to come and join our team!\nsupervise and control our clients' operational needs, as a B2B2C service provider you will managing all operational processes for iGaming operators including: Marketing (internal and acquisition), CS, VIP AM, Finance, Risk/ Compliance and etc.\nDevelop high quality business strategies and plans ensuring their alignment with short-term and long-term objectives\n\nדרישות\n\nProven experience as Head of Operations or in other managerial position\nExperience in the field of Online Casino Industry- A MustProficient Technical Knowledge- A mustEnglish High Level/Mother Tongue. Additional European language is an advantage.MSc/MA in business administration or Computer Science.\n\nדרושים בתחום\nמחשבים ותוכנה - מנהל/ת פרוייקטים\nמאפייני משרה\nמעל 5 שנות ניסיוןמשרה מלאה\nשמור משרה\n\nשתף\n\n\n\nDevelop high quality business strategies and plans ensuring their alignment with short-term and long-term objectives\n'>שלח מודעה לחבר\n\nעודShow more Report"}, {"company": "Adidas", "job": "Order Fulfillment Analyst", "city": "Holon", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f86bf8c&cb=1676383421949&jobListingId=1008265592649&jrtk=3-1-1gp83q1d2nced801-1goose8rugai5800-e8b4e7b1bfcf6a4d-", "description": "Purpose & Overall Relevance for the Organization:\nOBF teams are responsible for controlling and delivering the Order Book of the channels on a seasonal level where customer expectations are met on time and in full as well as all making sure the right product availability is achieved for successfully activating Brand related moments\nThe role will ensure that the order book of Israel is delivered inline with the Service Level agreements in place to relevant sales points in right quantities and on time, provide Order Fulfillment analysis and support for the organization, be accountable for continuous process improvements for Order Fulfillment topics of delivering on time, availability, correct allocation and OTIF. The role will also own all relevant Campaigns within the region and coordinate all the necessary operations around campaigns with the relevant stakeholders\n\nKey Responsibilities:\nDirects and coordinates the process covering planning, prioritization, order creation, pick & pack and delivery of the products to customers and own retail\nEnsure channel success by ensuring high product availability for key launches and campaigns\nCoordinating and following of deliveries of all sales channels.\nTrack and deliver all Campaigns & Launches according to the Brand calendar\nMonitoring and reporting including proposals and recommendations for the management team.\nFollow up the availability and order management- monitor the available products and elaborate availabilities.\nFollowing the launch and campaigns products and inform the warehouse about the launch dates in order to deliver the articles on the right time.\nAnalyze the order book and collaborate across functional areas to achieve overall KPI: OTIF- OTA.\nSell in analysis based on consolidation reports.\nReview and control the allocation status of the available articles in the system (SAP) and take the necessary actions if there’s a problem to be solved.\nCreating delivery notes for selected articles to the Warehouse for picking & packing.\nMaintain the order book with cleansing or updating the sales order accordingly.\nReview of incomplete orders\nValidate the trade terms and sales pricing of the sales orders\nADHOC exception management reporting\n\nKnowledge, Skills and Abilities:\nExpert in order management\nStrong leadership skills\nStrong analytical skills and data driven decision making\nAbility to deliver good results under pressure, accepting and meeting critical deadlines\nAbility to #CreateTheNew by challenging the status-quo\nAbility to act as a catalyst in Change Management projects/initiatives\nMotivated team player and willing to learn,\nStrong and proven analytical and communication skills with attention to details\nExperienced in logistics and supply chain management as well as project management\nCompetence, experienced and high level of IT affinity (MS Office/Teams needed / SAP knowledge is a plus)\nStrong interpersonal and communication skills including the ability to lead and influence discussions in diverse groups of varying size (internal & external)\nEnglish speaking and writing\n\nKey Relationships:\nDC & Transportation teams (Warehousing, Transport, last mile, Documentation and Clearance)\nSCM Israel\nSales & Marketing\nCustomer service\nFinance & Internal Controls - Audit\nIT & Legal\n\nMinimum Qualifications:\nDegree Level Qualification in Engineering or Supply Chain.\nMaster/Post-degree certifications in Supply Chain Management and/or Project Management and/or Engineering are preferred\n3-5 years of experience in Supply Chain, Logistics, Project management,\nProficient user of Microsoft Office applications, ERP/SAP\nExcellent skills in communication and negotiation\n\nAT ADIDAS WE HAVE A WINNING CULTURE. BUT TO WIN, PHYSICAL POWER IS NOT ENOUGH. JUST LIKE ATHLETES OUR EMPLOYEES NEED MENTAL STRENGTH IN THEIR GAME. WE FOSTER THE ATHLETE’S MINDSET THROUGH A SET OF BEHAVIORS THAT WE WANT TO ENABLE AND DEVELOP IN OUR PEOPLE AND THAT ARE AT THE CORE OF OUR UNIQUE COMPANY CULTURE: THIS IS HOW WE WIN WHILE PLAYING FAIR.\nCOURAGE: Speak up when you see an opportunity; step up when you see a need..\nOWNERSHIP: Pick up the ball. Be proactive, take responsibility and follow-through.\nINNOVATION: Elevate to win. Be curious, test and learn new and better ways of doing things.\nTEAMPLAY: Win together. Work collaboratively and cultivate a shared mindset.\nINTEGRITY: Play by the rules. Hold yourself and others accountable to our company’s standards.\nRESPECT: Value all players. Display empathy, be inclusive and show dignity to all.\n\nADIDAS CELEBRATES DIVERSITY, SUPPORTS INCLUSIVENESS AND ENCOURAGES INDIVIDUAL EXPRESSION IN OUR WORKPLACE. WE DO NOT TOLERATE THE HARASSMENT OR DISCRIMINATION TOWARD ANY OF OUR APPLICANTS OR EMPLOYEES. WE ARE AN EQUAL OPPORTUNITY EMPLOYER.\n\nJOB TITLE:\nOrder Fulfillment Analyst\nBRAND:\nadidas\nLOCATION:\nHolon\nTEAM:\nSupply Chain Management\nSTATE:\nM\nCOUNTRY/REGION:\nIL\nCONTRACT TYPE:\nFull time\nNUMBER:\n490939\nDATE:\nFeb 3, 2023Show more Report"}, {"company": "Check Point Software Technologies Ltd.", "job": "Country Manager - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=219&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a52026be&cb=1676383423169&jobListingId=1008350788543&jrtk=3-1-1gp83q2j0kltb801-1goose8rugai5800-2b767168a340a795-", "description": "Your Impact & Responsibilities\n\nWe are looking for our next Country Manager in Israel to lead our local sales organization to great things! As the country leader, you will be tasked with directly managing the local sales teams (Direct Touch and Channel Sales) as well as indirectly managing the Presales, Marketing and Finance teams. In this key role you will have the opportunity to influence employees, business partners and end customers alike, while making sure that our market share in the local cybersecurity landscape keeps growing. If you are a natural-born leader, we want you on our side!\n\nResponsibilities will include:\n\nAchieving and exceeding the sales targets for Israel\nIncreasing market penetration with the Direct Touch Accounts team\nLeading the Channels team with the development of the channel sales, enhancing the performance of the current partners and extending the market coverage through additional partners\nBuilding strong engagement and relationship with clients, the sales teams and the presales team by executing go to market programs and through account mapping and planning\nManaging pipeline generation and accurate forecasting including new solutions, projects, renewals and refresh\nPushing Security Checkups and POCs to empower direct touch relation\nContributing to increase Check Point awareness in the market place, through direct contacts with large accounts, technology consultants, specialized press and by active presence in trade shows and Check Point organized events\nBeing the brand ambassador of Check Point Israel\nDeveloping local market intelligence and competitive take-out\nDeveloping and coach all sales staff under your supervision\nYour Knowledge & Skills\nAt least 8-10 years of successful experience in IT enterprise sales and channel sales, including at least 5 years in a Team Leader / Sales Director/Country Manager / Regional Director role with direct reports responsibility\nBusiness acumen with good ability to strategize and plan as well as being hands-on when needed\nGood understanding of the IT Security market including local insight on competitors, solutions and current trends\nResult oriented and action driven\nHigh level of spoken and written business EnglishShow more Report"}, {"company": "Cognyte", "job": "Export Control Specialist", "city": "Herzliya", "date": "7d", "rating": "3.9", "link": "", "description": "At Cognyte we create mind-blowing investigative analytics software to speed up investigations and allow customers to detect and respond to real security threats like terror, crime, fraud, cyber threats, crypto crime, and more.So, if you want in on the action, let’s talk!You’ll make an impact onCooperating with different stakeholders within the company, as well as acting as a connecting thread between Cognyte and the Ministry of DefenseSupporting the company’s registration in Defense Export Control Authority (DECA) and handling marketing and export requests as well as encryption licenses.Training company employees, according to DECA guidelines, together with internal company policiesManaging and updating the company's databaseWorking in a team, participating in professional discussions, and being a part of different projectsWorking in a changing and evolving dynamic environmentRequirements:Your tool boxAssertiveness and MotivationAbility to lead independent processesExcellent human relationsTeam worker and a fast learnerCommercial awareness, responsible and accurateOrganization skillsExcellent English – spoken and writtenTechnological background - an advantage*Why Cognyte is your perfect match*We’re a values-driven business with a strong passion for innovation that makes a meaningful impact on the world around us. We are calling out to YOU - the curious minds of the world, who are looking to break new ground and bring innovative ideas to life.If this describes you, we could be your perfect match!Curious? Apply now.Career Page:People, Finance & LegalJob Type: Full-timeShow more Report"}, {"company": "ZIM", "job": "Tax Assistant", "city": "Haifa", "date": "1 day ago", "rating": "4.4", "link": "", "description": "We are looking for a Tax Assistant that will directly supports the Global Tax Director with tax compliance, research, planning, provisions, and audits. This position manages Israeli direct and indirect tax compliance on a monthly, quarterly, and annual basis. Responsibilities will include reconciliations, calculations, document preparation and filing, as well as maintaining matrices. Also responsible for some aspects of international tax compliance management and reporting.\nReporting & Compliance\nResponsible for completion of income tax returns work papers including all related analysis.\nResponsible for completion CbC and MF report work papers including all related analysis\nPrepares income tax accounting records and reports in accordance with applicable tax accounting practices, including analysis of Uncertain Tax Positions.\nTax consulting & Audits\nAssist to manage audits conducted by local / external financial auditors and tax authorities (Income tax, WHT, Payroll tax, VAT).\nAssist payroll group, as needed, to understand payroll tax matters on a global basis\nTax planning & Strategy\nPrepares spreadsheets to assist with understanding global tax impacts related to business expansion, re-structuring and general planning matters\nAssists with research of income tax considerations on a transactional basis\nAssist the management in estimating and monitoring annual cash taxes.\nTax Accounting\nAssist with accounting for income taxes (SFAS No. 109 / IAS12).\nPrepares tax footnote, including quarterly disclosures\nPrepares income tax accounting records and reports in accordance with applicable tax accounting practices, including analysis of Uncertain Tax Positions (UTPs)\nMaintains all income tax accounting balances and schedules\nEnsuring that appropriate internal controls are in place over accounting for income taxes.\n\nRequirements:\n \n5 years as a Certified CPA – BIG4\nTAX related experienceExperience with ERP systems and highly proficient with Excel.Strong research and problem-solving skills Demonstrated ability to prepare and maintain appropriate tax documentation on a quarterly, and annual timeline\nFunction:\n\nFinance\n\nPublish in Internal Career Page:\n\nNoShow more Report"}, {"company": "General Motors", "job": "Finance Controller - Maternity leave", "city": "Herzliya", "date": "24h", "rating": "4.1", "link": "", "description": ""}, {"company": "ธนาคารไทยพาณิชย์", "job": "Associate/Principal, Venture Capital (SCB10X)", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=223&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a9cd61f6&cb=1676383429060&jobListingId=1007017962825&jrtk=3-1-1gp83q8btkf26801-1goose8rugai5800-b438ad8ddee20f6f-", "description": "สมัครโปรดคลิกที่ปุ่ม \"Apply\"\nIf you are an active SCB employee, please apply through Workday by searching \"Find Jobs\".\nIf this is your first time applying you will need to create a candidate account when you click on apply.\nJob Description\nPerform Due Diligence on Venture Capital Investment\nGather information from target company and industry experts\nDo research on the existing references and customers of the target company\nExplore and research potential competitors to the target company\nWork closely with technical/business consultants to evaluate the target company including IPs\nConduct background checks on the current management of the target company\nDevelop financial modelling and valuation analysis and prepare internal investment memo\nPerform market research to help identify new investment trends and opportunities\nManage deal screening; call and/or meet with prospects, evaluate opportunities\nSummarize documentation; call notes, enter deals into CRM\nConnect business network with peers in other Venture Capital Firms\nPerform monitoring and reporting of portfolio companies\nQualification:\nBachelor’s Degree or higher in Business, Finance, Engineering, Accounting discipline preferred\nAt least 5 years’ experience in Venture Capital or related field\nExperience in Investment experience and/or due diligence\nUnderstand both technical and business concepts quickly and effectively with business acumen\nWe're committed to bringing passion and customer focus to the business.\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us.Show more Report"}, {"company": "Applied Materials", "job": "Operational Excellence Program Manager", "city": "Rehovot", "date": "13d", "rating": "4.1", "link": "", "description": "We are looking for a leader to create and maintain Operational Excellence culture within Applied Materials Israel, and lead the way for Operations to achieve productivity and performance goals\nWhat’s in it for you?\nEnable Applied Materials Israel continuous growth while improving financial results and competitiveness\nMonitor and share Operations Key Performance and Cost indicators vs. desired goals\nLead the way for Operations to achieve productivity and performance goals, identify the potential areas for improvement and what needs to be done to achieve the financial goals\nEngage/Align with Applied Materials Israel overall goals and missions – lead SR and AOP cycles within operations\nReflect Operations’ strategic projects/initiatives progress towards the key goals (QBR, QOR)\nProvide the methods and tools that enables operational excellence – foster lean culture, develop Ops University, lead internal and external benchmarks, nurture universities relations and innovations\nDrive & Manage Cost Related projects\nO ur group:\nOps Strategic Programs group enables continuous growth of large scale ‘mode of operations’ while driving the organization to be cost-efficient, providing roadmap and tools to achieve productivity goals.\nWhat should you have?\nBSc/MSc in Industrial Engineering, Economy, or MBA\nOver 7 years’ experience in the industry, specifically in operations or finance\nKnowledge in Operational KPI and financial aspects\nExperience in leading cross-organizational projects/processes to long term growth and operational productivity improvement\nKnowledge & experience in Lean and continuous improvement methods\nStrong analytical and problem-solving skills, out-of-the-box thinking\nLeadership skills and mindset – Visioning, cares to make and lead change, proactive thinking, see the greater picture, drive to global optimization, conflicts management\nExperience in project management and portfolio management\nStrong communication skills – Verbal and Written, presentation, building and conveying the right messages to a given audience\nIndependent in work, self-motivated, welcome feedback, drive for continues Improvement\nTeam player – ability to work with wide global teams, good interpersonal skills\nWho we are?\nApplied Materials Israel is home to the Process Diagnostics and Control business unit (PDC). Based in Rehovot, we develop, manufacture and market cutting-edge machine learning and computer vision-based metrology and inspection products that are essential elements in wafer fabrication. By playing a significant role in enabling the production of the next generation of microchips, our expertise enables our customers to transform possibilities into reality.\n#LI\nQualifications\nEducation:\nBachelor's Degree\nSkills\nCertifications:\nLanguages:\nYears of Experience:\n10 - 15 Years\nWork Experience:\nAdditional Information\nTravel:\nYes, 10% of the Time\nRelocation Eligible:\nNo\nApplied Materials is an Equal Opportunity Employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, citizenship, ancestry, religion, creed, sex, sexual orientation, gender identity, age, disability, veteran or military status, or any other basis prohibited by law.Show more Report"}, {"company": "Mobileye", "job": "Operation Manager for Sales Team", "city": "Jerusalem", "date": "7d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=225&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6947150a&cb=1676383432139&jobListingId=1008443679409&jrtk=3-1-1gp83qbcbkf2e801-1goose8rugai5800-ab173095f8841a15-", "description": "At Mobileye, we foster a hybrid-friendly environment, combining work from office and home.\nThe Sales Operation Manager provides vital support to the Company’s sales team. The successful candidate will maintain the sales pipeline, process orders, assist management with forecasting, and act as an extension of the sales team. An efficient Sales Operation Support contributes to quality customer service and helps the sales team meet its targets. The candidate will collaborate with team members in Sales, Operations, Finance and Mobileye's clients to ensure flawless customer service. The sales operation manager will maintain the data integrity and accuracy in the Company’s information systems.\nwhat your job will look like:\nAdminister and maintain the Sales Team Pipeline and data in Salesforce, provide a business overview and accurate sales revenue\nMaintain and monitor all sales reports and work with the team to ensure all payments and POs are on track\nCollaborate with logistics department to ensure timely deliveries, and identify potential delivery issues in advanced\nWork with Finance & logistics departments to setup new customers, escalate overdue invoices and approve part numbers for orders\nMaintain updated price lists and reference documentation for the sales team\nAssist the Sales Team with Salesforce data entry and maintain sales records\nWork with management to create and improve Salesforce dashboards and reporting\nWork closely with Mobileye’s Salesforce Administrator team to improve processes and ensure Salesforce efficiency\nAlert representatives regarding urgent issues and update them on order status and delivery details so they can keep customers informed\nDistribute weekly sales activity reports to the relevant team members\nProvide periodic reports on various activities\nProcess customer purchase orders\nPrioritize tasks\nAll you need is:\n B.Sc. in industrial engineering and management or information systems\n2 years of experience as Sales Operation Manager or equivalent experience\nProficiency in Salesforce – a must (NetSuite- advantage)\nExperience in BI systems- a must (power BI, Qlik sense etc.)\nExcellent administrative and record keeping skills\nExcellent communications, interpersonal and customer service skills\nExcellent written and verbal English\nAccuracy and attention to detail along with great organizational skills\nProficient in MS-Office Suite\nA team player\nAbility to Work under pressure\nMobileye changes the way we drive, from preventing accidents to semi and fully autonomous vehicles. If you are an excellent, bright, hands-on person with a passion to make a difference come to lead the revolution!Show more Report"}, {"company": "Barclays", "job": "Director - Global Markets", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=226&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e9627aa2&cb=1676383433748&jobListingId=1008439616450&jrtk=3-1-1gp83qcqni3bf801-1goose8rugai5800-0454259c360b4ae7-", "description": "Barclays Overview\nBarclays is a British universal bank. We are diversified by business, by different types of customers and clients, and by geography. Our businesses include consumer banking and payments operations around the world, as well as a top-tier, full service, global corporate and investment bank, all of which are supported by our service company which provides technology, operations and functional services across the Group.\n\nWe are an equal opportunity employer and we are opposed to discrimination on any grounds.\n\nDynamic working gives everyone at Barclays the opportunity to integrate professional and personal lives, if you have a need for flexibility then please discuss this with the hiring manager.\n\nAbout Macro\nUnderstanding the interconnectivity between Interest Rate and FX markets has become increasingly important to both our institutional and corporate clients. Our Macro business combines coverage of these asset classes to respond better to their needs.\nAbout Credit Structuring\nCredit Structuring sits within Markets and is part of the Cross Asset Sales and Structuring division. The group provides best-in-class structuring expertise to clients and internal stakeholders in the Credit Trading business in the context of a wide range of transactions, including structured financing, CLOs, credit linked notes and other exotic credit products.\n\nAbout EM Origination\nThe EM origination team is responsible for covering local markets clients with a cross-asset class mandate on both developed market and Emerging markets products. To achieve this, the team works cooperatively with various functions including trading, structuring, legal and compliance across the value chain to deliver a seamless execution to clients while factoring in the regulatory, market, credit, legal and cross-border considerations\n\nOverall purpose of role\n\nOversee sales and origination for Israel.\nKey Accountabilities\nWork with the EM Origination, Structuring and Trading teams to originate structured finance transactions in specificized coverage region.\nIncrease the client footprint by developing new relationships especially with EM sovereigns and quasi sovereign entities as well as other state-owned corporations\nParticipate in defining the Origination strategy for EMEA, generating new initiatives and enhancing the product offering based on latest market dynamics while managing financial resource consumption and credit limits\nBe responsible for updating the Credit Risk team on credit limit utilisation rates and the pipeline\n\nStakeholder Management and Leadership\nKey stakeholders and relationships:\nSales, trading and structuring partners within the Macro & Credit businesses\nInfrastructure partners in Operations, Legal, Credit and Onboarding\nIB, CB and PB coverage bankers\nSovereigns, Corporates, Funds, Investment Companies\nDecision-making and Problem Solving\nRequires strong judgement and analytical skills\n\nRisk and Control Objective\nEnsure that all activities and duties are carried out in full compliance with regulatory requirements, Enterprise Wide Risk Management Framework and internal Barclays Policies and Policy Standards\n\nPerson Specification\nStrong interest in business and finance\nResourcefulness, team-orientation, enthusiasm and an entrepreneurial spirit\nSignificant industry experience with multilateral banks, project finance and the public sector\nEntrepreneurial. Must be able to form strong relationships and be collaborative with Front-office and Infrastructure teams\nPassionate, motivated and resilient\nExcellent written and oral communicator in English and other local languages.\nStrong analytical and quantitative skills\n\nEssential Skills/Basic Qualifications:\nBachelor’s degree in Finance, Business Administration, Economics, Financial Engineering or closely related field\nExperience in Origination and Project Finance\nExisting client base in Sub Saharan Africa and other EM markets especially with the Sovereign and Quasi-Sovereign Entities\nSME in local business practices/culture. Knowledge of local languages.\n\nDesirable skills/Preferred Qualifications:\nMaster’s Degree in Finance, Business Administration or Public Administration\nSolid experience in Origination and Project Finance in CEEMEA\nExisting client base in CEEMEA especially with the Sovereign and Quasi-Sovereign Entities\n\nRegulated Role\nFCA certification\nThis role is deemed as a Certified role under the PRA & UK Financial Conduct Authority - Individual Accountabilities Regulations and may require the role holder to hold mandatory regulatory qualifications or the minimum qualifications to meet internal company benchmarks.\n\nBarclays Values & Diversity\nDynamic working gives everyone at Barclays the opportunity to integrate professional and personal lives, if you have a need for flexibility then please discuss this with the hiring manager. We are an equal opportunity employer and we are opposed to discrimination on any grounds. It is the policy of Barclays to ensure equal employment opportunity without discrimination or harassment on the basis of race, colour, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, veteran status, genetic information, or any other basis protected by law.\nPurpose and Values\nOur purpose is creating opportunities to rise. We support sustainable and inclusive growth by connecting the ideas, innovations and aspirations of our customers and clients to the capital that can bring them to life. For over 325 years we have funded progress, and today we remain committed to helping make our world more sustainable, more inclusive and more connected.\n\nOur values underpin everything we do: Respect, Integrity, Service, Excellence and Stewardship.\n\nRespect\nWe respect and value those we work with, and the contribution that they make.\nIntegrity\nWe act fairly, ethically and openly in all we do.\nService\nWe put our clients and customers at the centre of what we do.\nExcellence\nWe use our energy, skills and resources to deliver the best, sustainable results.\nStewardship\nWe are passionate about leaving things better than we found them.Show more Report"}, {"company": "Millennium Management LLC", "job": "Quantitative Researcher", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "", "description": "Quantitative Researcher\nWe are assembling a strong Quant Technology team to build our next generation of in-house analytics and trader support tools. This team will develop and maintain the in-house models and pricing libraries to support trading in Fixed Income, Commodities, Credit and FX derivatives, leveraging state-of-the-art mathematical modelling and financial engineering methods to provide our traders with the best analytics and support tools in the business.\nCandidate will need to have strong mathematical education (probabilities, statistics, calculous, etc) to understand, implement and develop state-of-the-art pricing models.\nWe generously reward hard work and outstanding performance, offering a unique opportunity for personal growth and building one’s career path in the lucrative and exciting world of global finance.\nThis is a singular opportunity to join one of the top hedge funds in the world and enter the fast-growing world of FinTech, learning from the best in the field how it is done at the highest levels. No prior experience in finance is required. We offer a dynamic environment and a culture that nurtures learning and growth, with excellent international opportunities.\nResponsibilities:\n Develop fixed-income pricing and risk analytics for our in-house pricing library\nDevelop pre-trade analysis tools for Portfolio Managers\nHelp maintain and enhance our C++ financial analytics library and derivative pricing and risk framework\nMandatory Requirements:\n1 - 2 years of C++ work experience\nStrong analytical and mathematical skills\nStrong problem solving capabilities\nB.A. with a strong quantitative training such as Math, Physics, Computer Science or Electrical Engineering with high grades\nVery strong English written and verbal skills. It is essential the candidate can clearly and fluently communicate in English\nSolid communication skills.\nAble to work independently in a fast-paced environment.\nDetail oriented, organized, demonstrating thoroughness and strong ownership of work\nExperience working in a production environment.\nAdditional valuable skills (nice to have):\nExperience with financial mathematics and derivative pricing.\nExperience in the financial industry\nExperience with Python\nAn M.A. or PhD degreeShow more Report"}, {"company": "Tailor Brands", "job": "Financial Controller", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "4.3", "link": "", "description": "With over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone - we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nJoin our Finance department to oversee all financial aspects of the company, including general accounting, month close, business support, tax returns, audits, operations, cash management, payroll and much more\nAnalyze financial results (monthly, quarterly, and annual reports) with respect to cash burn, trends, costs, and compliance with budgets\nPrepare investors and management periodical packs\nCash management and cash projections\nEquity related matters, including managing the cap table, option plans etc.\nInteract with other departments to provide consultative support for planning initiatives through financial analysis, reports, and recommendations\nWork with the Company’s external auditors and ensure the timely and accurate filing of the Company’s financial reports\nPrepare tax returns and other statutory reports, including tax planning\nEnhance and implement financial and accounting system processes, tools, and controls\nRequirements:\n\nProfessional certification (CPA)\nInternship from one of the Big 4 firms\nAt least 2 years of experience as an assistant controller/controller in a global high-tech company - Startup is a big advantage\nGreat communication skills and ability to collaborate with other departments and external 3rd parties\nExperience in preparing financial statements according to US GAAP\nAbility to prioritize tasks, meet deadlines, well organized and function as a team member to accomplish job roles\nGreat attention to details and problem-solving skills\nSuperb written and verbal communication skills both in English and Hebrew\nWorking knowledge of MS Office (especially Excel) and Priority accounting software - Advantage\nFamiliarity with SaaS metrics (especially in B2C) - an advantageShow more Report"}, {"company": "NNG LLC", "job": "SDR and Sales Ops", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=229&ao=1136043&s=58&guid=0000018631c722f4b782187c5df63356&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4f7aeeb7&cb=1676383437919&jobListingId=1008124264923&jrtk=3-1-1gp83qgvrjcbs801-1goose8rugai5800-75717af82e4d5bc5-", "description": "Arilou in a Nutshell\nArilou is the pioneer of cyber-security solutions for the automotive industry. Innovation is part of who we are, and every moment is invested in creating cutting-edge technology. In 2019 we were awarded Frost and Sullivan’s Best practices Award for Technology Innovation.\nAs the first company to introduce in-vehicle network security systems, Arilou continues to push the limits of automotive cyber security and is constantly evolving. A growing list of partnerships featuring OEMs (car makers) and many other industry leaders, including ARM, STMicroelectronics, Alpine Electronics, and Green Hills Software, offers a wide range of challenges.\nWe are looking for top talent to join our team, and work at the leading edge of automotive cyber-security research and design.\nJob description:\nThis position is a unique opportunity enabling you to combine a an SDR & Sales operations r responsibilities\nProactively seek new business opportunities in the market, qualify the leads, and present the company’s product to potential clients.\nCreate and manage lead generation campaigns via different channels; communicate with prospects through LinkedIn, cold calls, and emails.\nDevelop and execute lead generation strategies to schedule a targeted number of appointments for the sales team.\nImplement call scripts, campaigns, email pitches, and other outreach to improve leads generated.\nAccomplish meaningful metrics and reports to measure productivity and quota attainment.\nMaintaining database records.\nRaising Invoices, sales orders, and quotations.\nAnswering sales team queries and Supporting the Sales and Marketing users with all ERP-related requests.\nNew users training and implementing new procedures.\nMonitoring ongoing orders, payments, and shipping.\nEnforce Sales procedures.\nWork closely with the Finance team on revenue recognition and related transactions.\nRequirements:\nHigh level of English – must. Additional languages – advantage.\nProven work experience as an SDR/BDR of at least 1 year, Sales Ops experience – An advantage\nUnderstanding of sales performance metrics.\nA team player with a high level of dedication.\nBe comfortable speaking with decision-makers via various mediums (social, email, phone, and video).\nExcellent verbal and written communication skills.\nHands-on experience with CRM- Must, email automation tools, Excel, and data analysis.\nExpertise in the APAC, US, and western Europe enterprises – advantage.\nExperience in the IoT/OT cyber – advantage.Show more Report"}, {"company": "OrCam", "job": "Europe Regional Director", "city": "Jerusalem", "date": "15d", "rating": "3.6", "link": "", "description": ""}]