[{"company": "Edwards Lifesciences", "job": "Research Engineer", "city": "Israel", "date": "24h", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=201&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c2ffb0b&cb=1676381914982&jobListingId=1008452345369&jrtk=3-1-1gp82c1oljfmv801-1gojf1vc2ihnd800-365a398526f380b8-", "description": "Conduct ad-hoc research projects, involving planning, executing, and analyzing the results. Execution involves designing tests and working hands-on in the lab.\nThe job necessitates high analytical skills, as well as good technical skills.\nAbility to systematically work on different projects at the same time.\nProvide design inputs to existing or new products, based on the results of the Research work\nWrite technical reports based on multiple testing.\nCollaborate with different functions within the organization, both technical and cross functional.\nCreate working plans and manage resources to support Research activities.\n\nRequired Education/Skills:\nBachelor’s degree in Biomedical\\mechanical engineering\nHigh self-learning ability\nStrong execution, communication, and interpersonal relationship\nTechnical oriented skills\nBasic understanding of statistical techniques\nFluent English both oral and written\n\nRequired Experience:\n1-4 years of experience in medical device\nPreferred experience with cardiovascular industry\nKnowledge and understanding of imaging modalities as CT, Fluoroscopy and echocardiography – Advantage\nPrograming experience in Python and MATLAB - advantage\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Jellyfish", "job": "Paid Social Manager", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=202&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a9f73d89&cb=1676381916700&jobListingId=1008420809920&jrtk=3-1-1gp82c3epkhrt801-1gojf1vc2ihnd800-bb5b8dc889f4da49-", "description": "Company Description\nJellyfish is your digital partner. We support and drive digital transformation by providing the right technology, strategy and training.\nWith offices across the globe, we are focused on increasing our network, client base and digital services to the biggest brands on the planet.\nWe are ‘One Jellyfish’, we know how important it is not just to have the best people in the world working with us, but to also recognize and reward this talent. What’s stopping you from joining our award winning team?\n\nJob Description\nWe are looking for a self-motivated individual with high levels of energy to join our team as a Paid Social Manager. Our Paid Social Managers are responsible for the managing, executing and delivering clientʼs paid social strategy and efficient day to day management of assigned client accounts, focusing on delivering performance against agreed KPIs.\nThe ideal candidate will be responsible for planning, executing, optimising and reporting on best-in-class paid social media campaigns for our clients through available social media marketing platforms (e.g. Facebook, Twitter, Instagram, SnapChat, etc) working closely with the Client Services team to communicate campaign strategy, progress and results.\nThe successful candidate will have a high level of attention to detail, be data-driven, numerate and an articulate presenter.\nResponsibilities include:\nCampaign Management\nPlanning paid social campaigns across multiple-social channels.\nOptimising and executing Jellyfishʼs methodologies against paid social plans utilising native platforms, third party and internal tools, as required to deliver efficient and profitable Paid Social campaigns.\nCritically analysing the performance of campaigns, identifying opportunities to optimise, facilitating changes to hit and exceed client expectations and KPIs.\nProject managing all activity and processes required to proficiently run and create campaigns.\nProducing high quality client-facing reports, studies and presentations to Jellyfish brand standards including measuring forecasts vs actual and clearly articulating rationale for optimisation methodologies throughout campaigns..\nMaintaining an in depth understanding of Jellyfishʼs marketplace and the social landscape to ensure delivery of best-in-class campaigns.\nManaging day-to-day relationships with account teams, clients, advertising partners and colleagues\nTraining & Upskilling\nUpskill other members of the team, where required, on best practice paid social campaign execution.\nSupport the wider team to improve their understanding of paid social.\nShare best practice and knowledge with wider Jellyfish Group via lunch and learns, or other learning situations.\nBest Practice & Offering development:\nContribute to the creation of up-to date processes and frameworks to facilitate the growing use of paid social, when required.\nPro-actively work in partnership with directors and heads of other departments and divisions to ensure adherence to best practice in all areas as well as following set processes to deliver campaigns On Time In Full.\nCollaborate with the Data, Strategy and Planning teams to understand how paid social contributes to multi-service campaign success\nCollaborate and support the delivery of paid social media measurement frameworks and KPIs.\nDevelop the paid social offering to include the latest tools, technology and techniques, when required.\nWork with data suppliers and other 3rd party data experts to deliver clear data visualisations of reports for clients.\nEnsure all work is QAʼd appropriately and to the highest standards.\n\nQualifications\nKnowledge & Experience Requirements\nAn in-depth knowledge of the technologies and processes involved in running Paid Social campaigns\nKnowledge & experience of using Facebook Ads Manager and Twitter Ads Manager would be advantageous\nFacebook Blueprint certified; Google Advertising Fundamentals Exam - would be a plus\nA good understanding of Google analytics and other web analytics packages\nAdvanced knowledge of Microsoft Excel and PowerPoint.\n\nAdditional Information\n\nFlexible working from home policy\nFlexible working hours\nAnnual pay increase on your Jellyfish anniversary\nAnnual bonus\nA flat structure that supports you taking charge of your own career development!\nPrivate Healthcare\nAnd more\nEqual Opportunity Employer: Jellyfish is committed to making adjustments in our recruitment process to enable you to demonstrate your full potential. Should you require reasonable accommodation, please fill out the form here.\nFlexible working\nAnnual Bonus\nAnniversary Increase\nTraining and Development\nLife Assurance\nEmployee Assistance Programme - CounselingShow more Report"}, {"company": "Novartis", "job": "Medical Advisor", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.0", "link": "", "description": "110,000 professionals working together to improve patient’s life and you can be one of them. As Novartis Medical Advisor you will be responsible for optimization of patient access and outcomes by providing up-to-date compound and disease area medical expertise, acting as a key expert in the relevant therapeutic area assigned, and leading across functions to address external and internal stakeholder needs. Up for the challenge?\n\nYour responsibilities include, but are not limited to:\n\nPrepares and drives the execution of the local Medical Affairs strategic plans aligned and in collaboration with product MSLs and other functions (i.e., marketing, market access, RA). This plan should be built based on local stakeholder needs and in line with the Franchise and medical strategies as outlined in the Integrated Product Strategy (IPS) Plans.\nLead early identification of strategic drivers, elaboration of patient journey, positioning, target population, the wider stakeholder population mapping and segmentation.Identifies opportunities for joint value creation through engagement with the key scientific leaders and other partners in the healthcare systems including Patients and Patient Associations to co-design strategies and studies, advocating in the assigned therapeutic area. Utilizes Omnichannel where possible.Gathers and internally shares relevant captured insights (advisory boards, events etc.), to shape the disease area strategy.Accountable to Co-developing integrated evidence plans and ensuring local execution of these plans beginning at DDP/POC and throughout the lifecycle in partnership with Global Drug Development (GDD), functional partners, healthcare systems, patients and other external stakeholders.Provides key medical expertise on the company’s pipeline programs, disease areas and approved brands. Performs comprehensive evaluation of related products passing DDP/FDP to enable effective cross-functional New Product Planning for the Country. Provide informed local input to Global strategies, protocols, etc. if assigned early product portfolio.\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\n\nPost-graduate degree in health/life sciences- Doctoral degree (PharmD, PhD, MD, DMD)Fluent Hebrew and English – both languages required on proficiency levelPharmaceutical industry experience\nSignificant clinical and research background GCPStrong medical and scientific bases and agility to transverse the diseases’ arena\nWhy consider Novartis?\n\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\n\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do at Novartis!\n\nCommitment to Diversity & Inclusion:\n\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\n\n\nJoin our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/network\nDivision\nPHARMA\nBusiness Unit\nREGION EUROPE PHARMA\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nResearch & Development\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "Sandoz", "job": "QA Manager Sandoz", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "1996! In this year Sandoz initiated the world’s first biosimilar development program. Over 20 years of experience in biosimilar development have equipped us with extensive knowledge and world-class expertise and capabilities in the development, manufacturing, and commercialization of biosimilar medicines to the healthcare community and patients worldwide. This opportunity is waiting for you to contribute to Sandoz success story toward the future. Join Sandoz Israel as the Quality Manager ensuring the local Quality System and Standard Operating Procedures are in place for all current Good Manufacturing Practice /Good documentation practice (cGMP/GDP) and ensuring compliance with regulations, through trainings and internal audits.\n\nYour Key Responsibilities:\nYour responsibilities include, but not limited to:\n\nEnsure that a local Quality System and Standard Operating Procedures are in place for all cGMP/GDP (current Good Manufacturing Practice /Good documentation practice) related activities and that compliance with cGMP/GDP regulations is maintained through training and internal auditsCoordinate implementation of quality system and procedures for the implementation of Novartis Quality Manual and quality agreements\nEnsure that change requests, are managed according to Novartis Standard Operating Procedures from receipt, through to the implementation and closure\nConduct Good Practice monitoring on all sections, conduct QA investigation for non-compliance, follow up on corrective actions\nEnsure that all aspects of the handling and distribution of pharmaceutical products in the country comply with the requirements of the Novartis Quality Manual and Policies and meet all relevant cGMP (current Good Manufacturing Practice) regulatory and legislative requirements\nEnsure that coordinated contact is maintained with the Regulatory Authorities, the local partners (suppliers, third parties, licensees, and distributors) and Global Quality Assurance\nEnsure that all incoming drug products are inspected prior to their release to the market in accordance with the current in place procedures, registered specifications and local/ international regulationsManage complaints, deviations, recalls, counterfeits and product tampering according to the Novartis Corporate Quality Manual and local written procedures\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse team’s representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\nDegree in Pharmacy\nQP certification or minimum of 2 years of experience from Pharmaceutical Industry / plantKnowledge of Corrective and Preventive Actions (CAPA), Good Documentation Practice, Quality Management and Quality AssuranceHebrew and English – both on proficiency level, Russian – advantageStrong digital abilities, Resilience and assertiveness\n\nDesirable Requirements:\nHigh level of energies, proactiveness, Team playerExperience from a multi-national company and cross functional interaction\n\n\nWhy consider Sandoz?\n500 million patients were touched by Sandoz generic and biosimilar medicines in 2020 and while we’re proud of this, we know there is more we could do to continue to help pioneer access to medicines for people around the world.\n\nHow will we do this? We believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do here at Sandoz!\n\n\nImagine what you could do at Sandoz!\n\n\nCommitment to Diversity & Inclusion:\nSandoz, a Novartis company, embraces diversity, equal opportunity, and inclusion. We are committed to building diverse teams, representative of the patients and communities we serve, and we strive to create an inclusive workplace that cultivates bold innovation through collaboration and empowers our people to unleash their full potential.\nSandoz are an equal opportunities employer and welcome applications from all suitably qualified persons.\n\nJoin our Novartis Group Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/network\n\nWe are Sandoz, a Novartis Division. Join us and help reimagine medicine.\nDivision\nSANDOZ\nBusiness Unit\nCOMMERCIAL OPS EUROPE SZ\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nQuality\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "Medisafe", "job": "Director of Program Operations", "city": "Haifa", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=205&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_625d7438&cb=1676381920662&jobListingId=1008303760927&jrtk=3-1-1gp82c78fk27m801-1gojf1vc2ihnd800-84642f0381fc31e7-", "description": "About The Role\nMedisafe is a market leader in digital patient support services, using AI and personalization tools to help patients cope with complex challenges. We are looking for a Director of Program operations to join a dynamic and fast-paced environment and work with cross-functional teams to design programs that deliver the company’s vision and strategy and meet our client’s goals.\n\nBy implementing Medisafe’s technology and best practices, the team you lead will be able to influence patients’ lives and provide them with the best support throughout their journey.\n\nAs a Director of Program Operations in Medisafe, you will ensure every program will be delivered successfully and add the highest possible value to the organization. You will be responsible for creating stable and robust infrastructure, defining processes and workflows, improving and scaling up the efficiency of processes, and ensuring the success of each program led by your team.\n\n\nResponsibilities:\n\nRecruit, train, manage and develop a team to become experienced specialists\nProvides direction and integrative coordination in the planning, development, and implementation.\nProvide clear and measurable objectives for the team and the individuals. Supervise all programs and project managers involved to provide feedback and resolve complex problems\nEnsure team members are properly trained to allow optimum performance.\nEffectively develop and mentor team to build broad and deep bench strength in the skills needed to meet succession needs and eliminate key man risks. Provide real-time feedback on performance to direct reports\nEstablishes and implements short- and long-range goals, objectives, policies, and operating procedures; monitors and evaluates operational effectiveness and effects changes required for improvement.\nDeliver ways to enhance the efficiency and productivity of procedures and people.\nIdentifies, recommends, and implements new processes, technologies, and systems to improve and streamline organizational processes and use of resources and materials.\nDeep understanding and identification of partners’ business needs and market trends.\nSeeking and acting upon feedback from partners\nServes as a principal point of collaboration, leadership, and expertise to both internal and external stakeholders on professional and operational matters pertaining to successful execution of programs(Leadership & collaboration) Collaborate with leaders on scheduling resources to promote career development, support execution and fill resourcing needs while ensuring balance of assignments across teams in order to meet program goals.\n\n\nRequirements:\n\n3-4 years of relevant work experience in a managerial position (product or program management) in the healthcare space – a must\nExperience in team leading: supervising, training, mentoring, performance evaluation techniques, and key metrics\nProactive forward thinking – creating new solutions and tools for process & program improvement\nAbility to develop, plan, and implement short- and long-range goals.\nSkill in examining and re-engineering operations and procedures, formulating policy, and developing and implementing new strategies and procedures\nRobust Project Management expertise, with familiarity with techniques and methods, working on numerous concurrent projects. Meeting aggressive deadlines while managing risks and, maintaining an eye for detail and a deep commitment to customer service.\nData-driven, analytical mindset with great problem-solving abilities\nExcellent organizational and leadership skills\nExcellent client-facing skills with great verbal skills including the ability to explain complex processes to non-subject matter experts over client meetings and presentations\nPassionate and knowledgeable about technology and digital solutions\nAdvanced verbal and written communication skills in English\nExperience in startup culture – an advantage\nFamiliarity with Pharmaceutical regulation processes and terminology\nHave a strong sense of empathy with the ability to understand patients/clients needs\n\nBenefits:\nYou’ll be joining a growing company with offices in Boston, London, and Haifa and collaborating with world-class Product Managers, Engineers, Marketers, and Designers in a fast-paced, rapidly advancing Health space.\n\nThis is a full-time position, immediately available in our downtown Haifa office (a walking distance from the train station), and we’re working hybrid.Show more Report"}, {"company": "Edwards Lifesciences", "job": "Application Engineer - Student Temporary position", "city": "Israel", "date": "19d", "rating": "4.0", "link": "", "description": ""}, {"company": "Diageo", "job": "Manager, Field RGM – Strategic Accounts", "city": "Central", "date": "18d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=207&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0acd9293&cb=1676381923569&jobListingId=1008414623788&jrtk=3-1-1gp82ca5djcbj801-1gojf1vc2ihnd800-c0096a3e99801582-", "description": "Job Description :\nAre you looking to play a pivotal role in attracting the next generation of best-in-class talent for one of the worlds most respected fast moving CPG’s?\nDiageo is a global leader in beverage alcohol with an outstanding collection of brands including Johnnie Walker, Crown Royal, Bulleit and Buchanan's whiskies, Smirnoff, Cîroc and Ketel One vodkas, Captain Morgan, Baileys, Don Julio, Tanqueray and Guinness.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. It is central to our purpose to celebrate life, every day, everywhere.\nWe are a global leader in beverage alcohol with an outstanding collection of brands across spirits and beer! We produce an assortment of over 200 amazing brands – old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world!\nDiageo is listed on both the New York Stock Exchange (DEO) and the London Stock Exchange (DGE). For more information about Diageo, our people, our brands, and performance, visit us at www.diageo.com. Visit Diageo's global responsible drinking resource, www.DRINKiQ.com, for information, initiatives, and ways to share standard methodology.\nManager Field RGM – Strategic Accounts\nKey Outputs/Deliverables\nEnsures the DIAGEO US Spirits pricing agenda and related NRM processes run efficiently in order for Diageo to optimize Diageo NA NSV / GP growth\nIdentifies key market level RGM opportunities\nImproves trade spend efficiencies in order to drive net revenue and profitability for DIAGEO\nDrives internal and external organizational capabilities, processes, and tools in the NRM space in order to accelerate data insights into commercial action\nPerformance Management\nDeliver RGM value through price and mix that is ahead of the industry\nLeads the development of annual discount plans, and promotion calendar\nDrives Strategic Account level RGM Optimization Missions\nImplement price direction for both headline price and promotional guidelines in strategic accounts\nFacilitate monthly strategic account reviews\nReview and approve gap close programs and communicate impact to central finance\nEnsure team is using system based M&E tool to make data backed decisions in gap close process as well consistent post M&E reviews\nLeverage TRAX, Nielsen, and NABCA data to inform annual price planning process as well as retailer profitability\nWorks with distributor and central Rev Mgmt team to identify pricing opportunities\nLeads development, maintenance and communication of price changes and promotional calendars.\nAnalytics\nCreates insightful and practical monthly analysis of pricing results\nReviews trends and competitive activity throughout the year to identify additional suggested pricing opportunities or risks\nDrives deal level analytics, Diageo / Distributor suggested margin analysis, conduct project based analytics and scenario planning to make informed suggested pricing recommendations\nResolves distributor inquiries on pricing process/data/reporting analytics\nSystems\nPrice Model Administration - maintain frontline price changes, support calendar, suggested price models and local pricing data (taxes, freight, etc) – multiple systems: VIP/DO, RM/Anaplan, MSBI, AIP/Qlik\nExperience:\nUndergraduate required; MBA preferred\nMust have 3-5 years of cross functional commercial experience, with strong analytical and technical skills.\nProven track record of being able to manage and influence a wide array of senior leaders\nHave sophisticated skills in analytics and data insights. Must understand and apply data analysis to drive effective portfolio strategies and business performance. Must know how to use and implement metrics to measure performance\nWorker Type :\nRegular\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2023-01-18-08:00\nSalary Range:\nMinimum Salary:\n$105105\nMaximum Salary:\n$175175\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US-based employees are eligible for healthcare benefits, retirement benefits , short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.Show more Report"}, {"company": "Roche", "job": "Field Application Specialist", "city": "Hod HaSharon", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=208&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_99c93d63&cb=1676381925267&jobListingId=1008106162098&jrtk=3-1-1gp82cbp7kcm2801-1gojf1vc2ihnd800-3607ae0a8f3e0eb8-", "description": "The Position\nWho we are:\nRoche is ranked among the world's foremost corporations providing innovative healthcare solutions, continuously investing in medical research and development.\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.\nThe Position:\nThe Field Application Specialist provides after-sales support to customers on Roche Diagnostics Product Portfolio. The application support provided on the phone, by email or during site visit and is in the form of troubleshooting assistance.\nAs a member of our Applications Specialist team, you will be primarily responsible for providing application support and expertise to existing and potential customers. You will install, train and provide troubleshooting assistance for Roche’s Core Lab instrumentation and reagent systems.\nYou will work in close collaboration with the sales team to assist in driving sales.\nAccountabilities:\nApplication Support:\nProvide support to customers when any application issues arise in a prompt and timely fashion, Perform or assist with software upgrades of customer instrument base.\nProvide post-sales support to the customer to aid in establishing new parameters and answer technical inquiries.\nInstall & configure instruments and related reagents\nPerform customer training\nMaintain and develop customer facing documentation for support and training\nInstall applications on Roche platforms according to Roche guidelines / procedures;\nRun correlation studies and validations in coordination with the customer if/as required;\nEstablish a plan to visit and/or communicate with each assigned customer on a cycle or frequency matching the customer’s needs and support requirements and Roche’s business priorities.\nSales Assist:\nPre-sales support in the form of customer tailored shows and/or demonstrating to customers\nPresent Roche technical and application solutions to customers during demos\nSupport sales through technical knowledge and with the RFPs' technical details as needed.\nWho you are:\nBachelor's Degree in Science, Applied Science or similar.\nMinimum of 3 years of relevant experience as Application Specialist in the Diagnostics field, preferably in the Core lab domain\nThorough background in Biology /Chemistry\nAbility to analyze and resolve situations while maintaining a high-level of customer service\nPossess and apply excellent troubleshooting skills\nStrong presentation and communication skills\nAble to work with minimal supervision\nMay be required to be available for standby work (after hours) occasionally\nWho we are\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.Show more Report"}, {"company": "Diageo", "job": "National & Strategic Accounts Sales Analytics Manager", "city": "Central", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Edwards Lifesciences", "job": "Reception and administration Representative", "city": "Israel", "date": "25d", "rating": "4.0", "link": "", "description": ""}, {"company": "Edwards Lifesciences", "job": "Senior Sales Specialist - Distributor Surgical", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=211&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b0d1ce16&cb=1676381928916&jobListingId=1008447723501&jrtk=3-1-1gp82cfaejca7801-1gojf1vc2ihnd800-b120728b73f7bd86-", "description": "Advise sales management on distributed sales customer information, market trends, and Edwards' historical sales data for development of strategies to achieve business development goals. Ensure validity of all distributed sales transactions and pricing.\n\nBe the primary contact with Israeli cardiac surgeons and hospital staff to ensure sales and promotion of the Surgical portfolio in collaboration with local distributor.\n\nKey Responsibilities:\n\nLead in analyzing customer pricing data, and developing and updating customer pricing data reports for provision to Distributors, in keeping with Distributor agreement\nAnalyze Distributor chargeback/rebate claims; negotiate and provide solutions to resolve discrepancies with Distributors\nLead in analyzing Distribution sales trends, develop findings, and propose solutions for sales management\nResolve complex Distributor issues and propose solutions to achieve desired sales results\nAssess and prioritize Distributor AR account issues in collaboration with Finance to allocate resources to address discrepancies\nConfirm accuracy of sales tracings and Distributor sales shipments\nWorks independently on complex projects and/or lines of work\n\nEducation and Experience:\nBachelor's Degree in in related field of study, previous commercial background, business analysis experience including, spreadsheets, database management systems, and word processing Required\n\nAdditional Skills:\n\nProven expertise in MS Office Suite including Word, PowerPoint, Access, and Excel; Qlik experience preferred\nExcellent written and verbal communication skills and interpersonal relationship skills including consultative and relationship management skills\nAbility to quantify abstract conceptual data into concrete analysis\nAdhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control\nExperience with distribution contracts preferred\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Merck KGaA Darmstadt Germany", "job": "QA Validation Specialist", "city": "Jerusalem", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Nym Health", "job": "Medical Developer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "3.0", "link": "", "description": "At Nym, we’re passionate about simplifying healthcare by automating the accurate interpretation of clinical language.\nOur interdisciplinary team has developed an innovative technology that can understand clinical language and provides an entirely new way of analyzing and decoding medical records into clear, concise, and actionable information. This ultimately ensures clinical and administrative teams can spend more time focused on patient care.\nAt Nym, the future is bright. Our engine currently processes over five million charts annually in more than 150 emergency department and urgent care settings across the US. We are backed by top-tier VCs and growing rapidly, with offices in NYC and Tel Aviv.\nCome join us!\nRole and Responsibilities\nWe are looking for a Medical Developer to be part of our Engineering Team. This role will report directly to Roee Kenett (Medical Director) and will be a key partner to:\nDevelop Nym’s medical knowledge and medical coding accuracy, while collaborating with software developers and linguists to create a robust and comprehensive clinical language understanding engine\nAssist in the onboarding process of new healthcare systems by reviewing and analyzing clinical data and medical coding guidelines\nPerform hands-on development of clinical language understanding software\nDesign and develop new clinical coding features\nRequirements:\n\nMedical Doctor Degree\nFluent in Hebrew and English\nTechnical proficiency - an advantage\nAvailability for full-time position\nPreferred Skills\nExperience with data analysis\nExperience and familiarity with the United States healthcare system\nExperience and proficiency with Python and SQL\nUSMLE Step 2 CK\nThe position is located in our Tel Aviv officeShow more Report"}, {"company": "Abbott Laboratories", "job": "Demand Planner", "city": "Tel Aviv-Yafo", "date": "18d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=214&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c51200df&cb=1676381933556&jobListingId=1008414751456&jrtk=3-1-1gp82cjsfp2mn801-1gojf1vc2ihnd800-84433da0140e7d96-", "description": "ABOUT ABBOTT\nAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.\nWORKING AT ABBOTT\nAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:\nCareer development with an international company where you can grow the career you dream of.\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.\nA fantastic range of benefits including competitive salaries and bonus potential, private healthcare.\nTHE OPPORTUNITY\nThis position is located in Tel Aviv, Israel.\nMAIN PURPOSE FOR ANI DEMAND PLANNER:\nManaging affiliate’s ANI product portfolios.\nTo ensure that the organization meets future demand to continue operating as efficiently and effectively as possible.\nAssuring product availability in accordance with DOH targets, maintain high level service and minimizing product write offs or destructions.\nCORE JOB RESPONSIBILITIES:\nLead projects related to affiliate inventory levels, supply initiatives and logistic activities.\nPlanning inventory flow to better manage product availability, analyzing statistical data, and generating forecasting solutions.\nPlanning Finished goods shipments from factories & global hubs.\nAddress demand-related issues in a timely and effective manner.\nProposing and implementing solutions to improve demand forecast accuracy.\nPlay an instrumental role in the affiliate Demand Review. Act as Affiliate S&OP Coordinator.\nSupport all affiliate functions: Regulatory, Marketing and finance department.\nDaily work in ERP, BI, SAP\nACCOUNTABILITY :\nAnalyze quantity and financial forecasts.\nReport of forecasts and inventory KPIs.\nDrive the Demand Review and S&OP meetings.\nFollow inventory level and improvement plans.\nFollow up on order preparations and fulfillment with distribution centers\nInitiate process improvements\nLead New projects implementation\nKPI Calculation\nQUALIFICATIONS:\nB.Sc. In Industrial Engineering or equivalent\nAt least 1-2 years of similar experience\nHigh data analysis skills, detailed oriented\nTeam Player\nExperienced in working in or with global corporation – an advantage\nWillingness for extensive work\nMulti tasking and ability to work with number of disciplines in parallel\nExperience with ERP systems & Microsoft Office\nExcel Expert\nEnglish proficiencyShow more Report"}, {"company": "Ciklum", "job": "Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": ""}, {"company": "Enovis", "job": "Design Quality Engineer", "city": "Central", "date": "12d", "rating": "3.5", "link": "", "description": ""}, {"company": "Haleon", "job": "Category Manager PH & MM Channels", "city": "Israel", "date": "25d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=217&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8c8cbc35&cb=1676381937607&jobListingId=1008400116213&jrtk=3-1-1gp82cnpvjopq801-1gojf1vc2ihnd800-87815d6cb1723dc5-", "description": "Job Description\nSite Name: Petach Tikvah\nPosted Date: Jan 11 2023\nHello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands – including Sensodyne, Panadol, Advil, Voltaren, Theraflu, Otrivin, and Centrum – through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.\nCategory Manager PH &MM Channels\nIn This Role You Will…\nAs Category Manager PH &MM Channels, you will be responsible to ensure strategic recommendations regarding category development opportunities, customer portfolio management, Customer CATMAN projects, planograms and visibility strategy for both MM and PH channels for the country under his responsibility\nIn This Role You Will…\nDevelop the visibility strategy\nbe responsible for driving in-depth category expertise, shopper & customer research projects\nhave active role in Core Assortment Strategy and portfolio strategy development partnering with Customer Marketing, marketing, sales and NRM\nleads strategic customer Category Management projects through relevant KAMs .\nbe a subject matter expert identifying gaps & opportunities and creating recommendations to sales for execution.\ncollaborate closely with GRI Category Management Lead, ComEx Team, cross functional teams at Haleon\nWhy You?\nQualifications:\nUniversity degree\nHebrew and English\nBackground in sales, marketing, customer marketing, analytics, or related field\nTeam Management experience\nPrevious sales experience\nOver the counter and/or fast moving consumer goods category experience\nExperience working directly with customers to deliver business plans\nStrong experience in leading strategic process and alignment, in a way that builds real buy-to ensure execution follows strategic alignment\nStrong analytical skills, solution orientation\nWhy Join Us?\nThe future of everyday health is changing. And we’re the people changing it. In front of us is an incredible opportunity to go beyond what any of us have done before. And make everyday health more achievable, more inclusive and more sustainable. For more and more people. So join us, as we build one of the world’s leading consumer healthcare companies. Join us to innovate our category-leading brands. To better understand people’s everyday health needs. To tackle the biggest barriers that stand in their way. To change individual and societal behavior. Join us to work with colleagues who share your restless energy. To explore your interests. To stretch yourself to do the best work of your career. And join us, as together we build a working experience that encourages us all to lead happier, healthier, more productive lives. The way we see it, every day is an opportunity for better. And we’re going all in to realize it.\nOpportunities For Growth\nNone of us should ever feel like we are standing still. Instead, we want Haleon to be a place where we feel like we are always progressing.\nImproving everyday health takes dedication. Energy. Effort. So, we look to reward your contribution with a benefits package that includes:\nA competitive base salary\nAnnual bonuses that reflect Haleon’s performance\nHealth and wellbeing programmes that take care of you physically and mentally\nPossibilities of development within the role and company’s structure\nRecognition programmes that reward incredible contributions\nHybrid@Haleon our philosophy to hybrid work – performance with choice\nDiversity, Equity, And Inclusion\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create an unmatched understanding of each other, and promotes fair and equitable outcomes for everyone.\nWe’re striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives.\nWe believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\nCare to join us. Find out what life at Haleon is really like www.haleon.com/careers/\n\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\n\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\n\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Show more Report"}, {"company": "Ciklum", "job": "Delivery Director", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f5dcf0e3&cb=1676381939316&jobListingId=1008373793450&jrtk=3-1-1gp82cpfgj472801-1gojf1vc2ihnd800-6232fdf0e0e9c96b-", "description": "Description\nCiklum is looking for a Delivery Director, to join our team full-time in Israel.\n\nWe are a leading global product engineering and digital services company that unites 4000+ seasoned professionals globally on various projects in healthcare, fintech, travel, sportswear, entertainment, and security. Ciklum delivers high-impact technology solutions to Fortune 500 and fast-growing organisations worldwide.\n\nAbout the role:\n\nAs a Delivery Director, you will be responsible for the oversight, leadership and delivery of multiple large, complex transformation engagements that make up one of Ciklum’s largest markets. The role is focused on supporting our commercial teams in developing winning agile transformation strategies to advise existing accounts and win new deals. The engagements consist of business, technology and operational change. Customer satisfaction, business growth and smooth delivery across numerous projects/programs is a core aspect of the role and potential candidates should be adept at balancing engagement outcomes and the broader goals for the client relationship.\n\nWe’re seeking experienced, high caliber industry leaders with a proven track record of successful delivery. Candidates must have a deep understanding of program and portfolio management principles, a strategic mindset and the natural ability to lead large teams. In addition, the candidate must have a deep understanding of the business culture in Israel and be able to bridge the gap between our clients and our global delivery organization, and to have accountability of the p&l for the portfolio.\n\n\nResponsibilities\nTaking accountability for the P&L of the portfolio, working closely with the commercial team to hit growth and GM targets for the portfolio\nDefining the objectives, delivery strategy and associated timelines for the portfolio, setting aspirational goals and milestones\nWorking with account teams (Delivery and Account Management) to agree a delivery methodology and ensuring it is implemented effectively with the appropriate controls and governance\nProviding regular progress updates to senior client stakeholders and the Ciklum Leadership, including the escalation of blocking issues and ongoing risk management\nDay to day management of a multidisciplinary team consisting of client staff, contractors, suppliers and Ciklum staff, including performance management where necessary\nDefinition of and adherence to the portfolio budget\nOngoing identification and implementation of efficiencies needed to improve quality and pace while reducing running costs\nEnsure all solutions and operations adhere to legal guidelines and internal policies\nOn-demand provide consulting/coaching/training for project team members (e.g. team leads, scrum masters, DMs, etc.)\nManaging and monitoring of gross margin and ongoing earned value analysis\nProvide proactive constructive input to the internal organization on services and solutions that should be considered for improvement and/or creation\nSupervise and mentor Delivery Management Team\nBe accountable for the Change and Risk management for the entire Customer’s project portfolios, including those managed by other project managers, balancing resources in line with overall delivery criticality\nLeading a global high caliber, motivated and professional program leadership team across all disciplines including business design, business change, technology and architecture, testing, release and live support\nRequirements\nThe ideal candidate will possess strong analytical skills, exceptional problem-solving skills, be highly organized and have excellent leadership skills\n8+ years of Agile Delivery / Project Management experience and strong commercial understanding, ideally within the Product Engineering and/or IT consulting industry\n3+ years of experience as a Program,, or Portfolio Director who has already successfully delivered programs with an annual budget in excess of $4-6+m and over 50-70+ team members\nExperience running full stack product engineering teams combining user research and DevOps to create products users love at pace\nDeep agile expertise, experience in scaling programs via SAFe, LeSS, Nexus etc\nStrong service/client-oriented attitude, focus on an outcome\nBusiness acumen with a strategic perspective\nAbility to make rapid informed decisions\nExcellent Knowledge of performance evaluation techniques and key metrics\nExperience in conducting training, coaching and mentoring a group of Delivery Managers\nAgile and/or PMI certification\nPersonal skills\nCompetencies\nInfluencing and negotiating with clients\nWorks collaboratively with clients to identify issues with delivery, opportunities beyond the existing engagement and works with clients to solve issues and grow the account\nProblem Solving\nIdentifies the root causes and effects of the problem, comes up with appropriate solutions, and executes on them\nDecision Making\nAsk the right questions. Analyzes information and makes data-driven decisions\nPersuading and Influencing\nPresents multiple arguments, considers feedback, adjusts language to the target audience\nCommitment to Excellence\nActively seeks new ways of working and continually improves productivity\nAdaptability\nThrives on ambiguity, handles multiple demands effectively, adapts to new situations with fresh ideas or innovative approaches\nIntegrity & Ethics\nMakes choices and consistently acts in a manner that displays integrity (following internal principles, morals, and values) and ethics (following external laws, rules, and norms)\nProactivity\nVoluntarily and proactively initiates the steps to identify and address existing and potential obstacles, issues, and opportunities; leads towards resolution by asking sensible questions\nComprehension & Communication\nArticulates and comprehends technical and business concepts, ideas, feelings, opinions and conclusions in a clear and effective manner\nWhat's in it for you\nPossibility to strategically influence the development of a large-scale international business\nJoin the leadership at one of the most successful and fastest growing regions in Ciklum.\nVariety of knowledge sharing, training and self-development opportunities\nCompetitive compensation package\nCiklum’s commitment to providing support to your professional growth within the organization\nWork closely with an contribute to the success of top Hi-Tech companies in the market\n\nBe bold, not bored!\n\nInterested already? We would love to get to know you! Submit your application. We can’t wait to see you at Ciklum.Show more Report"}, {"company": "MSD Animal Health Intelligence Technology Labs", "job": "Data Scientist", "city": "Netanya", "date": "30d+", "rating": "3.7", "link": "", "description": "Our Company is where we transform vision into reality. It's where ideas become technologies, and cutting-edge technologies become solutions for animal care and management.\nWe support farmers by providing real-time actionable information to help them manage their herds. It provides pet owners with smart devices and data that give them a better understanding of their pets’ activity and health needs, enriching relationships. It helps conservationists safeguard natural environments and wildlife.\nLeveraging decades of Technological Research & Development experience across many markets, technologies, and species, along with development environments and Quality Assurance procedures, we're always inventing new ways to look after the health and well-being of animals. Our decades of experience keep us ahead of the curve by leveraging advanced Technological Solutions from enhancing the precious bond between people and their pets, to advancing animal healthcare and wildlife preservation.\nAs a data scientist, you will help us discover insights from the vast amounts of data our systems collect.\nIn this role, you will utilize data mining techniques, perform statistical analyses, and will be building prediction models for the purpose of surfacing insights related to livestock and companion animal behavior.\nWe are looking for a highly analytical person, proficient in data analysis, mathematics, and statistics.\nYou will be working closely with our animal research scientists to gain a better understanding of the animals we monitor.\nResponsibilities:\nPerform data mining over our large cloud databasesRun statistical analyses of running experimentsBuild prediction models\nRequirements:\n\nB.Sc. or higher in biomedicine, statistics, applied mathematics, computer science or related discipline3+ years of experience as a Data ScientistExperience as a python developerProficient applied statistics skills, such as distributions, statistical testing, regression, etc.Strong Theoretical knowledge of Collaborative Filtering, k-Means, Spectral clusteringLinear-Algebra - a must (LS, PCA, SVD)Experience with SQLStrong programming skillsSelf-learnerTeam player\nAdvantages:M.Sc.Experience with integration of your solution to a production environmentShow more Report"}, {"company": "Vi", "job": "Marketing Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": ""}, {"company": "Diageo", "job": "2023 MBA Summer Internship, Marketing", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8e459bb4&cb=1676381943382&jobListingId=1008115081249&jrtk=3-1-1gp82cteujcbs801-1gojf1vc2ihnd800-9fd0c7582cfd434b-", "description": "Job Description :\nDiageo is a global leader in beverage alcohol with an outstanding collection of over 200 brands - old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world! Brands like Crown Royal, Ciroc, Johnnie Walker, Guinness, Tanqueray, Captain Morgan, Baileys, Smirnoff, Bulleit, Ketel One and Don Julio are at the very heart of what we do. Global or local, every one of our brands has a story - all have a unique purpose and role to play in creating enduring connections with people.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. This, as well as celebrating our inclusive and diverse culture, is core to our purpose of “celebrating life, every day, everywhere”!\nYOUR ROLE\nAs a 2023 summer intern, you will get first-hand experience with our work, our people, our values, and our culture. Interns are given real responsibilities and challenges with projects that have an immediate impact on the business. Throughout the summer, you are given multiple opportunities to interact with senior management through both their project work as well as informative and cultural events. All interns receive individual mentoring and training from their immediate manager, and the opportunity to show results. You are expected to perform to our high standards and are given the same kind of performance feedback we give our full-time employees.\nDuring the 10-week summer internship, you will be asked to immerse yourself in one of our key organizational business units and develop a business plan proposal that will get us a step closer in achieving our ambition.\nSample Marketing Projects from past internships\nDevelop an in-depth understanding of the Guinness Extra Stout (GES) consumer and develop a marketing plan to enhance the volume opportunity for GES\nDeliver a relationship marketing strategy for the Tanqueray portfolio.\nDevelop a revitalization plan for the iconic Seagram’s 7.\nBuild a strategy to double the volume of Smirnoff Ice in five years.\nLeverage sports and the multiverse to drive Captain Morgan growth to multicultural audiences\nKey Qualifications\nCurrently enrolled in an MBA program\nMarketing MBA interns typically have 2 to 5 years of work experience\nLeadership, with a particular focus on transformational and inspirational problem solvers\nCreativity\nCritical thinking\nAbility to work autonomously\nData analysis, synthesis, and interpretation\nStrong communication and presentation skills\nRelationship building\nSalary Range:\nMinimum Salary:\n$50.00/hour\nMaximum Salary:\n$50.00/hour\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US based employees are eligible for healthcare benefits, retirement benefits, short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the roles primary location.\nWorker Type :\nInternship (Fixed Term)\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2022-09-02-07:00Show more Report"}, {"company": "Sanofi", "job": "MSL Immunology Team", "city": "Netanya", "date": "27d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=222&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f2397ab&cb=1676381944534&jobListingId=1008395109197&jrtk=3-1-1gp82cukdjm5i801-1gojf1vc2ihnd800-fce730993a4d056a-", "description": "Job purpose\nMedical Science Liaisons (MSLs) engage with healthcare professionals, institutions and payers, in a non-promotional manner, to identify and address their needs. MSLs use their scientific expertise to communicate and form partnerships to deliver the medical strategy, capture actionable insights and ultimately improve patient pathways and outcomes.\nKey ResponsibilitiesTo build and develop enduring value-based trusted partnerships, through scientific engagement and exchange, with healthcare professionals and institutions in a rapidly evolving healthcare environmentTo engage proactively and reactively with healthcare professionals, payers and institutions.To execute the Country Medical Plan.To generate actionable and valuable insights and propose solutions.To create cross functional partnerships and collaborate with internal stakeholders.All MSLs comply with the local and corporate compliance frameworks for external and internal interactions and complete all global/local mandatory trainings.\nrequirements:\nMedical, pharmacy or post graduate level science degree\nFluency in spoken and written business English.\nAbility to effectively participate in multi-disciplinary teams in order to set and meet business goals and objectives.\nDemonstrates project management skills and effectively manages multiple competing priorities.\nUtilises appropriate time management strategies, to manage complex environment and motivate and guide team with the multiple skill levels.\nDemonstrates agility to identify critical tasks and resources necessary to achieve the desired objectives and ensure execution of strategies.\nHolds deep knowledge and understanding of local regulations and codes of practice for pharmaceutical industry, as they apply to the non-promotional activities of this role.\nHigh degree of knowledge of relevant healthcare systems, the evolving medical landscape, regulatory and payer environment, public health and industry trends to accurately identify key issues and develop strategies and plans.\nAt Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.Show more Report"}, {"company": "AstraZeneca", "job": "KAM Oncology", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=223&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_79de53ad&cb=1676381946360&jobListingId=1008383383933&jrtk=3-1-1gp82d0dckcm7801-1gojf1vc2ihnd800-9b441606d8af13e4-", "description": "At AstraZeneca we turn ideas into life changing medicines. Working here means being entrepreneurial, flexible and thinking big and working together to make the impossible a reality.\nWe’re focused on the potential of science to address the unmet needs of patients around the world. We commit to those areas where we think we can really change the course of medicine and bring big new ideas to life. As Oncology KAM - Lung Cancer Team, you’ll play a pivotal role in channelling our scientific capabilities to make a positive impact on changing patients’ lives.\nAstraZeneca’s vision in Oncology is to help patients by redefining the cancer-treatment paradigm, with the aim of bringing new cancer medicines to patients. A broad pipeline of next generation medicines is focused principally on this disease areas - breast, ovarian, lung and haematological cancers. As well as other tumour types, these are being targeted through four key platforms - immunotherapy, the genetic drivers of cancer and resistance, DNA damage repair,\nand antibody drug conjugates, underpinned by personalized healthcare and biomarker technologies.\nMain Duties and Responsibilities\nYou will be responsible for selling, account management, deep understanding of patient’s journey maintaining and documenting all sales activities for the AstraZeneca Oncology portfolio of products to physicians in hospital settings and within a defined geographic territory.\nYou will be responsible for positioning AstraZeneca as a leader in Oncology commitment through development of long-term relationships with Key Customers and maintaining a high level of clinical expertise by consistently utilizing all available medical information resources.\nYou will also develop and implement clinical sales presentations to groups of healthcare personnel, as well as maximize key physician contact by networking within accounts and at all medical meetings.\nEssential Requirements\nBachelor’s degree (Biology/Life science etc)\nAt least four to six years as a Pharmaceutical Sales Representative\nExperience selling, and knowledge of Oncology products or diseases preferred\nHistory of building customer relationships, and goal achievement\nDemonstrated clinical selling skills and business acumen in complex selling environment\nFluent in English\nA valid driver’s license and safe driving record\nTeam player and flexibility\nNext Steps – Apply today!\nTo be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please fill free to share this posting with them.\nAstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country where the role is advertised.\nAstraZeneca embraces diversity and equality of opportunity. We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills. We believe that the more inclusive we are, the better our work will be. We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics. We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Show more Report"}, {"company": "AstraZeneca", "job": "Medical advisor- Neurology", "city": "Kfar Saba", "date": "17d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=224&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b5b4e1a9&cb=1676381948058&jobListingId=1008417324499&jrtk=3-1-1gp82d226i9gm801-1gojf1vc2ihnd800-66edd4c2927e30fa-", "description": "AstraZeneca is pushing the boundaries of science in order to deliver live-saving breakthrough medicines that will\nimprove patients’ lives. In that endeavour, Medical Affairs is a key strategic partner in shaping the optimal\nperformance of the AstraZeneca brands. The Medical Advisor is a core member of the brand team and\ntakes the medical lead in the therapeutic area (TA) through building scientific partnerships with Key External\nExperts (KEE) and other healthcare professionals through 1) strategic and educational medical affairs projects 2) engaging key external experts (KEE) in TA 3) providing key medical input to marketing-sales-market access\ninterface. 4) providing high quality up-to-date scientific and medical information to customers. These outputs are guaranteed through continuously building robust scientific and medical expertise on the therapeutic area, AstraZeneca products and its competitors in combination with a business acumen attitude and strong\ncommunication skills. The function is office based with a significant field presence. The Medical Advisor is a core member of the brand team, and has a key input into the medical therapeutic area strategy in partnership with the Medical manager.\nTypical Accountabilities\nConduct scientific exchange and collect customer insights:\nThe Medical Advisor typically interacts with key expert customers (defined target list) to build and develop strong strategic partnerships, driven by the science and the TA strategy. During these interactions that are non-promotional in nature and driven by a clear (customer) objective, customer insights are gained that feed back to the brand teams.\nWithin this broad task, the Medical Advisor will:\no Stay up-to-date in TA knowledge through active monitoring of the scientific literature, congress attendance and frequent interactions with Key External Experts (KEE)\no Discuss key data sets with experts in F2F contacts or group meetings in order to identify patient pathways, treatment realities in areas of medical need as guided by the TA strategy\no Build relationships with experts for advocacy development guided by the TA strategy\no Brief speakers for scientific events\no Respond to unsolicited requests for information about unapproved AstraZeneca products or unapproved uses of approved products\no Respond to medical queries via medical information platform\no Continuously improve or optimize impactful communication skills\no Interact with other Medical Advisors/MSLs and MAMs from other countries or other TAs in order to exchange best practice and further shape the role\nDeliver Key medical input into the brand strategy:\no Works in a strategic partnership with the Marketing and Market Access Department , providing key input in the local operational brand strategy by ensuring input of KEE, customer insights and competitive\no Core member of the x-functional brand team\no High quality scientific and medical input in the Brand Teams, Brand Building Framework, strategic brand projects and Campaigns\no Responsible for reviewing and approving of promotional material - solution-driven with thorough understanding of the promotional standards code (company and local)\no Develop and execute medical affairs projects (eg. build evidence) of the brand plan according to budget and timelines.\no Close follow up of the brand medical budget\no Coaches and Support MSLs to be best in class (scientific expertise, communication skills, business acumen) and ensure development and execution of the MSL Action Plans\nMaintain top-notch robust scientific and medical expertise:\no Keep track of relevant scientific peer-reviewed literature in the TA\no Attend international and national scientific and medical congresses in the TA\no Engage with KEE in the TA\no Assimilate customer insights obtained through different means\no Ensure excellent up-to-date scientific knowledge in product and therapeutic area of internal colleagues through knowledge updates, medical product training sessions\no Support Clinical operations in site selection\no The Medical Advisor role is also very active in enabling other functions through internal education and support based on their knowledge from the customers and the TA.\nManage scientific partnerships with KEE\no Manage Externally Sponsored Research\no Follow-up of grants/chairs/scientific sponsoring with Key External Experts\nGain input from and co-create projects with KEE\no organizes and leads meetings with KEE in order to gain their input on well-defined data sets or projects to advance the TA strategy\nBe compliant\no Successfully complete all training requirements\no Comply with all external regulations & internal policies\no Full understanding of AZ MSL guide, external interactions policy standards, (including, but not\nlimited to publications policy, congress policy,…)\nEducation, Qualifications, Skills and Experience\nEssential\nMedical or Pharmacist Degree or scientific\ndegree with PhD\nSignificant and robust experience with\nsearching, handling, assimilating, synthesizing,\nreporting and presenting scientific data in the\nhealth care sector\nNational mobility and flexibility (organisation\nand attendance of evening meetings)\nExcellent relational and communication skills.Takes initiative and proactive were needed\nwhile conscious of compliance and process\nrules in the company.\nPresentation skillsAbility to work effectively in cross-functional\nteams\nKnowledge of therapeutic area or the ability to\nacquire this knowledge rapidly. Broad\nemployability in other TAs is an asset.\nMedical integrity and ethical balanceFluent knowledge of Hebrew and English\n(verbal and written)\nTwo years experience in the pharmaceutical industry (medical role)\nDesirable\nExperience in and knowledge of\npharmaceutical medical and marketing\nprocesses\nExperience in moderation of meetings with\nHCPs\nBusiness AcumenProven Project management skillsBudget management experienceAbility to lead a teamExperience in moderation of meetings with\nHCPs\nAbility to work effectively in cross-functional\nteams\nTeam player attitudeShow more Report"}, {"company": "Lifetrack Medical Sytems", "job": "Solutions Engineer , EMEA", "city": "Jerusalem", "date": "7d", "rating": "", "link": "", "description": "Core ResponsibilitiesThe Solutions Engineering Lead, EMEA, reporting to the Director of Engineering, will have the following responsibilities:1. Help on business initiatives by supporting the Engineering and Customer Success teams.Assist on any technical matter regarding go-live of new customers with Customer Success teamAssist and collaborate with Customer Technical stakeholders on networking configurations and setup required for successful deployments and integrationsPerform regular preventive maintenance remotely or via onsite visits when requiredAddress, troubleshoot and fix any technical issues raised by customers or escalated by the Customer Support TeamCollaborate and engage with Customer Technical stakeholders and Technical Operation teams when required, conduct technical onboarding, integration implementation and testingAmenable on a scheduled working on site (customer facing work) and do customer onsite visitWilling to work on weekends with flexible schedule2. Oversee the IT requirements of the Lifetrack team.Ensure up-to-date cybersecurity practices are in place for the internal Lifetrack teamProactively be involved in hardware maintenance, software installations, and office networkCoach and train junior members on troubleshooting and maintenance best practices3. Other dutiesSupport other technical team members when required, such as Developers or the Quality Assurance TeamOther related tasks that may be assigned from time to time by the immediate superiorRequired Experience and Skills3-5 years of extensive experience in applications support [deployment, upgrade, troubleshoot, fix] in Linux/Unix based environment in a healthcare IT company.Good understanding of Linux configuration and troubleshooting.Experience in network configuration and troubleshootingShould have skills in Scripting/Coding in at least one languageExcellent written and verbal communication skills in English.Preferred but not required:Good understanding of DICOM and HL7.Experience with tools like Jenkins, TerraformWorking knowledge and experience with deploying solutions in AWS.Operating PrinciplesPurpose-Driven. Being a company with purpose, we also want to have people with purpose- people who are passionate about doing good doing well for a purpose greater than them.Do it right, from the start. We believe in starting from first principles and putting in the hard work now to avoid more work down the future. Our LifeSysTM platform, built from the ground up, reflects this.Radical transparency. We want our people to keep growing and improving. Receiving and giving feedback is critical for this. We expect people to be upfront, open and willing to learn from each other.Crush the bottlenecks. We are always focused on the critical path to achieving results. We expect our members to be relentlessly efficient in clearing the obstacles to this critical path.Going the extra mile. We like and reward team members who are not only good at their jobs, but will raise their hand and propose projects or solutions that help take Lifetrack forward.Job Type: Full-timeAbility to commute/relocate:Jerusalem, מחוז ירושלים: Reliably commute or planning to relocate before starting work (Required)Expected Start Date: 13/02/2023Show more Report"}, {"company": "MUSC", "job": "MUHA AI57 - Scribe Columbia Laurel Street (MCP)", "city": "Central", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=226&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9ffdc7df&cb=1676381958775&jobListingId=1008253230025&jrtk=3-1-1gp82dchuii0r801-1gojf1vc2ihnd800-0c00d80dd1bdf4aa-", "description": "Entity/Organization: MUSC - MCP\n\nHours per week: 40\n\nScheduled Work Hours/Shift: 8am-5pm\n\nPay Basis/FLSA: Hourly\n\nJob Summary/Purpose: The Scribe accompanies the physician or licensed provider into the exam room, documenting in the EMR all aspects of patient care to include, chief compliant, history of presenting illness, physical exam and patient plan as directed by the provider.\n\nMinimum Training and Education: High school diploma or equivalent. Experience in a healthcare environment. Excellent computer and typing skills. Strong verbal and written communication skills. Working knowledge of an electronic medical record application. Adept knowledge of medical terminology. High attention to detail.\n\nRequired Licensure, Certifications, Registrations:\n\nAdditional Duties and Responsibilities:\n\nPhysical Requirements: Continuous requirements are to perform job functions while standing, walking and sitting. Ability to bend at the waist, kneel, climb stairs, reach in all directions, fully use both hands and legs, possess good finger dexterity, perform repetitive motions with hands/wrists/elbows and shoulders, reach in all directions. Maintain 20/40 vision corrected, see and recognize objects close at hand and at a distance, work in a latex safe environment and work indoors. Frequently lift and/or carry objects weighing 20 lbs (+/-) unassisted. Lift from 36” to overhead 15 lbs. Infrequently work in dusty areas and confined/cramped spaces.Show more Report"}, {"company": "AstraZeneca", "job": "PM GU Oncology", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=227&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_dcf53fa4&cb=1676381960217&jobListingId=1008383383921&jrtk=3-1-1gp82ddv32pv5001-1gojf1vc2ihnd800-aed07b6be6daea30-", "description": "At AstraZeneca we turn ideas into life changing medicines. Working here means being entrepreneurial, thinking big and working together to make the impossible a reality. We’re focused on the potential of science to address the unmet needs of patients around the world. We commit to those areas where we\nthink we can really change the course of medicine and bring big new ideas to life. As Oncology Sales Representative - Women's Cancer Team, you’ll play a pivotal role in channelling our scientific capabilities to make a positive impact on changing patients’ lives.\nAstraZeneca’s vision in Oncology is to help patients by redefining the cancer-treatment paradigm. A broad pipeline of next-generation medicines is focused principally on this disease areas - breast, ovarian, lung and haematological cancers. As well as other tumour types, these are being targeted through\nfour key platforms - immunotherapy, the genetic drivers of cancer and resistance, DNA damage repair, and antibody drug conjugates, underpinned by personalized healthcare and biomarker technologies.\nMain Duties and Responsibilities:\nPreparing, updating and implementing respective plans (Brand Plans) including short and long-term market share/profitability targets of the brands in his/her area of responsibility.\nGathering and interpreting accurately customer segmentation, market analyses, SWOT, competitor analyses, other developments within the sector and the respective data to ensure that the brand plans will reach the targets, integrating these to the operational plans and keeping plans updated.\nLeading strategic decisions in order to improve business performance\nBeing an active & leading member of the Brand team including Sales Management, Medical Department, Regulatory Department, Diagnostic and Market Access functions ensuring that the brand strategy and plans are effectively developed and implemented.\nVisiting customers through planning dual visits with the product promotion team/medical team etc to ensure that possible problems are solved.\nBuilding and maintaining relations with Opinion Leaders.\nEssential Requirements:\nAt least 3 years of PM experience in pharma sector, from Oncology Therapy Area\nExperience with managing sales representatives\nStrategic thinker with ability to set product vision\nEffective at teamwork and have ability to lead a cross team\nHave a strong scientific knowledge\nHave the ability to create strong relationship with customers and leading KEEs.\nExcellent communication and presentation skills\nHave a strong analytical skills\nUniversity degree from a reputable university\nVery good command of written and spoken English\nNo restriction to travel frequently and must have a valid driving license\nNext Steps – Apply today!\nTo be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please fill free to share this posting with them.\nAstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country where the role is advertised.\nAstraZeneca embraces diversity and equality of opportunity. We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills. We believe that the more inclusive we are, the better our work will be. We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics. We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Show more Report"}, {"company": "Abbott Laboratories", "job": "Marketing Director, Nutrition", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=228&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c0310445&cb=1676381961569&jobListingId=1008313454600&jrtk=3-1-1gp82df98gfrt801-1gojf1vc2ihnd800-c4833d5cd67f8392-", "description": "Marketing Director, Nutrition\nAbout Abbott\nAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.\nWorking at Abbott\nAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:\nCareer development with an international company where you can grow the career you dream of.\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.\nA fantastic range of benefits including competitive salaries and bonus potential, private healthcare.\nThe Opportunity\nThis position is located in Tel Aviv, Israel.\nRole purpose:\nTo create, implement, monitor and adjust long and short term marketing strategies that leads to building & strengthening superior brands - pediatric nutrition as well as medical nutrition - with full compliance to legal acts, World Health Organization (WHO), local regulations in Israel nutrition market within end users, care givers, decision makers & intermediaries (such as Health Care Professionals, Key Opinion Leaders, nurses, pharmacists, authorities, governmental bodies).\nWhat You’ll Do\nAchieve annual sales, market share and division margin plan and updates.\nFull responsibility of product marketing mix including price, package, positioning, placement and target audience\nFull understanding of end users, HCPs, nurses & KOLs\nMaximize the profitability of the products within scope of responsibility.\nSeek profitable business opportunities for new product/category/service launches.\nPlan, coordinate and implement launch processes.\nEnsure maximum internal and external alignment and excellence in execution with field teams, agencies and other related stakeholders to achieve and exceed expectations.\nPrepare, adjust and monitor marketing budget.\nActive member of management teams.\nEnsure compliance with relevant Acts, legal demands, ethical standards, Corporate Business and Safety Procedures and Abbott Code of Business Conduct.\nStrategic Focus:\nDevelop strong brands with sustainable growth and margin.\nSupport medical team for best in class execution on the field.\nFollow up industry trends and changes in health care reforms that will/may impact the business favorably or unfavorably and prepare contingency/mitigating plans.\nEstablish corporate partnerships (in licensing, co-marketing or/and co-promotion).\nLeadership:\nLead all marketing team & individuals (~10 direct and in-direct reports) to achieve business and personal goals.\nDevelop and maintain rapport with key opinion leaders in the market place to build/enhance credibility, identify trends, competitor activities and new opportunities.\nLead marketing to partner all relevant internal and external interfaces.\nRequired Qualifications\nMaster’s Degree preferably in Marketing / Business administration\nMinimum 10 years of marketing management experience, preferably from FMCG companies.\nFluency in Hebrew and English\nExperience in both traditional media and new media (digital execution)\nExcellent leadership skills\nApply Now\nFollow your career aspirations to Abbott for diverse opportunities with a company that can help you build your future and live your best life. Abbott is an Equal Opportunity Employer, committed to employee diversity.\nConnect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.Show more Report"}, {"company": "RecrutiX", "job": "Full-stack .NET Developer", "city": "Southern", "date": "3d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=229&ao=1110586&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b3a57d04&cb=1676381962951&jobListingId=1008447191044&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp82dgjqkuhv801-1gojf1vc2ihnd800-982a0afeb0c2eff3--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAHwcAGFGW2fSxpnWwe6lHLfRzmSUbJw2-l6qe_YtrYmK4d2p-xC9Yp88lme8vQRBsNyNqr06J-SG5sYPDRSV8-sIExR8lB690yNjPYRQjXANi8vLmgjyLyhEdWpmiXife6AlBWdWoCVQAej81YDGmLPgqF01PHux6tDepmUmtXr4WGEut0mzmOgY_rqBVfdn45SadfE--mT7oDv6tEEfkira13x0ti2gNj71XcHfKB3YN75hoQwOEPY-KeUHgXlu4Qx2g6ZYzO7vKi5pvvh8PIJAarypYKmfolj9FeH29yF1YOoid9QvshHwL88P0OGdunfD0jy8QgchZ10iraOnWG1NnOpoy5LcToLEaOGLQ_Px4osHUAzvgdyD06YnCJE9cJGf2vC3yPljUEnv-tk_bJrVBInuVmLPTxarTW7emT3eGm3aup8eQfIwdwuV8qEDGnL17K8EJPYQDawb9QFfxQhn7Lp-MA4kozFIK6a8kW-EuiwnsZAm8Gx9cqcZCuUVBL-4JLBJeVqZacAc3jxGckaVvy13tw9hr24K2gTw1sEF0JhvcwXLik9V6Nv3655Pd2676LGu6I578LnecJAmD1BhEjdDZQpyqaBfdrRydK3s1dtQmKfOSvs6CyCL89RCCYkTxk9LEXUeUr2f8IKIVz", "description": "We are an established US-based healthcare administration company looking for passionate and experienced Middle and Senior .NET full-stack developers to join our team. We are building B2B product from the ground up using a modern technology stack that makes a real difference for thousands of patients. - .NET experience (Framework, Core) - minimum 3 years (5 years for a Senior) - OOP, Patterns, Architecture principles (Middle – understand and apply, Senior – propose, review, coach other team members) - SOLID is not a foreign word for you - Able to understand and write complex and efficient SQL queries / LINQ expressions - Experience with Azure Cloud - Advanced level of English - Experience with at least one standard front-end framework - Git / Jira / CI-CD - REST - MSSQL - Entity Framework experience - Web Services - ASP .NET Core WebAPI - Multithreading/Asynchronous programmingShow more Report"}, {"company": "ICON", "job": "Clinical Research Associate", "city": "Israel", "date": "17d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=230&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2824a624&cb=1676381964132&jobListingId=1008419261071&jrtk=3-1-1gp82dhohi3b3801-1gojf1vc2ihnd800-29f54bd31dc3fb8b-", "description": "ICON plc is a world-leading healthcare intelligence and clinical research organisation. From molecule to medicine, we advance clinical research providing outsourced services to pharmaceutical, biotechnology, medical device and government and public health organisations. With our patients at the centre of all that we do, we help to accelerate the development of drugs and devices that save lives and improve quality of life. Our people are our greatest strength, are at the core of our culture, and the driving force behind our success. ICON people have a mission to succeed and a passion that ensures what we do, we do well.\nWorking fully embedded within one of our pharmaceutical clients, with the support of ICON right behind you, you’ll be at the heart of our client’s innovation.\nAs a CRA, you will be dedicated to one of our global Pharmaceutical clients. As one of the world’s leading and most trusted healthcare companies they place their core values and commitment to scientific innovation are at the heart of everything they do.\nClinical Research Associate is ultimately responsible for the successful management of investigator sites and monitoring activities for assigned clinical studies throughout the trial lifecycle. Key responsibilities include:\nFull ownership of investigator sites for assigned studies, with responsibility for the successful management of the site right through to close-out, in accordance with the clinical monitoring plan.Developing effective relationships with investigator site staff to ensure that key clinical metrics are met.Ensuring integrity of clinical data through an ability to sufficiently maintain site tracking records and working diligently to relevant guidelines.Passionate, innovative and committed.\nHere at ICON we want our employees to succeed and ensure that they are set up for this success through constant training, development and support. To enable success in this position you will have:\nPrior experience of at least 3 years working in investigator site management, including conducting monitoring visits, from either a pharmaceutical company or a CRO environment.A working knowledge of ICH-GCP guidelines and local and international regulatory requirements is essential.You will be educated to degree level in a life science discipline or be a licensed healthcare professional.Experience working on Oncology trials or complex studies would be an advantage for this role.\nYour health, your family, your career, your money — the things that matter to you, matter to us. The benefits of ICON just get better and better.\nBenefits of Working in ICON:\n\nOur success depends on the knowledge, capabilities and quality of our people. That’s why we are committed to developing our employees in a continuous learning culture – one where we challenge you with engaging work and where every experience adds to your professional development.\n\nAt ICON, our focus is to provide you with a comprehensive and competitive total reward package that comprises, not only an excellent level of base pay, but also a wide range of variable pay and recognition programs. In addition, our best in class employee benefits, supportive policies and wellbeing initiatives are tailored to support you and your family at all stages of your career - both now, and into the future.\n\nICON, including subsidiaries, is an equal opportunity and inclusive employer and is committed to providing a workplace free of discrimination and harassment. All qualified applicants will receive equal consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nIf, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please let us know.Show more Report"}]