[{"company": "Roche", "job": "Administrative and Procurement Coordinator – Diagnostics Israel", "city": "Hod HaSharon", "date": "11d", "rating": "4.3", "link": "", "description": ""}, {"company": "Auzen", "job": "Customer Success Manager (German)", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.0", "link": "", "description": "A fast growing startup in the digital healthcare industry in Israel is looking for a motivated German-speaking Customer Success Manager to join the adventure. Auzen revolutionizes the world of hearing care by offering unprecedented online access to innovative hearing-aids and remote adjustment services at a highly competitive price.Main responsibilitiesAs primary contact, act as a trusted advisor to the client, enhancing the client relationship experienceManage inbound leads pipeline, initiate and conclude the sales processPerformed remote hearing diagnostics, tests and fittingsProvide comprehensive onboarding, training, and continuous technical support to your customersOverall responsibility for your customers’ health, growth, and satisfactionMultitask between different communication channels and toolsRepresent the voice of the customer to provide input in product, marketing, and sales processesContribute to our team's growth by creating new content and sharing new ideas.RequirementsNative German speaker is a mustAbility to multitask and work with several tools simultaneouslyWillingness to learn about new healthcare technologies and tools.Past experience in customer support or sales- advantageDiplomacy, tact, and poise under pressure when providing step-by-step training & assistance.Impeccable communication (both writing and speaking) skills in English.French, Italian, and other European languages are an advantageJob Type: Full-timeLanguage:German (Required)English (Required)Show more Report"}, {"company": "EisnerAmper LLP", "job": "Tax Manager- Corporate Tax", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1110586&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a9ef486e&cb=1676381814782&jobListingId=1007954211867&cpc=E04C949A9101C6A2&jrtk=3-1-1gp828vtegfrt801-1gojf19qs2a4s000-017bd2c5145eced4--6NYlbfkN0B59FvENQ1PoESRw5gnAKNar20u3UYxwrwjmE7U3P3yjcM0YAVk_sAPPhn-zC-_zaFO9GGGVuLx5z3wdfqPZ156tGejtbAQbF1P5hQ3NCtq4Owe1RB2tLyOmeqOsgccsnhDmzWmbNR0Ek5zePosJzDYZcQ9NRFoURzlUsbn5wifSb0ozLascpLDBFCNncAXUpRxFrO-uiD4GztWmV-3U3i0vxFCLMATBLBpGDV6k-VQrs6X9Dx_ZHgx-w-2W18uW-xp_KSxdwiCEWMpVHBPT6dAM-9q9i4ozMfZ83tDpim0ViPFWlPOFysSuJgGDgH2Fjl-syLmFJIhYRQnWVbiPei-U0Ufj5_AdZDXyrvXytoiVYWwMIdhLkhJDAEMBdaVfPNFibEubRnSLnI_FkZO6hIcRgBfz0Cn6HWAcYCWoJn3q03NWlVQal7Fb5QdgijX4bdZN8uZnkxP6LTkJiR3CWcgHBLyvBIeXjYJJnE3LoDHxWCyfTR3v9pd608aOFeZHZ-G2QoQr4zCW0YSPesa6FN5GdYIhFV2ZJm4PzE05Ihfjgr7b6-b8v-7WfzqsvNmXqGDNkS2Lc5bdOcfvJPtgoAIbJoP7nN2jZGIBdza75xDH9rnkbqFrX7dFlES15JRLr8%3D", "description": "Job Description\nEisnerAmper is currently seeking a Tax Manager - Corporate to join our firm for our Israel location. This individual will work with other members of our corporate tax practice to develop and sustain excellent client relationships. They will advise clients primarily within corporate sector public and private in various industries including Financial Services, Tech, Healthcare, Manufacturing & Distribution. The individual will oversee preparing or reviewing various tax provisions, manage the preparation of tax compliance and assist with planning. They will also ensure that our tax personnel keep up to date on current tax practices and changes in tax law and have the ability to provide our clients with in-depth industry knowledge.\nWhat you’ll be doing:\nResponsible for managing and coordinating tax compliance and advisory work for clients\nReview Federal, Multi-National, Multi-State Partnership tax returns\nLead client relationships on day-to-day tax matters supporting partners with service execution and development of extended services\nResearch and consult on technical matters and special projects\nProactively build relationships and communicate effectively with the client to provide superior client service\nActively participate in business development efforts to include working collaboratively with partners and marketing professionals to target and build relationships with client prospects\nManage, train and develop staff. Participate in the performance review process\nWe’re looking for someone who has:\nBachelor’s degree in Accounting or related field required; Master of Tax preferred\nMinimum 5 years of experience in a public accounting firm or related experience\nCPA required\nProficient with corporate tax provisions and FIN 48\nPrevious experience supervising and training Staff and Seniors preferred\nExcellent written and verbal communication and interpersonal skills\nStrong organizational techniques are required\nMust be highly motivated and experienced in managing multiple client engagements\nMust begin to attain visibility and recognition within their industry specialization\nProficient with Microsoft Office (Word, Excel, PowerPoint, Outlook)\nWe’re looking for someone who has:\nMaster’s degree in Tax\nProficient in corporate taxation; individual and pass through a plus\nAbout our Tax Team:\nAs the largest service line within the firm, EisnerAmper’s Tax Group does not only provide trusted and innovative tax solutions to its clients, but it creates new opportunities for employees to grow, both personally and professionally. With a range of specialties based on location and industry, employees have the flexibility to focus on the work they want to do and the autonomy to shape their careers in a fulfilling way.\nA hybrid between a general tax practice and a hyper-specialized firm, our culture is based on collaboration, innovation and transparency. For us, success is defined by working together, sometimes across specialties, to provide the best tax solutions to meet our clients’ unique needs.\nTax regulations and procedures are always changing, and so are we. All EisnerAmper tax employees are empowered to challenge the status quo by thinking outside the box and bringing new ideas to the table. Because when we can identify creative ways to reduce filing turnarounds or streamline compliance work, we're able spend more time conducting impactful business advisory services for our clients.\nAbout EisnerAmper:\nEisnerAmper is one of the largest accounting, tax and business advisory firms in the U.S., with more than 3,000 employees and over 300 partners across the country. We combine responsiveness with a long-range perspective; to help clients meet the pressing issues they face today, and position them for success tomorrow.\nOur clients are enterprises as diverse as sophisticated financial institutions and start-ups, global public firms and middle-market companies, as well as high net worth individuals, family offices, not-for-profit organizations, and entrepreneurial ventures across a variety of industries. We are also engaged by the attorneys, financial professionals, bankers and investors who serve these clients.\nOur reach extends globally, with offices in the United Kingdom, Israel, India, the Cayman Islands, Singapore, and Ireland.\nEisnerAmper is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n#LI-PS1\nPreferred Location:\nIsraelShow more Report"}, {"company": "Roche", "job": "Customer Care Specialist/Order Management - Diagnostics Israel", "city": "Hod HaSharon", "date": "10d", "rating": "4.3", "link": "", "description": ""}, {"company": "Medison Pharma", "job": "Customer Service Coordinator", "city": "Petah Tikva", "date": "19d", "rating": "3.7", "link": "", "description": ""}, {"company": "Harris Computer Systems", "job": "Corporate Business Development", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_93bd9a09&cb=1676381819106&jobListingId=1008429871581&jrtk=3-1-1gp82942ppke0801-1gojf19qs2a4s000-51cb14d9affa2550-", "description": "Harris is an operating group of Constellation Software (CSU:TSX). We acquire, manage, and build mission-critical vertical market software (VMS) companies that are located all over the world. We have acquired over 500 companies across multiple industries including software used in healthcare, public safety, utilities and many more. We acquire small, medium, and large sized companies from owner/operators as well as institutional and corporate shareholders and hold them forever, applying the best practices we have learned as seasoned acquirers of niche software companies.\nWe are seeking a Corporate Development Specialist to work closely with our senior management team in Israel to continue our successful M&A activity in the region. The successful candidate will play a key role in identifying and sourcing potential companies of interest and reaching out to initiate a dialogue and build relationships with founders and senior executives.\nThe ideal candidate understands, appreciates, and enjoys the process that is business development. You might have a sales background, or a background in any industry where building a relationship is key. You understand that successful business development is a volume game that requires precision and consistent effort. You apply rigor to your processes and professionalism to your exchanges.\nThis is a great opportunity to apply your business development skills towards corporate acquisitions.\nAbout the Role:\nThe Corporate Development Specialist will proactively reach out to business owners and management teams of vertical market software companies to build and manage relationships for our M&A team. This is a great opportunity to apply your corporate development skills towards capital deployment in an entrepreneurial environment. We are looking for deal origination driven individuals that are interested in software, M&A and are excited at the prospect of contributing to our growth through capital deployment.Manage and grow our M&A CRM database by identifying small, medium, and large sized software companies that meet our acquisition criteriaInitiate outbound prospecting calls and emails to connect with target companiesDevelop and build relationships with management teams and shareholdersTrack personalized outreach activities weekly and maintain meticulous record keeping in our CRM.\nAbout You:\nYou have an interest in building a career in corporate development and M&A and have strong communication skills and a knack for building rapport with stakeholders. You are proactive, persistent, intelligent, and efficient. You enjoy finding ways to reach out to prospects and find it rewarding to connect with them to share your offering and learn more about their businesses. You have the following attributes:Strong Work Ethic: Demonstrated ability to develop and manage a pipeline. Understanding that M&A prospecting is a balance between volume and precision that requires consistent effort.Entrepreneurial Attitude: Ability to work independently and connect the dots when speaking to business owners. Positive personality with a strong drive to succeed.Maturity: Ability to develop relationships with founders and senior executives that builds trust in our company and investment modelArticulate & Persuasive: Ability to think on your feet and pivot the conversation when necessary. Communicates in a professional, confident, and convincing mannerFinancial Understanding: You have a basic understanding of finance and accounting principles and can use your skills to assess investment opportunities.\nThe Opportunity:\nBring your best self to work! Harris provides a career opportunity like no other. With multiple opportunities for career growth and progression, Harris is a great home for ambitious and driven individuals that are motivated by the ability to really make a difference. Our core values unite and guide us. Learn more about us here: Values (harriscomputer.com) #weareharrisShow more Report"}, {"company": "BDM International Healthcare Billing", "job": "Back Office Administrator", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "BDM, Ltd, a progressive international healthcare billing firm located in central Tel Aviv, is looking for a Back-Office Administrator with mother tongue level English. A background in the US Healthcare business industry, insurance industry or billing, is a plus.**Hybrid work from home/office**Keys Responsibilities include:Processing of new accounts- Data Entry and Data CheckOrdering and reviewing medical bills and documentsLetter writing , editing and account auditingOther Administrative TasksRequirements and Skills:BA/BSDetail orientedFull working knowledge of Microsoft OfficeGood analytical and written communication skillsPlease see our website https://bdm.co.il/for more information about our company.Job Type: Full-timeSalary: 9,000.00₪ - 10,000.00₪ per monthShow more Report"}, {"company": "Pfizer", "job": "Hybrid Health representative South Israel", "city": "Herzliya", "date": "6d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2955cff7&cb=1676381821860&jobListingId=1008438185609&jrtk=3-1-1gp8296qnk60o801-1gojf19qs2a4s000-38228ce87f86e130-", "description": "Hybrid Health Representative – Primary care (Vaccines & Toviaz)\nContract Type: Permanent\nRole Description\nThe Health Representative Hybrid is responsible for calling on (F2F and virtually) practicing physicians, hospitals, managed care (kupot) and other health-related\norganizations/personnel within an assigned territory. He/She must provide the most current information pertaining to Pfizer Israel products and their approved indications in a manner which will ensure the appropriate use of these products and achieve the business potential of the territory. Accomplishment of these goals must comply with the terms and conditions outlined in the Representatives Pledge of Ethics, Pfizer's Policy on Business Conduct as well as sampling policies.\nResponsibilities\nInvest time and effort to achieve the established goals for the territory such as sales, market share, doctor calls, etc.\nListen and respond appropriately to customer needs that will ensure acceptance of or agreement with a \"call plan\" objective\nMaintain the required technical expertise including competitive product knowledge and computer capabilities\nEnsure clear concise and accurate communication of product information using proper medical terminology\nPlan and organize daily sales call activities to optimize the use of time and maximize the achievement of sales and market share objectives\nUse hybrid ways of communication with customers such as: F2F call, Virtual calls (VCC, Teams, Zoom ect.), RTEs, Journal Clubs, Webinars, as required and defined by the Category strategy\nPrepare, analyze and send sales/patients scanning monthly reports (as requested by Health Engagement Lead,) in his/her territory\nWork with all relevant partners within the company to ensure “closing” of the loop. Collaborate with internal stakeholders such as medical advisor, MSLs, KAMs to ensure our customers are receiving the best tailored solution based on their needs\nRecognize changes in the work environment, develop and implement alternative plans to achieve objectives, modify call plan/business plan activities accordingly\nDemonstrate persistence to accomplish objectives despite disappointments and/or rejection of original efforts\nMake daily decisions based on logical and factual information after weighing alternatives and their consequences\nUse available resources and invest according to Business plan (all plans, and events must have clear objectives, be accurate, truthful and appropriate for their intended context)\nCreate and maintain a positive impression with customers\nProject a professional image as demonstrated by neat physical appearance and appropriate manner of speech\nMaintain timely communication with supervisor and other members of the sales team\nFully comply with the terms and conditions prescribed in the Sales Representatives\nQualifications\nA Bachelor's degree in Life Sciences (or similar diploma)\nAt least two years of sales and/or marketing experience within pharmaceutical, biotech, healthcare, or medical device industries Product or hospital sales experience – advantage\nLocal Market knowledge\nEasy adaptor of using new technologies tools - Core competencies: Planning and organizing work, engaging others through effective communication, Basic analytical skills, drive to achieve individual leadership and impact.\nHigh ability to read, analyze and interpret medical research\nExcellent communication skills in Hebrew and English\nGood Presentation skills, high digital abilities and learning agility\nDriving license – role requires travelling\nPurpose\nBreakthroughs that change patients' lives... At Pfizer we are a patient centric company, guided by our four values: courage, joy, equity and excellence. Our breakthrough culture lends itself to our dedication to transforming millions of lives.\nDigital Transformation Strategy\nOne bold way we are achieving our purpose is through our company wide digital transformation strategy. We are leading the way in adopting new data, modelling and automated solutions to further digitize and accelerate drug discovery and development with the aim of enhancing health outcomes and the patient experience.\nFlexibility\nWe aim to create a trusting, flexible workplace culture which encourages employees to achieve work life harmony, attracts talent and enables everyone to be their best working self. Let’s start the conversation!\nEqual Employment Opportunity\nWe believe that a diverse and inclusive workforce is crucial to building a successful business. As an employer, Pfizer is committed to celebrating this, in all its forms – allowing for us to be as diverse as the patients and communities we serve. Together, we continue to build a culture that encourages, supports and empowers our employees.\nSales\n#LI-PFEShow more Report"}, {"company": "Lilly", "job": "Sr. Associate - Oncology Medical Science Liaison", "city": "Raanana", "date": "5d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d9311cf9&cb=1676381823459&jobListingId=1008443297074&jrtk=3-1-1gp8298d5jfmv801-1gojf19qs2a4s000-d72af6f9cd756197-", "description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 35,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.\nResponsibilities\nThe Medical Science Liaison is a highly knowledgeable scientific person who is primarily responsible for answering the scientific and clinical needs of Scientific Experts (SE). He / She will be placed in a dynamic and motivating environment dedicated to the launch of new products and in a path of professional career. The Medical Science Liaison is a field-based role.\n\nKey Responsibilities:\nIdentification of SEs and development of relationship with them\nProvide deep and advanced disease state and product expertise to SE\nEngage in continuous learning within their therapy area, through literature search, participation in scientific congresses etc.\nCommunication of scientific intelligence and clinical insights\nRespond to unsolicited request, also at congresses\nParticipation in consultant meetings\nDrive digital innovation in engaging customers\nBasic Qualifications\nAdvanced degree in health sciences (PharmD, MD, PhD in a medically related field) OR Masters / bachelor’s level degree in health sciences (e.g. BSN, RPh, PA, NP) with previous experience in Oncology TA.\nAdditional Skills/Preferences\nEnglish proficiency (written and oral): Advanced (B2/C1)\nPassion for science, results, and high standards\nGreat and demonstrable learning agility\nBusiness acumen (starting from scientific information)\nProactive – takes independent action and responds quickly.\nEnthusiasm for a variety of digital technologies with the ability to assimilate complex information and systems.\nConfidence and willingness\nAsk questions, understand, and translate into suggestions/ new solutions.\nDemonstrable ability to operate in a compliant way.\nBrilliant and demonstrable presentation skills\nAbility to effectively communicate scientific data into meaningful, clear, and compliant content.\nAbility to manage a complex environment and prioritize different projects at the same time.\nEli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.\nLilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n#WeAreLillyShow more Report"}, {"company": "Haleon", "job": "Digital Key Account Manager", "city": "Israel", "date": "5d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_18c5f047&cb=1676381825035&jobListingId=1008440067373&jrtk=3-1-1gp8299u9jm6i801-1gojf19qs2a4s000-00f4edd3798d24d8-", "description": "Job Description\nSite Name: Petach Tikvah\nPosted Date: Jan 31 2023\nHello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands – including Sensodyne, Advil, Voltaren, Otrivin, and Centrum – through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.\nJob Title\nDigital Key Account Manager\nIn this role you will hold account management for omnichannel Mass Market e-commerce and key e-pharmacy customers across Haleon’s full portfolio.\nIn This Role You Will…\nBuild customer base partnerships that maximizes Haleon’s potential growth in the e-commerce channel. Exceed and meet customer expectations through optimized Haleon resources management and optimized solution propositions under time and budget constrained business context.\nUnderstand full channel and customer potential for Haleon Categories and brands\nDeliver sales, profit and visibility targets for customer group.\nDevelop credible relationships that lead to win/win agreements ensuring Haleon strategy is implemented, and we are recognized as a supplier of choice in the categories we operate in.\nGain agreement on annual plan and monitor to ensure brilliant execution is carried out and corrective actions are taken when necessary. Ensure proper measurement and evaluation is in place.\nIdentify opportunities based on customer insights and work with cross functional teams to translate to actionable proposals that grow our categories.\nResponsible for data consolidation and reporting across customers\nLeverage all available data and insights to monitor KPIs per customer and drive action. Drive solutions that grow customer’s trust in Haleon, to overcome problems efficiently\nConduct regular reviews of business performance internally and externally and ensure agreed actions are put in place.\nValidate the Service Invoices and Credit Notes that are related to the annual agreement and the trade budget spent.\nCoordinate and collaborate closely with distributors to ensure execution compliance and to maximize Haleon potential and consistency within omni channel customers\nMonitor competition and identify risk and opportunities\nWhy You?\nQualifications & Skills:\nUniversity degree or equivalent in Business\nProficient in Hebrew and English\n3+ years’ experience in KA management. E – commerce customer experience desirable.\nStrong commercial acumen and passion about digital & e-commerce\nFamiliar with digital media KPIs\nExperience in customer marketing roles will be considered an asset\nAbility to find solutions in new areas and move things forward through stakeholder buy-in and compelling customer propositions\nProven skills to manage a high degree of complexity in changing environment\nNegotiation/influence skills\nAccountability for results\nExcellent use of Microsoft Office\nWhy Join Us?\nThe future of everyday health is changing. And we’re the people changing it. In front of us is an incredible opportunity to go beyond what any of us have done before. And make everyday health more achievable, more inclusive and more sustainable. For more and more people. So join us, as we build one of the world’s leading consumer healthcare companies. Join us to innovate our category-leading brands. To better understand people’s everyday health needs. To tackle the biggest barriers that stand in their way. To change individual and societal behavior. Join us to work with colleagues who share your restless energy. To explore your interests. To stretch yourself to do the best work of your career. And join us, as together we build a working experience that encourages us all to lead happier, healthier, more productive lives. The way we see it, every day is an opportunity for better. And we’re going all in to realize it.\nDiversity, Equity, and Inclusion\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create an unmatched understanding of each other, and promotes fair and equitable outcomes for everyone.\nWe’re striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives.\nWe believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\nCare to join us. Find out what life at Haleon is really like www.haleon.com/careers/\n\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\n\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\n\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Show more Report"}, {"company": "ICON", "job": "Contract and Bidget Negotiator", "city": "Israel", "date": "2d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a1ef1ace&cb=1676381826350&jobListingId=1008450004474&jrtk=3-1-1gp829b7l2gps001-1gojf19qs2a4s000-81e499280f8ff55b-", "description": "ICON plc is a world-leading healthcare intelligence and clinical research organisation. From molecule to medicine, we advance clinical research providing outsourced services to pharmaceutical, biotechnology, medical device and government and public health organisations. With our patients at the centre of all that we do, we help to accelerate the development of drugs and devices that save lives and improve quality of life. Our people are our greatest strength, are at the core of our culture, and the driving force behind our success. ICON people have a mission to succeed and a passion that ensures what we do, we do well.\nICON Strategic Solutions (ISS) is looking for qualified candidate to perform the investigator site contracting Services hereunder in order to support a broad range of therapeutic studies across all our sponsor´s divisions in accordance with the requirements described in FSP Program.\nJOB FUNCTIONS/RESPONSIBILITIES\nPerform negotiation of legal terms and budget terms for Clinical Study Agreements (“CSA”) (i.e., investigator site agreements)\nPerform negotiation of legal terms and budget terms for amendments to CSAs\nDraft and negotiate ancillary site contracts (e.g. PI / Sub-I / department agreements /Study Coordinator) as required\nUtilize Sponsor´s provided templates. Sponsor´s requires stand-alone site contracts with the exception of the US, which utilizes master clinical study agreements.\nProduce and maintain site-specific templates where needed to support the Sponsor´s targeted investigator site list, but limited to the sites within the studies assigned\nRecommend country-specific and site /entity-specific modifications to templates based on site and local regulatory requirements\nUtilize previously negotiated terms for existing contracts between same site/entity and Sponsor´s\nPerform submission and oversight of site and study specific local language translations. Candidate will be required to use Sponsor´s preferred translation vendors. Sponsor´s will manage template version control and translations\nAttend weekly study team and country meetings, as needed\nIdentifies risk and mitigation strategies as it relates to meeting contract negotiation timelines\nICON’s Legal team may provide support to ISS personnel. For the avoidance of doubt, ISS is not providing legal advice to Sponsor´s in any capacity.\nFollow Sponsor´s’s legal guidance document and comments and fallbacks\nIdentify contractual and compliance risks for CSA contracting and raise to Sponsor´s\nCollect information from investigator site to complete Foreign Corrupt Practices Act (FCPA) form and submit to Sponsor´s\nPrioritize to meet study timelines to minimize impact to planned Site Initiation Visit (SIV) dates.\nAct independent of CRO managing the study\nPerform quality control checks of contracts and amendments prior to upload to DocuSign for electronic signatures\nIf electronic signatures are not permissible, provide management of hard copy/ local signature process\nContractual Parties:\nEnsure signatory to CSA is authorized to sign on behalf of the party\nEnsure signatory to the CSA will either be responsible for the contractual obligations or operating under a Power of Attorney binding a Sponsor´s entity to the obligations. Sponsor´s preerence is to have Sponsor´s or Sponsor´s Affiliates as the contracting entity for CSAs where possible\nEnsure country - specific singnatory requirements are met (e.g., Some countries require signature by local affiliate (e.g. Italy and Canada))\nSupport and provide country level intelligence into the selection of signing part at the country level which must consider payment impact, tax issues (VAT/R&D/WHT) establishment (I.e. corporate presence) and relationship to sponsor.\n Collection and submission of payment support forms, including, but not limited to Payee information forms and required tax forms\nBudget negotiation specific requirements:\nPre-populate site-specific budget items from prior negotiations following Sponsor´s provided guidelines.\nNegotiate site budgets following Sponsor’s principles document and comments & fallbacks\nActively participate in per-subject cost development meeting. ISS personnel will provide review and input into the country specific budget templates to minimize timelines for site budget negotiations.\nProvide country level expertise to budget related contract terms and conditions\nEscalate out of parameter budget items to Sponsor´s Investigator Contracts Lead (ICL)\nRecord negotiated changes to patient compensation information and provide to Sponsor´s designated contact for Informed Consent Document (ICD)\nDemonstrate effective time management skills; able to independently prioritize multiple tasks.\nDemonstrate the ability to work independently and use initiative to anticipate/resolve issues and complete tasks.\nShows a commitment to and demonstrate the ability to consistently perform high quality work with minimal management oversight.\nContract Management System:\nAriba Contracts Workbench is the current Sponsor´s contract management system.\nISS personnel will utilize the system for all contracts consistent with Sponsor´s provided guidance and training.\nSignature processing:\nISS personnel should first adapt and advocate for Sponsor´s-preferred DocuSign system for electronic signature process. Other options / alternatives may be presented by the ISS personnel and will be reviewed by Sponsor´s\nTrial Master File:\nISS personnel will file CSA and Amendments into the eTMF within required timeframe\nEDUCATION REQUIREMENTS\nBachelor’s Degree or international equivalent in business, finance, health sciences or related field\nRead write and speak fluent English; fluent in host country language required.\n1-2 years Industry experience managing contracts required.\nBenefits of Working in ICON:\n\nOur success depends on the knowledge, capabilities and quality of our people. That’s why we are committed to developing our employees in a continuous learning culture – one where we challenge you with engaging work and where every experience adds to your professional development.\n\nAt ICON, our focus is to provide you with a comprehensive and competitive total reward package that comprises, not only an excellent level of base pay, but also a wide range of variable pay and recognition programs. In addition, our best in class employee benefits, supportive policies and wellbeing initiatives are tailored to support you and your family at all stages of your career - both now, and into the future.\n\nICON, including subsidiaries, is an equal opportunity and inclusive employer and is committed to providing a workplace free of discrimination and harassment. All qualified applicants will receive equal consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nIf, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please let us know.Show more Report"}, {"company": "Chronos Consulting", "job": "Recruitment Specialist Tel Aviv area", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1c2731d4&cb=1676381827542&jobListingId=1006039678149&jrtk=3-1-1gp829cbpkcl4801-1gojf19qs2a4s000-b6d981e238b99f14-", "description": "Chronos Consulting (www.chronosconsulting.com) is part of the Coberon Chronos Group, an award winning global leader in permanent and temporary staffing, RPO and business process automation solutions for global multinationals. The Group owns and operates 42 offices worldwide.\n\nAs the team is expanding, we are seeking a fluent English speaking Senior Consultant for Financial Services Recruitment (Finance/Accounting/Banking/Insurance/Payrolling) with a proven track record and experience in mid to senior level full cycle recruitment. You will build and grow both client and candidate relationships through management of the recruitment process delivery including: sourcing, screening, assessing, and presenting candidates to multinational clients. Career growth opportunities to build and manage a team of Recruiters and Researchers and expand into Asia/Africa/Latam/Europe for the ideal candidate.\n\nThe Role:\nAs he Recruitment Specialist you will:\n\nResearch, identify, and present candidates for mid- to senior-level executive positions, ideally exposure with a wide range of diverse industries (IT/Telecom, Manufacturing, Engineering, Pharmaceuticals, Consumer Packaged Goods).\nIdentify recruitment sources, networking leads, social media, advertising resources, and other tools to attract candidates.\nCoordinate client & candidate relationships, deliver solutions in a timely, professional, and responsive manner.\nCreate and update Progress Reports to track research and recruitment process, proposals, and support in responses for RFIs and RFPs.\n\nThe Requirements:\n3+ years’ experience in full cycle recruitment (job description creation, posting, sourcing, screening, interviewing, presenting & closing)\nExperience with a variety of sourcing methodologies to include: headhunting, market mapping, Boolean searches, social media recruitment strategies, career sites, among others\nInteracting with clients (both local and international) and key stake holders throughout the recruitment process\nCustomer focus with a sense of urgency while maintaining quality control\nStrong negotiation, verbal and written communication skills with attention to detail\nEntrepreneurial spirit and driven for growth and expansion\nAbility to work independently, strong team player and/ or manage international offices and Consultants\nFluent English mandatory. 2nd language a huge plus. French, Polish German, Spanish, Portuguese, Russian, Arabic, Turkish, Hebrew etc.\n\nWhat we offer:\nGood salary\nTop bonus scheme\nEquity participation\nHealthcare\nFree financial advice\nFreedom\nFlexible working timesShow more Report"}, {"company": "AstraZeneca", "job": "Primary Care Sales Representative, CVRM", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Viseven", "job": "Account Executive", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1b68f68d&cb=1676381830581&jobListingId=1008306940796&jrtk=3-1-1gp829fbukbnn801-1gojf19qs2a4s000-615586504532301c-", "description": "Viseven Group is an international IT company specialising in interactive content and cloud-based solutions for global pharmaceutical companies since 2009; constant growth and self-development is in our corporate DNA. Our unique developments and approaches are actively used in more than 50 countries all over the world. Viseven's solutions are represented at major industry events in Barcelona, Philadelphia, London, etc.\nThe rapidly expanding team includes more than 700+ highly-skilled tech- and non-technical experts: front- and back-end developers, BA specialists and managers who create, localize and customize applications at 8 offices: in Kyiv, Zhytomyr, Vinnytsia, Ternopil (Ukraine), Tallinn (Estonia), New Delhi (India) and Bridgewater (NJ, USA).\nRole description:\nViseven comes with a mission to save lives by making communication faster.\nWe do so by disrupting how Pharma and Life Sciences create, update, and share the information with Healthcare Professionals, Caregivers, and Patients (yes, with you too).\nAs a part of the Viseven Team, you will have a chance to interface with the most innovative teams from Pharma, Life Sciences, Biotech, and Medical Devices. A perfect candidate will be a trailblazer, ready to drive the change, a listener, and a consultant, that can tailor a solution from a rich Viseven Portfolio (no one-fits-all approach).\nResponsibilities:\nDevelop opportunities generated by the Sales development team (Outbound & Inbound SDR)\nGenerate new opportunities (new revenue streams) in the entrusted Clients\nClose deals by preparing & pitching proposals for the UVP to potential and existing Clients\nSign MSA, SOW and initiate Project team allocation for the projects after receiving POS\nBe a consultant for a Client in all related the business matters\nBuild trustful relations with the Client\nRequirements:\nAt least 2 years of experience in a similar position\nEnglish language proficiency is a must\nKnowledge and understanding of business development, sales, account, or product management\nAbility to learn and retain new information quickly\nAbility to handle multitasking productively\nAdvanced communication and presentation skills\nGreat team player: optimistic, organized, flexible, helpful\nWill be considered as a Competitive Advantage:\nExperience in B2B software sales\nWorking knowledge of CRM programs\nKnowledge of foreign languages other than English\nWhat we provide:\nWe understand that our team members are essential to making our goals a reality, so we value and empower them to share their vision. And we reward this kind of passion with a highly competitive compensation and exceptional benefits, such as:Competitive compensation and regular performance based salary and career development reviewsPassionate experienced team, friendly atmosphereProfessional and career growthPaid time off - 18 business days per year (20 business days after 2 years of cooperation)Non-documented sick leave - 4 business days per yearDocumented sick leave - 20 business days per yearFamily leave - 3 paid business days in case of marriage, childbirth or bereavementComprehensive medical insuranceEnglish learning coursesOpportunities to participate in professional forums and conferencesRegular corporate events and team-buildingsEnjoyable working environment: comfortable and fully equipped office and possibility to work from homeShow more Report"}, {"company": "IQVIA", "job": "Site Activation Specialist", "city": "Israel", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f97dc209&cb=1676381831828&jobListingId=1008432848196&jrtk=3-1-1gp829gis20b0001-1gojf19qs2a4s000-4a1e18ab9d70c65c-", "description": "Job Overview\nUnder moderate supervision, executes the feasibility, site identification regulatory, start-up, and maintenance activities in accordance with regulations, SOPs, and project requirements at the regional, or country level.\nPrepares and manages site documentation; reviews and negotiates site documents and contracts with sites and sponsors; maintains, reviews, and reports on site performance metrics; serves as the primary point of contact for investigative sites; tracks completion of appropriate documents for sites; ensures contracts are fully executed; and establishes project timelines. With moderate oversight and supervision, perform tasks at a country/region level associated with site activation activities in accordance with applicable local and/or international\nregulations, standard operating procedures (SOPs), project requirements and contractual/budgetary guidelines. May also include maintenance activities.\nEssential Functions\nWith moderate oversight and supervision, werve a Single Point of Contact (SPOC) to perform feasibility, site activation and some maintenance activities in assigned studies for investigative sites, according to applicable regulations, SOPs and work instructions, working closely with the Site Activation Manager (SAM), Project Management team, and other departments as necessary. Review documents for completeness, consistency and accuracy, under guidance of senior staff.Prepare site documents, reviewing for completeness and accuracy.Inform team members of completion of regulatory contractual. and other documents for individual sites.Distribute completed documents to sites and internal project team members.Update and maintain internal systems, databases, tracking tools, timelines and project plans with accurate and complete project specific information.Review, track and follow up the progress, the approval and execution of required documents such as questionaires, CDAs, regulatory, ethics, Informed Consent Form (ICF) and Investigator Pack (IP) release documents. Requires advanced knowledge within a specific discipline typically gained through extensive work experience and/or education.\nQualifications\nBachelor's Degree Life sciences or a related field Req AndOther 1 - 3 years’ clinical research or other relevant experience; or equivalent combination of education, training and experience. ReqWith 3 years’ experience in a healthcare environment or equivalent combination of education, training and experience.\n#LI-Remote,\nIQVIA is a leading global provider of advanced analytics, technology solutions and clinical research services to the life sciences industry. We believe in pushing the boundaries of human science and data science to make the biggest impact possible – to help our customers create a healthier world. Learn more at https://jobs.iqvia.comShow more Report"}, {"company": "Roche", "job": "Supply Chain Expert - Diagnostics Israel", "city": "Hod HaSharon", "date": "10d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_06bee29c&cb=1676381833159&jobListingId=1008431016645&jrtk=3-1-1gp829hrqjc9s801-1gojf19qs2a4s000-4d7bfde7be2ccf05-", "description": "The Position\nSupply Chain Expert\nWho we are:\nRoche is ranked among the world's foremost corporations providing innovative healthcare solutions, continuously investing in medical research and development.\n\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we have become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\n\nRoche is an Equal Opportunity Employer.\n The Opportunity:\nThis is an excellent opportunity for an experienced professional to join Roche Diagnostics.\n\nIn this role you will work with multiple stakeholders to guarantee on-time in full deliveries, while complying with local and global regulations and standards\nResponsibility for:\nSupply Chain Planning: Managing inventory level to meet market demand and minimize losses\nManaging the efficiency of the inventory level, inventory analysis, forecasting, and performing the write-off calculation and control. Support the plan and calculation of safety stock. Accountable for ensuring products availability to fulfill the on-time delivery according to SLA (service level agreement)\nCreating and maintaining the material master database, and the SAP environment to guarantee proper inventory management.\nDeveloping a supply plan based on statistical forecasts and ensures plan’s accuracy.\nSupporting the Commercial areas to align with product life cycle management.\nDriving the escalation process for supply and demand planning issues.\nOwning accuracy and continuous optimization of the supply chain\nManaging key parameters of bottleneck management, allocation, reserve and scrap mitigation across the network.\nResponsible for the claim handling within suppliers\n3PL Liaison:\nBecome the primary point of Contact for the logistics contractor\nSupport the supply chain interface (both human and system) with 3PL\nManaging the 3PL KPI’s monitoring\nSupports the maintenance of the product database in respect with legal and compliance requirements;\nLead the collaboration with 3PL on quality issues in collaboration with quality department\nAdditional Day to day activities:\nSupporting import-export activities\nCan also act as a back-up to the Order Management department when it relates to allocation of materials, bottlenecks, order processing and any other activities related to it.\nActs as Key User in SAP and any other Supply Chain Systems\nProvide tools and services that support our customers with up-to-date solutions to facilitate their daily business.\nWho you are:\nRelevant experience required (5-7 years) in Supply Chain and Logistics planning positions, ideally in the medical devices or pharmaceutical industry\nRelevant university degree\nProficiency with ERP systems (Preferably SAP)\nAble to adapt and respond to internal and external changes\nStrong experience in internal processes, drive process improvements\nCustomer oriented\nCollaborative, demonstrates sense of urgency and collective ownership\nStrong communication and interpersonal skills, Ability to work with different stakeholders, Agile mindset\nHigh level fluency in Hebrew and English\nWho we are\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.Show more Report"}, {"company": "Finn Partners", "job": "Finn Partners Israel is Hiring!", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "", "description": "Our gorgeous new office in Har Tuv (between Jerusalem and Tel Aviv) is waiting for you!\nWe communicate on behalf of health innovators aiming to make a difference in the world.\nIf you have communications or digital marketing experience, please contact us. Send us:\nYour current CV\nA cover letter detailing your skills and interests\nIf you qualify for an opening, we'll be in touch with more information.\nAbout Finn Partners\nNamed as a Best Place to Work 2020 by PR Week, close to 1,000 of the most accomplished professionals in the industry make up Finn Partners. With 20 offices across eight countries around the world, our managing partners alone have more than 175 years of combined experience working in the consumer, technology, travel & leisure, financial services, healthcare, education and manufacturing sectors. The firm offers a full-service approach including integrated public relations, content creation, social, digital marketing and research services. Founded in New York in 2011 by Peter Finn with an innovative new model in which entrepreneurial spirit, innovation and partnership drive client success and sustainable agency growth, the firm delivers world-class client service, coupled with best-in-class employment practices, to produce award-winning work and a rewarding culture.\n\nAnGUSqRXJlShow more Report"}, {"company": "AstraZeneca", "job": "Cardiology Sales Representative, CVRM", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Edwards Lifesciences", "job": "Manager Sales & Clinical Field Clinical Specialist TMTT", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4320224c&cb=1676381836797&jobListingId=1008431373140&jrtk=3-1-1gp829ldbk6dk801-1gojf19qs2a4s000-eba939df8627f46f-", "description": "Develops clinical education materials in connection with clinical investigations. Provides expertise and clinical insights on the device, procedure and protocol throughout the life cycle of the clinical investigation.\n\nKey Responsibilities:\n\nEstablish, maintain and develop mutually, profitable business relationships between Edwards Lifesciences and its customers (both external and internal) with appropriate levels of clinical/management in hospitals by offering service, product knowledge, and clinician education excellence\nProvide education during the procedure on all aspects of the device, device handling, implantation and troubleshooting techniques related to equipment, tools and products required for device implants.\nReview market and competitor information and propose action plans to increase our position in the marketplace\nDevelop strategy to facilitate product presentation, product trials, implementation and in-service education to meet customer’s requirements\nDevelop strategy for focused education plans for key accounts and potential accounts to support sales in collaboration with Sales Managers and Sales Reps\nAttend and educate at conferences as needed\nOther incidental duties\n\nEducation and Experience:\n\nBachelor's Degree or Equivalent in a related field\nSales/Commercial experience within the medical device field and/or clinical experience\nTraining experience in clinical / technical environment Preferred\n\nAdditional Skills:\n\nProven expertise in MS Office Suite\nStrong written and verbal communication skills, presentation, and interpersonal relationship skills including negotiating and relationship management skills\nExcellent problem-solving and critical thinking skills\nGood ability to read, write and speak English, preferred\nExpert knowledge and understanding of cardiovascular science\nExpert understanding of cardiovascular anatomy, pathology and physiology\nExpert understanding of medical device regulatory requirements and documents, device accountability and adverse events reporting\nAbility to manage confidential information with discretion\nStrict attention to detail\nAbility to interact professionally with all organizational levels\nAbility to manage competing priorities in a fast paced environment\nMust be able to work in a team environment, including inter-departmental teams and key contact representing the organization on contracts or projects\nAbility to interact with senior internal and external personnel, including key opinion leaders (KOLs) on significant matters often requiring coordination between organizations\nAdhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "BDM International Healthcare Billing", "job": "Billing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "A progressive international healthcare billing and collections firm, located in central Tel Aviv, is looking for a Billing Analyst/ Administrator with mother tongue level English. A background in the US Healthcare business industry or billing and revenue cycles, is a plus.**Hybrid work from home/office**Keys Responsibilities including:Accessing, analyzing and integrating financial and other data from a variety of hospital data systems.Posting payments, reconciling payment data and responding to account inquiriesRequirements and Skills:· BA/BS· Analytical· Full working knowledge of Microsoft Office (especially Excel)· Proficient in systems dataJob Type: Full-timeSalary: 10,000.00₪ - 12,000.00₪ per monthShow more Report"}, {"company": "Assured Allies", "job": "Head of Product", "city": "Ramat Gan", "date": "30d+", "rating": "4.2", "link": "", "description": "Are you smart, curious, nimble, relentless leader and quick learner enough to tackle one of society’s largest emerging problems?If you answer yes to all of the above, we might have one of the most interesting product leadership roles out there, just for you.We are Assured Allies and we are reinventing the products that help our parents better live when they retire… We are already changing how hundreds of thousands of aging adults in the US age and we need a product magician to help us push us to the next level.Why a magician? Because on a day-to-day you will need to-Speak the language of actuaries, data scientists, clinicians, developers, operations team and account managementCut to the chase and drive your team to pull a lot of decisions quickly from their hats (and know what to do if they end up wrong)Retrospect what you and your team did to make sure we do not make the same mistake twiceBuild and manage a team in a merit based and data driven environment. (e.g. give and receive frank, timely and honest feedback, solicit the best ideas, have solid foundations for decisions)Ensure nothing disappears (e.g. falls through the cracks)Quickly call out risks and problems but not be discouraged by themFew other critical requirements-We do not provide broomsticks so this position will require some air travel. (It reports to the VP Product Management in our US office and works extensively with our R&D teams in Israel)7+ years of software product management experience2+ years leading product management activities and deep knowledge of either one of these books ( “Lean Startup”,“Startup Owner’s Manual”)&gt;5 years utilizing Agile and/or Scrum software methodologiesExperience in healthcare / case management systems is a plusQinQMQRS3vJob Type: Full-timeShow more Report"}, {"company": "Ciklum", "job": "Junior Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": ""}, {"company": "Sedgwick", "job": "Benefit Liaison", "city": "Israel", "date": "5d", "rating": "3.2", "link": "", "description": ""}, {"company": "M-SOR s.r.o.", "job": "First SORUDO International Sales Manager in Israel", "city": "Jerusalem", "date": "19d", "rating": "5.0", "link": "", "description": "First SORUDO International Sales Manager in IsraelThis isn't just an ordinary job offer. We don't seek an ordinary salesman. We are looking for someone, who will take our successful products from Europe and help them grow in your country.We are SORUDO, a company which saves lives through a unique system of Complex Self-defense and First Aid Training, which we organize for companies and institutions. (only B2B)Sales talent is pointless, unless you sell something you can believe in, something that helps others and has a meaning itself.We will hire only 1 person in your country. If we choose you, you will get a job, which you can be proud of.We have more than 80 courses and products that we can offer to clients in your country.Our offer is suitable for clients such as:Security agencies (G4S)Healthcare sector (Hospitals / Psychiatry Institutes)Government agenciesLarge Corporate companiesManufacturing companiesAre you able to do it? Do you have the courage for it? Read more and help us save lives in your home country.Find out more at: https://sorudo.cz/international-sales-manager-2/Working with us, you save lives, but you also get:Reward up to 16,700 € / month (high commissions for profit up to 25% of a contract)→ Our sales representatives and managers usually earn up to 467% of the local average salary.→ There is no limit for commission, that is only up to you.→ Possibility of a fixed salary for smooth start.(So that you can gradually grow your sales that will build higher salary based on commission)Career potential, you can grow really fast to become→ Team manager (you can grow with our local company)→ Country director (and eventually become our partner for the country)We seek someone who is:Ambitious (wants to achieve high goals, we don't want an average person)Finisher (someone who constantly pushes the deal forward)Great at communication, presentable manners are natural requirementFluent in English (you need to be fluent for communication with our company and other colleagues abroad)We know that our work saves lives and our ambition is no smaller than global expansion. Our company sets high expectations and seeks only colleagues, who want to improve themselves with us.Find out more at: https://sorudo.cz/international-sales-manager-2/Job Types: Full-time, Part-timeSalary: Up to 61,500.00₪ per monthShow more Report"}, {"company": "Diageo", "job": "Director, Ventures North America", "city": "Central", "date": "18d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5282ee15&cb=1676381844906&jobListingId=1008415108216&jrtk=3-1-1gp829tba2f30001-1gojf19qs2a4s000-077ad3fc032ed5e4-", "description": "Job Description :\nWhich company will you join?\nFrom Arthur Guinness to Johnnie Walker, our business was founded on people of outstanding character, and in 250 years, nothing has changed. We’re the world’s leading premium alcohol company! Our brands are industry icons including Johnnie Walker, Crown Royal, Bulleit and Buchanan's whiskies, Smirnoff, Cîroc and Ketel One vodkas, Captain Morgan, Baileys, Don Julio, Tanqueray and Guinness. Our success is thanks to the strength of our people, in every role. It’s why we trust them with our legacy and why we reward them with the career-defining opportunities that they deserve. Our ambition is to build the best performing, most trusted and respected Consumer Products Company in the world. To achieve these, we need the very best people!\nAt Diageo, our purpose is to celebrate life everywhere, every day. To do that, you will join an organization that is passionate about customers and consumers, and proud of what they do. Diageo teams constantly set high goals and then try hard to exceed them. We are also an incredibly diverse organization, and we value each and every one’s talent and personality.\nContext\nYou will play a meaningful role in the DIAGEO Global Business Development & Ventures (BDV) Team reporting into the VP of Global Ventures based in New York, NY. The role will help drive DIAGEO's Ventures agenda, with focus on the North America market.\nBDV drives Diageo’s inorganic growth ambition and crafting shareholder value by identifying, pursuing, and completing M&A opportunities. This includes Diageo’s industry-leading venturing arm, Distill Ventures.\nDistill Ventures (“DV”) is the drinks industry’s first accelerator for new and growing brands. It exists to provide Diageo with a pipeline of access to the best founder led brands in the world, providing funding and acceleration support to entrepreneurs to help build global spirits brands of the future. Since its founding in 2013, DV has invested in 35+ brands in a wide range of drinks categories, including New World whiskey, premium gin, and non-alcoholic spirits. Through a combination of cash investment, mentoring support and access to a network of authorities, DV works with founders from all backgrounds and stages of growth to help brands go further, faster.\nThrough both its traditional investment pathway and its Pre-Accelerator, which launched in 2021 and focuses on recruiting diverse entrepreneurs into drinks, DV operates across both alcoholic and non-alcoholic drink categories, and invests at all stages, from pre-launch through to those requiring significant growth and expansion capital. It is operated independently and backed by Diageo, the world’s leading premium drinks company, providing investment funding, as well as resources and access through its global network of authorities.\nKey Accountabilities:\nCollaborate closely with DV and the VP of Global Ventures to be the primary day-to-day interface into Diageo for the Distill Ventures North America portfolio - leading on all operational matters, partnering the DV team and founders.\nOwn the execution of DV transactions advising on deal assessment, valuation, due diligence, transaction structure and negotiation of key contractual parameters through to transaction closure, through the investment approval process including building investment hypothesis and strategic rationales and writing approval papers.\nSupport on day-to-day Distill Ventures operations including strategic, financial, operational and governance related matters.\nDelivery of quarterly Investment Board calendar\nSupport acceleration of DV brands including being a relationship partner and resource for the DV team and founders of our portfolio companies, including attending portfolio company board meetings and monthly business reviews and mentoring the businesses through their steps of acceleration\nConceive, lead and implement critical initiatives that support the scale up and / or further differentiation of DV (e.g. Pre Accelerator Program, DTC upweight, no & low agenda)\nLead the preparation of briefing and approval materials to Diageo Executives and other partners\nMarket Complexity:\nThis role will have significant ownership on the North American Ventures agenda working closely with key internal collaborators, the Distill Ventures team, and founders of our portfolio companies.\nTo be successful in the role requires:\nInvestment and analytical skills:\nThe desired candidate will be able to demonstrate strong investment judgment and ability to handle the investment process, including the following skills:\nAbility to craft and defend an investment hypothesis/rationale\nUnderstanding of financial accounts, financial metrics, and ability to construct financial models\nAbility to structure and negotiate transactions and lead the approval process\nUnderstanding of trends, key commercial critical metrics, strategic questions, and team assessment\nPositive relationship building and network: proven track record of building relationships internally and externally with tangible examples of working alongside others and influencing senior partners.\nOperational experience and understanding of the challenges faced by fast-growing start-ups that enable you to make valuable contributions when you are supporting portfolio companies and founders as they look to accelerate and scale.\nLeadership and innovation: confirmed ability to drive traction and embed new thinking (and programs) within DIAGEO – can demonstrate understanding of how to use a network and work within the DIAGEO system, driving momentum behind your vision\nComfortable working in the unknown and ambiguous: groundbreaking new thinking and avenues for DIAGEO without feeling intimidated or lost. Clarity of thought and navigating ambiguity.\nPassion for driving value-creating opportunities, entrepreneurship, and start-ups: The desired candidate will be a self-starter who feels empowered by space and freedom and helps drive innovation. They will demonstrate a strong passion for the start-up world including understanding of the key trends and happenings.\nQualifications and Experience Required\nBachelor’s degree with strong academic record, MBA preferred\nPrevious experience within the Beverage Alcohol industry or CPG-focused venture capital, private equity or corporate development a plus\nDesirable to have experience working with early-stage businesses/entrepreneurs\nStrong commercial, marketing, and financial competence, and critical thinking capabilities\nExcellent project management skills working with cross-functional teams and proven experience of establishing credibility, influence and working at senior management levels\nSelf-starter, high energy, delivers against goals with minimal direct supervision\nClear and succinct communicator, both culturally aware and adaptable\nPassionate about the Spirits Industry and the Venture Capital space\nCelebrating our inclusive and diverse culture is core to Diageo’s purpose of “celebrating life every day everywhere”. This purpose is, in itself, inclusive in nature, as it values everybody irrespective of background, disability, religion, gender identity, sexuality or ethnicity.\nWe know that for Diageo to succeed and realize its ambition, we depend on having diverse talent with a range of backgrounds, skills and capabilities in each of the 180 countries in which we operate and to reflect our broad consumer base. We view diversity as one of the key enablers that helps our business to grow and our values, purpose and standards set the conditions for us to respect the unique contribution each person brings.\nSalary Range:\nMinimum Salary:\n$143771.25\nMaximum Salary:\n$239618.75\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US based employees are eligible for healthcare benefits, retirement benefits, short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.\nWorker Type :\nRegular\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2023-01-18-08:00\nSalary Range:\nMinimum Salary:\n$143771.25\nMaximum Salary:\n$239618.75\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US-based employees are eligible for healthcare benefits, retirement benefits , short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.Show more Report"}, {"company": "", "job": "change analyst", "city": "Jerusalem", "date": "24d", "rating": "", "link": "", "description": ""}, {"company": "Novartis", "job": "Medical Science Liaison (MSL)", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9b2eef7f&cb=1676381906417&jobListingId=1008395031198&jrtk=3-1-1gp82bpdq2p8l001-1gojf19qs2a4s000-aced7a5829509a6e-", "description": "110,000 professionals working together to improve patient’s life and you can be one of them. As Novartis MSL you will be responsible for scientifically engaging, collaborating and aligning with a broad range of external stakeholders to co-create value, address identified patient needs and ultimately change the practice of medicine for better patient access and outcomes. Up for the challenge?\n\nYour responsibilities include, but are not limited to:\n\nBe a strategic internal partner, gather and leverage insights for an impactful contribution to Patient Journey mapping, launch excellence roadmap, integrated evidence generation plans, integrated product strategy and subsequently the medical strategyUtilize knowledge of assigned therapeutic area and Novartis compounds to serve as the Medical, Clinical and Scientific expert to field matrix colleagues\nIdentify data gaps, data generation opportunities (including RWE and implementation science, precision medicine), and key unmet needs and opportunities to help improve patient access and outcomesEnsure appropriate identification and mapping of external stakeholders, aligned to the medical strategy, and in collaboration with other Novartis colleagues. Able to create personalized, flexible engagement strategies and plans, leveraging multiple channels and tailored content to meet the changing needs of external stakeholdersPersonalize and expand external stakeholder engagement beyond Healthcare Professionals. Support and contribute to innovative partnership models for shared ownership in transforming clinical practice\nApply foundational impactful Scientific Engagement principles in stakeholder interactions in alignment with medical strategy and portfolio/pipeline prioritization.\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\n\nPost-graduate degree in health/life sciences- Doctoral degree (PharmD, PhD, MD, DMD)Fluent Hebrew and English – both languages required on proficiency levelActs with credibility and clarity of purpose to build and maintain effective and collaborative relationshipsWorking knowledge of the Healthcare System and research procedures as well as the guidelines relevant to the pharmaceutical industryExperience in a medical function (2-3 years preferred) in at least one therapeutic area.Capable of self-directed learning and having a growth mindsetExcellent communication, interpersonal, and influencing skills, with the ability to communicate effectively to a variety of audiences\nWhy consider Novartis?\n\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\n\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do at Novartis!\n\nCommitment to Diversity & Inclusion:\n\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\n\n\nJoin our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/network\nDivision\nPHARMA\nBusiness Unit\nREGION EUROPE PHARMA\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nResearch & Development\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "Warman O'Brien", "job": "Clinical Data Manager", "city": "Jerusalem", "date": "30d+", "rating": "5.0", "link": "", "description": "Who are they?Be a part of one of the world’s largest healthcare data science providers. This award winning Global CRO who specialise in using artificial intelligence and machine learning are currently running trials for some of the world’s biggest pharma companies. This trailblazing company provides industry-leading training, a clear and fast promotion cycle and a great benefits package to allow for a healthy work-life balance.What will you do?Using your managerial expertise, you will provide end-to-end delivery of data management services for single and multi-service projects, ensuring quality deliverables on time and within a budget, to customer satisfaction.You will provide comprehensive data management products expertise to a Clinical Data Management (CDM) team to provide high quality data management products that meets customer needs.Using your leadership experience, you will direct the team in project planning, execution and close-out, financial management, communications and milestone deliverables.You will fulfil comply with Good Clinical Practices (GCPs), applicable regulatory guidelines, SOPs, policies, and, where available, CDM guidance documents.What do you need?Bachelor’s Degree or educational equivalent, in health, clinical, biological or mathematical science – or a related field.A minimum of 5 years’ Clinical Data Management experience.Ideally 3+ years as a Clinical Data Management project lead or equivalent.What do you get in return?Up to £65,000 plus market leading yearly bonus.Industry-leading training and support to help your professional development.Clear and frequent career progression opportunities.Great benefits, including pension contributions, private health care and dental.Opportunities to work with some of the top people in their field with access to all the technological advancements they employ.Fully remote role.Applications for this role are ending soon, apply now with your CV to avoid missing out.Job Types: Full-time, PermanentSalary: 228,236.00₪ - 269,733.00₪ per yearShow more Report"}, {"company": "Merck KGaA Darmstadt Germany", "job": "QC technicion", "city": "Jerusalem", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Pulsenmore", "job": "Director of Marketing Communications", "city": "Ramat Gan", "date": "30d+", "rating": "", "link": "", "description": ""}]