[[{"company": "Roche", "job": "Administrative and Procurement Coordinator – Diagnostics Israel", "city": "Hod HaSharon", "date": "11d", "rating": "4.3", "link": "", "description": ""}, {"company": "Auzen", "job": "Customer Success Manager (German)", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.0", "link": "", "description": "A fast growing startup in the digital healthcare industry in Israel is looking for a motivated German-speaking Customer Success Manager to join the adventure. Auzen revolutionizes the world of hearing care by offering unprecedented online access to innovative hearing-aids and remote adjustment services at a highly competitive price.Main responsibilitiesAs primary contact, act as a trusted advisor to the client, enhancing the client relationship experienceManage inbound leads pipeline, initiate and conclude the sales processPerformed remote hearing diagnostics, tests and fittingsProvide comprehensive onboarding, training, and continuous technical support to your customersOverall responsibility for your customers’ health, growth, and satisfactionMultitask between different communication channels and toolsRepresent the voice of the customer to provide input in product, marketing, and sales processesContribute to our team's growth by creating new content and sharing new ideas.RequirementsNative German speaker is a mustAbility to multitask and work with several tools simultaneouslyWillingness to learn about new healthcare technologies and tools.Past experience in customer support or sales- advantageDiplomacy, tact, and poise under pressure when providing step-by-step training & assistance.Impeccable communication (both writing and speaking) skills in English.French, Italian, and other European languages are an advantageJob Type: Full-timeLanguage:German (Required)English (Required)Show more Report"}, {"company": "EisnerAmper LLP", "job": "Tax Manager- Corporate Tax", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1110586&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a9ef486e&cb=1676381814782&jobListingId=1007954211867&cpc=E04C949A9101C6A2&jrtk=3-1-1gp828vtegfrt801-1gojf19qs2a4s000-017bd2c5145eced4--6NYlbfkN0B59FvENQ1PoESRw5gnAKNar20u3UYxwrwjmE7U3P3yjcM0YAVk_sAPPhn-zC-_zaFO9GGGVuLx5z3wdfqPZ156tGejtbAQbF1P5hQ3NCtq4Owe1RB2tLyOmeqOsgccsnhDmzWmbNR0Ek5zePosJzDYZcQ9NRFoURzlUsbn5wifSb0ozLascpLDBFCNncAXUpRxFrO-uiD4GztWmV-3U3i0vxFCLMATBLBpGDV6k-VQrs6X9Dx_ZHgx-w-2W18uW-xp_KSxdwiCEWMpVHBPT6dAM-9q9i4ozMfZ83tDpim0ViPFWlPOFysSuJgGDgH2Fjl-syLmFJIhYRQnWVbiPei-U0Ufj5_AdZDXyrvXytoiVYWwMIdhLkhJDAEMBdaVfPNFibEubRnSLnI_FkZO6hIcRgBfz0Cn6HWAcYCWoJn3q03NWlVQal7Fb5QdgijX4bdZN8uZnkxP6LTkJiR3CWcgHBLyvBIeXjYJJnE3LoDHxWCyfTR3v9pd608aOFeZHZ-G2QoQr4zCW0YSPesa6FN5GdYIhFV2ZJm4PzE05Ihfjgr7b6-b8v-7WfzqsvNmXqGDNkS2Lc5bdOcfvJPtgoAIbJoP7nN2jZGIBdza75xDH9rnkbqFrX7dFlES15JRLr8%3D", "description": "Job Description\nEisnerAmper is currently seeking a Tax Manager - Corporate to join our firm for our Israel location. This individual will work with other members of our corporate tax practice to develop and sustain excellent client relationships. They will advise clients primarily within corporate sector public and private in various industries including Financial Services, Tech, Healthcare, Manufacturing & Distribution. The individual will oversee preparing or reviewing various tax provisions, manage the preparation of tax compliance and assist with planning. They will also ensure that our tax personnel keep up to date on current tax practices and changes in tax law and have the ability to provide our clients with in-depth industry knowledge.\nWhat you’ll be doing:\nResponsible for managing and coordinating tax compliance and advisory work for clients\nReview Federal, Multi-National, Multi-State Partnership tax returns\nLead client relationships on day-to-day tax matters supporting partners with service execution and development of extended services\nResearch and consult on technical matters and special projects\nProactively build relationships and communicate effectively with the client to provide superior client service\nActively participate in business development efforts to include working collaboratively with partners and marketing professionals to target and build relationships with client prospects\nManage, train and develop staff. Participate in the performance review process\nWe’re looking for someone who has:\nBachelor’s degree in Accounting or related field required; Master of Tax preferred\nMinimum 5 years of experience in a public accounting firm or related experience\nCPA required\nProficient with corporate tax provisions and FIN 48\nPrevious experience supervising and training Staff and Seniors preferred\nExcellent written and verbal communication and interpersonal skills\nStrong organizational techniques are required\nMust be highly motivated and experienced in managing multiple client engagements\nMust begin to attain visibility and recognition within their industry specialization\nProficient with Microsoft Office (Word, Excel, PowerPoint, Outlook)\nWe’re looking for someone who has:\nMaster’s degree in Tax\nProficient in corporate taxation; individual and pass through a plus\nAbout our Tax Team:\nAs the largest service line within the firm, EisnerAmper’s Tax Group does not only provide trusted and innovative tax solutions to its clients, but it creates new opportunities for employees to grow, both personally and professionally. With a range of specialties based on location and industry, employees have the flexibility to focus on the work they want to do and the autonomy to shape their careers in a fulfilling way.\nA hybrid between a general tax practice and a hyper-specialized firm, our culture is based on collaboration, innovation and transparency. For us, success is defined by working together, sometimes across specialties, to provide the best tax solutions to meet our clients’ unique needs.\nTax regulations and procedures are always changing, and so are we. All EisnerAmper tax employees are empowered to challenge the status quo by thinking outside the box and bringing new ideas to the table. Because when we can identify creative ways to reduce filing turnarounds or streamline compliance work, we're able spend more time conducting impactful business advisory services for our clients.\nAbout EisnerAmper:\nEisnerAmper is one of the largest accounting, tax and business advisory firms in the U.S., with more than 3,000 employees and over 300 partners across the country. We combine responsiveness with a long-range perspective; to help clients meet the pressing issues they face today, and position them for success tomorrow.\nOur clients are enterprises as diverse as sophisticated financial institutions and start-ups, global public firms and middle-market companies, as well as high net worth individuals, family offices, not-for-profit organizations, and entrepreneurial ventures across a variety of industries. We are also engaged by the attorneys, financial professionals, bankers and investors who serve these clients.\nOur reach extends globally, with offices in the United Kingdom, Israel, India, the Cayman Islands, Singapore, and Ireland.\nEisnerAmper is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n#LI-PS1\nPreferred Location:\nIsraelShow more Report"}, {"company": "Roche", "job": "Customer Care Specialist/Order Management - Diagnostics Israel", "city": "Hod HaSharon", "date": "10d", "rating": "4.3", "link": "", "description": ""}, {"company": "Medison Pharma", "job": "Customer Service Coordinator", "city": "Petah Tikva", "date": "19d", "rating": "3.7", "link": "", "description": ""}, {"company": "Harris Computer Systems", "job": "Corporate Business Development", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_93bd9a09&cb=1676381819106&jobListingId=1008429871581&jrtk=3-1-1gp82942ppke0801-1gojf19qs2a4s000-51cb14d9affa2550-", "description": "Harris is an operating group of Constellation Software (CSU:TSX). We acquire, manage, and build mission-critical vertical market software (VMS) companies that are located all over the world. We have acquired over 500 companies across multiple industries including software used in healthcare, public safety, utilities and many more. We acquire small, medium, and large sized companies from owner/operators as well as institutional and corporate shareholders and hold them forever, applying the best practices we have learned as seasoned acquirers of niche software companies.\nWe are seeking a Corporate Development Specialist to work closely with our senior management team in Israel to continue our successful M&A activity in the region. The successful candidate will play a key role in identifying and sourcing potential companies of interest and reaching out to initiate a dialogue and build relationships with founders and senior executives.\nThe ideal candidate understands, appreciates, and enjoys the process that is business development. You might have a sales background, or a background in any industry where building a relationship is key. You understand that successful business development is a volume game that requires precision and consistent effort. You apply rigor to your processes and professionalism to your exchanges.\nThis is a great opportunity to apply your business development skills towards corporate acquisitions.\nAbout the Role:\nThe Corporate Development Specialist will proactively reach out to business owners and management teams of vertical market software companies to build and manage relationships for our M&A team. This is a great opportunity to apply your corporate development skills towards capital deployment in an entrepreneurial environment. We are looking for deal origination driven individuals that are interested in software, M&A and are excited at the prospect of contributing to our growth through capital deployment.Manage and grow our M&A CRM database by identifying small, medium, and large sized software companies that meet our acquisition criteriaInitiate outbound prospecting calls and emails to connect with target companiesDevelop and build relationships with management teams and shareholdersTrack personalized outreach activities weekly and maintain meticulous record keeping in our CRM.\nAbout You:\nYou have an interest in building a career in corporate development and M&A and have strong communication skills and a knack for building rapport with stakeholders. You are proactive, persistent, intelligent, and efficient. You enjoy finding ways to reach out to prospects and find it rewarding to connect with them to share your offering and learn more about their businesses. You have the following attributes:Strong Work Ethic: Demonstrated ability to develop and manage a pipeline. Understanding that M&A prospecting is a balance between volume and precision that requires consistent effort.Entrepreneurial Attitude: Ability to work independently and connect the dots when speaking to business owners. Positive personality with a strong drive to succeed.Maturity: Ability to develop relationships with founders and senior executives that builds trust in our company and investment modelArticulate & Persuasive: Ability to think on your feet and pivot the conversation when necessary. Communicates in a professional, confident, and convincing mannerFinancial Understanding: You have a basic understanding of finance and accounting principles and can use your skills to assess investment opportunities.\nThe Opportunity:\nBring your best self to work! Harris provides a career opportunity like no other. With multiple opportunities for career growth and progression, Harris is a great home for ambitious and driven individuals that are motivated by the ability to really make a difference. Our core values unite and guide us. Learn more about us here: Values (harriscomputer.com) #weareharrisShow more Report"}, {"company": "BDM International Healthcare Billing", "job": "Back Office Administrator", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "BDM, Ltd, a progressive international healthcare billing firm located in central Tel Aviv, is looking for a Back-Office Administrator with mother tongue level English. A background in the US Healthcare business industry, insurance industry or billing, is a plus.**Hybrid work from home/office**Keys Responsibilities include:Processing of new accounts- Data Entry and Data CheckOrdering and reviewing medical bills and documentsLetter writing , editing and account auditingOther Administrative TasksRequirements and Skills:BA/BSDetail orientedFull working knowledge of Microsoft OfficeGood analytical and written communication skillsPlease see our website https://bdm.co.il/for more information about our company.Job Type: Full-timeSalary: 9,000.00₪ - 10,000.00₪ per monthShow more Report"}, {"company": "Pfizer", "job": "Hybrid Health representative South Israel", "city": "Herzliya", "date": "6d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2955cff7&cb=1676381821860&jobListingId=1008438185609&jrtk=3-1-1gp8296qnk60o801-1gojf19qs2a4s000-38228ce87f86e130-", "description": "Hybrid Health Representative – Primary care (Vaccines & Toviaz)\nContract Type: Permanent\nRole Description\nThe Health Representative Hybrid is responsible for calling on (F2F and virtually) practicing physicians, hospitals, managed care (kupot) and other health-related\norganizations/personnel within an assigned territory. He/She must provide the most current information pertaining to Pfizer Israel products and their approved indications in a manner which will ensure the appropriate use of these products and achieve the business potential of the territory. Accomplishment of these goals must comply with the terms and conditions outlined in the Representatives Pledge of Ethics, Pfizer's Policy on Business Conduct as well as sampling policies.\nResponsibilities\nInvest time and effort to achieve the established goals for the territory such as sales, market share, doctor calls, etc.\nListen and respond appropriately to customer needs that will ensure acceptance of or agreement with a \"call plan\" objective\nMaintain the required technical expertise including competitive product knowledge and computer capabilities\nEnsure clear concise and accurate communication of product information using proper medical terminology\nPlan and organize daily sales call activities to optimize the use of time and maximize the achievement of sales and market share objectives\nUse hybrid ways of communication with customers such as: F2F call, Virtual calls (VCC, Teams, Zoom ect.), RTEs, Journal Clubs, Webinars, as required and defined by the Category strategy\nPrepare, analyze and send sales/patients scanning monthly reports (as requested by Health Engagement Lead,) in his/her territory\nWork with all relevant partners within the company to ensure “closing” of the loop. Collaborate with internal stakeholders such as medical advisor, MSLs, KAMs to ensure our customers are receiving the best tailored solution based on their needs\nRecognize changes in the work environment, develop and implement alternative plans to achieve objectives, modify call plan/business plan activities accordingly\nDemonstrate persistence to accomplish objectives despite disappointments and/or rejection of original efforts\nMake daily decisions based on logical and factual information after weighing alternatives and their consequences\nUse available resources and invest according to Business plan (all plans, and events must have clear objectives, be accurate, truthful and appropriate for their intended context)\nCreate and maintain a positive impression with customers\nProject a professional image as demonstrated by neat physical appearance and appropriate manner of speech\nMaintain timely communication with supervisor and other members of the sales team\nFully comply with the terms and conditions prescribed in the Sales Representatives\nQualifications\nA Bachelor's degree in Life Sciences (or similar diploma)\nAt least two years of sales and/or marketing experience within pharmaceutical, biotech, healthcare, or medical device industries Product or hospital sales experience – advantage\nLocal Market knowledge\nEasy adaptor of using new technologies tools - Core competencies: Planning and organizing work, engaging others through effective communication, Basic analytical skills, drive to achieve individual leadership and impact.\nHigh ability to read, analyze and interpret medical research\nExcellent communication skills in Hebrew and English\nGood Presentation skills, high digital abilities and learning agility\nDriving license – role requires travelling\nPurpose\nBreakthroughs that change patients' lives... At Pfizer we are a patient centric company, guided by our four values: courage, joy, equity and excellence. Our breakthrough culture lends itself to our dedication to transforming millions of lives.\nDigital Transformation Strategy\nOne bold way we are achieving our purpose is through our company wide digital transformation strategy. We are leading the way in adopting new data, modelling and automated solutions to further digitize and accelerate drug discovery and development with the aim of enhancing health outcomes and the patient experience.\nFlexibility\nWe aim to create a trusting, flexible workplace culture which encourages employees to achieve work life harmony, attracts talent and enables everyone to be their best working self. Let’s start the conversation!\nEqual Employment Opportunity\nWe believe that a diverse and inclusive workforce is crucial to building a successful business. As an employer, Pfizer is committed to celebrating this, in all its forms – allowing for us to be as diverse as the patients and communities we serve. Together, we continue to build a culture that encourages, supports and empowers our employees.\nSales\n#LI-PFEShow more Report"}, {"company": "Lilly", "job": "Sr. Associate - Oncology Medical Science Liaison", "city": "Raanana", "date": "5d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d9311cf9&cb=1676381823459&jobListingId=1008443297074&jrtk=3-1-1gp8298d5jfmv801-1gojf19qs2a4s000-d72af6f9cd756197-", "description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 35,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.\nResponsibilities\nThe Medical Science Liaison is a highly knowledgeable scientific person who is primarily responsible for answering the scientific and clinical needs of Scientific Experts (SE). He / She will be placed in a dynamic and motivating environment dedicated to the launch of new products and in a path of professional career. The Medical Science Liaison is a field-based role.\n\nKey Responsibilities:\nIdentification of SEs and development of relationship with them\nProvide deep and advanced disease state and product expertise to SE\nEngage in continuous learning within their therapy area, through literature search, participation in scientific congresses etc.\nCommunication of scientific intelligence and clinical insights\nRespond to unsolicited request, also at congresses\nParticipation in consultant meetings\nDrive digital innovation in engaging customers\nBasic Qualifications\nAdvanced degree in health sciences (PharmD, MD, PhD in a medically related field) OR Masters / bachelor’s level degree in health sciences (e.g. BSN, RPh, PA, NP) with previous experience in Oncology TA.\nAdditional Skills/Preferences\nEnglish proficiency (written and oral): Advanced (B2/C1)\nPassion for science, results, and high standards\nGreat and demonstrable learning agility\nBusiness acumen (starting from scientific information)\nProactive – takes independent action and responds quickly.\nEnthusiasm for a variety of digital technologies with the ability to assimilate complex information and systems.\nConfidence and willingness\nAsk questions, understand, and translate into suggestions/ new solutions.\nDemonstrable ability to operate in a compliant way.\nBrilliant and demonstrable presentation skills\nAbility to effectively communicate scientific data into meaningful, clear, and compliant content.\nAbility to manage a complex environment and prioritize different projects at the same time.\nEli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.\nLilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n#WeAreLillyShow more Report"}, {"company": "Haleon", "job": "Digital Key Account Manager", "city": "Israel", "date": "5d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_18c5f047&cb=1676381825035&jobListingId=1008440067373&jrtk=3-1-1gp8299u9jm6i801-1gojf19qs2a4s000-00f4edd3798d24d8-", "description": "Job Description\nSite Name: Petach Tikvah\nPosted Date: Jan 31 2023\nHello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands – including Sensodyne, Advil, Voltaren, Otrivin, and Centrum – through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.\nJob Title\nDigital Key Account Manager\nIn this role you will hold account management for omnichannel Mass Market e-commerce and key e-pharmacy customers across Haleon’s full portfolio.\nIn This Role You Will…\nBuild customer base partnerships that maximizes Haleon’s potential growth in the e-commerce channel. Exceed and meet customer expectations through optimized Haleon resources management and optimized solution propositions under time and budget constrained business context.\nUnderstand full channel and customer potential for Haleon Categories and brands\nDeliver sales, profit and visibility targets for customer group.\nDevelop credible relationships that lead to win/win agreements ensuring Haleon strategy is implemented, and we are recognized as a supplier of choice in the categories we operate in.\nGain agreement on annual plan and monitor to ensure brilliant execution is carried out and corrective actions are taken when necessary. Ensure proper measurement and evaluation is in place.\nIdentify opportunities based on customer insights and work with cross functional teams to translate to actionable proposals that grow our categories.\nResponsible for data consolidation and reporting across customers\nLeverage all available data and insights to monitor KPIs per customer and drive action. Drive solutions that grow customer’s trust in Haleon, to overcome problems efficiently\nConduct regular reviews of business performance internally and externally and ensure agreed actions are put in place.\nValidate the Service Invoices and Credit Notes that are related to the annual agreement and the trade budget spent.\nCoordinate and collaborate closely with distributors to ensure execution compliance and to maximize Haleon potential and consistency within omni channel customers\nMonitor competition and identify risk and opportunities\nWhy You?\nQualifications & Skills:\nUniversity degree or equivalent in Business\nProficient in Hebrew and English\n3+ years’ experience in KA management. E – commerce customer experience desirable.\nStrong commercial acumen and passion about digital & e-commerce\nFamiliar with digital media KPIs\nExperience in customer marketing roles will be considered an asset\nAbility to find solutions in new areas and move things forward through stakeholder buy-in and compelling customer propositions\nProven skills to manage a high degree of complexity in changing environment\nNegotiation/influence skills\nAccountability for results\nExcellent use of Microsoft Office\nWhy Join Us?\nThe future of everyday health is changing. And we’re the people changing it. In front of us is an incredible opportunity to go beyond what any of us have done before. And make everyday health more achievable, more inclusive and more sustainable. For more and more people. So join us, as we build one of the world’s leading consumer healthcare companies. Join us to innovate our category-leading brands. To better understand people’s everyday health needs. To tackle the biggest barriers that stand in their way. To change individual and societal behavior. Join us to work with colleagues who share your restless energy. To explore your interests. To stretch yourself to do the best work of your career. And join us, as together we build a working experience that encourages us all to lead happier, healthier, more productive lives. The way we see it, every day is an opportunity for better. And we’re going all in to realize it.\nDiversity, Equity, and Inclusion\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create an unmatched understanding of each other, and promotes fair and equitable outcomes for everyone.\nWe’re striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives.\nWe believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\nCare to join us. Find out what life at Haleon is really like www.haleon.com/careers/\n\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\n\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\n\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Show more Report"}, {"company": "ICON", "job": "Contract and Bidget Negotiator", "city": "Israel", "date": "2d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a1ef1ace&cb=1676381826350&jobListingId=1008450004474&jrtk=3-1-1gp829b7l2gps001-1gojf19qs2a4s000-81e499280f8ff55b-", "description": "ICON plc is a world-leading healthcare intelligence and clinical research organisation. From molecule to medicine, we advance clinical research providing outsourced services to pharmaceutical, biotechnology, medical device and government and public health organisations. With our patients at the centre of all that we do, we help to accelerate the development of drugs and devices that save lives and improve quality of life. Our people are our greatest strength, are at the core of our culture, and the driving force behind our success. ICON people have a mission to succeed and a passion that ensures what we do, we do well.\nICON Strategic Solutions (ISS) is looking for qualified candidate to perform the investigator site contracting Services hereunder in order to support a broad range of therapeutic studies across all our sponsor´s divisions in accordance with the requirements described in FSP Program.\nJOB FUNCTIONS/RESPONSIBILITIES\nPerform negotiation of legal terms and budget terms for Clinical Study Agreements (“CSA”) (i.e., investigator site agreements)\nPerform negotiation of legal terms and budget terms for amendments to CSAs\nDraft and negotiate ancillary site contracts (e.g. PI / Sub-I / department agreements /Study Coordinator) as required\nUtilize Sponsor´s provided templates. Sponsor´s requires stand-alone site contracts with the exception of the US, which utilizes master clinical study agreements.\nProduce and maintain site-specific templates where needed to support the Sponsor´s targeted investigator site list, but limited to the sites within the studies assigned\nRecommend country-specific and site /entity-specific modifications to templates based on site and local regulatory requirements\nUtilize previously negotiated terms for existing contracts between same site/entity and Sponsor´s\nPerform submission and oversight of site and study specific local language translations. Candidate will be required to use Sponsor´s preferred translation vendors. Sponsor´s will manage template version control and translations\nAttend weekly study team and country meetings, as needed\nIdentifies risk and mitigation strategies as it relates to meeting contract negotiation timelines\nICON’s Legal team may provide support to ISS personnel. For the avoidance of doubt, ISS is not providing legal advice to Sponsor´s in any capacity.\nFollow Sponsor´s’s legal guidance document and comments and fallbacks\nIdentify contractual and compliance risks for CSA contracting and raise to Sponsor´s\nCollect information from investigator site to complete Foreign Corrupt Practices Act (FCPA) form and submit to Sponsor´s\nPrioritize to meet study timelines to minimize impact to planned Site Initiation Visit (SIV) dates.\nAct independent of CRO managing the study\nPerform quality control checks of contracts and amendments prior to upload to DocuSign for electronic signatures\nIf electronic signatures are not permissible, provide management of hard copy/ local signature process\nContractual Parties:\nEnsure signatory to CSA is authorized to sign on behalf of the party\nEnsure signatory to the CSA will either be responsible for the contractual obligations or operating under a Power of Attorney binding a Sponsor´s entity to the obligations. Sponsor´s preerence is to have Sponsor´s or Sponsor´s Affiliates as the contracting entity for CSAs where possible\nEnsure country - specific singnatory requirements are met (e.g., Some countries require signature by local affiliate (e.g. Italy and Canada))\nSupport and provide country level intelligence into the selection of signing part at the country level which must consider payment impact, tax issues (VAT/R&D/WHT) establishment (I.e. corporate presence) and relationship to sponsor.\n Collection and submission of payment support forms, including, but not limited to Payee information forms and required tax forms\nBudget negotiation specific requirements:\nPre-populate site-specific budget items from prior negotiations following Sponsor´s provided guidelines.\nNegotiate site budgets following Sponsor’s principles document and comments & fallbacks\nActively participate in per-subject cost development meeting. ISS personnel will provide review and input into the country specific budget templates to minimize timelines for site budget negotiations.\nProvide country level expertise to budget related contract terms and conditions\nEscalate out of parameter budget items to Sponsor´s Investigator Contracts Lead (ICL)\nRecord negotiated changes to patient compensation information and provide to Sponsor´s designated contact for Informed Consent Document (ICD)\nDemonstrate effective time management skills; able to independently prioritize multiple tasks.\nDemonstrate the ability to work independently and use initiative to anticipate/resolve issues and complete tasks.\nShows a commitment to and demonstrate the ability to consistently perform high quality work with minimal management oversight.\nContract Management System:\nAriba Contracts Workbench is the current Sponsor´s contract management system.\nISS personnel will utilize the system for all contracts consistent with Sponsor´s provided guidance and training.\nSignature processing:\nISS personnel should first adapt and advocate for Sponsor´s-preferred DocuSign system for electronic signature process. Other options / alternatives may be presented by the ISS personnel and will be reviewed by Sponsor´s\nTrial Master File:\nISS personnel will file CSA and Amendments into the eTMF within required timeframe\nEDUCATION REQUIREMENTS\nBachelor’s Degree or international equivalent in business, finance, health sciences or related field\nRead write and speak fluent English; fluent in host country language required.\n1-2 years Industry experience managing contracts required.\nBenefits of Working in ICON:\n\nOur success depends on the knowledge, capabilities and quality of our people. That’s why we are committed to developing our employees in a continuous learning culture – one where we challenge you with engaging work and where every experience adds to your professional development.\n\nAt ICON, our focus is to provide you with a comprehensive and competitive total reward package that comprises, not only an excellent level of base pay, but also a wide range of variable pay and recognition programs. In addition, our best in class employee benefits, supportive policies and wellbeing initiatives are tailored to support you and your family at all stages of your career - both now, and into the future.\n\nICON, including subsidiaries, is an equal opportunity and inclusive employer and is committed to providing a workplace free of discrimination and harassment. All qualified applicants will receive equal consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nIf, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please let us know.Show more Report"}, {"company": "Chronos Consulting", "job": "Recruitment Specialist Tel Aviv area", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1c2731d4&cb=1676381827542&jobListingId=1006039678149&jrtk=3-1-1gp829cbpkcl4801-1gojf19qs2a4s000-b6d981e238b99f14-", "description": "Chronos Consulting (www.chronosconsulting.com) is part of the Coberon Chronos Group, an award winning global leader in permanent and temporary staffing, RPO and business process automation solutions for global multinationals. The Group owns and operates 42 offices worldwide.\n\nAs the team is expanding, we are seeking a fluent English speaking Senior Consultant for Financial Services Recruitment (Finance/Accounting/Banking/Insurance/Payrolling) with a proven track record and experience in mid to senior level full cycle recruitment. You will build and grow both client and candidate relationships through management of the recruitment process delivery including: sourcing, screening, assessing, and presenting candidates to multinational clients. Career growth opportunities to build and manage a team of Recruiters and Researchers and expand into Asia/Africa/Latam/Europe for the ideal candidate.\n\nThe Role:\nAs he Recruitment Specialist you will:\n\nResearch, identify, and present candidates for mid- to senior-level executive positions, ideally exposure with a wide range of diverse industries (IT/Telecom, Manufacturing, Engineering, Pharmaceuticals, Consumer Packaged Goods).\nIdentify recruitment sources, networking leads, social media, advertising resources, and other tools to attract candidates.\nCoordinate client & candidate relationships, deliver solutions in a timely, professional, and responsive manner.\nCreate and update Progress Reports to track research and recruitment process, proposals, and support in responses for RFIs and RFPs.\n\nThe Requirements:\n3+ years’ experience in full cycle recruitment (job description creation, posting, sourcing, screening, interviewing, presenting & closing)\nExperience with a variety of sourcing methodologies to include: headhunting, market mapping, Boolean searches, social media recruitment strategies, career sites, among others\nInteracting with clients (both local and international) and key stake holders throughout the recruitment process\nCustomer focus with a sense of urgency while maintaining quality control\nStrong negotiation, verbal and written communication skills with attention to detail\nEntrepreneurial spirit and driven for growth and expansion\nAbility to work independently, strong team player and/ or manage international offices and Consultants\nFluent English mandatory. 2nd language a huge plus. French, Polish German, Spanish, Portuguese, Russian, Arabic, Turkish, Hebrew etc.\n\nWhat we offer:\nGood salary\nTop bonus scheme\nEquity participation\nHealthcare\nFree financial advice\nFreedom\nFlexible working timesShow more Report"}, {"company": "AstraZeneca", "job": "Primary Care Sales Representative, CVRM", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Viseven", "job": "Account Executive", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1b68f68d&cb=1676381830581&jobListingId=1008306940796&jrtk=3-1-1gp829fbukbnn801-1gojf19qs2a4s000-615586504532301c-", "description": "Viseven Group is an international IT company specialising in interactive content and cloud-based solutions for global pharmaceutical companies since 2009; constant growth and self-development is in our corporate DNA. Our unique developments and approaches are actively used in more than 50 countries all over the world. Viseven's solutions are represented at major industry events in Barcelona, Philadelphia, London, etc.\nThe rapidly expanding team includes more than 700+ highly-skilled tech- and non-technical experts: front- and back-end developers, BA specialists and managers who create, localize and customize applications at 8 offices: in Kyiv, Zhytomyr, Vinnytsia, Ternopil (Ukraine), Tallinn (Estonia), New Delhi (India) and Bridgewater (NJ, USA).\nRole description:\nViseven comes with a mission to save lives by making communication faster.\nWe do so by disrupting how Pharma and Life Sciences create, update, and share the information with Healthcare Professionals, Caregivers, and Patients (yes, with you too).\nAs a part of the Viseven Team, you will have a chance to interface with the most innovative teams from Pharma, Life Sciences, Biotech, and Medical Devices. A perfect candidate will be a trailblazer, ready to drive the change, a listener, and a consultant, that can tailor a solution from a rich Viseven Portfolio (no one-fits-all approach).\nResponsibilities:\nDevelop opportunities generated by the Sales development team (Outbound & Inbound SDR)\nGenerate new opportunities (new revenue streams) in the entrusted Clients\nClose deals by preparing & pitching proposals for the UVP to potential and existing Clients\nSign MSA, SOW and initiate Project team allocation for the projects after receiving POS\nBe a consultant for a Client in all related the business matters\nBuild trustful relations with the Client\nRequirements:\nAt least 2 years of experience in a similar position\nEnglish language proficiency is a must\nKnowledge and understanding of business development, sales, account, or product management\nAbility to learn and retain new information quickly\nAbility to handle multitasking productively\nAdvanced communication and presentation skills\nGreat team player: optimistic, organized, flexible, helpful\nWill be considered as a Competitive Advantage:\nExperience in B2B software sales\nWorking knowledge of CRM programs\nKnowledge of foreign languages other than English\nWhat we provide:\nWe understand that our team members are essential to making our goals a reality, so we value and empower them to share their vision. And we reward this kind of passion with a highly competitive compensation and exceptional benefits, such as:Competitive compensation and regular performance based salary and career development reviewsPassionate experienced team, friendly atmosphereProfessional and career growthPaid time off - 18 business days per year (20 business days after 2 years of cooperation)Non-documented sick leave - 4 business days per yearDocumented sick leave - 20 business days per yearFamily leave - 3 paid business days in case of marriage, childbirth or bereavementComprehensive medical insuranceEnglish learning coursesOpportunities to participate in professional forums and conferencesRegular corporate events and team-buildingsEnjoyable working environment: comfortable and fully equipped office and possibility to work from homeShow more Report"}, {"company": "IQVIA", "job": "Site Activation Specialist", "city": "Israel", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f97dc209&cb=1676381831828&jobListingId=1008432848196&jrtk=3-1-1gp829gis20b0001-1gojf19qs2a4s000-4a1e18ab9d70c65c-", "description": "Job Overview\nUnder moderate supervision, executes the feasibility, site identification regulatory, start-up, and maintenance activities in accordance with regulations, SOPs, and project requirements at the regional, or country level.\nPrepares and manages site documentation; reviews and negotiates site documents and contracts with sites and sponsors; maintains, reviews, and reports on site performance metrics; serves as the primary point of contact for investigative sites; tracks completion of appropriate documents for sites; ensures contracts are fully executed; and establishes project timelines. With moderate oversight and supervision, perform tasks at a country/region level associated with site activation activities in accordance with applicable local and/or international\nregulations, standard operating procedures (SOPs), project requirements and contractual/budgetary guidelines. May also include maintenance activities.\nEssential Functions\nWith moderate oversight and supervision, werve a Single Point of Contact (SPOC) to perform feasibility, site activation and some maintenance activities in assigned studies for investigative sites, according to applicable regulations, SOPs and work instructions, working closely with the Site Activation Manager (SAM), Project Management team, and other departments as necessary. Review documents for completeness, consistency and accuracy, under guidance of senior staff.Prepare site documents, reviewing for completeness and accuracy.Inform team members of completion of regulatory contractual. and other documents for individual sites.Distribute completed documents to sites and internal project team members.Update and maintain internal systems, databases, tracking tools, timelines and project plans with accurate and complete project specific information.Review, track and follow up the progress, the approval and execution of required documents such as questionaires, CDAs, regulatory, ethics, Informed Consent Form (ICF) and Investigator Pack (IP) release documents. Requires advanced knowledge within a specific discipline typically gained through extensive work experience and/or education.\nQualifications\nBachelor's Degree Life sciences or a related field Req AndOther 1 - 3 years’ clinical research or other relevant experience; or equivalent combination of education, training and experience. ReqWith 3 years’ experience in a healthcare environment or equivalent combination of education, training and experience.\n#LI-Remote,\nIQVIA is a leading global provider of advanced analytics, technology solutions and clinical research services to the life sciences industry. We believe in pushing the boundaries of human science and data science to make the biggest impact possible – to help our customers create a healthier world. Learn more at https://jobs.iqvia.comShow more Report"}, {"company": "Roche", "job": "Supply Chain Expert - Diagnostics Israel", "city": "Hod HaSharon", "date": "10d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_06bee29c&cb=1676381833159&jobListingId=1008431016645&jrtk=3-1-1gp829hrqjc9s801-1gojf19qs2a4s000-4d7bfde7be2ccf05-", "description": "The Position\nSupply Chain Expert\nWho we are:\nRoche is ranked among the world's foremost corporations providing innovative healthcare solutions, continuously investing in medical research and development.\n\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we have become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\n\nRoche is an Equal Opportunity Employer.\n The Opportunity:\nThis is an excellent opportunity for an experienced professional to join Roche Diagnostics.\n\nIn this role you will work with multiple stakeholders to guarantee on-time in full deliveries, while complying with local and global regulations and standards\nResponsibility for:\nSupply Chain Planning: Managing inventory level to meet market demand and minimize losses\nManaging the efficiency of the inventory level, inventory analysis, forecasting, and performing the write-off calculation and control. Support the plan and calculation of safety stock. Accountable for ensuring products availability to fulfill the on-time delivery according to SLA (service level agreement)\nCreating and maintaining the material master database, and the SAP environment to guarantee proper inventory management.\nDeveloping a supply plan based on statistical forecasts and ensures plan’s accuracy.\nSupporting the Commercial areas to align with product life cycle management.\nDriving the escalation process for supply and demand planning issues.\nOwning accuracy and continuous optimization of the supply chain\nManaging key parameters of bottleneck management, allocation, reserve and scrap mitigation across the network.\nResponsible for the claim handling within suppliers\n3PL Liaison:\nBecome the primary point of Contact for the logistics contractor\nSupport the supply chain interface (both human and system) with 3PL\nManaging the 3PL KPI’s monitoring\nSupports the maintenance of the product database in respect with legal and compliance requirements;\nLead the collaboration with 3PL on quality issues in collaboration with quality department\nAdditional Day to day activities:\nSupporting import-export activities\nCan also act as a back-up to the Order Management department when it relates to allocation of materials, bottlenecks, order processing and any other activities related to it.\nActs as Key User in SAP and any other Supply Chain Systems\nProvide tools and services that support our customers with up-to-date solutions to facilitate their daily business.\nWho you are:\nRelevant experience required (5-7 years) in Supply Chain and Logistics planning positions, ideally in the medical devices or pharmaceutical industry\nRelevant university degree\nProficiency with ERP systems (Preferably SAP)\nAble to adapt and respond to internal and external changes\nStrong experience in internal processes, drive process improvements\nCustomer oriented\nCollaborative, demonstrates sense of urgency and collective ownership\nStrong communication and interpersonal skills, Ability to work with different stakeholders, Agile mindset\nHigh level fluency in Hebrew and English\nWho we are\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.Show more Report"}, {"company": "Finn Partners", "job": "Finn Partners Israel is Hiring!", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "", "description": "Our gorgeous new office in Har Tuv (between Jerusalem and Tel Aviv) is waiting for you!\nWe communicate on behalf of health innovators aiming to make a difference in the world.\nIf you have communications or digital marketing experience, please contact us. Send us:\nYour current CV\nA cover letter detailing your skills and interests\nIf you qualify for an opening, we'll be in touch with more information.\nAbout Finn Partners\nNamed as a Best Place to Work 2020 by PR Week, close to 1,000 of the most accomplished professionals in the industry make up Finn Partners. With 20 offices across eight countries around the world, our managing partners alone have more than 175 years of combined experience working in the consumer, technology, travel & leisure, financial services, healthcare, education and manufacturing sectors. The firm offers a full-service approach including integrated public relations, content creation, social, digital marketing and research services. Founded in New York in 2011 by Peter Finn with an innovative new model in which entrepreneurial spirit, innovation and partnership drive client success and sustainable agency growth, the firm delivers world-class client service, coupled with best-in-class employment practices, to produce award-winning work and a rewarding culture.\n\nAnGUSqRXJlShow more Report"}, {"company": "AstraZeneca", "job": "Cardiology Sales Representative, CVRM", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Edwards Lifesciences", "job": "Manager Sales & Clinical Field Clinical Specialist TMTT", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4320224c&cb=1676381836797&jobListingId=1008431373140&jrtk=3-1-1gp829ldbk6dk801-1gojf19qs2a4s000-eba939df8627f46f-", "description": "Develops clinical education materials in connection with clinical investigations. Provides expertise and clinical insights on the device, procedure and protocol throughout the life cycle of the clinical investigation.\n\nKey Responsibilities:\n\nEstablish, maintain and develop mutually, profitable business relationships between Edwards Lifesciences and its customers (both external and internal) with appropriate levels of clinical/management in hospitals by offering service, product knowledge, and clinician education excellence\nProvide education during the procedure on all aspects of the device, device handling, implantation and troubleshooting techniques related to equipment, tools and products required for device implants.\nReview market and competitor information and propose action plans to increase our position in the marketplace\nDevelop strategy to facilitate product presentation, product trials, implementation and in-service education to meet customer’s requirements\nDevelop strategy for focused education plans for key accounts and potential accounts to support sales in collaboration with Sales Managers and Sales Reps\nAttend and educate at conferences as needed\nOther incidental duties\n\nEducation and Experience:\n\nBachelor's Degree or Equivalent in a related field\nSales/Commercial experience within the medical device field and/or clinical experience\nTraining experience in clinical / technical environment Preferred\n\nAdditional Skills:\n\nProven expertise in MS Office Suite\nStrong written and verbal communication skills, presentation, and interpersonal relationship skills including negotiating and relationship management skills\nExcellent problem-solving and critical thinking skills\nGood ability to read, write and speak English, preferred\nExpert knowledge and understanding of cardiovascular science\nExpert understanding of cardiovascular anatomy, pathology and physiology\nExpert understanding of medical device regulatory requirements and documents, device accountability and adverse events reporting\nAbility to manage confidential information with discretion\nStrict attention to detail\nAbility to interact professionally with all organizational levels\nAbility to manage competing priorities in a fast paced environment\nMust be able to work in a team environment, including inter-departmental teams and key contact representing the organization on contracts or projects\nAbility to interact with senior internal and external personnel, including key opinion leaders (KOLs) on significant matters often requiring coordination between organizations\nAdhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "BDM International Healthcare Billing", "job": "Billing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "A progressive international healthcare billing and collections firm, located in central Tel Aviv, is looking for a Billing Analyst/ Administrator with mother tongue level English. A background in the US Healthcare business industry or billing and revenue cycles, is a plus.**Hybrid work from home/office**Keys Responsibilities including:Accessing, analyzing and integrating financial and other data from a variety of hospital data systems.Posting payments, reconciling payment data and responding to account inquiriesRequirements and Skills:· BA/BS· Analytical· Full working knowledge of Microsoft Office (especially Excel)· Proficient in systems dataJob Type: Full-timeSalary: 10,000.00₪ - 12,000.00₪ per monthShow more Report"}, {"company": "Assured Allies", "job": "Head of Product", "city": "Ramat Gan", "date": "30d+", "rating": "4.2", "link": "", "description": "Are you smart, curious, nimble, relentless leader and quick learner enough to tackle one of society’s largest emerging problems?If you answer yes to all of the above, we might have one of the most interesting product leadership roles out there, just for you.We are Assured Allies and we are reinventing the products that help our parents better live when they retire… We are already changing how hundreds of thousands of aging adults in the US age and we need a product magician to help us push us to the next level.Why a magician? Because on a day-to-day you will need to-Speak the language of actuaries, data scientists, clinicians, developers, operations team and account managementCut to the chase and drive your team to pull a lot of decisions quickly from their hats (and know what to do if they end up wrong)Retrospect what you and your team did to make sure we do not make the same mistake twiceBuild and manage a team in a merit based and data driven environment. (e.g. give and receive frank, timely and honest feedback, solicit the best ideas, have solid foundations for decisions)Ensure nothing disappears (e.g. falls through the cracks)Quickly call out risks and problems but not be discouraged by themFew other critical requirements-We do not provide broomsticks so this position will require some air travel. (It reports to the VP Product Management in our US office and works extensively with our R&D teams in Israel)7+ years of software product management experience2+ years leading product management activities and deep knowledge of either one of these books ( “Lean Startup”,“Startup Owner’s Manual”)&gt;5 years utilizing Agile and/or Scrum software methodologiesExperience in healthcare / case management systems is a plusQinQMQRS3vJob Type: Full-timeShow more Report"}, {"company": "Ciklum", "job": "Junior Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": ""}, {"company": "Sedgwick", "job": "Benefit Liaison", "city": "Israel", "date": "5d", "rating": "3.2", "link": "", "description": ""}, {"company": "M-SOR s.r.o.", "job": "First SORUDO International Sales Manager in Israel", "city": "Jerusalem", "date": "19d", "rating": "5.0", "link": "", "description": "First SORUDO International Sales Manager in IsraelThis isn't just an ordinary job offer. We don't seek an ordinary salesman. We are looking for someone, who will take our successful products from Europe and help them grow in your country.We are SORUDO, a company which saves lives through a unique system of Complex Self-defense and First Aid Training, which we organize for companies and institutions. (only B2B)Sales talent is pointless, unless you sell something you can believe in, something that helps others and has a meaning itself.We will hire only 1 person in your country. If we choose you, you will get a job, which you can be proud of.We have more than 80 courses and products that we can offer to clients in your country.Our offer is suitable for clients such as:Security agencies (G4S)Healthcare sector (Hospitals / Psychiatry Institutes)Government agenciesLarge Corporate companiesManufacturing companiesAre you able to do it? Do you have the courage for it? Read more and help us save lives in your home country.Find out more at: https://sorudo.cz/international-sales-manager-2/Working with us, you save lives, but you also get:Reward up to 16,700 € / month (high commissions for profit up to 25% of a contract)→ Our sales representatives and managers usually earn up to 467% of the local average salary.→ There is no limit for commission, that is only up to you.→ Possibility of a fixed salary for smooth start.(So that you can gradually grow your sales that will build higher salary based on commission)Career potential, you can grow really fast to become→ Team manager (you can grow with our local company)→ Country director (and eventually become our partner for the country)We seek someone who is:Ambitious (wants to achieve high goals, we don't want an average person)Finisher (someone who constantly pushes the deal forward)Great at communication, presentable manners are natural requirementFluent in English (you need to be fluent for communication with our company and other colleagues abroad)We know that our work saves lives and our ambition is no smaller than global expansion. Our company sets high expectations and seeks only colleagues, who want to improve themselves with us.Find out more at: https://sorudo.cz/international-sales-manager-2/Job Types: Full-time, Part-timeSalary: Up to 61,500.00₪ per monthShow more Report"}, {"company": "Diageo", "job": "Director, Ventures North America", "city": "Central", "date": "18d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5282ee15&cb=1676381844906&jobListingId=1008415108216&jrtk=3-1-1gp829tba2f30001-1gojf19qs2a4s000-077ad3fc032ed5e4-", "description": "Job Description :\nWhich company will you join?\nFrom Arthur Guinness to Johnnie Walker, our business was founded on people of outstanding character, and in 250 years, nothing has changed. We’re the world’s leading premium alcohol company! Our brands are industry icons including Johnnie Walker, Crown Royal, Bulleit and Buchanan's whiskies, Smirnoff, Cîroc and Ketel One vodkas, Captain Morgan, Baileys, Don Julio, Tanqueray and Guinness. Our success is thanks to the strength of our people, in every role. It’s why we trust them with our legacy and why we reward them with the career-defining opportunities that they deserve. Our ambition is to build the best performing, most trusted and respected Consumer Products Company in the world. To achieve these, we need the very best people!\nAt Diageo, our purpose is to celebrate life everywhere, every day. To do that, you will join an organization that is passionate about customers and consumers, and proud of what they do. Diageo teams constantly set high goals and then try hard to exceed them. We are also an incredibly diverse organization, and we value each and every one’s talent and personality.\nContext\nYou will play a meaningful role in the DIAGEO Global Business Development & Ventures (BDV) Team reporting into the VP of Global Ventures based in New York, NY. The role will help drive DIAGEO's Ventures agenda, with focus on the North America market.\nBDV drives Diageo’s inorganic growth ambition and crafting shareholder value by identifying, pursuing, and completing M&A opportunities. This includes Diageo’s industry-leading venturing arm, Distill Ventures.\nDistill Ventures (“DV”) is the drinks industry’s first accelerator for new and growing brands. It exists to provide Diageo with a pipeline of access to the best founder led brands in the world, providing funding and acceleration support to entrepreneurs to help build global spirits brands of the future. Since its founding in 2013, DV has invested in 35+ brands in a wide range of drinks categories, including New World whiskey, premium gin, and non-alcoholic spirits. Through a combination of cash investment, mentoring support and access to a network of authorities, DV works with founders from all backgrounds and stages of growth to help brands go further, faster.\nThrough both its traditional investment pathway and its Pre-Accelerator, which launched in 2021 and focuses on recruiting diverse entrepreneurs into drinks, DV operates across both alcoholic and non-alcoholic drink categories, and invests at all stages, from pre-launch through to those requiring significant growth and expansion capital. It is operated independently and backed by Diageo, the world’s leading premium drinks company, providing investment funding, as well as resources and access through its global network of authorities.\nKey Accountabilities:\nCollaborate closely with DV and the VP of Global Ventures to be the primary day-to-day interface into Diageo for the Distill Ventures North America portfolio - leading on all operational matters, partnering the DV team and founders.\nOwn the execution of DV transactions advising on deal assessment, valuation, due diligence, transaction structure and negotiation of key contractual parameters through to transaction closure, through the investment approval process including building investment hypothesis and strategic rationales and writing approval papers.\nSupport on day-to-day Distill Ventures operations including strategic, financial, operational and governance related matters.\nDelivery of quarterly Investment Board calendar\nSupport acceleration of DV brands including being a relationship partner and resource for the DV team and founders of our portfolio companies, including attending portfolio company board meetings and monthly business reviews and mentoring the businesses through their steps of acceleration\nConceive, lead and implement critical initiatives that support the scale up and / or further differentiation of DV (e.g. Pre Accelerator Program, DTC upweight, no & low agenda)\nLead the preparation of briefing and approval materials to Diageo Executives and other partners\nMarket Complexity:\nThis role will have significant ownership on the North American Ventures agenda working closely with key internal collaborators, the Distill Ventures team, and founders of our portfolio companies.\nTo be successful in the role requires:\nInvestment and analytical skills:\nThe desired candidate will be able to demonstrate strong investment judgment and ability to handle the investment process, including the following skills:\nAbility to craft and defend an investment hypothesis/rationale\nUnderstanding of financial accounts, financial metrics, and ability to construct financial models\nAbility to structure and negotiate transactions and lead the approval process\nUnderstanding of trends, key commercial critical metrics, strategic questions, and team assessment\nPositive relationship building and network: proven track record of building relationships internally and externally with tangible examples of working alongside others and influencing senior partners.\nOperational experience and understanding of the challenges faced by fast-growing start-ups that enable you to make valuable contributions when you are supporting portfolio companies and founders as they look to accelerate and scale.\nLeadership and innovation: confirmed ability to drive traction and embed new thinking (and programs) within DIAGEO – can demonstrate understanding of how to use a network and work within the DIAGEO system, driving momentum behind your vision\nComfortable working in the unknown and ambiguous: groundbreaking new thinking and avenues for DIAGEO without feeling intimidated or lost. Clarity of thought and navigating ambiguity.\nPassion for driving value-creating opportunities, entrepreneurship, and start-ups: The desired candidate will be a self-starter who feels empowered by space and freedom and helps drive innovation. They will demonstrate a strong passion for the start-up world including understanding of the key trends and happenings.\nQualifications and Experience Required\nBachelor’s degree with strong academic record, MBA preferred\nPrevious experience within the Beverage Alcohol industry or CPG-focused venture capital, private equity or corporate development a plus\nDesirable to have experience working with early-stage businesses/entrepreneurs\nStrong commercial, marketing, and financial competence, and critical thinking capabilities\nExcellent project management skills working with cross-functional teams and proven experience of establishing credibility, influence and working at senior management levels\nSelf-starter, high energy, delivers against goals with minimal direct supervision\nClear and succinct communicator, both culturally aware and adaptable\nPassionate about the Spirits Industry and the Venture Capital space\nCelebrating our inclusive and diverse culture is core to Diageo’s purpose of “celebrating life every day everywhere”. This purpose is, in itself, inclusive in nature, as it values everybody irrespective of background, disability, religion, gender identity, sexuality or ethnicity.\nWe know that for Diageo to succeed and realize its ambition, we depend on having diverse talent with a range of backgrounds, skills and capabilities in each of the 180 countries in which we operate and to reflect our broad consumer base. We view diversity as one of the key enablers that helps our business to grow and our values, purpose and standards set the conditions for us to respect the unique contribution each person brings.\nSalary Range:\nMinimum Salary:\n$143771.25\nMaximum Salary:\n$239618.75\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US based employees are eligible for healthcare benefits, retirement benefits, short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.\nWorker Type :\nRegular\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2023-01-18-08:00\nSalary Range:\nMinimum Salary:\n$143771.25\nMaximum Salary:\n$239618.75\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US-based employees are eligible for healthcare benefits, retirement benefits , short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.Show more Report"}, {"company": "", "job": "change analyst", "city": "Jerusalem", "date": "24d", "rating": "", "link": "", "description": ""}, {"company": "Novartis", "job": "Medical Science Liaison (MSL)", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=0000018626f0a719b1ce72618ec04fa1&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9b2eef7f&cb=1676381906417&jobListingId=1008395031198&jrtk=3-1-1gp82bpdq2p8l001-1gojf19qs2a4s000-aced7a5829509a6e-", "description": "110,000 professionals working together to improve patient’s life and you can be one of them. As Novartis MSL you will be responsible for scientifically engaging, collaborating and aligning with a broad range of external stakeholders to co-create value, address identified patient needs and ultimately change the practice of medicine for better patient access and outcomes. Up for the challenge?\n\nYour responsibilities include, but are not limited to:\n\nBe a strategic internal partner, gather and leverage insights for an impactful contribution to Patient Journey mapping, launch excellence roadmap, integrated evidence generation plans, integrated product strategy and subsequently the medical strategyUtilize knowledge of assigned therapeutic area and Novartis compounds to serve as the Medical, Clinical and Scientific expert to field matrix colleagues\nIdentify data gaps, data generation opportunities (including RWE and implementation science, precision medicine), and key unmet needs and opportunities to help improve patient access and outcomesEnsure appropriate identification and mapping of external stakeholders, aligned to the medical strategy, and in collaboration with other Novartis colleagues. Able to create personalized, flexible engagement strategies and plans, leveraging multiple channels and tailored content to meet the changing needs of external stakeholdersPersonalize and expand external stakeholder engagement beyond Healthcare Professionals. Support and contribute to innovative partnership models for shared ownership in transforming clinical practice\nApply foundational impactful Scientific Engagement principles in stakeholder interactions in alignment with medical strategy and portfolio/pipeline prioritization.\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\n\nPost-graduate degree in health/life sciences- Doctoral degree (PharmD, PhD, MD, DMD)Fluent Hebrew and English – both languages required on proficiency levelActs with credibility and clarity of purpose to build and maintain effective and collaborative relationshipsWorking knowledge of the Healthcare System and research procedures as well as the guidelines relevant to the pharmaceutical industryExperience in a medical function (2-3 years preferred) in at least one therapeutic area.Capable of self-directed learning and having a growth mindsetExcellent communication, interpersonal, and influencing skills, with the ability to communicate effectively to a variety of audiences\nWhy consider Novartis?\n\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\n\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do at Novartis!\n\nCommitment to Diversity & Inclusion:\n\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\n\n\nJoin our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/network\nDivision\nPHARMA\nBusiness Unit\nREGION EUROPE PHARMA\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nResearch & Development\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "Warman O'Brien", "job": "Clinical Data Manager", "city": "Jerusalem", "date": "30d+", "rating": "5.0", "link": "", "description": "Who are they?Be a part of one of the world’s largest healthcare data science providers. This award winning Global CRO who specialise in using artificial intelligence and machine learning are currently running trials for some of the world’s biggest pharma companies. This trailblazing company provides industry-leading training, a clear and fast promotion cycle and a great benefits package to allow for a healthy work-life balance.What will you do?Using your managerial expertise, you will provide end-to-end delivery of data management services for single and multi-service projects, ensuring quality deliverables on time and within a budget, to customer satisfaction.You will provide comprehensive data management products expertise to a Clinical Data Management (CDM) team to provide high quality data management products that meets customer needs.Using your leadership experience, you will direct the team in project planning, execution and close-out, financial management, communications and milestone deliverables.You will fulfil comply with Good Clinical Practices (GCPs), applicable regulatory guidelines, SOPs, policies, and, where available, CDM guidance documents.What do you need?Bachelor’s Degree or educational equivalent, in health, clinical, biological or mathematical science – or a related field.A minimum of 5 years’ Clinical Data Management experience.Ideally 3+ years as a Clinical Data Management project lead or equivalent.What do you get in return?Up to £65,000 plus market leading yearly bonus.Industry-leading training and support to help your professional development.Clear and frequent career progression opportunities.Great benefits, including pension contributions, private health care and dental.Opportunities to work with some of the top people in their field with access to all the technological advancements they employ.Fully remote role.Applications for this role are ending soon, apply now with your CV to avoid missing out.Job Types: Full-time, PermanentSalary: 228,236.00₪ - 269,733.00₪ per yearShow more Report"}, {"company": "Merck KGaA Darmstadt Germany", "job": "QC technicion", "city": "Jerusalem", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Pulsenmore", "job": "Director of Marketing Communications", "city": "Ramat Gan", "date": "30d+", "rating": "", "link": "", "description": ""}], [{"company": "Edwards Lifesciences", "job": "Research Engineer", "city": "Israel", "date": "24h", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=201&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c2ffb0b&cb=1676381914982&jobListingId=1008452345369&jrtk=3-1-1gp82c1oljfmv801-1gojf1vc2ihnd800-365a398526f380b8-", "description": "Conduct ad-hoc research projects, involving planning, executing, and analyzing the results. Execution involves designing tests and working hands-on in the lab.\nThe job necessitates high analytical skills, as well as good technical skills.\nAbility to systematically work on different projects at the same time.\nProvide design inputs to existing or new products, based on the results of the Research work\nWrite technical reports based on multiple testing.\nCollaborate with different functions within the organization, both technical and cross functional.\nCreate working plans and manage resources to support Research activities.\n\nRequired Education/Skills:\nBachelor’s degree in Biomedical\\mechanical engineering\nHigh self-learning ability\nStrong execution, communication, and interpersonal relationship\nTechnical oriented skills\nBasic understanding of statistical techniques\nFluent English both oral and written\n\nRequired Experience:\n1-4 years of experience in medical device\nPreferred experience with cardiovascular industry\nKnowledge and understanding of imaging modalities as CT, Fluoroscopy and echocardiography – Advantage\nPrograming experience in Python and MATLAB - advantage\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Jellyfish", "job": "Paid Social Manager", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=202&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a9f73d89&cb=1676381916700&jobListingId=1008420809920&jrtk=3-1-1gp82c3epkhrt801-1gojf1vc2ihnd800-bb5b8dc889f4da49-", "description": "Company Description\nJellyfish is your digital partner. We support and drive digital transformation by providing the right technology, strategy and training.\nWith offices across the globe, we are focused on increasing our network, client base and digital services to the biggest brands on the planet.\nWe are ‘One Jellyfish’, we know how important it is not just to have the best people in the world working with us, but to also recognize and reward this talent. What’s stopping you from joining our award winning team?\n\nJob Description\nWe are looking for a self-motivated individual with high levels of energy to join our team as a Paid Social Manager. Our Paid Social Managers are responsible for the managing, executing and delivering clientʼs paid social strategy and efficient day to day management of assigned client accounts, focusing on delivering performance against agreed KPIs.\nThe ideal candidate will be responsible for planning, executing, optimising and reporting on best-in-class paid social media campaigns for our clients through available social media marketing platforms (e.g. Facebook, Twitter, Instagram, SnapChat, etc) working closely with the Client Services team to communicate campaign strategy, progress and results.\nThe successful candidate will have a high level of attention to detail, be data-driven, numerate and an articulate presenter.\nResponsibilities include:\nCampaign Management\nPlanning paid social campaigns across multiple-social channels.\nOptimising and executing Jellyfishʼs methodologies against paid social plans utilising native platforms, third party and internal tools, as required to deliver efficient and profitable Paid Social campaigns.\nCritically analysing the performance of campaigns, identifying opportunities to optimise, facilitating changes to hit and exceed client expectations and KPIs.\nProject managing all activity and processes required to proficiently run and create campaigns.\nProducing high quality client-facing reports, studies and presentations to Jellyfish brand standards including measuring forecasts vs actual and clearly articulating rationale for optimisation methodologies throughout campaigns..\nMaintaining an in depth understanding of Jellyfishʼs marketplace and the social landscape to ensure delivery of best-in-class campaigns.\nManaging day-to-day relationships with account teams, clients, advertising partners and colleagues\nTraining & Upskilling\nUpskill other members of the team, where required, on best practice paid social campaign execution.\nSupport the wider team to improve their understanding of paid social.\nShare best practice and knowledge with wider Jellyfish Group via lunch and learns, or other learning situations.\nBest Practice & Offering development:\nContribute to the creation of up-to date processes and frameworks to facilitate the growing use of paid social, when required.\nPro-actively work in partnership with directors and heads of other departments and divisions to ensure adherence to best practice in all areas as well as following set processes to deliver campaigns On Time In Full.\nCollaborate with the Data, Strategy and Planning teams to understand how paid social contributes to multi-service campaign success\nCollaborate and support the delivery of paid social media measurement frameworks and KPIs.\nDevelop the paid social offering to include the latest tools, technology and techniques, when required.\nWork with data suppliers and other 3rd party data experts to deliver clear data visualisations of reports for clients.\nEnsure all work is QAʼd appropriately and to the highest standards.\n\nQualifications\nKnowledge & Experience Requirements\nAn in-depth knowledge of the technologies and processes involved in running Paid Social campaigns\nKnowledge & experience of using Facebook Ads Manager and Twitter Ads Manager would be advantageous\nFacebook Blueprint certified; Google Advertising Fundamentals Exam - would be a plus\nA good understanding of Google analytics and other web analytics packages\nAdvanced knowledge of Microsoft Excel and PowerPoint.\n\nAdditional Information\n\nFlexible working from home policy\nFlexible working hours\nAnnual pay increase on your Jellyfish anniversary\nAnnual bonus\nA flat structure that supports you taking charge of your own career development!\nPrivate Healthcare\nAnd more\nEqual Opportunity Employer: Jellyfish is committed to making adjustments in our recruitment process to enable you to demonstrate your full potential. Should you require reasonable accommodation, please fill out the form here.\nFlexible working\nAnnual Bonus\nAnniversary Increase\nTraining and Development\nLife Assurance\nEmployee Assistance Programme - CounselingShow more Report"}, {"company": "Novartis", "job": "Medical Advisor", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.0", "link": "", "description": "110,000 professionals working together to improve patient’s life and you can be one of them. As Novartis Medical Advisor you will be responsible for optimization of patient access and outcomes by providing up-to-date compound and disease area medical expertise, acting as a key expert in the relevant therapeutic area assigned, and leading across functions to address external and internal stakeholder needs. Up for the challenge?\n\nYour responsibilities include, but are not limited to:\n\nPrepares and drives the execution of the local Medical Affairs strategic plans aligned and in collaboration with product MSLs and other functions (i.e., marketing, market access, RA). This plan should be built based on local stakeholder needs and in line with the Franchise and medical strategies as outlined in the Integrated Product Strategy (IPS) Plans.\nLead early identification of strategic drivers, elaboration of patient journey, positioning, target population, the wider stakeholder population mapping and segmentation.Identifies opportunities for joint value creation through engagement with the key scientific leaders and other partners in the healthcare systems including Patients and Patient Associations to co-design strategies and studies, advocating in the assigned therapeutic area. Utilizes Omnichannel where possible.Gathers and internally shares relevant captured insights (advisory boards, events etc.), to shape the disease area strategy.Accountable to Co-developing integrated evidence plans and ensuring local execution of these plans beginning at DDP/POC and throughout the lifecycle in partnership with Global Drug Development (GDD), functional partners, healthcare systems, patients and other external stakeholders.Provides key medical expertise on the company’s pipeline programs, disease areas and approved brands. Performs comprehensive evaluation of related products passing DDP/FDP to enable effective cross-functional New Product Planning for the Country. Provide informed local input to Global strategies, protocols, etc. if assigned early product portfolio.\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\n\nPost-graduate degree in health/life sciences- Doctoral degree (PharmD, PhD, MD, DMD)Fluent Hebrew and English – both languages required on proficiency levelPharmaceutical industry experience\nSignificant clinical and research background GCPStrong medical and scientific bases and agility to transverse the diseases’ arena\nWhy consider Novartis?\n\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\n\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do at Novartis!\n\nCommitment to Diversity & Inclusion:\n\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\n\n\nJoin our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/network\nDivision\nPHARMA\nBusiness Unit\nREGION EUROPE PHARMA\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nResearch & Development\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "Sandoz", "job": "QA Manager Sandoz", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "1996! In this year Sandoz initiated the world’s first biosimilar development program. Over 20 years of experience in biosimilar development have equipped us with extensive knowledge and world-class expertise and capabilities in the development, manufacturing, and commercialization of biosimilar medicines to the healthcare community and patients worldwide. This opportunity is waiting for you to contribute to Sandoz success story toward the future. Join Sandoz Israel as the Quality Manager ensuring the local Quality System and Standard Operating Procedures are in place for all current Good Manufacturing Practice /Good documentation practice (cGMP/GDP) and ensuring compliance with regulations, through trainings and internal audits.\n\nYour Key Responsibilities:\nYour responsibilities include, but not limited to:\n\nEnsure that a local Quality System and Standard Operating Procedures are in place for all cGMP/GDP (current Good Manufacturing Practice /Good documentation practice) related activities and that compliance with cGMP/GDP regulations is maintained through training and internal auditsCoordinate implementation of quality system and procedures for the implementation of Novartis Quality Manual and quality agreements\nEnsure that change requests, are managed according to Novartis Standard Operating Procedures from receipt, through to the implementation and closure\nConduct Good Practice monitoring on all sections, conduct QA investigation for non-compliance, follow up on corrective actions\nEnsure that all aspects of the handling and distribution of pharmaceutical products in the country comply with the requirements of the Novartis Quality Manual and Policies and meet all relevant cGMP (current Good Manufacturing Practice) regulatory and legislative requirements\nEnsure that coordinated contact is maintained with the Regulatory Authorities, the local partners (suppliers, third parties, licensees, and distributors) and Global Quality Assurance\nEnsure that all incoming drug products are inspected prior to their release to the market in accordance with the current in place procedures, registered specifications and local/ international regulationsManage complaints, deviations, recalls, counterfeits and product tampering according to the Novartis Corporate Quality Manual and local written procedures\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse team’s representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\nDegree in Pharmacy\nQP certification or minimum of 2 years of experience from Pharmaceutical Industry / plantKnowledge of Corrective and Preventive Actions (CAPA), Good Documentation Practice, Quality Management and Quality AssuranceHebrew and English – both on proficiency level, Russian – advantageStrong digital abilities, Resilience and assertiveness\n\nDesirable Requirements:\nHigh level of energies, proactiveness, Team playerExperience from a multi-national company and cross functional interaction\n\n\nWhy consider Sandoz?\n500 million patients were touched by Sandoz generic and biosimilar medicines in 2020 and while we’re proud of this, we know there is more we could do to continue to help pioneer access to medicines for people around the world.\n\nHow will we do this? We believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do here at Sandoz!\n\n\nImagine what you could do at Sandoz!\n\n\nCommitment to Diversity & Inclusion:\nSandoz, a Novartis company, embraces diversity, equal opportunity, and inclusion. We are committed to building diverse teams, representative of the patients and communities we serve, and we strive to create an inclusive workplace that cultivates bold innovation through collaboration and empowers our people to unleash their full potential.\nSandoz are an equal opportunities employer and welcome applications from all suitably qualified persons.\n\nJoin our Novartis Group Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/network\n\nWe are Sandoz, a Novartis Division. Join us and help reimagine medicine.\nDivision\nSANDOZ\nBusiness Unit\nCOMMERCIAL OPS EUROPE SZ\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nQuality\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "Medisafe", "job": "Director of Program Operations", "city": "Haifa", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=205&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_625d7438&cb=1676381920662&jobListingId=1008303760927&jrtk=3-1-1gp82c78fk27m801-1gojf1vc2ihnd800-84642f0381fc31e7-", "description": "About The Role\nMedisafe is a market leader in digital patient support services, using AI and personalization tools to help patients cope with complex challenges. We are looking for a Director of Program operations to join a dynamic and fast-paced environment and work with cross-functional teams to design programs that deliver the company’s vision and strategy and meet our client’s goals.\n\nBy implementing Medisafe’s technology and best practices, the team you lead will be able to influence patients’ lives and provide them with the best support throughout their journey.\n\nAs a Director of Program Operations in Medisafe, you will ensure every program will be delivered successfully and add the highest possible value to the organization. You will be responsible for creating stable and robust infrastructure, defining processes and workflows, improving and scaling up the efficiency of processes, and ensuring the success of each program led by your team.\n\n\nResponsibilities:\n\nRecruit, train, manage and develop a team to become experienced specialists\nProvides direction and integrative coordination in the planning, development, and implementation.\nProvide clear and measurable objectives for the team and the individuals. Supervise all programs and project managers involved to provide feedback and resolve complex problems\nEnsure team members are properly trained to allow optimum performance.\nEffectively develop and mentor team to build broad and deep bench strength in the skills needed to meet succession needs and eliminate key man risks. Provide real-time feedback on performance to direct reports\nEstablishes and implements short- and long-range goals, objectives, policies, and operating procedures; monitors and evaluates operational effectiveness and effects changes required for improvement.\nDeliver ways to enhance the efficiency and productivity of procedures and people.\nIdentifies, recommends, and implements new processes, technologies, and systems to improve and streamline organizational processes and use of resources and materials.\nDeep understanding and identification of partners’ business needs and market trends.\nSeeking and acting upon feedback from partners\nServes as a principal point of collaboration, leadership, and expertise to both internal and external stakeholders on professional and operational matters pertaining to successful execution of programs(Leadership & collaboration) Collaborate with leaders on scheduling resources to promote career development, support execution and fill resourcing needs while ensuring balance of assignments across teams in order to meet program goals.\n\n\nRequirements:\n\n3-4 years of relevant work experience in a managerial position (product or program management) in the healthcare space – a must\nExperience in team leading: supervising, training, mentoring, performance evaluation techniques, and key metrics\nProactive forward thinking – creating new solutions and tools for process & program improvement\nAbility to develop, plan, and implement short- and long-range goals.\nSkill in examining and re-engineering operations and procedures, formulating policy, and developing and implementing new strategies and procedures\nRobust Project Management expertise, with familiarity with techniques and methods, working on numerous concurrent projects. Meeting aggressive deadlines while managing risks and, maintaining an eye for detail and a deep commitment to customer service.\nData-driven, analytical mindset with great problem-solving abilities\nExcellent organizational and leadership skills\nExcellent client-facing skills with great verbal skills including the ability to explain complex processes to non-subject matter experts over client meetings and presentations\nPassionate and knowledgeable about technology and digital solutions\nAdvanced verbal and written communication skills in English\nExperience in startup culture – an advantage\nFamiliarity with Pharmaceutical regulation processes and terminology\nHave a strong sense of empathy with the ability to understand patients/clients needs\n\nBenefits:\nYou’ll be joining a growing company with offices in Boston, London, and Haifa and collaborating with world-class Product Managers, Engineers, Marketers, and Designers in a fast-paced, rapidly advancing Health space.\n\nThis is a full-time position, immediately available in our downtown Haifa office (a walking distance from the train station), and we’re working hybrid.Show more Report"}, {"company": "Edwards Lifesciences", "job": "Application Engineer - Student Temporary position", "city": "Israel", "date": "19d", "rating": "4.0", "link": "", "description": ""}, {"company": "Diageo", "job": "Manager, Field RGM – Strategic Accounts", "city": "Central", "date": "18d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=207&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0acd9293&cb=1676381923569&jobListingId=1008414623788&jrtk=3-1-1gp82ca5djcbj801-1gojf1vc2ihnd800-c0096a3e99801582-", "description": "Job Description :\nAre you looking to play a pivotal role in attracting the next generation of best-in-class talent for one of the worlds most respected fast moving CPG’s?\nDiageo is a global leader in beverage alcohol with an outstanding collection of brands including Johnnie Walker, Crown Royal, Bulleit and Buchanan's whiskies, Smirnoff, Cîroc and Ketel One vodkas, Captain Morgan, Baileys, Don Julio, Tanqueray and Guinness.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. It is central to our purpose to celebrate life, every day, everywhere.\nWe are a global leader in beverage alcohol with an outstanding collection of brands across spirits and beer! We produce an assortment of over 200 amazing brands – old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world!\nDiageo is listed on both the New York Stock Exchange (DEO) and the London Stock Exchange (DGE). For more information about Diageo, our people, our brands, and performance, visit us at www.diageo.com. Visit Diageo's global responsible drinking resource, www.DRINKiQ.com, for information, initiatives, and ways to share standard methodology.\nManager Field RGM – Strategic Accounts\nKey Outputs/Deliverables\nEnsures the DIAGEO US Spirits pricing agenda and related NRM processes run efficiently in order for Diageo to optimize Diageo NA NSV / GP growth\nIdentifies key market level RGM opportunities\nImproves trade spend efficiencies in order to drive net revenue and profitability for DIAGEO\nDrives internal and external organizational capabilities, processes, and tools in the NRM space in order to accelerate data insights into commercial action\nPerformance Management\nDeliver RGM value through price and mix that is ahead of the industry\nLeads the development of annual discount plans, and promotion calendar\nDrives Strategic Account level RGM Optimization Missions\nImplement price direction for both headline price and promotional guidelines in strategic accounts\nFacilitate monthly strategic account reviews\nReview and approve gap close programs and communicate impact to central finance\nEnsure team is using system based M&E tool to make data backed decisions in gap close process as well consistent post M&E reviews\nLeverage TRAX, Nielsen, and NABCA data to inform annual price planning process as well as retailer profitability\nWorks with distributor and central Rev Mgmt team to identify pricing opportunities\nLeads development, maintenance and communication of price changes and promotional calendars.\nAnalytics\nCreates insightful and practical monthly analysis of pricing results\nReviews trends and competitive activity throughout the year to identify additional suggested pricing opportunities or risks\nDrives deal level analytics, Diageo / Distributor suggested margin analysis, conduct project based analytics and scenario planning to make informed suggested pricing recommendations\nResolves distributor inquiries on pricing process/data/reporting analytics\nSystems\nPrice Model Administration - maintain frontline price changes, support calendar, suggested price models and local pricing data (taxes, freight, etc) – multiple systems: VIP/DO, RM/Anaplan, MSBI, AIP/Qlik\nExperience:\nUndergraduate required; MBA preferred\nMust have 3-5 years of cross functional commercial experience, with strong analytical and technical skills.\nProven track record of being able to manage and influence a wide array of senior leaders\nHave sophisticated skills in analytics and data insights. Must understand and apply data analysis to drive effective portfolio strategies and business performance. Must know how to use and implement metrics to measure performance\nWorker Type :\nRegular\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2023-01-18-08:00\nSalary Range:\nMinimum Salary:\n$105105\nMaximum Salary:\n$175175\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US-based employees are eligible for healthcare benefits, retirement benefits , short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.Show more Report"}, {"company": "Roche", "job": "Field Application Specialist", "city": "Hod HaSharon", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=208&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_99c93d63&cb=1676381925267&jobListingId=1008106162098&jrtk=3-1-1gp82cbp7kcm2801-1gojf1vc2ihnd800-3607ae0a8f3e0eb8-", "description": "The Position\nWho we are:\nRoche is ranked among the world's foremost corporations providing innovative healthcare solutions, continuously investing in medical research and development.\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.\nThe Position:\nThe Field Application Specialist provides after-sales support to customers on Roche Diagnostics Product Portfolio. The application support provided on the phone, by email or during site visit and is in the form of troubleshooting assistance.\nAs a member of our Applications Specialist team, you will be primarily responsible for providing application support and expertise to existing and potential customers. You will install, train and provide troubleshooting assistance for Roche’s Core Lab instrumentation and reagent systems.\nYou will work in close collaboration with the sales team to assist in driving sales.\nAccountabilities:\nApplication Support:\nProvide support to customers when any application issues arise in a prompt and timely fashion, Perform or assist with software upgrades of customer instrument base.\nProvide post-sales support to the customer to aid in establishing new parameters and answer technical inquiries.\nInstall & configure instruments and related reagents\nPerform customer training\nMaintain and develop customer facing documentation for support and training\nInstall applications on Roche platforms according to Roche guidelines / procedures;\nRun correlation studies and validations in coordination with the customer if/as required;\nEstablish a plan to visit and/or communicate with each assigned customer on a cycle or frequency matching the customer’s needs and support requirements and Roche’s business priorities.\nSales Assist:\nPre-sales support in the form of customer tailored shows and/or demonstrating to customers\nPresent Roche technical and application solutions to customers during demos\nSupport sales through technical knowledge and with the RFPs' technical details as needed.\nWho you are:\nBachelor's Degree in Science, Applied Science or similar.\nMinimum of 3 years of relevant experience as Application Specialist in the Diagnostics field, preferably in the Core lab domain\nThorough background in Biology /Chemistry\nAbility to analyze and resolve situations while maintaining a high-level of customer service\nPossess and apply excellent troubleshooting skills\nStrong presentation and communication skills\nAble to work with minimal supervision\nMay be required to be available for standby work (after hours) occasionally\nWho we are\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.Show more Report"}, {"company": "Diageo", "job": "National & Strategic Accounts Sales Analytics Manager", "city": "Central", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Edwards Lifesciences", "job": "Reception and administration Representative", "city": "Israel", "date": "25d", "rating": "4.0", "link": "", "description": ""}, {"company": "Edwards Lifesciences", "job": "Senior Sales Specialist - Distributor Surgical", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=211&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b0d1ce16&cb=1676381928916&jobListingId=1008447723501&jrtk=3-1-1gp82cfaejca7801-1gojf1vc2ihnd800-b120728b73f7bd86-", "description": "Advise sales management on distributed sales customer information, market trends, and Edwards' historical sales data for development of strategies to achieve business development goals. Ensure validity of all distributed sales transactions and pricing.\n\nBe the primary contact with Israeli cardiac surgeons and hospital staff to ensure sales and promotion of the Surgical portfolio in collaboration with local distributor.\n\nKey Responsibilities:\n\nLead in analyzing customer pricing data, and developing and updating customer pricing data reports for provision to Distributors, in keeping with Distributor agreement\nAnalyze Distributor chargeback/rebate claims; negotiate and provide solutions to resolve discrepancies with Distributors\nLead in analyzing Distribution sales trends, develop findings, and propose solutions for sales management\nResolve complex Distributor issues and propose solutions to achieve desired sales results\nAssess and prioritize Distributor AR account issues in collaboration with Finance to allocate resources to address discrepancies\nConfirm accuracy of sales tracings and Distributor sales shipments\nWorks independently on complex projects and/or lines of work\n\nEducation and Experience:\nBachelor's Degree in in related field of study, previous commercial background, business analysis experience including, spreadsheets, database management systems, and word processing Required\n\nAdditional Skills:\n\nProven expertise in MS Office Suite including Word, PowerPoint, Access, and Excel; Qlik experience preferred\nExcellent written and verbal communication skills and interpersonal relationship skills including consultative and relationship management skills\nAbility to quantify abstract conceptual data into concrete analysis\nAdhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control\nExperience with distribution contracts preferred\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Merck KGaA Darmstadt Germany", "job": "QA Validation Specialist", "city": "Jerusalem", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Nym Health", "job": "Medical Developer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "3.0", "link": "", "description": "At Nym, we’re passionate about simplifying healthcare by automating the accurate interpretation of clinical language.\nOur interdisciplinary team has developed an innovative technology that can understand clinical language and provides an entirely new way of analyzing and decoding medical records into clear, concise, and actionable information. This ultimately ensures clinical and administrative teams can spend more time focused on patient care.\nAt Nym, the future is bright. Our engine currently processes over five million charts annually in more than 150 emergency department and urgent care settings across the US. We are backed by top-tier VCs and growing rapidly, with offices in NYC and Tel Aviv.\nCome join us!\nRole and Responsibilities\nWe are looking for a Medical Developer to be part of our Engineering Team. This role will report directly to Roee Kenett (Medical Director) and will be a key partner to:\nDevelop Nym’s medical knowledge and medical coding accuracy, while collaborating with software developers and linguists to create a robust and comprehensive clinical language understanding engine\nAssist in the onboarding process of new healthcare systems by reviewing and analyzing clinical data and medical coding guidelines\nPerform hands-on development of clinical language understanding software\nDesign and develop new clinical coding features\nRequirements:\n\nMedical Doctor Degree\nFluent in Hebrew and English\nTechnical proficiency - an advantage\nAvailability for full-time position\nPreferred Skills\nExperience with data analysis\nExperience and familiarity with the United States healthcare system\nExperience and proficiency with Python and SQL\nUSMLE Step 2 CK\nThe position is located in our Tel Aviv officeShow more Report"}, {"company": "Abbott Laboratories", "job": "Demand Planner", "city": "Tel Aviv-Yafo", "date": "18d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=214&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c51200df&cb=1676381933556&jobListingId=1008414751456&jrtk=3-1-1gp82cjsfp2mn801-1gojf1vc2ihnd800-84433da0140e7d96-", "description": "ABOUT ABBOTT\nAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.\nWORKING AT ABBOTT\nAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:\nCareer development with an international company where you can grow the career you dream of.\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.\nA fantastic range of benefits including competitive salaries and bonus potential, private healthcare.\nTHE OPPORTUNITY\nThis position is located in Tel Aviv, Israel.\nMAIN PURPOSE FOR ANI DEMAND PLANNER:\nManaging affiliate’s ANI product portfolios.\nTo ensure that the organization meets future demand to continue operating as efficiently and effectively as possible.\nAssuring product availability in accordance with DOH targets, maintain high level service and minimizing product write offs or destructions.\nCORE JOB RESPONSIBILITIES:\nLead projects related to affiliate inventory levels, supply initiatives and logistic activities.\nPlanning inventory flow to better manage product availability, analyzing statistical data, and generating forecasting solutions.\nPlanning Finished goods shipments from factories & global hubs.\nAddress demand-related issues in a timely and effective manner.\nProposing and implementing solutions to improve demand forecast accuracy.\nPlay an instrumental role in the affiliate Demand Review. Act as Affiliate S&OP Coordinator.\nSupport all affiliate functions: Regulatory, Marketing and finance department.\nDaily work in ERP, BI, SAP\nACCOUNTABILITY :\nAnalyze quantity and financial forecasts.\nReport of forecasts and inventory KPIs.\nDrive the Demand Review and S&OP meetings.\nFollow inventory level and improvement plans.\nFollow up on order preparations and fulfillment with distribution centers\nInitiate process improvements\nLead New projects implementation\nKPI Calculation\nQUALIFICATIONS:\nB.Sc. In Industrial Engineering or equivalent\nAt least 1-2 years of similar experience\nHigh data analysis skills, detailed oriented\nTeam Player\nExperienced in working in or with global corporation – an advantage\nWillingness for extensive work\nMulti tasking and ability to work with number of disciplines in parallel\nExperience with ERP systems & Microsoft Office\nExcel Expert\nEnglish proficiencyShow more Report"}, {"company": "Ciklum", "job": "Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": ""}, {"company": "Enovis", "job": "Design Quality Engineer", "city": "Central", "date": "12d", "rating": "3.5", "link": "", "description": ""}, {"company": "Haleon", "job": "Category Manager PH & MM Channels", "city": "Israel", "date": "25d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=217&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8c8cbc35&cb=1676381937607&jobListingId=1008400116213&jrtk=3-1-1gp82cnpvjopq801-1gojf1vc2ihnd800-87815d6cb1723dc5-", "description": "Job Description\nSite Name: Petach Tikvah\nPosted Date: Jan 11 2023\nHello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands – including Sensodyne, Panadol, Advil, Voltaren, Theraflu, Otrivin, and Centrum – through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.\nCategory Manager PH &MM Channels\nIn This Role You Will…\nAs Category Manager PH &MM Channels, you will be responsible to ensure strategic recommendations regarding category development opportunities, customer portfolio management, Customer CATMAN projects, planograms and visibility strategy for both MM and PH channels for the country under his responsibility\nIn This Role You Will…\nDevelop the visibility strategy\nbe responsible for driving in-depth category expertise, shopper & customer research projects\nhave active role in Core Assortment Strategy and portfolio strategy development partnering with Customer Marketing, marketing, sales and NRM\nleads strategic customer Category Management projects through relevant KAMs .\nbe a subject matter expert identifying gaps & opportunities and creating recommendations to sales for execution.\ncollaborate closely with GRI Category Management Lead, ComEx Team, cross functional teams at Haleon\nWhy You?\nQualifications:\nUniversity degree\nHebrew and English\nBackground in sales, marketing, customer marketing, analytics, or related field\nTeam Management experience\nPrevious sales experience\nOver the counter and/or fast moving consumer goods category experience\nExperience working directly with customers to deliver business plans\nStrong experience in leading strategic process and alignment, in a way that builds real buy-to ensure execution follows strategic alignment\nStrong analytical skills, solution orientation\nWhy Join Us?\nThe future of everyday health is changing. And we’re the people changing it. In front of us is an incredible opportunity to go beyond what any of us have done before. And make everyday health more achievable, more inclusive and more sustainable. For more and more people. So join us, as we build one of the world’s leading consumer healthcare companies. Join us to innovate our category-leading brands. To better understand people’s everyday health needs. To tackle the biggest barriers that stand in their way. To change individual and societal behavior. Join us to work with colleagues who share your restless energy. To explore your interests. To stretch yourself to do the best work of your career. And join us, as together we build a working experience that encourages us all to lead happier, healthier, more productive lives. The way we see it, every day is an opportunity for better. And we’re going all in to realize it.\nOpportunities For Growth\nNone of us should ever feel like we are standing still. Instead, we want Haleon to be a place where we feel like we are always progressing.\nImproving everyday health takes dedication. Energy. Effort. So, we look to reward your contribution with a benefits package that includes:\nA competitive base salary\nAnnual bonuses that reflect Haleon’s performance\nHealth and wellbeing programmes that take care of you physically and mentally\nPossibilities of development within the role and company’s structure\nRecognition programmes that reward incredible contributions\nHybrid@Haleon our philosophy to hybrid work – performance with choice\nDiversity, Equity, And Inclusion\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create an unmatched understanding of each other, and promotes fair and equitable outcomes for everyone.\nWe’re striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives.\nWe believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\nCare to join us. Find out what life at Haleon is really like www.haleon.com/careers/\n\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\n\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\n\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Show more Report"}, {"company": "Ciklum", "job": "Delivery Director", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f5dcf0e3&cb=1676381939316&jobListingId=1008373793450&jrtk=3-1-1gp82cpfgj472801-1gojf1vc2ihnd800-6232fdf0e0e9c96b-", "description": "Description\nCiklum is looking for a Delivery Director, to join our team full-time in Israel.\n\nWe are a leading global product engineering and digital services company that unites 4000+ seasoned professionals globally on various projects in healthcare, fintech, travel, sportswear, entertainment, and security. Ciklum delivers high-impact technology solutions to Fortune 500 and fast-growing organisations worldwide.\n\nAbout the role:\n\nAs a Delivery Director, you will be responsible for the oversight, leadership and delivery of multiple large, complex transformation engagements that make up one of Ciklum’s largest markets. The role is focused on supporting our commercial teams in developing winning agile transformation strategies to advise existing accounts and win new deals. The engagements consist of business, technology and operational change. Customer satisfaction, business growth and smooth delivery across numerous projects/programs is a core aspect of the role and potential candidates should be adept at balancing engagement outcomes and the broader goals for the client relationship.\n\nWe’re seeking experienced, high caliber industry leaders with a proven track record of successful delivery. Candidates must have a deep understanding of program and portfolio management principles, a strategic mindset and the natural ability to lead large teams. In addition, the candidate must have a deep understanding of the business culture in Israel and be able to bridge the gap between our clients and our global delivery organization, and to have accountability of the p&l for the portfolio.\n\n\nResponsibilities\nTaking accountability for the P&L of the portfolio, working closely with the commercial team to hit growth and GM targets for the portfolio\nDefining the objectives, delivery strategy and associated timelines for the portfolio, setting aspirational goals and milestones\nWorking with account teams (Delivery and Account Management) to agree a delivery methodology and ensuring it is implemented effectively with the appropriate controls and governance\nProviding regular progress updates to senior client stakeholders and the Ciklum Leadership, including the escalation of blocking issues and ongoing risk management\nDay to day management of a multidisciplinary team consisting of client staff, contractors, suppliers and Ciklum staff, including performance management where necessary\nDefinition of and adherence to the portfolio budget\nOngoing identification and implementation of efficiencies needed to improve quality and pace while reducing running costs\nEnsure all solutions and operations adhere to legal guidelines and internal policies\nOn-demand provide consulting/coaching/training for project team members (e.g. team leads, scrum masters, DMs, etc.)\nManaging and monitoring of gross margin and ongoing earned value analysis\nProvide proactive constructive input to the internal organization on services and solutions that should be considered for improvement and/or creation\nSupervise and mentor Delivery Management Team\nBe accountable for the Change and Risk management for the entire Customer’s project portfolios, including those managed by other project managers, balancing resources in line with overall delivery criticality\nLeading a global high caliber, motivated and professional program leadership team across all disciplines including business design, business change, technology and architecture, testing, release and live support\nRequirements\nThe ideal candidate will possess strong analytical skills, exceptional problem-solving skills, be highly organized and have excellent leadership skills\n8+ years of Agile Delivery / Project Management experience and strong commercial understanding, ideally within the Product Engineering and/or IT consulting industry\n3+ years of experience as a Program,, or Portfolio Director who has already successfully delivered programs with an annual budget in excess of $4-6+m and over 50-70+ team members\nExperience running full stack product engineering teams combining user research and DevOps to create products users love at pace\nDeep agile expertise, experience in scaling programs via SAFe, LeSS, Nexus etc\nStrong service/client-oriented attitude, focus on an outcome\nBusiness acumen with a strategic perspective\nAbility to make rapid informed decisions\nExcellent Knowledge of performance evaluation techniques and key metrics\nExperience in conducting training, coaching and mentoring a group of Delivery Managers\nAgile and/or PMI certification\nPersonal skills\nCompetencies\nInfluencing and negotiating with clients\nWorks collaboratively with clients to identify issues with delivery, opportunities beyond the existing engagement and works with clients to solve issues and grow the account\nProblem Solving\nIdentifies the root causes and effects of the problem, comes up with appropriate solutions, and executes on them\nDecision Making\nAsk the right questions. Analyzes information and makes data-driven decisions\nPersuading and Influencing\nPresents multiple arguments, considers feedback, adjusts language to the target audience\nCommitment to Excellence\nActively seeks new ways of working and continually improves productivity\nAdaptability\nThrives on ambiguity, handles multiple demands effectively, adapts to new situations with fresh ideas or innovative approaches\nIntegrity & Ethics\nMakes choices and consistently acts in a manner that displays integrity (following internal principles, morals, and values) and ethics (following external laws, rules, and norms)\nProactivity\nVoluntarily and proactively initiates the steps to identify and address existing and potential obstacles, issues, and opportunities; leads towards resolution by asking sensible questions\nComprehension & Communication\nArticulates and comprehends technical and business concepts, ideas, feelings, opinions and conclusions in a clear and effective manner\nWhat's in it for you\nPossibility to strategically influence the development of a large-scale international business\nJoin the leadership at one of the most successful and fastest growing regions in Ciklum.\nVariety of knowledge sharing, training and self-development opportunities\nCompetitive compensation package\nCiklum’s commitment to providing support to your professional growth within the organization\nWork closely with an contribute to the success of top Hi-Tech companies in the market\n\nBe bold, not bored!\n\nInterested already? We would love to get to know you! Submit your application. We can’t wait to see you at Ciklum.Show more Report"}, {"company": "MSD Animal Health Intelligence Technology Labs", "job": "Data Scientist", "city": "Netanya", "date": "30d+", "rating": "3.7", "link": "", "description": "Our Company is where we transform vision into reality. It's where ideas become technologies, and cutting-edge technologies become solutions for animal care and management.\nWe support farmers by providing real-time actionable information to help them manage their herds. It provides pet owners with smart devices and data that give them a better understanding of their pets’ activity and health needs, enriching relationships. It helps conservationists safeguard natural environments and wildlife.\nLeveraging decades of Technological Research & Development experience across many markets, technologies, and species, along with development environments and Quality Assurance procedures, we're always inventing new ways to look after the health and well-being of animals. Our decades of experience keep us ahead of the curve by leveraging advanced Technological Solutions from enhancing the precious bond between people and their pets, to advancing animal healthcare and wildlife preservation.\nAs a data scientist, you will help us discover insights from the vast amounts of data our systems collect.\nIn this role, you will utilize data mining techniques, perform statistical analyses, and will be building prediction models for the purpose of surfacing insights related to livestock and companion animal behavior.\nWe are looking for a highly analytical person, proficient in data analysis, mathematics, and statistics.\nYou will be working closely with our animal research scientists to gain a better understanding of the animals we monitor.\nResponsibilities:\nPerform data mining over our large cloud databasesRun statistical analyses of running experimentsBuild prediction models\nRequirements:\n\nB.Sc. or higher in biomedicine, statistics, applied mathematics, computer science or related discipline3+ years of experience as a Data ScientistExperience as a python developerProficient applied statistics skills, such as distributions, statistical testing, regression, etc.Strong Theoretical knowledge of Collaborative Filtering, k-Means, Spectral clusteringLinear-Algebra - a must (LS, PCA, SVD)Experience with SQLStrong programming skillsSelf-learnerTeam player\nAdvantages:M.Sc.Experience with integration of your solution to a production environmentShow more Report"}, {"company": "Vi", "job": "Marketing Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": ""}, {"company": "Diageo", "job": "2023 MBA Summer Internship, Marketing", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8e459bb4&cb=1676381943382&jobListingId=1008115081249&jrtk=3-1-1gp82cteujcbs801-1gojf1vc2ihnd800-9fd0c7582cfd434b-", "description": "Job Description :\nDiageo is a global leader in beverage alcohol with an outstanding collection of over 200 brands - old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world! Brands like Crown Royal, Ciroc, Johnnie Walker, Guinness, Tanqueray, Captain Morgan, Baileys, Smirnoff, Bulleit, Ketel One and Don Julio are at the very heart of what we do. Global or local, every one of our brands has a story - all have a unique purpose and role to play in creating enduring connections with people.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. This, as well as celebrating our inclusive and diverse culture, is core to our purpose of “celebrating life, every day, everywhere”!\nYOUR ROLE\nAs a 2023 summer intern, you will get first-hand experience with our work, our people, our values, and our culture. Interns are given real responsibilities and challenges with projects that have an immediate impact on the business. Throughout the summer, you are given multiple opportunities to interact with senior management through both their project work as well as informative and cultural events. All interns receive individual mentoring and training from their immediate manager, and the opportunity to show results. You are expected to perform to our high standards and are given the same kind of performance feedback we give our full-time employees.\nDuring the 10-week summer internship, you will be asked to immerse yourself in one of our key organizational business units and develop a business plan proposal that will get us a step closer in achieving our ambition.\nSample Marketing Projects from past internships\nDevelop an in-depth understanding of the Guinness Extra Stout (GES) consumer and develop a marketing plan to enhance the volume opportunity for GES\nDeliver a relationship marketing strategy for the Tanqueray portfolio.\nDevelop a revitalization plan for the iconic Seagram’s 7.\nBuild a strategy to double the volume of Smirnoff Ice in five years.\nLeverage sports and the multiverse to drive Captain Morgan growth to multicultural audiences\nKey Qualifications\nCurrently enrolled in an MBA program\nMarketing MBA interns typically have 2 to 5 years of work experience\nLeadership, with a particular focus on transformational and inspirational problem solvers\nCreativity\nCritical thinking\nAbility to work autonomously\nData analysis, synthesis, and interpretation\nStrong communication and presentation skills\nRelationship building\nSalary Range:\nMinimum Salary:\n$50.00/hour\nMaximum Salary:\n$50.00/hour\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US based employees are eligible for healthcare benefits, retirement benefits, short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the roles primary location.\nWorker Type :\nInternship (Fixed Term)\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2022-09-02-07:00Show more Report"}, {"company": "Sanofi", "job": "MSL Immunology Team", "city": "Netanya", "date": "27d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=222&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f2397ab&cb=1676381944534&jobListingId=1008395109197&jrtk=3-1-1gp82cukdjm5i801-1gojf1vc2ihnd800-fce730993a4d056a-", "description": "Job purpose\nMedical Science Liaisons (MSLs) engage with healthcare professionals, institutions and payers, in a non-promotional manner, to identify and address their needs. MSLs use their scientific expertise to communicate and form partnerships to deliver the medical strategy, capture actionable insights and ultimately improve patient pathways and outcomes.\nKey ResponsibilitiesTo build and develop enduring value-based trusted partnerships, through scientific engagement and exchange, with healthcare professionals and institutions in a rapidly evolving healthcare environmentTo engage proactively and reactively with healthcare professionals, payers and institutions.To execute the Country Medical Plan.To generate actionable and valuable insights and propose solutions.To create cross functional partnerships and collaborate with internal stakeholders.All MSLs comply with the local and corporate compliance frameworks for external and internal interactions and complete all global/local mandatory trainings.\nrequirements:\nMedical, pharmacy or post graduate level science degree\nFluency in spoken and written business English.\nAbility to effectively participate in multi-disciplinary teams in order to set and meet business goals and objectives.\nDemonstrates project management skills and effectively manages multiple competing priorities.\nUtilises appropriate time management strategies, to manage complex environment and motivate and guide team with the multiple skill levels.\nDemonstrates agility to identify critical tasks and resources necessary to achieve the desired objectives and ensure execution of strategies.\nHolds deep knowledge and understanding of local regulations and codes of practice for pharmaceutical industry, as they apply to the non-promotional activities of this role.\nHigh degree of knowledge of relevant healthcare systems, the evolving medical landscape, regulatory and payer environment, public health and industry trends to accurately identify key issues and develop strategies and plans.\nAt Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all.Show more Report"}, {"company": "AstraZeneca", "job": "KAM Oncology", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=223&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_79de53ad&cb=1676381946360&jobListingId=1008383383933&jrtk=3-1-1gp82d0dckcm7801-1gojf1vc2ihnd800-9b441606d8af13e4-", "description": "At AstraZeneca we turn ideas into life changing medicines. Working here means being entrepreneurial, flexible and thinking big and working together to make the impossible a reality.\nWe’re focused on the potential of science to address the unmet needs of patients around the world. We commit to those areas where we think we can really change the course of medicine and bring big new ideas to life. As Oncology KAM - Lung Cancer Team, you’ll play a pivotal role in channelling our scientific capabilities to make a positive impact on changing patients’ lives.\nAstraZeneca’s vision in Oncology is to help patients by redefining the cancer-treatment paradigm, with the aim of bringing new cancer medicines to patients. A broad pipeline of next generation medicines is focused principally on this disease areas - breast, ovarian, lung and haematological cancers. As well as other tumour types, these are being targeted through four key platforms - immunotherapy, the genetic drivers of cancer and resistance, DNA damage repair,\nand antibody drug conjugates, underpinned by personalized healthcare and biomarker technologies.\nMain Duties and Responsibilities\nYou will be responsible for selling, account management, deep understanding of patient’s journey maintaining and documenting all sales activities for the AstraZeneca Oncology portfolio of products to physicians in hospital settings and within a defined geographic territory.\nYou will be responsible for positioning AstraZeneca as a leader in Oncology commitment through development of long-term relationships with Key Customers and maintaining a high level of clinical expertise by consistently utilizing all available medical information resources.\nYou will also develop and implement clinical sales presentations to groups of healthcare personnel, as well as maximize key physician contact by networking within accounts and at all medical meetings.\nEssential Requirements\nBachelor’s degree (Biology/Life science etc)\nAt least four to six years as a Pharmaceutical Sales Representative\nExperience selling, and knowledge of Oncology products or diseases preferred\nHistory of building customer relationships, and goal achievement\nDemonstrated clinical selling skills and business acumen in complex selling environment\nFluent in English\nA valid driver’s license and safe driving record\nTeam player and flexibility\nNext Steps – Apply today!\nTo be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please fill free to share this posting with them.\nAstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country where the role is advertised.\nAstraZeneca embraces diversity and equality of opportunity. We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills. We believe that the more inclusive we are, the better our work will be. We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics. We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Show more Report"}, {"company": "AstraZeneca", "job": "Medical advisor- Neurology", "city": "Kfar Saba", "date": "17d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=224&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b5b4e1a9&cb=1676381948058&jobListingId=1008417324499&jrtk=3-1-1gp82d226i9gm801-1gojf1vc2ihnd800-66edd4c2927e30fa-", "description": "AstraZeneca is pushing the boundaries of science in order to deliver live-saving breakthrough medicines that will\nimprove patients’ lives. In that endeavour, Medical Affairs is a key strategic partner in shaping the optimal\nperformance of the AstraZeneca brands. The Medical Advisor is a core member of the brand team and\ntakes the medical lead in the therapeutic area (TA) through building scientific partnerships with Key External\nExperts (KEE) and other healthcare professionals through 1) strategic and educational medical affairs projects 2) engaging key external experts (KEE) in TA 3) providing key medical input to marketing-sales-market access\ninterface. 4) providing high quality up-to-date scientific and medical information to customers. These outputs are guaranteed through continuously building robust scientific and medical expertise on the therapeutic area, AstraZeneca products and its competitors in combination with a business acumen attitude and strong\ncommunication skills. The function is office based with a significant field presence. The Medical Advisor is a core member of the brand team, and has a key input into the medical therapeutic area strategy in partnership with the Medical manager.\nTypical Accountabilities\nConduct scientific exchange and collect customer insights:\nThe Medical Advisor typically interacts with key expert customers (defined target list) to build and develop strong strategic partnerships, driven by the science and the TA strategy. During these interactions that are non-promotional in nature and driven by a clear (customer) objective, customer insights are gained that feed back to the brand teams.\nWithin this broad task, the Medical Advisor will:\no Stay up-to-date in TA knowledge through active monitoring of the scientific literature, congress attendance and frequent interactions with Key External Experts (KEE)\no Discuss key data sets with experts in F2F contacts or group meetings in order to identify patient pathways, treatment realities in areas of medical need as guided by the TA strategy\no Build relationships with experts for advocacy development guided by the TA strategy\no Brief speakers for scientific events\no Respond to unsolicited requests for information about unapproved AstraZeneca products or unapproved uses of approved products\no Respond to medical queries via medical information platform\no Continuously improve or optimize impactful communication skills\no Interact with other Medical Advisors/MSLs and MAMs from other countries or other TAs in order to exchange best practice and further shape the role\nDeliver Key medical input into the brand strategy:\no Works in a strategic partnership with the Marketing and Market Access Department , providing key input in the local operational brand strategy by ensuring input of KEE, customer insights and competitive\no Core member of the x-functional brand team\no High quality scientific and medical input in the Brand Teams, Brand Building Framework, strategic brand projects and Campaigns\no Responsible for reviewing and approving of promotional material - solution-driven with thorough understanding of the promotional standards code (company and local)\no Develop and execute medical affairs projects (eg. build evidence) of the brand plan according to budget and timelines.\no Close follow up of the brand medical budget\no Coaches and Support MSLs to be best in class (scientific expertise, communication skills, business acumen) and ensure development and execution of the MSL Action Plans\nMaintain top-notch robust scientific and medical expertise:\no Keep track of relevant scientific peer-reviewed literature in the TA\no Attend international and national scientific and medical congresses in the TA\no Engage with KEE in the TA\no Assimilate customer insights obtained through different means\no Ensure excellent up-to-date scientific knowledge in product and therapeutic area of internal colleagues through knowledge updates, medical product training sessions\no Support Clinical operations in site selection\no The Medical Advisor role is also very active in enabling other functions through internal education and support based on their knowledge from the customers and the TA.\nManage scientific partnerships with KEE\no Manage Externally Sponsored Research\no Follow-up of grants/chairs/scientific sponsoring with Key External Experts\nGain input from and co-create projects with KEE\no organizes and leads meetings with KEE in order to gain their input on well-defined data sets or projects to advance the TA strategy\nBe compliant\no Successfully complete all training requirements\no Comply with all external regulations & internal policies\no Full understanding of AZ MSL guide, external interactions policy standards, (including, but not\nlimited to publications policy, congress policy,…)\nEducation, Qualifications, Skills and Experience\nEssential\nMedical or Pharmacist Degree or scientific\ndegree with PhD\nSignificant and robust experience with\nsearching, handling, assimilating, synthesizing,\nreporting and presenting scientific data in the\nhealth care sector\nNational mobility and flexibility (organisation\nand attendance of evening meetings)\nExcellent relational and communication skills.Takes initiative and proactive were needed\nwhile conscious of compliance and process\nrules in the company.\nPresentation skillsAbility to work effectively in cross-functional\nteams\nKnowledge of therapeutic area or the ability to\nacquire this knowledge rapidly. Broad\nemployability in other TAs is an asset.\nMedical integrity and ethical balanceFluent knowledge of Hebrew and English\n(verbal and written)\nTwo years experience in the pharmaceutical industry (medical role)\nDesirable\nExperience in and knowledge of\npharmaceutical medical and marketing\nprocesses\nExperience in moderation of meetings with\nHCPs\nBusiness AcumenProven Project management skillsBudget management experienceAbility to lead a teamExperience in moderation of meetings with\nHCPs\nAbility to work effectively in cross-functional\nteams\nTeam player attitudeShow more Report"}, {"company": "Lifetrack Medical Sytems", "job": "Solutions Engineer , EMEA", "city": "Jerusalem", "date": "7d", "rating": "", "link": "", "description": "Core ResponsibilitiesThe Solutions Engineering Lead, EMEA, reporting to the Director of Engineering, will have the following responsibilities:1. Help on business initiatives by supporting the Engineering and Customer Success teams.Assist on any technical matter regarding go-live of new customers with Customer Success teamAssist and collaborate with Customer Technical stakeholders on networking configurations and setup required for successful deployments and integrationsPerform regular preventive maintenance remotely or via onsite visits when requiredAddress, troubleshoot and fix any technical issues raised by customers or escalated by the Customer Support TeamCollaborate and engage with Customer Technical stakeholders and Technical Operation teams when required, conduct technical onboarding, integration implementation and testingAmenable on a scheduled working on site (customer facing work) and do customer onsite visitWilling to work on weekends with flexible schedule2. Oversee the IT requirements of the Lifetrack team.Ensure up-to-date cybersecurity practices are in place for the internal Lifetrack teamProactively be involved in hardware maintenance, software installations, and office networkCoach and train junior members on troubleshooting and maintenance best practices3. Other dutiesSupport other technical team members when required, such as Developers or the Quality Assurance TeamOther related tasks that may be assigned from time to time by the immediate superiorRequired Experience and Skills3-5 years of extensive experience in applications support [deployment, upgrade, troubleshoot, fix] in Linux/Unix based environment in a healthcare IT company.Good understanding of Linux configuration and troubleshooting.Experience in network configuration and troubleshootingShould have skills in Scripting/Coding in at least one languageExcellent written and verbal communication skills in English.Preferred but not required:Good understanding of DICOM and HL7.Experience with tools like Jenkins, TerraformWorking knowledge and experience with deploying solutions in AWS.Operating PrinciplesPurpose-Driven. Being a company with purpose, we also want to have people with purpose- people who are passionate about doing good doing well for a purpose greater than them.Do it right, from the start. We believe in starting from first principles and putting in the hard work now to avoid more work down the future. Our LifeSysTM platform, built from the ground up, reflects this.Radical transparency. We want our people to keep growing and improving. Receiving and giving feedback is critical for this. We expect people to be upfront, open and willing to learn from each other.Crush the bottlenecks. We are always focused on the critical path to achieving results. We expect our members to be relentlessly efficient in clearing the obstacles to this critical path.Going the extra mile. We like and reward team members who are not only good at their jobs, but will raise their hand and propose projects or solutions that help take Lifetrack forward.Job Type: Full-timeAbility to commute/relocate:Jerusalem, מחוז ירושלים: Reliably commute or planning to relocate before starting work (Required)Expected Start Date: 13/02/2023Show more Report"}, {"company": "MUSC", "job": "MUHA AI57 - Scribe Columbia Laurel Street (MCP)", "city": "Central", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=226&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9ffdc7df&cb=1676381958775&jobListingId=1008253230025&jrtk=3-1-1gp82dchuii0r801-1gojf1vc2ihnd800-0c00d80dd1bdf4aa-", "description": "Entity/Organization: MUSC - MCP\n\nHours per week: 40\n\nScheduled Work Hours/Shift: 8am-5pm\n\nPay Basis/FLSA: Hourly\n\nJob Summary/Purpose: The Scribe accompanies the physician or licensed provider into the exam room, documenting in the EMR all aspects of patient care to include, chief compliant, history of presenting illness, physical exam and patient plan as directed by the provider.\n\nMinimum Training and Education: High school diploma or equivalent. Experience in a healthcare environment. Excellent computer and typing skills. Strong verbal and written communication skills. Working knowledge of an electronic medical record application. Adept knowledge of medical terminology. High attention to detail.\n\nRequired Licensure, Certifications, Registrations:\n\nAdditional Duties and Responsibilities:\n\nPhysical Requirements: Continuous requirements are to perform job functions while standing, walking and sitting. Ability to bend at the waist, kneel, climb stairs, reach in all directions, fully use both hands and legs, possess good finger dexterity, perform repetitive motions with hands/wrists/elbows and shoulders, reach in all directions. Maintain 20/40 vision corrected, see and recognize objects close at hand and at a distance, work in a latex safe environment and work indoors. Frequently lift and/or carry objects weighing 20 lbs (+/-) unassisted. Lift from 36” to overhead 15 lbs. Infrequently work in dusty areas and confined/cramped spaces.Show more Report"}, {"company": "AstraZeneca", "job": "PM GU Oncology", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=227&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_dcf53fa4&cb=1676381960217&jobListingId=1008383383921&jrtk=3-1-1gp82ddv32pv5001-1gojf1vc2ihnd800-aed07b6be6daea30-", "description": "At AstraZeneca we turn ideas into life changing medicines. Working here means being entrepreneurial, thinking big and working together to make the impossible a reality. We’re focused on the potential of science to address the unmet needs of patients around the world. We commit to those areas where we\nthink we can really change the course of medicine and bring big new ideas to life. As Oncology Sales Representative - Women's Cancer Team, you’ll play a pivotal role in channelling our scientific capabilities to make a positive impact on changing patients’ lives.\nAstraZeneca’s vision in Oncology is to help patients by redefining the cancer-treatment paradigm. A broad pipeline of next-generation medicines is focused principally on this disease areas - breast, ovarian, lung and haematological cancers. As well as other tumour types, these are being targeted through\nfour key platforms - immunotherapy, the genetic drivers of cancer and resistance, DNA damage repair, and antibody drug conjugates, underpinned by personalized healthcare and biomarker technologies.\nMain Duties and Responsibilities:\nPreparing, updating and implementing respective plans (Brand Plans) including short and long-term market share/profitability targets of the brands in his/her area of responsibility.\nGathering and interpreting accurately customer segmentation, market analyses, SWOT, competitor analyses, other developments within the sector and the respective data to ensure that the brand plans will reach the targets, integrating these to the operational plans and keeping plans updated.\nLeading strategic decisions in order to improve business performance\nBeing an active & leading member of the Brand team including Sales Management, Medical Department, Regulatory Department, Diagnostic and Market Access functions ensuring that the brand strategy and plans are effectively developed and implemented.\nVisiting customers through planning dual visits with the product promotion team/medical team etc to ensure that possible problems are solved.\nBuilding and maintaining relations with Opinion Leaders.\nEssential Requirements:\nAt least 3 years of PM experience in pharma sector, from Oncology Therapy Area\nExperience with managing sales representatives\nStrategic thinker with ability to set product vision\nEffective at teamwork and have ability to lead a cross team\nHave a strong scientific knowledge\nHave the ability to create strong relationship with customers and leading KEEs.\nExcellent communication and presentation skills\nHave a strong analytical skills\nUniversity degree from a reputable university\nVery good command of written and spoken English\nNo restriction to travel frequently and must have a valid driving license\nNext Steps – Apply today!\nTo be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please fill free to share this posting with them.\nAstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country where the role is advertised.\nAstraZeneca embraces diversity and equality of opportunity. We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills. We believe that the more inclusive we are, the better our work will be. We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics. We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.Show more Report"}, {"company": "Abbott Laboratories", "job": "Marketing Director, Nutrition", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=228&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c0310445&cb=1676381961569&jobListingId=1008313454600&jrtk=3-1-1gp82df98gfrt801-1gojf1vc2ihnd800-c4833d5cd67f8392-", "description": "Marketing Director, Nutrition\nAbout Abbott\nAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.\nWorking at Abbott\nAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:\nCareer development with an international company where you can grow the career you dream of.\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.\nA fantastic range of benefits including competitive salaries and bonus potential, private healthcare.\nThe Opportunity\nThis position is located in Tel Aviv, Israel.\nRole purpose:\nTo create, implement, monitor and adjust long and short term marketing strategies that leads to building & strengthening superior brands - pediatric nutrition as well as medical nutrition - with full compliance to legal acts, World Health Organization (WHO), local regulations in Israel nutrition market within end users, care givers, decision makers & intermediaries (such as Health Care Professionals, Key Opinion Leaders, nurses, pharmacists, authorities, governmental bodies).\nWhat You’ll Do\nAchieve annual sales, market share and division margin plan and updates.\nFull responsibility of product marketing mix including price, package, positioning, placement and target audience\nFull understanding of end users, HCPs, nurses & KOLs\nMaximize the profitability of the products within scope of responsibility.\nSeek profitable business opportunities for new product/category/service launches.\nPlan, coordinate and implement launch processes.\nEnsure maximum internal and external alignment and excellence in execution with field teams, agencies and other related stakeholders to achieve and exceed expectations.\nPrepare, adjust and monitor marketing budget.\nActive member of management teams.\nEnsure compliance with relevant Acts, legal demands, ethical standards, Corporate Business and Safety Procedures and Abbott Code of Business Conduct.\nStrategic Focus:\nDevelop strong brands with sustainable growth and margin.\nSupport medical team for best in class execution on the field.\nFollow up industry trends and changes in health care reforms that will/may impact the business favorably or unfavorably and prepare contingency/mitigating plans.\nEstablish corporate partnerships (in licensing, co-marketing or/and co-promotion).\nLeadership:\nLead all marketing team & individuals (~10 direct and in-direct reports) to achieve business and personal goals.\nDevelop and maintain rapport with key opinion leaders in the market place to build/enhance credibility, identify trends, competitor activities and new opportunities.\nLead marketing to partner all relevant internal and external interfaces.\nRequired Qualifications\nMaster’s Degree preferably in Marketing / Business administration\nMinimum 10 years of marketing management experience, preferably from FMCG companies.\nFluency in Hebrew and English\nExperience in both traditional media and new media (digital execution)\nExcellent leadership skills\nApply Now\nFollow your career aspirations to Abbott for diverse opportunities with a company that can help you build your future and live your best life. Abbott is an Equal Opportunity Employer, committed to employee diversity.\nConnect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.Show more Report"}, {"company": "RecrutiX", "job": "Full-stack .NET Developer", "city": "Southern", "date": "3d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=229&ao=1110586&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b3a57d04&cb=1676381962951&jobListingId=1008447191044&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1gp82dgjqkuhv801-1gojf1vc2ihnd800-982a0afeb0c2eff3--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAHwcAGFGW2fSxpnWwe6lHLfRzmSUbJw2-l6qe_YtrYmK4d2p-xC9Yp88lme8vQRBsNyNqr06J-SG5sYPDRSV8-sIExR8lB690yNjPYRQjXANi8vLmgjyLyhEdWpmiXife6AlBWdWoCVQAej81YDGmLPgqF01PHux6tDepmUmtXr4WGEut0mzmOgY_rqBVfdn45SadfE--mT7oDv6tEEfkira13x0ti2gNj71XcHfKB3YN75hoQwOEPY-KeUHgXlu4Qx2g6ZYzO7vKi5pvvh8PIJAarypYKmfolj9FeH29yF1YOoid9QvshHwL88P0OGdunfD0jy8QgchZ10iraOnWG1NnOpoy5LcToLEaOGLQ_Px4osHUAzvgdyD06YnCJE9cJGf2vC3yPljUEnv-tk_bJrVBInuVmLPTxarTW7emT3eGm3aup8eQfIwdwuV8qEDGnL17K8EJPYQDawb9QFfxQhn7Lp-MA4kozFIK6a8kW-EuiwnsZAm8Gx9cqcZCuUVBL-4JLBJeVqZacAc3jxGckaVvy13tw9hr24K2gTw1sEF0JhvcwXLik9V6Nv3655Pd2676LGu6I578LnecJAmD1BhEjdDZQpyqaBfdrRydK3s1dtQmKfOSvs6CyCL89RCCYkTxk9LEXUeUr2f8IKIVz", "description": "We are an established US-based healthcare administration company looking for passionate and experienced Middle and Senior .NET full-stack developers to join our team. We are building B2B product from the ground up using a modern technology stack that makes a real difference for thousands of patients. - .NET experience (Framework, Core) - minimum 3 years (5 years for a Senior) - OOP, Patterns, Architecture principles (Middle – understand and apply, Senior – propose, review, coach other team members) - SOLID is not a foreign word for you - Able to understand and write complex and efficient SQL queries / LINQ expressions - Experience with Azure Cloud - Advanced level of English - Experience with at least one standard front-end framework - Git / Jira / CI-CD - REST - MSSQL - Entity Framework experience - Web Services - ASP .NET Core WebAPI - Multithreading/Asynchronous programmingShow more Report"}, {"company": "ICON", "job": "Clinical Research Associate", "city": "Israel", "date": "17d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=230&ao=1136043&s=58&guid=0000018626f0fd3cb129e19a038cef14&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2824a624&cb=1676381964132&jobListingId=1008419261071&jrtk=3-1-1gp82dhohi3b3801-1gojf1vc2ihnd800-29f54bd31dc3fb8b-", "description": "ICON plc is a world-leading healthcare intelligence and clinical research organisation. From molecule to medicine, we advance clinical research providing outsourced services to pharmaceutical, biotechnology, medical device and government and public health organisations. With our patients at the centre of all that we do, we help to accelerate the development of drugs and devices that save lives and improve quality of life. Our people are our greatest strength, are at the core of our culture, and the driving force behind our success. ICON people have a mission to succeed and a passion that ensures what we do, we do well.\nWorking fully embedded within one of our pharmaceutical clients, with the support of ICON right behind you, you’ll be at the heart of our client’s innovation.\nAs a CRA, you will be dedicated to one of our global Pharmaceutical clients. As one of the world’s leading and most trusted healthcare companies they place their core values and commitment to scientific innovation are at the heart of everything they do.\nClinical Research Associate is ultimately responsible for the successful management of investigator sites and monitoring activities for assigned clinical studies throughout the trial lifecycle. Key responsibilities include:\nFull ownership of investigator sites for assigned studies, with responsibility for the successful management of the site right through to close-out, in accordance with the clinical monitoring plan.Developing effective relationships with investigator site staff to ensure that key clinical metrics are met.Ensuring integrity of clinical data through an ability to sufficiently maintain site tracking records and working diligently to relevant guidelines.Passionate, innovative and committed.\nHere at ICON we want our employees to succeed and ensure that they are set up for this success through constant training, development and support. To enable success in this position you will have:\nPrior experience of at least 3 years working in investigator site management, including conducting monitoring visits, from either a pharmaceutical company or a CRO environment.A working knowledge of ICH-GCP guidelines and local and international regulatory requirements is essential.You will be educated to degree level in a life science discipline or be a licensed healthcare professional.Experience working on Oncology trials or complex studies would be an advantage for this role.\nYour health, your family, your career, your money — the things that matter to you, matter to us. The benefits of ICON just get better and better.\nBenefits of Working in ICON:\n\nOur success depends on the knowledge, capabilities and quality of our people. That’s why we are committed to developing our employees in a continuous learning culture – one where we challenge you with engaging work and where every experience adds to your professional development.\n\nAt ICON, our focus is to provide you with a comprehensive and competitive total reward package that comprises, not only an excellent level of base pay, but also a wide range of variable pay and recognition programs. In addition, our best in class employee benefits, supportive policies and wellbeing initiatives are tailored to support you and your family at all stages of your career - both now, and into the future.\n\nICON, including subsidiaries, is an equal opportunity and inclusive employer and is committed to providing a workplace free of discrimination and harassment. All qualified applicants will receive equal consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nIf, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please let us know.Show more Report"}], [{"company": "Pfizer", "job": "Health representative Hybrid - Central Israel", "city": "Herzliya", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=301&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_246fa419&cb=1676381966163&jobListingId=1008386446584&jrtk=3-1-1gp82djokkbmc801-1gojf2h73ghov800-08b8ea4adc950d90-", "description": "Health Representative Hybrid – Primary Care (Vaccines &Toviaz)\nArea: Central Israel\nRole Description\nThe Health Representative Hybrid is responsible for calling on (F2F and virtually) practicing physicians, hospitals, managed care (kupot) and other health-related organizations/personnel within an assigned territory.\nHe/She must provide the most current information pertaining to Pfizer Israel products and their approved indications in a manner which will ensure the appropriate use of these products and achieve the business potential of the territory. Accomplishment of these goals must comply with the terms and conditions outlined in the Representatives Pledge of Ethics, Pfizer's Policy on Business Conduct as well as sampling policies.\nResponsibilities\nInvest time and effort to achieve the established goals for the territory such as sales, market share, doctor calls, etc.\nListen and respond appropriately to customer needs that will ensure acceptance of or agreement with a \"call plan\" objective\nMaintain the required technical expertise including competitive product knowledge and computer capabilities\nEnsure clear concise and accurate communication of product information using proper medical terminology\nPlan and organize daily sales call activities to optimize the use of time and maximize the achievement of sales and market share objectives\nUse hybrid ways of communication with customers such as: F2F call, Virtual calls (VCC, Teams, Zoom ect.), RTEs, Journal Clubs, Webinars, as required and defined by the Category strategy\nPrepare, analyze and send sales/patients scanning monthly reports (as requested by Health Engagement Lead) in his/her territory\nWork with all relevant partners within the company to ensure “closing” of the loop. Collaborate with internal stakeholders such as medical advisor, MSLs, KAMs to ensure our customers are receiving the best tailored solution based on their needs\nRecognize changes in the work environment, develop and implement alternative plans to achieve objectives, modify call plan/business plan activities accordingly\nDemonstrate persistence to accomplish objectives despite disappointments and/or rejection of original efforts\nMake daily decisions based on logical and factual information after weighing alternatives and their consequences\nUse available resources and invest according to Business plan (all plans, and events must have clear objectives, be accurate, truthful and appropriate for their intended context)\nCreate and maintain a positive impression with customers\nProject a professional image as demonstrated by neat physical appearance and appropriate manner of speech\nMaintain timely communication with supervisor and other members of the sales team\nFully comply with the terms and conditions prescribed in the Sales Representatives\nQualifications\nA Bachelor's degree in Life Sciences (or similar diploma)\nAt least two years of sales and/or marketing experience within pharmaceutical, biotech, healthcare, or medical device industries Product or hospital sales experience – advantage\nLocal Market knowledge\nEasy adaptor of using new technologies tools - Core competencies: Planning and organizing work, engaging others through effective communication, Basic analytical skills, drive to achieve individual leadership and impact.\nHigh ability to read, analyze and interpret medical research\nExcellent communication skills in Hebrew and English\nGood Presentation skills, high digital abilities and learning agility\nDriving license – role requires travelling\nPurpose\nBreakthroughs that change patients' lives... At Pfizer we are a patient centric company, guided by our four values: courage, joy, equity and excellence. Our breakthrough culture lends itself to our dedication to transforming millions of lives.\nDigital Transformation Strategy\nOne bold way we are achieving our purpose is through our company wide digital transformation strategy. We are leading the way in adopting new data, modelling and automated solutions to further digitize and accelerate drug discovery and development with the aim of enhancing health outcomes and the patient experience.\nFlexibility\nWe aim to create a trusting, flexible workplace culture which encourages employees to achieve work life harmony, attracts talent and enables everyone to be their best working self. Let’s start the conversation!\nEqual Employment Opportunity\nWe believe that a diverse and inclusive workforce is crucial to building a successful business. As an employer, Pfizer is committed to celebrating this, in all its forms – allowing for us to be as diverse as the patients and communities we serve. Together, we continue to build a culture that encourages, supports and empowers our employees.\nSales\n#LI-PFEShow more Report"}, {"company": "Planned Parenthood Keystone", "job": "Medical Care Assistant - Warminster", "city": "Central", "date": "30d+", "rating": "3.5", "link": "", "description": "Planned Parenthood Keystone (PPKey) serves 37 counties in Pennsylvania, home to over half of Pennsylvania residents. We have administrative offices in the Lehigh Valley, Harrisburg, Warminster, and York. We operate 9 medical centers that serve over 22,000 patients annually and offer comprehensive sexuality education that reaches thousands of young adults.\nPlanned Parenthood Keystone is looking for individuals who are committed to supporting our shared goal of strengthening and enhancing our awareness and commitment to advancing the cause of racial & social justice in our organization.\nPlanned Parenthood Keystone is looking Full-time (35 hours/week), non-exempt, Medical Care Assistant based out of our Warminster Medical Center. A Medical Care Assistant is responsible for providing exceptional customer service to our patients while serving as a member of our dedicated team of medical center employees.\nYou will participate in a team approach to the delivery of quality reproductive healthcare in accordance with Planned Parenthood’s policies and medical protocols. The Medical Care Assistant must proficiently perform responsibilities in areas of medical center support operations: Front Desk, Patient Intake, and Clinical (Back Office).\nESSENTIAL FUNCTIONS:\nFront Desk Responsibilities:\nPerform general front desk duties including answering phones, scheduling appointments, and greeting & assisting patients/ visitors Follow the Planned Parenthood safety and security procedures for screening visitors\nServe as the first point of contact for maintaining efficient work flow.\nAlert appropriate staff to any issues that may affect patient flow\nAccurately register and update the patient record, verify income and program status and update as necessary, including verifying purpose of the patient’s visit, assigning appropriate electronic template, and updating the patient information in the practice management system Identify patient insurance, scan insurance documents, and verify insurance coverage and if necessary, complete benefits information to include Medicaid/ Medicaid Managed Care patients and Commercial insurance Determines and collects patient fees, receives and records current charges, payments of accounts, records balance due at the end of the visit\nAccurately accounts for pharmacy sales in the medical center Performs end of the day close and reconciles cash and credit cards against the day sheet and prepares bank deposits. Documents in notes any issues regarding balances, payments, credit, etc.\nPatient Intake Responsibilities:\nInform patients about general reproductive health care, abortion services, all FDA approved birth control methods, sexually transmitted disease testing and treatment, HIV testing, safer sex, and medical center procedures\nProvide factual, unbiased information to patients seeking abortion.\nDescribe the difference between medication and surgical abortion Educates patients of fees, visit procedures, contraception, STDs, etc.\nVerifies and correctly documents patient income as well as accurately determines eligibility for financial assistance funding or private pay\nCounsel patients on pregnancy outcome electives in a non-directive manner including adoption, abortion, and parenting.\nProvide community referral resources\nObtains informed consent and written signature on most recent patient education sheets\nClinical (Back Office) Responsibilities:\nProvide room assistance for specialty procedures including, but not limited to colposcopy and loop electrosurgery\nPerforms appropriate lab procedures including venipuncture, urine dipstick, weight, blood pressure, anemia and RH factor tests\nEnsures labs are prepped and packaged for the appropriate lab companies\nSupports Advanced Practice Clinicians (APCs) by prepping patients, labs, and supplies\nPerforms infection control tasks in accordance to Planned Parenthood, CLIA and OSHA guidelines when working with specimens and cleaning instruments\nActively participates with compliance measures for pharmaceuticals including removing expired products and rotating stock\nAbortion Care Responsibilities:\nAides in the completion of surgical abortion procedures by examining the products of conception in accordance with Planned Parenthood protocol\nMaintains an efficient workflow while adhering to all protocols related to working alongside MDs and RNs during abortion procedures in the Procedure Room, Post-Procedure Room or on Infection Control Alerts MDs to findings as needed\nGeneral Medical Center Responsibilities:\nWork collaboratively with the health center team to meet patient needs as well as individual and center productivity levels and patient cycle times\nCompliance with Throughput (TP) priorities, strategies and Team Centered Patient Care (TCPC) components\nProvide support services related to Telehealth in accordance with federal and state laws and applicable regulations\nMaintain facility for cleanliness, appropriate instruments, and optimum supply levels.\nMaintain equipment for proper functioning in accordance with the policies and standards of Planned Parenthood and regulatory agencies\nAssist with inventory maintenance including keeping records, stocking and ordering supplies\nParticipates in emergency drills and follows emergency procedures\nEnsure a culture that embraces diversity, fair and respectful treatment of all persons, and customer-focused delivery throughout the organization\nEnsure completion of all required training, including, but not limited to: CALs & CPR Adhere to all HIPAA and patient privacy regulations.\nMaintain patient and medical center confidentiality\nParticipate in the quality assurance/risk management process, including incident reports and follow up\nAdhere to the Personal protective Equipment (PPE) protocol as well as protocols outlined in the affiliate infection control program\nComply with all medical protocols, policies and procedures, including any federal & state laws and regulations governing the services provided by Planned Parenthood\nWork collaboratively with center team to meet patient needs, individual/center productivity levels\nCompetently use the patient information system software in all of its applications, if applicable to job\nServe as an Ambassador for the organization to inspire support and connection with the mission and services provided by the affiliate\nThe above essential functions are not an exhaustive list of required responsibilities, duties, and skills. Other duties may be added, or this job description may be amended at any time.\nVALUES AND COMMITMENTS:\nCommitment to Planned Parenthood’s mission and conviction to health equity and access to sexual and reproductive healthcare\nUnderstanding of racism and commitment to racial & social justice\nAwareness of multiple group identities and their dynamics, bringing a high level of self-awareness, empathy, and humility to interpersonal interactions; building of trust across diverse groups of people\nDemonstrated ability to communicate and hear effectively across differences and reflect and act on feedback related to identity and equity with the aim to learn\nCommitment to Planned Parenthood’s In This Together service ethos, workplace values, and service standards\nQUALIFICATIONS AND EXPERIENCE:\nRequired:\nCompletion of an accredited high school program or equivalent is required\nComputer literacy, including competency in affiliate email, Microsoft suite, internet, and electronic health record system, if applicable to job\nGood interpersonal, problem solving, and communication skills\nAbility to read and interpret documents such as policies and procedures\nAbility to write routine reports and correspondence\nAbility and willingness to work a flexible schedule including nights and weekends\nComputer literacy, including competence in affiliate email, Internet, and patient management systems software\nStrong commitment to quality healthcare and excellent customer service\nAbility and willingness to travel. Reliable means of transportation\nPreferred:\n1-2 years of experience with progressive responsibility in the reproductive health or general healthcare industry (ies).\nActive Medical Assistant or Nursing Assistant Certification\nSALARY AND BENEFITS:\nCompensation for this position starts at $17.25 per hour and goes up from there based on experience\nMedical, Dental, and Vision coverage options for you and eligible dependents\nShort Term Disability\nLife/AD&D and Long Term Disability policy voluntary coverage options\nGenerous vacation, leave, and holiday benefits\nPlanned Parenthood is an equal employment opportunity employer. We comply with all applicable laws prohibiting discrimination based on race, color, religion, gender and gender expression/identity, age, ethnicity, national origin, ancestry, physical or mental disability, uniformed service member/veteran status, marital status, medical condition, pregnancy, sexual orientation, citizenship status, genetic information, as well as any other category protected by federal, state, or local. We are committed to building an inclusive workplace that values racial & social justice. We strongly encourage all persons to apply, including people of color and members of the LGBTQ community.Show more Report"}, {"company": "AllStars-IT", "job": "Network and Cyber Protection Team Member", "city": "Israel", "date": "11d", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=303&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_db854c20&cb=1676381970999&jobListingId=1008430459254&jrtk=3-1-1gp82doermfoo801-1gojf2h73ghov800-181ea8cdb8922b68-", "description": "Network and Cyber Protection Team Member\nLevel\nSenior\nDepartment\nOther IT Positions\nType\nFull Time\nProject\nBank HaPoalim\nLocations:\nIsrael\nJob Details\nPosted on:\nJanuary 26, 2023\nJob ID:\n2527\nAbout the Company\nHeadquarters in Warsaw, Poland, AllSTARSIT operates development hubs across the whole CEE Region (Poland, Ukraine, Czech Republic, Romania, and Bulgaria), Israel, and Dubai. Additionally, AllSTARSIT has Tech Customer Support offices in the LATAM region, with an HQ in Colombia. The company has over 800+ talented Software Engineers and Tech Specialists spread across all locations.\n\nAllSTARSIT is an international Software R&D, Technical Support, and Talent Acquisition service provider established in 2004. The company specializes in software development services for clients across industries as diverse as cybersecurity, healthcare, fintech, telecommunications, media, and more.\nAbout the Project\nBank Hapoalim is one of Israel's largest banks.\nThe Information Security Infrastructure Unit in the Communications Department is responsible for establishing, maintaining, and operating the bank's security systems.\nThe unit handles a large number of information security technologies and products such as: firewalls, protection systems against DDoS attacks, application protection systems. On a daily basis, we are involved in leading, managing, planning, accompanying and building architecture for various projects in the various environments of the bank.\nThe employees in the unit are technical experts who provide service to various parties in the technology division and beyond.\nHeadquarters\nTel Aviv, Israel\nCurrent technology stack\nfirewalls, balancers, proxies, vpn, ssl, solarwinds, kiwi syslog, proxy products, load balancers, f5 product, anti-ddos protection systems.\nRequired skills:\nPractical knowledge and experience (hands on) in information security infrastructure products such as: firewalls, balancers, proxies, vpn, ssl - mandatory\nKnowledge of monitoring products: solarwinds, kiwi syslog.\nFamiliarity and in-depth mandatory practical experience with proxy products and load balancers - f5 product is an advantage.\nGood familiarity with anti-ddos protection systems - an advantage\nWillingness to work at night (shifts)\nGood command of the English language\nScope of work:\nEstablishment, operation and maintenance of information security systems\nInterface work with internal and external parties\nWhy AllSTARSIT?\nFlexible working model: work from anywhere or choose one of our offices in Warsaw, Kyiv, Lviv, Prague, Bogotá, or Dubai, or premium co-working spaces with luxury amenities in 23 cities around the world.\n\n\nLearning & Development program: we offer a team of senior developers, mentorship program, individual budget for self-education, free English, Spanish, and Polish courses, English for kids, regular tech & educational meetups, ability to become a meetup speaker, and online course subscriptions, among other perks and opportunities.\n\n\nWellness program: extended medical insurance, yoga & stretching, personal psychologist, sport/hobby compensation, Covid-19/flu vaccination, rewarding culture, and unique corporate gifts.\n\n\nBalanced lifestyle: workation programs, memorable corporate parties abroad, team building activities, Happy Fridays, family events, and charity events.Show more Report"}, {"company": "Merck KGaA Darmstadt Germany", "job": "Scientist", "city": "Jerusalem", "date": "21d", "rating": "4.2", "link": "", "description": ""}, {"company": "Diageo", "job": "2023 MBA Summer Internship, Finance", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=305&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2900a49f&cb=1676381974301&jobListingId=1008115081246&jrtk=3-1-1gp82drme2f30001-1gojf2h73ghov800-7da8b3ecf589cc22-", "description": "Job Description :\nDiageo is a global leader in beverage alcohol with an outstanding collection of over 200 brands - old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world! Brands like Crown Royal, Ciroc, Johnnie Walker, Guinness, Tanqueray, Captain Morgan, Baileys, Smirnoff, Bulleit, Ketel One and Don Julio are at the very heart of what we do. Global or local, every one of our brands has a story - all have a unique purpose and role to play in creating enduring connections with people.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. This, as well as celebrating our inclusive and diverse culture, is core to our purpose of “celebrating life, every day, everywhere”!\nYOUR ROLE\nAs a 2023 summer intern, you will get first-hand experience with our work, people, values, and culture. Summer interns are given responsibilities and challenges with projects that have an immediate impact on the business. Throughout the summer, you are given multiple opportunities to engage with senior management through both project work, as well as informative and cultural events. All interns receive individual coaching and training from their immediate manager and program buddy. You are encouraged to perform to our high standards and are given the same kind of performance feedback we give our full-time employees.\nDuring the 10-week summer internship, you will be immersed in one of our key organizational business units and develop a business plan proposal that will get us a step closer in achieving our ambition.\nSample Finance Projects from past internships\nDevelop pricing strategies and consumer insights to promote growth within tequila and convenience brands\nBuild competitive benchmarking template to drive understanding of competitive landscape for luxury and reserve brands\nIdentify P&L impacts on Diageo Beer Company to forecast category trends and future commercial impacts\nProvide transparency into financial impact of cost components, structures, and drivers across North American market to drive cost savings\nKey Qualifications\nCurrently enrolled in an MBA program\nFinance MBA interns typically have 2 to 5 years of work experience\nSelf-starter; ability to work independently and own summer project\nProblem solving and critical thinking skills\nShown analytical / financial modeling skills\nExcellent verbal, written and interpersonal communication skills\nHighly ambitious, geographically mobile, and high level of business maturity\nProven high analytical capabilities and insight generation, emerging high potential future leader\nSalary Range:\nMinimum Salary:\n$50.00/hour\nMaximum Salary:\n$50.00/hour\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US based employees are eligible for healthcare benefits, retirement benefits, short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the roles primary location.\nWorker Type :\nInternship (Fixed Term)\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2022-09-02-07:00Show more Report"}, {"company": "Diageo", "job": "Manager, Commercial Growth Plan", "city": "Central", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Team8", "job": "Team8 Health stealth startup-VP Engineering", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "AllStars-IT", "job": "Help Desk Specialist", "city": "Israel", "date": "30d+", "rating": "4.8", "link": "", "description": "Help Desk Specialist\nLevel\nJunior\nDepartment\nOther IT Positions\nType\nFull Time\nProject\nRafael\nLocations:\nIsrael\nJob Details\nPosted on:\nSeptember 26, 2022\nJob ID:\n2687\nAbout the Company\nHeadquarters in Warsaw, Poland, AllSTARSIT operates development hubs across the whole CEE Region (Poland, Ukraine, Czech Republic, Romania, and Bulgaria), Israel, and Dubai. Additionally, AllSTARSIT has Tech Customer Support offices in the LATAM region, with an HQ in Colombia. The company has over 800+ talented Software Engineers and Tech Specialists spread across all locations.\n\nAllSTARSIT is an international Software R&D, Technical Support, and Talent Acquisition service provider established in 2004. The company specializes in software development services for clients across industries as diverse as cybersecurity, healthcare, fintech, telecommunications, media, and more.\nAbout the Project\nRafael Advanced Defense Systems Ltd. is synonymous with dynamic defense, daring innovation, and technological ingenuity. For over 70 years, the company has pioneered advances in defense solutions for air, land, sea, space, and cyber. Our innovations are based on extensive operational experience and understanding of evolving combat requirements. They enable the rapid development of effective solutions for complex challenges on a variety of fronts.\nAlways ahead ‒ we ensure ongoing advantages for our global client base. We are dedicated to continuously enhancing our customer service, as well as expanding our global industrial cooperation programs.\nSpecialization\nDefense Systems and Cyber Security\nHeadquarters\nIsrael\nRequired skills:\nAt least one year of experience in providing service and handling customers in a technical telephone support center (and/or relevant military experience)\nWillingness to work long term\nAbility to provide service and high motivation for the position\nScope of work:\nA little about the role:\nTelephone support representative at the service center and support for computing issues\nAnswering and handling end user faults and application support\nWorking hours 7:50-16:50, including overtime work\nWhy should you join us?\nAn opportunity to join a young and high-quality team, high-level training, good conditions and development opportunities!\nWhy AllSTARSIT?\nFlexible working model: work from anywhere or choose one of our offices in Warsaw, Kyiv, Lviv, Prague, Bogotá, or Dubai, or premium co-working spaces with luxury amenities in 23 cities around the world.\n\n\nLearning & Development program: we offer a team of senior developers, mentorship program, individual budget for self-education, free English, Spanish, and Polish courses, English for kids, regular tech & educational meetups, ability to become a meetup speaker, and online course subscriptions, among other perks and opportunities.\n\n\nWellness program: extended medical insurance, yoga & stretching, personal psychologist, sport/hobby compensation, Covid-19/flu vaccination, rewarding culture, and unique corporate gifts.\n\n\nBalanced lifestyle: workation programs, memorable corporate parties abroad, team building activities, Happy Fridays, family events, and charity events.Show more Report"}, {"company": "Medison Pharma", "job": "Distribution Team Leader", "city": "Petah Tikva", "date": "27d", "rating": "3.7", "link": "", "description": "Medison is a global pharma company on a mission to help patients around the world get faster access to lifesaving, innovative, breakthrough therapies.\nMediHome - Medison's logistics, services, and solutions leader in healthcare is looking for a Distribution Team Leader to Manage the distribution process and manage the distribution drivers team.\nResponsible for the transportation and distribution of products to the customer, and that it meets the regulations of the company and the Ministry of Health.\nAnalysis of the distribution lines, Providing data, and Monitoring the distribution expenses,\nProviding solutions that support business activity in optimal distribution conditions\nA thinking partner for optimizing distribution in the short and long term\nRequirements:\n\nHigh school education.\nExperience and Ability to manage a team.\nAvailable to work irregular hours.\nService-oriented, Assertive, and Pedant.\nPatience, courtesy, and the ability to work independently\nResponsibilities:\n\nOpening the logistic center daily\nManagerial routines - holding team meetings, providing continuous feedback, joining distribution drives on the road for close monitoring\nholding case studies in the field of distribution\nDuring special cases - assisting the operations team, and ordering taxis with judgment.\nFinding solutions and optimizing the entire distribution field - in terms of delivery times and expenses.\nManaging real-time events while taking into account both the solution to the patient and relevant interfaces in order to execute the distribution - distribution drivers, subcontractors, and taxis.\nData analysis – production of reports that will form the database for decision-making in distribution lines, optimization, expenses, operation of subcontractors, and judgment regarding the types of vehicles.\nTesting with customers the quality of the distribution\nVehicles - managerial responsibility for choosing the type of vehicle, the installation process, and the ongoing operation of all systemsShow more Report"}, {"company": "", "job": "Clinical Business Analyst", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=310&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b2873f0b&cb=1676381981204&jobListingId=1008033515344&jrtk=3-1-1gp82e2c7itm9801-1gojf2h73ghov800-95162ffaf0101d7e-", "description": "הגש מועמדות\n\nבאר שבע\nמשרה מלאה\nתיאור\n\n.We are looking for an excellent Clinical Business Analyst to join our Clinical Content team\n\nResponsibilities include building and maintaining our medical ontology content, mapping terminologies and providing clinical insights for the product and development teams.\n\nBe sure the file is in PDF format or with file extension docx.\nAdvantages\nExperience in medical informaticsExperience in medical QAProven knowledge of US Healthcare market and common US EMR’s and Healthcare IT solutionsSQL knowledge\n\nדרישות\n\nRegistered Nurse / Medical Register/ Pharmacist / M.A. in Health Science / PhD in Life Science\nAt least 2 years’ experience of clinical practice\nIndependent learning skills\n\nWide knowledge in Excel\n\nComputer and Technical data analysis abilities\n\nFluent in English – written and spoken\n\nדרושים בתחום\nמחשבים ותוכנה - מערכות מידע\nמאפייני משרה\nמשרה מלאה\nשמור משרה\n\nשתף\n\nשלח מודעה לחבר\n\nעודShow more Report"}, {"company": "MSD Animal Health Intelligence Technology Labs", "job": "HW Board Designer", "city": "Netanya", "date": "30d+", "rating": "3.7", "link": "", "description": "Our Company is where we transform vision into reality. It's where ideas become technologies, and cutting-edge technologies become solutions for animal care and management.\nWe support farmers by providing real-time actionable information to help them manage their herds. It provides pet owners with smart devices and data that give them a better understanding of their pets’ activity and health needs, enriching relationships. It helps conservationists safeguard natural environments and wildlife.\nLeveraging decades of Technological Research & Development experience across many markets, technologies and species, along with development environments and Quality Assurance procedures, we're always inventing new ways to look after the health and well-being of animals. Our decades of experience keep us ahead of the curve by leveraging advanced Technological Solutions from enhancing the precious bond between people and their pets, to advancing animal healthcare and wildlife preservation.\nWe're looking for experienced, highly talented and motivated Board Design engineer to join our HW team. This role provides a unique opportunity for HW engineer to be involved in the electronics development of our company next Generation products line. The responsibility of this role is for the complete hardware design process, from HW specification and documentation phase through schematics drawing, Layout guidance, bring-up, integration with SW, Design validation tests and mass production ramp-up.\nAs part of the HW team that develops and maintains many products in parallel and ATE testing boards , the role includes time sharing between few projects including maintenance of existing products - ECOs, debugging and deep failure analysis investigations.\nRequirements:\n\nMandatory:\nBSc. and/or MSc. in Electronic Engineering from a leading university.\n6-8 years of experience in Board Design.\nFamiliarity with the complete development cycle from HW specification and documentation, through schematics drawing, Layout guidance, bring-up, integration with SW, Design validation tests and mass production ramp-up.\nDetails oriented, with good design methodology skills from concept to specification documentation and implementation.\nExperience with HW projects leadership. Can lead HW design taking into account the over-all aspects of the design (HW architecture/system level /RT SW considerations/Production and testing considerations) and communicate externally of the HW team.\nExperience with hands-on work and willingness to perform the bring up, HW/SW integration and debugging activities is a must.\nWilling to be involved in exiting products maintenance, Failures/RMA investigations and re-designs.\n Advantage:\nPractical knowledge in LTE\\LTE-M and GNSS systems.\nPractical Knowledge in wireless communication such as Zig-Bee, WIFI, BT, LoRa, UWB.\nPractical Knowledge in High speed interfaces USB, DDR3 .\nPractical knowledge in rechargeable batteries & chargers system design.\nExperienced with Altium tool.\nRequired Personal Characteristics:\nDiligent and methodical.\nHighly motivated individual and excellent team player.\nGood teamwork and collaboration.\nExcellent communication and learning skills.Show more Report"}, {"company": "Oqton", "job": "Senior Product Manager Clinical Software", "city": "Central", "date": "30d+", "rating": "4.6", "link": "", "description": ""}, {"company": "Edwards Lifesciences", "job": "Field Clinical Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=313&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_28b3c2c9&cb=1676381985537&jobListingId=1008383707503&jrtk=3-1-1gp82e6mjjfmo801-1gojf2h73ghov800-78c8ab50e920add4-", "description": "Imaging & Device field Specialist\nAct as a lead on all aspects within the therapy including imaging, integration and troubleshooting techniques related to equipment, software, tools and products required for clinical use including but not limited to intraoperative case coverage and coordinating one-on-one ad hoc training sessions and in- service structured education programs in the Cath Lab. Provide expertise on intraprocedural imaging support during beating heart studies for therapies. Provide knowledge transfer to team members. Educate and train physicians, hospital personnel and hospital staff on all aspects of technical matters related to investigational products and procedures including imaging through conducting and/or coordinating one-on-one ad hoc training sessions and in-service structured education programs on two or more technologies or one highly specialized technology. Analyze, summarize, and present clinical baseline, procedural, and follow-up imaging (e.g., CT, echo, MRI, angiography) to provide inputs that support new product and procedure development and to support event investigations. Collaborate and provide recommendations to HCPs to develop imaging patient selection criteria and screening protocol. Train field support team and/or HCPs on cardiac imaging procedures. Provide on-site cardiac imaging support and guidance during clinical procedures to ensure optimal imaging during the implantation of transcatheter devices. Analyze imaging and/or oversee third party image analysis for patient screening and contribute an opinion to the assessment of potential cases. Marginal Job Functions Percentage required • Experience as clinical specialist imaging/echocardiographer with TEE experience required • Good imaging analysis software skills (e.g. 3Mensio, TomTec, Vitrea, Circle VI, etc.) • Excellent written, verbal, and presentation communication skills • Ability to effectively guide and instruct other imaging specialists in clinical settings on effective imaging equipment operation • Strong diplomacy, influencing and relationship management skills • Demonstrated problem-solving and critical thinking skills • Substantial knowledge of relevant imaging equipment operation (e.g. 2D or 3D TTE/TEE/ICE, CT, MRI, etc.) • Substantial knowledge and understanding of principles, theories, and concepts relevant to cardiovascular imaging • Knowledge of and adherence to Edwards Environmental Health and Safety and Quality guidelines • Knowledge of Good Clinical Practices • Ability to work in a team environment, fostering collaboration between inter-departmental teams, HCPs and KOLs • Adhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control Level of Independence Additional Information Works independently without close supervision Compares and evaluates possible courses of action after considering various possibilities Applies his or her knowledge in following procedures or in determining which procedures to follow or determining whether specified standards are met Considers the cause and effect of activities Determines or effectively recommends course of action after considering potential risks of alternatives May provide guidance to lower level personnel Makes decisions in the face of different alternatives and without Level of Independence Additional Information formulas or guidelines or with guidelines that are not complete and exhaustive, and which allow room for creativity and judgment Direction tends to be high level and focused on end results with means of accomplishment left to incumbent\nDevelops clinical education materials in connection with clinical investigations. Provides expertise and clinical insights on the device, procedure and protocol throughout the life cycle of the clinical investigation.\n\nKey Responsibilities:\n\nResponsible for certification of the centers, physicians and other related staff, as well as EW personnel and as outlined within EW SOPs\nProvide education on all aspects of the device, device handling, implantation and troubleshooting techniques related to equipment, tools and products required for device implants.\nThroughout commercial procedures, provide physicians and medical staff with required follow-up support to ensure continuity of education and technical support related to all aspects of patient outcome. Develop and continuously improve training curriculum, training materials and training tools, based on clinical trial experience, EW guidelines and SOP.\nProvide training and guidance to new Field Clinical Specialists\nEducate and train physicians, hospital personnel and hospital staff on technical matters related to investigational products and procedures through conducting and/or coordinating one-on-one ad hoc training sessions and in-service structured education programs.\nPlan and implement growth strategies within focused accounts in partnership with the Sales and Sales Management. Responsible for upselling in key strategic accounts working in conjunction with Business Managers\nLearns the product(s), physiology, anatomy, applications and “language” of the market and Edwards Lifesciences. Fully monitor clinical support activities, changes in the market and assigned accounts, as well as, competitive activity with the NSM and the appropriate Sales Specialist.\nValidate software and hardware updates in the field as applicable\nOther incidental duties\n\nEducation and Experience:\nBachelor's Degree or Equivalent 5 years years experience of previous related medical device and/or clinical experience Required\nTraining experience in clinical / technical environment Preferred\n\nAdditional Skills:\n\nProven expertise in MS Office Suite and ability to operate general office machinery\nStrong written and verbal communication skills, presentation, and interpersonal relationship skills including negotiating and relationship management skills\nBusiness Intelligence & Interact with KOL and proctors\nExcellent problem-solving and critical thinking skills\nFull knowledge and understanding of cardiovascular science\nFull understanding of cardiovascular anatomy, pathology and physiology\nFull understanding of medical device regulatory requirements and documents, device accountability and adverse events reporting\nAbility to manage confidential information with discretion\nStrict attention to detail\nAbility to interact professionally with all organizational levels\nAbility to manage competing priorities in a fast paced environment\nMust be able to work in a team environment, including inter-departmental teams and key contact representing the organization on contracts or projects\nAbility to interact with senior internal and external personnel on significant matters often requiring coordination between organizations\nAdhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Merck KGaA Darmstadt Germany", "job": "Production Scientist", "city": "Jerusalem", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "iMDsoft", "job": "Clinical Information System PreSale Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=315&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a880b247&cb=1676381988105&jobListingId=1008351902215&jrtk=3-1-1gp82e94kii0r801-1gojf2h73ghov800-70b9ead988d9cb79-", "description": "We are iMDsoft, Where Caring is not just a slogan…..Our solutions are designed to help those most in need when they need it the most. Our mission is to make clinical software better for everyone. We are proud of our team of dedicated professionals from diverse backgrounds and industries, who are working together to take great care of people and each other. If you are a professional and a team player committed to positive change, this is the place for you.We are looking for a Clinical Information System PreSale Specialist to join and manage iMDsoft toManage MetaVision presale activities with iMDsoft channel partners in multiple markets across the entire sales cycle.The role includes:1. Support channel partners throughout the sales process2. Clearly articulate product features and benefits to channel partners and prospect customers3. Run compelling MetaVision product demos to Intensivists and Anaesthetists4. Train channel partners to deliver successful MetaVision product demonstrations5. Prepare presale material to support the sales process6. RFP Bid Manager - Respond to Clinical Information Systems RFPs7. Monitor the performance of channel partner presale teams to ensure they properly present iMDsoft MetaVision Suite8. Participating in international trade shows9. Manage internal communication with technical product managersExperience:o Certified ICU nurse or doctor’s assistant - more than 5 years clinical experienceo Hands-on user of MetaVision or similar Clinical Information SystemPresale experience in the healthcare industry – advantageSkills:o Languages: English and Hebrew (excellent speaking and writing); Knowledge in Spanish, French, Italian - advantageo Demonstrate clinical experience in discussions with Intensivists and Anaesthetisto High level of understanding of information systemso Proficiency in Microsoft Toolso Excellent presentation skills, a born presenter and story tellero Customer facing – ability to have one-on-one sessions with senior hospital stake holderso Ability to travel up to 30% of the timeJob Type: Full-timeShow more Report"}, {"company": "Planned Parenthood Keystone", "job": "Health Center Support RN", "city": "Central", "date": "16d", "rating": "3.5", "link": "", "description": "Planned Parenthood Keystone (PPKey) serves 37 counties in Pennsylvania, home to over half of Pennsylvania residents. We have administrative offices in the Lehigh Valley, Harrisburg, Warminster, and York. We operate 9 medical centers that serve over 22,000 patients annually and offer comprehensive sexuality education that reaches thousands of young adults.\nPlanned Parenthood Keystone is looking for individuals who are committed to supporting our shared goal of strengthening and enhancing our awareness and commitment to advancing the cause of racial & social justice in our organization.\nPURPOSE OF POSITION:\nParticipate in a team approach to the delivery of quality reproductive healthcare and abortion services in accordance with Planned Parenthood’s policies and medical protocols. The Health Center Support RN must proficiently perform responsibilities in all three (3) areas of medical center support operations: Front Desk, Patient Intake, and Clinical Labs, as well as be an active participant in patient flow, staff training, and clinical leadership. Must be willing to travel to York and Reading until a full schedule is created for Lancaster.\nEssential Functions\nMaintain current license, professional certification, and CPR/ACLS/PALS certification as appropriate\nProficiently provide abortion and family planning related assistance, education, information, post-procedure instructions and be available during emergencies\nSupport the APCs & Physicians by providing additional onsite clinical leadership for MCA staff\nAdminister and/or oversee the administration of medications, including injections, without a clinician on-site\nWork collaboratively with the health center team to meet patient needs as well as individual and center productivity levels and patient cycle times. Steps in to eliminate/reduce patient waiting times. Alerts health center manager as needed\nActs as lead HCS-RN on any specific station, modeling appropriate and best practices and offering support and expertise to less seasoned staff\nActs as an HCS-RN mentor and assists in the training of new and existing staff to ensure professional growth and developmen\nFront Desk Responsibilities\nBe able to perform general front desk duties including answering phones, scheduling appointments, checking patients in & out, verifying insurances, greeting & assisting patients/ visitors as per safety and security policies, and collecting appropriate fees\nServe as the first point of contact for maintaining efficient workflow. Alert appropriate staff to any issues that may affect patient flow\nPatient Intake Responsibilities:\nEducate patients about reproductive health care, abortion services, all FDA approved birth control methods, sexually transmitted disease testing and treatment, HIV testing, safer sex, and medical center procedures\nVerifies and correctly documents patient income as well as accurately determines eligibility for financial assistance funding or private pay\nCounsel patients on pregnancy outcome electives in a non-directive manner including adoption, abortion, and parenting. Provide community referral resources\nObtains informed consent and written signature on most recent patient education sheets\nClinical (Back Office) Responsibilities:\nProvide room assistance for specialty procedures including, but not limited to colposcopy and loop electrosurgery\nPerforms appropriate lab procedures including venipuncture, urine dipstick, weight, blood pressure, anemia and RH factor tests\nEnsures labs are prepped and packaged for the appropriate lab companies\nPerforms infection control tasks in accordance to Planned Parenthood, CLIA and OSHA guidelines when working with specimens and cleaning instruments\nActively participates with compliance measures for pharmaceuticals including removing expired products and rotating stock\nPerforms limited scope pelvic ultrasounds, training to be provided\nGeneral Medical Center Responsibilities:\nWork with Team to maintain facility for cleanliness, appropriate instruments, and optimum supply levels. Maintain equipment for proper functioning in accordance with the policies and standards of Planned Parenthood and regulatory agencies\nParticipates in and/or facilitates emergency drills and follow emergency procedures\nEnsure a culture that embraces diversity, fair and respectful treatment of all persons, and customer-focused delivery throughout the organization\nEnsure completion of all required training, including, but not limited to: CALs & CPR\nAdhere to all HIPAA and patient privacy regulations. Maintain patient and medical center confidentiality\nParticipate in the quality assurance/risk management process, including incident reports and follow up\nComply with all medical protocols, policies and procedures, including any federal & state laws and regulations governing the services provided by Planned Parenthood\nServe as an Ambassador for the organization to inspire support and connection with the mission and services provided by the affiliate\nProviding \"as needed\" staff sharing when services and access are compromised for a particular region or center. It is the expectation of every employee in medical services to reasonably accommodate those needs when asked. Administration will work with staff based on availability and coverage needs as best as possible\nSALARY & BENEFITS\nCompensation for this position starts at $33.00 per hour and goes up from there based on experience\nMedical, Dental, and Vision coverage options for you and eligible dependents\nShort Term Disability\nLife/AD&D and Long Term Disability policy voluntary coverage options\nGenerous vacation, leave, and holiday benefits\nPlanned Parenthood is an equal employment opportunity employer. We comply with all applicable laws prohibiting discrimination based on race, color, religion, gender and gender expression/identity, age, ethnicity, national origin, ancestry, physical or mental disability, uniformed service member/veteran status, marital status, medical condition, pregnancy, sexual orientation, citizenship status, genetic information, as well as any other category protected by federal, state, or local. We are committed to building an inclusive workplace that values racial & social justice. We strongly encourage all persons to apply, including people of color and members of the LGBTQ community.Show more Report"}, {"company": "Merck KGaA Darmstadt Germany", "job": "Biochemist", "city": "Jerusalem", "date": "17d", "rating": "4.2", "link": "", "description": ""}, {"company": "Aidoc", "job": "DevOps and Cloud Platforms", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.6", "link": "", "description": "About Aidoc\n\nAidoc is a pioneering force in clinical AI. Our clinical AI imaging solutions help physicians quickly identify and diagnose urgent cases and improve patient outcomes. Built on Aidoc’s exclusive aiOS, we analyze and aggregate medical data to enable care teams to operationalize the unexpected and work seamlessly with a continued focus on the patient. Aidoc AI is always on, running in the background to change the foreground.\nOur solutions are used in more than 1,000 hospitals, including leading health systems in the US. Funded by some of the industry’s leading VC’s, Aidoc has raised more than $250 million to date, and was chosen as one of TIME’s 50 most genius companies.\nAbout this role\n\n In this role, you will be working on the latest cutting-edge tools and technologies as a first mover based on technology trends and in alignment with business objectives. You will be researching, learning and implementing innovative, creative and cost effective ways to safely introduce new technologies to the Aidoc environment.\nYou will work in collaboration with the Dev, Data Engineering and AI teams to empower them with the right monitoring and reliability tools to achieve the company’s goals.\nResponsibilities\nYou will receive end-to-end ownership for core parts of our operation:\nCI/CD pipelines of the company’s products and infrastructure\nThe company’s entire cloud production infrastructure, including advanced cloud infra on AWS, with data pipelines, serverless deployments and container orchestration\nApplication and infrastructure monitoring solutions\nAutomations for big-data pipelines and processes\nYou will be trusted with autonomy, freedom and influence to design solutions and make technical decisions, in a critical position for the company’s growth.\nYou will work in a unique professional culture championing close work between Dev and DevOps and\nownership. We’re literally tackling the challenges of bringing cutting edge cloud-based services to the healthcare world\nRequirements\nAt least 4 years of experience as a DevOps Engineer\nPassion for elegant and effective technological solutions\nAccountability and ownership - doing whatever it takes for the company to succeed\nIndependent learning capability and curiosity without boundaries\nExperience in designing and building cloud-based solutions, in one of the major cloud providers\nWorking on systems with complex release or business flows\nSolid programming and scripting skills\nAdvantage for:\nExperience with Terraform\nStrong knowledge of docker framework\nContainer orchestration solutions (e.g. Kubernetes)\nServerless solutions\nInfrastructure for high scale training and inference with DL models\nExperience and passion for developing CI/CD and release flow pipelines, allowing the organization to move fast and reliably\nExcellent knowledge of Linux\nWorking at Aidoc\n\nOur perks:\nOffice close to HaShalom train station with free parking\nStocked up kitchen, catered breakfasts\nLunch - personal chef & meal card\nWellness- yoga, pilates, and functional workouts in the office\nAmazing culture - collaborative, transparent & fun!\nAttractive compensation package & benefitsShow more Report"}, {"company": "MSD", "job": "HW Program Manager", "city": "Netanya", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=319&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ae66dfc0&cb=1676381993163&jobListingId=1008142158768&jrtk=3-1-1gp82ee4hp6ci801-1gojf2h73ghov800-ef25b534e02fc267-", "description": "Job Description\nOur Company is where we transform vision into reality. It's where ideas become technologies, and cutting-edge technologies become solutions for animal care and management.\nWe support farmers by providing real-time actionable information to help them manage their herds. It provides pet owners with smart devices and data that give them a better understanding of their pets’ activity and health needs, enriching relationships. It helps conservationists safeguard natural environments and wildlife.\nLeveraging decades of Technological Research & Development experience across many markets, technologies, and species, along with development environments and Quality Assurance procedures, we're always inventing new ways to look after the health and well-being of animals. Our decades of experience keep us ahead of the curve by leveraging advanced Technological Solutions from enhancing the precious bond between people and their pets, to advancing animal healthcare and wildlife preservation.\nAs a technical program manager, you will be responsible of leading complex multidisciplinary projects/programs that requires a high level of technical know-how. End to end responsibility throughout the entire development cycle, from inception to mass production. Play a key role in the definition & development of company’s next generation products. Working in full alignment with the internal R&D matrix as well as external stakeholders\nRequirements:\nB.Sc. / M. Sc in Electrical Engineering\nBackground of at least 5 years as Embedded or Board designer or Emb Architect\nAt least 5 years working as a system engineer/program/project manager from a multidisciplinary company\nExperience with leading the development of embedded products\nProven capabilities to develop consumer mass production products\nProven leadership & execution capabilities\nExperience working in matrix-based organization (HW, SW, subcontractors and operations)\nHands-on experience in product development which involve HW, FW, SW, RF, QA, and mechanics\nProficiency in MS Office and MS Project\nExcellent communication, presentation and organizational skills\nAHITL\nCurrent Employees apply HERE\nCurrent Contingent Workers apply HERE\nSearch Firm Representatives Please Read Carefully\nMerck & Co., Inc., Rahway, NJ, USA, also known as Merck Sharp & Dohme LLC, Rahway, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails.\nEmployee Status:\nRegular\nRelocation:\nNo relocation\nVISA Sponsorship:\nTravel Requirements:\nFlexible Work Arrangements:\nShift:\nValid Driving License:\nHazardous Material(s):\nNumber of Openings:\n1\nRequisition ID:R194850Show more Report"}, {"company": "MUSC", "job": "MUHA EA11 - LPN Columbia (MCP)", "city": "Central", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=320&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_66e3847d&cb=1676381994671&jobListingId=1008253230021&jrtk=3-1-1gp82efjni3b6801-1gojf2h73ghov800-48491e0f886b3528-", "description": "Entity/Organization: MUHA (Medical University Hospital Authority/Medical Center)\n\nHours per week:\nScheduled Work Hours/Shift:\n\nFair Labor Standards Act Status: Hourly\n\nJob Summary/Purpose: Under the direction of a registered nurse is responsible for all identified nursing care behaviors within his/her span of control during his/her tour of duty and is accountable to the Charge Nurse and/or designated individual. The LPN participates in the care of a defined patient population. The LPN assists with data collection, formulation of plans for patient care, and participates with evaluation of outcomes of nursing actions.\n\nMinimum Training and Education: Graduation from a recognized Licensed Practical Nursing program and licensed as an LPN within the state of South Carolina or a compact state. One year of LPN experience preferred. Current Basic Life Support (BLS) required, either a certification from an American Heart Association (AHA) BLS for Healthcare Providers (or AHA recognized equivalent) or an American Red Cross CPR/AED for Professional Rescuer and Healthcare Provider.\n\nRequired Licensure, Certifications, Registrations: Licensed as an LPN within the state of South Carolina or a compact state. Current Basic Life Support (BLS) required, either a certification from an American Heart Association (AHA) BLS for Healthcare Providers (or AHA recognized equivalent) or an American Red Cross CPR/AED for Professional Rescuer and Healthcare Provider.\n\nAdditional Duties and Responsibilities:\n\nPhysical Requirements: Ability to perform job functions while standing. (Continuous) Ability to perform job functions while sitting. (Continuous) Ability to perform job functions while walking. (Continuous) Ability to climb stairs. (Infrequent) Ability to work indoors. (Continuous) Ability to work outside in temperature extremes. (Infrequent) Ability to work from elevated areas. (Frequent) Ability to work in confined/cramped spaces. (Frequent) Ability to perform job functions from kneeling positions. (Infrequent) Ability to bend at the waist. (Continuous) Ability to twist at the waist. (Frequent) Ability to squat and perform job functions. (Frequent) Ability to perform \"pinching\" operations. (Frequent) Ability to perform gross motor activities with fingers and hands. (Continuous) Ability to perform firm grasping with fingers and hands. (Continuous) Ability to perform fine manipulation with fingers and hands. (Continuous) Ability to reach overhead. (Frequent) Ability to perform repetitive motions with hands/wrists/elbows and shoulders. (Continuous) Ability to fully use both legs. (Continuous) Ability to use lower extremities for balance and coordination. (Frequent) Ability to reach in all directions. (Continuous) Ability to lift and carry 50 lbs. unassisted. (Infrequent) Ability to lift/lower objects 50 lbs. from/to floor from/to 36 inches unassisted. (Infrequent) Ability to lift from 36\" to overhead 25 lbs. (Infrequent) Ability to exert up to 50 lbs. of force. (Frequent) Examples include: To transfer a 100 lb. patient that can not assist in the transfer requires 50 lbs. of force. For every 100 additional pounds, assistance will be required from another healthcare worker. 20 lbs. of force is needed to push a 400 lb. patient in a wheelchair on carpet. 25 lbs. of force is required to push a stretcher with a patient with one hand. Ability to maintain 20/40 vision, corrected, in one eye or with both eyes. (Continuous) Ability to see and recognize objects close at hand or at a distance. (Continuous) Ability to match or discriminate between colors. (Continuous) Ability to determine distance/relationship between objects; depth perception. (Continuous) Good peripheral vision capabilities. (Continuous) Ability to maintain hearing acuity, with correction. (Continuous) Ability to perform gross motor functions with frequent fine motor movements. (Continuous) Ability to deal effectively with stressful situations. (Continuous) Ability to work rotating shifts. (Frequent) Ability to work overtime as required. (Frequent) Ability to work in a latex safe environment. (Continuous) Ability to maintain tactile sensory functions. (Continuous) (Selected Positions) *Ability to maintain good olfactory sensory function. (Continuous) *(Selected Positions) *Ability to be qualified physically for respirator use, initially and as required. (Continuous) (Selected Positions)Show more Report"}, {"company": "Pfizer", "job": "Hybrid Health Representative - Internal Medicine (Migraine)", "city": "Herzliya", "date": "17d", "rating": "4.2", "link": "", "description": ""}, {"company": "Medison Pharma", "job": "Medical Representative - Psychiatry - Neurology", "city": "Petah Tikva", "date": "5d", "rating": "3.7", "link": "", "description": "Medison is a global pharma company on a mission to help patients worldwide get faster access to lifesaving, innovative, breakthrough therapies. We operate in 4 continents and over 24 countries and are growing fast. If you want to be part of our mission and help save patients by getting them the latest treatments, join us!\nAs Medical Representative, you will work with the Psychiatry - Neurology team to present and promote Medison’s products In the North area.\nYou will Lead the efforts of Medison Psychiatry-Neurology business, which includes different indications within the Psychiatry - Neurology arena.\nIf you are a true team player, have a strong drive to overcome any challenge, can bring new ideas, and market insights, and develop strong working relationships, we'd like you to join us!\n\nRequirements:\n \nBSc degree in life sciences or paramedical degree\n Relevant work experience in the pharmaceutical industry, with previous experience as a Medical Representative\n High ability to read, analyze and interpret medical research.\n Excellent communication skills in Hebrew and English\n Presentation skills, digital abilities\n Agile in work and ability to learn quickly.\n Driving license – this role requires traveling.\nResponsibilities:\n\nPresent and promote our products in a scientific manner by providing the latest and most relevant data and information to the right customer at the right time.\nSupport Healthcare professional's decisions and optimize patient outcomes in an ethical way\nAchieve objectives by effectively communicating the value and appropriate.\nBe in charge of the relevant territories to work and delegate our portfolio to customers, in line with Medison’s strategy and the individual needs of stakeholders.\nLeverage all available data sources to create, dynamically prioritize and adapt relevant territory and customer engagement plans.\nMaintain a deep and current knowledge of the industry, trade association, and competitors, and focus your effort on customer opportunities.Show more Report"}, {"company": "MSD", "job": "Environmental, Health & Safety Manager", "city": "Netanya", "date": "24d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=323&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0d87ca8e&cb=1676381998696&jobListingId=1008402955949&jrtk=3-1-1gp82ejg8kbnn801-1gojf2h73ghov800-57c3006558a92407-", "description": "Job Description\nOur Company is where we transform vision into reality. It's where ideas become technologies, and cutting-edge technologies become solutions for animal care and management.\nWe support farmers by providing real-time actionable information to help them manage their herds. It provides pet owners with smart devices and data that give them a better understanding of their pets’ activity and health needs, enriching relationships. It helps conservationists safeguard natural environments and wildlife.\nLeveraging decades of Technological Research & Development experience across many markets, technologies and species, along with development environments and Quality Assurance procedures, we're always inventing new ways to look after the health and well-being of animals. Our decades of experience keep us ahead of the curve by leveraging advanced Technological Solutions from enhancing the precious bond between people and their pets, to advancing animal healthcare and wildlife preservation.\nResponsibilities:\nProvide technical support and coordination in defining and implementing site EH&S systems for the sites. This entails guiding and directing site support efforts, communicating to the site staff and sub groups and providing in addition to obtaining site EH&S inputs where required.\nPrioritize EH&S related risks and develop and assist with implementing corrective action and preventive action plans. Monitor and communicate overall status of plans to Site Management, EHS Director and the Global Manufacturing and Supply Chain Leadership team.\nProactively identify improvement opportunities and collaborate with other EHS staff/ Engineering/and Operations personnel to leverage best practices and drive continuous improvement efforts.\nEnsures ongoing evaluation of changes in EHS Regulatory requirements. Develops and implements site positions and strategies to ensure 100% compliance with all current and future EHS requirements as and when they arise.\nEnsures that site systems are in place to maintain 100% site compliance with all Safety and Environmental Regulations and Programs and are aligned with global safety and environment (GSE) expectations and the agreed EHS roadmap for our Animal Health Intelligence division.\nEstablish and maintain excellent communication processes to ensure management, occupational health, and affected employees understand the workplace hazards, exposures, and accompanying risks, as well as the needed control strategies.\nProvide technical support for new projects and modifications to ensure proper EH&S design review, as well as routine /maintenance evaluation after process / equipment installed / implemented.\nConduct independent inspections of facilities and practices, as required, for conformance with Site, Corporate and/or Statutory EHS requirements. Ensures Operations are carried out in accordance with required standards of EHS and in adherence to all relevant Company Policies and Procedures.\nDevelop and implement effective EH&S-related training programs for both management and employees.\nAssist other region sites as EHS contact to support Accident/incident investigations, to give follow up to EHS initiatives, collect EHS KPIs and to be point of contact for smaller sites into the region that doesn’t have an EHS dedicated personnel.\nImplement EHS initiatives in region aligned with global initiatives will implement in the site and support smaller sites in region.\nEducation Minimum Requirements\nBachelor’s degree or equivalent in an environmental or safety related technical discipline is of strong advantage, Master degree is a plus.\nMinimum 10 years of experience within a high output manufacturing environment.\nPrevious experience in leading project teams with and/or without managerial responsibility is advantageous.\nDocumented knowledge of EHS laws and regulatory framework.\nHealth/Safety certificate confirming the ability to perform function of Health & Safety professional\nClear and recognizable understanding of processes, equipment and methods associated with Plastic & electronic products manufacturing.\nRequired Experience & Skills\nProven ability to develop sustainable cooperative professional relationships on all levels of the organization.\nExcellent communication, interpersonal, and organizational skills.\nHigh ethical standards, being a role model of business compliance and integrity.\nProven ability to prioritize, focus on and obtain business results.\nDemonstrated analytical and logical problem-solving abilities.\nFlexibility to perform multiple, complex tasks simultaneously to efficiently support the business.\nFluency in written and spoken Hebrew and English.\nPreferred Experience & Skills\nRelevant EHS professional certification(s).\nLean/Six Sigma experience desirable.\nKnowledge of ISO norm 14,000 & 45001 (former OHSAS 18000)\nVision and sound judgment; ability to develop strategy and execute tactically.\nRobust skills interpreting and applying regulatory frameworks such as EU, OSHA, EPA, ISO, NFPA, GMP.\nRobust skills interpreting and applying regulatory frameworks.\nCurrent Employees apply HERE\nCurrent Contingent Workers apply HERE\nSearch Firm Representatives Please Read Carefully\nMerck & Co., Inc., Rahway, NJ, USA, also known as Merck Sharp & Dohme LLC, Rahway, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails.\nEmployee Status:\nRegular\nRelocation:\nDomestic/International\nVISA Sponsorship:\nYes\nTravel Requirements:\n10%\nFlexible Work Arrangements:\nHybrid\nShift:\n1st - Day\nValid Driving License:\nNo\nHazardous Material(s):\nNumber of Openings:\n1\nRequisition ID:R217298Show more Report"}, {"company": "Medison Pharma", "job": "Medical Representative internal medicine", "city": "Petah Tikva", "date": "20d", "rating": "3.7", "link": "", "description": "Medison is a global pharma company on a mission to help patients worldwide get faster access to lifesaving, innovative, breakthrough therapies. We operate in 4 continents and over 24 countries and are growing fast. If you want to be part of our mission and help save patients by getting them the latest treatments, join us!\nAs Medical Representative, you will work with the Internal Medicine team to present and promote Medison’s products in the center area of Israel.\nYou will lead the efforts of Medison's Cardiovascular and Endocrinology portfolio, which includes world class therapies for the treatment of cholesterol and Osteoporosis.\nYou will have frontline exposure to our portfolio vision, business strategies and critical market insights that drive our business forward.\nRequirements:\n\nBSc degree in life sciences or para-medical degree\nHigh ability to read, analyze and interpret medical research\nExcellent communication skills in Hebrew and English\nPresentation skills and digital abilities\nAgility in work and in ability to learn quickly\nDriving license – role requires travelling\nAt least 1-2 years of experience as a Medical Representative\n\nResponsibilities:\n\nPresenting and promoting Medison's portfolio and services in a scientific manner by providing the latest and most relevant data and information to the right customer at the right time\nSupporting healthcare professionals’ decision making and optimizing patient outcomes in an ethical way\nAchieving objectives by effectively communicating the value and appropriate use of the portfolio\nDeveloping and executing action plans for the relevant territories, in line with Medison's strategy and the individual needs of the stakeholder\nLeveraging all available data sources to create, dynamically prioritize and adapting relevant territory and customer engagement plans\nDemonstrating advanced customer engagement skills to deliver high quality customer interactions and maximizing customer experience for the benefit of patients\nMaintaining deep and current knowledge of the industry, trade association, competitors and buyer dynamics and focusing your efforts on identifying customer opportunitiesShow more Report"}, {"company": "Qualitest", "job": "CSV Engineer", "city": "Israel", "date": "10d", "rating": "3.9", "link": "", "description": "Description\n\nQuaitest is hiring experienced CSV Engineers for the pharma industry!\n\nIn this position you will:\nWrite Computerized systems validation documents and test protocols: IQ,OQ,PQ\nWrite Computerized systems design and summary documents: URS,FRS,VP,VSR\nWrite software applications reject lists, bug identification, report and monitoring.\nFunctional and detailed documented testing of life-science computerized systems.\nComply with healthcare regulation for computerized systems ( 2CFRPART11, CE Annex 11)\nRequirements\n\n\n1 year of experience in healthcare QA\n1 year of experience with software testing specifically and\\or familiar with IT technical issues.\nExperience in computerized system validation in the life science industry( Biotech, Pharma, Medical Device etc.)\n\nBenefits\n\nWhy QualiTest?\n\nHave continuous access to and work with Senior Specialists and Practice Experts\nBe a part of a leading company, globally recognized as a Visionary by Gartner Magic Quadrant\nAs a global company, we offer unique placement opportunities around the world\nNever stop experimenting and learning with Qualitest Tech academy: training courses, mentorship programs, technical tribes, sponsored certifications, leadership programs and much more\n\nIntrigued to find more about us?\n\nVisit our website at www.qualitestgroup.com\nCheck out our Career page: https://qualitestgroup.com/careers/open-positions/\n\nIf you like what you have read, send us your resume and let’s start talking!Show more Report"}, {"company": "Healthee", "job": "Senior Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "About us:\nIt’s 2022, people. Health ‘benefits’ should be easy, accessible, and affordable. Enter Healthee, which helps employees discover what’s covered, which provider to see, what it costs, and how to book an appointment—all within 27 seconds. It’s a win-win for HR Pros, reducing your workload and costs, and making your employees healthier, happier, and more loyal. Empower your employees to take full advantage of their health benefits, without replacing your broker.\nWe’re on a mission to support employees and transform their health care experience. We’re building an AI powered platform that is designed to support every employee with healthcare benefits, navigate their plans and optimize care..\nWant to join our mission-driven team? Read on.\nWe are looking for an experienced product manager with proven ability to create successful products that customers love, that is excited to join our growing team and to be part of making people healthier.\n\nObjectives\nBe obsessed with the customer - understand their needs and challenges pains and motivations\nOwn your product vision and roadmap based on customer and business needs\nLead the product lifecycle from ideation to execution to drive fast impact to our customers\nDevelop and monitor key metrics to measure the success of the product to drive the business goals\nManage ongoing collaboration with engineering, PM, design, CX, Sales and marketing\nAnalyze the market and competitive landscape\nRequirements\nAt least 7 years of product experience of building impactful products\nExperience working in B2C companies\nPassionate about user experience\nStrategic thinker with a ‘can-do’ and ‘get things done’ attitude\nSelf driven, take ownership and obsess with impact\nAnalytical and data driven mindset\nA people person and team player\nAdvantage: Expert in the American health insurance system\nBenefits\nHybrid Work\nStock Options\nTraining & DevelopmentShow more Report"}, {"company": "Hoffman Construction Company", "job": "Commissioning Scheduler", "city": "Qiryat Gat", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=327&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5f9b7b0e&cb=1676382003921&jobListingId=1008028447803&jrtk=3-1-1gp82eok2nccp801-1gojf2h73ghov800-034da17ed477faed-", "description": "JOIN THE HOFFMAN TEAM\nHoffman is building a diverse company, and we welcome all candidates to apply. We are seeking US based candidates who have a sense of adventure and would like to temporarily relocate and work in Israel on a large semi-conductor manufacturing project.\nWe have had the good fortune to build for many of our clients throughout the US and Internationally. Headquartered in the Pacific Northwest, the Hoffman Construction name is synonymous with some of the most iconic semi-conductor manufacturing projects in the US.\nOur company has been in business for a century, but we are not stuck in the past. We encourage innovation, and we welcome diversity.\nHoffman is employee-owned, which means employee owners have a stake in the company's long-term success, and it means you have the freedom and independence to solve challenges without bureaucratic second-guessing.\nYou will earn highly competitive pay, get professional skills training, health insurance, paid time off, a generous retirement program and a culture of inclusion and acceptance. We will be providing a comprehensive international temporary relocation package for all expatriates.\nThe people who work here take pride in their work, support each other and drive our commitment to exceptional construction, from urban high-rise towers, educational buildings, museums and libraries to advanced technology, industrial manufacturing facilities, water treatment plants, healthcare facilities and more.\nHoffman is a place where you can feel like you belong. Many of our employees have been here for 20+ years. They often join us straight out of college or apprenticeships and grow their entire careers here.\nWe are looking for people with a wide range of talents in positions from the jobsite to our corporate offices. Explore our website , and, if you like what you see, apply today.\nSalary Range: $75,000 - $100,000 annually\nPosition Summary: The Commissioning Scheduler will work within the Scheduling Department and will report to the Scheduling Manager. They will work closely with the project team, including the Scheduling Manager, construction team, and the Commissioning team to coordinate the interface between the master schedule and the commissioning system. Responsibilities include building and maintaining equipment startup sequences, managing data input, and inputting status updates & forecasts, and reporting. This position will be fully at the project site.\nEssential Responsibilities:\nUse Primavera (P6), Excel, and Exto to coordinate construction and commissioning schedules.\nMap P6 construction and commissioning activities to Exto with support from the Commissioning Team.\nMaintain alignment between P6 & Exto content and dates.\nMaintain P6 logic ties and sequencing.\nProvide reports, key performance indicators, and analysis of variances to be used by the team to manage the project.\nQualifications:\nPosition Related Skills\nProficient in Windows and Microsoft Office 365 (Excel, Word, Outlook, Power Point and Teams), and have a general understanding of working within a computer network.\nAdvanced knowledge and high proficiency of Microsoft Excel.\nExperience with scheduling software, such as P6, and/or commissioning databases, such as Exto, is preferred.\nAbility to follow procedures, and a willingness to learn and master new software and concepts.\nAbility to work well and maintain a cooperative attitude through high-pressure situations.\nExcellent time-management skills and ability to multi-task and prioritize work while frequently interrupted by phone calls and questions on work in progress.\nExcellent written and oral communication skills with an ability to develop strong interpersonal relationships.\nAbility to work closely with variety of trade and craft people in a field work situation. Patience and professionalism are essential.\nHighly developed visual observation and interpretation skills with the ability to recognize patterns and trends.\nMust be a strong team player with the ability to collaborate with various personnel within and across departments and at all levels of leadership.\nProfessional Experience and Education\nEquipment start up, testing and commissioning experience preferred.\nHigh School diploma or GED required.\nBachelor’s degree or equivalent work experience preferred.\nPhysical and Mental Requirements:\nStanding/Walking/Sitting: workday is combination of standing, walking and sitting.\nMust be able to climb stairs: 5% of day.\nHands/Arms: constant use of hands/fingers for mouse/keyboard/computer use.\nSight: visual acuity in near, mid, and far range vision. Color vision, peripheral vision, depth perception, hand/eye coordination.\nHearing: sufficient to hear conversational levels in person and over the telephone.\nSpeech: sufficient to make oneself heard in person, speak in front of groups, and be understood over the telephone.\nLift/Carry: Up to 20lbs. Computer/drawings - minimal .\nBending/Twisting: minimal.\nKneeling/Crouching/Crawling: minimal.\nConstant mental alertness, accuracy, and attention to detail required.\nMust work at the jobsite office.\nMust be able to follow processes and procedures with high level of accuracy and attention to detail.\nMust be able to work independently, make decisions, and follow through on all assignments.\nMust use creativity, independent judgment, and organizational and problem-solving skills to determine best method to accomplish desired results.\nMust be able to plan and organize work.\nMust possess strong organizational and computer use skills and have a high level of competency to read/write/speak English, interpret construction related documentation and communicate with coworkers.\nApplication review will consider without limitation the following criteria: qualifications, education, and experience specific to the job description/duties as well as prior experience with Hoffman Construction. Applicants must be able to pass the Hoffman Drug and Alcohol test.\nHoffman Construction is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sex, sexual orientation, gender identity or expression, national origin, age, disability, protected veteran status, genetic information, or any other characteristic protected by applicable law.\nThis job description is intended to outline the general nature and level of work being performed by employees. It is not designed to cover or contain a comprehensive list of responsibilities, duties, or skills required of the employee of this job. Furthermore, this description is subject to change at the discretion of the company, with or without notice.Show more Report"}, {"company": "Analog Devices", "job": "Staff Engineer, Field Applications", "city": "Raanana", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=328&ao=1136043&s=58&guid=0000018626f14470b27b90e1cdc8dcdf&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_743cfcca&cb=1676382005162&jobListingId=1008377232479&jrtk=3-1-1gp82eprb34ag001-1gojf2h73ghov800-089b856340ff0d2e-", "description": "Analog Devices (NASDAQ: ADI) designs and manufactures semiconductor products and solutions. We enable our customers to interpret the world around us by intelligently bridging the physical and digital worlds with unmatched technologies that sense, measure and connect.\nCandidate will provide field applications support, pre-sales and post-sales technical support to Strategic and Key customers for Analog Devices products used in industrial Automation and Healthcare. The Candidate also will support the Broadmarket. These parts range from Amplifiers, Data Converters, Power Supplies to industrial Communications. This involves working with customers, sales teams and products lines to identify key opportunities and position the best solutions tailored to customer needs to grow Analog Devices market share\nActivities include, but are not limited to:\nUnderstanding customers' system and proposing solutions using as many ADI components as possible.\nDeveloping and maintaining strong relationships with the customer and ensuring fast responses.\nTraining customers on Analog Devices' solutions and products and presenting at seminars.\nTraining Product Lines, Sales, and Applications on customer’s system requirements.\nRun evaluation systems/boards, being able to provide on-site customer lab support.\nWorking together and coordinating activities with the Account Managers, driving customer’s technical support activities and coordinating actions with Marketing and Product Lines.\nDeveloping and maintaining good relationships with Product Lines, Marketing and Application teams. Providing regular inputs and updates to help the definition of new products.\nProviding regular inputs on opportunities/designs wins and losses.\nQualifications\nGraduate/Postgraduate degree in electronics engineering, preferably MSEE or PhD\n3-5 years of analog experience at board/system level or previous experience as Field Application Engineer or similar role will be an advantage.\nMixed signal circuit applications/design at the board/system level. Experience in Networks (Hard- and Software) is a plus\nGood organizational skills and the ability to multi-task many projects and set priorities. Able to organize activities in an independent way.\nTeam player, outgoing personality with a ‘can-do’ attitude. Capability to present to and work with all levels of Management, Sales, and Engineering\nFlexibility and proactive attitude are a must.\nGood lab measurement and debug skills.\nGood verbal, written communication and interpersonal skills. Fluent English and local language.\nAbility to deliver convincing presentations\nRegional Travel (within territory) 35-50%\nFor positions requiring access to technical data, Analog Devices, Inc. may have to obtain export licensing approval from the U.S. Department of Commerce - Bureau of Industry and Security and/or the U.S. Department of State - Directorate of Defense Trade Controls. As such, applicants for this position – except US Citizens, US Permanent Residents, and protected individuals as defined by 8 U.S.C. 1324b(a)(3) – may have to go through an export licensing review process.\nAnalog Devices is an equal opportunity employer. We foster a culture where everyone has an opportunity to succeed regardless of their race, color, religion, age, ancestry, national origin, social or ethnic origin, sex, sexual orientation, gender, gender identity, gender expression, marital status, pregnancy, parental status, disability, medical condition, genetic information, military or veteran status, union membership, and political affiliation, or any other legally protected group.\nJob Req Type: Experienced\n\nRequired Travel: Yes, 50% of the time\n\nShift Type: 1st Shift/DaysShow more Report"}, {"company": "MSD Animal Health Intelligence Technology Labs", "job": "R&D HW Program Manager", "city": "Netanya", "date": "30d+", "rating": "3.7", "link": "", "description": "Our Company is where we transform vision into reality. It's where ideas become technologies, and cutting-edge technologies become solutions for animal care and management.\nWe support farmers by providing real-time actionable information to help them manage their herds. It provides pet owners with smart devices and data that give them a better understanding of their pets’ activity and health needs, enriching relationships. It helps conservationists safeguard natural environments and wildlife.\nLeveraging decades of Technological Research & Development experience across many markets, technologies, and species, along with development environments and Quality Assurance procedures, we're always inventing new ways to look after the health and well-being of animals. Our decades of experience keep us ahead of the curve by leveraging advanced Technological Solutions from enhancing the precious bond between people and their pets, to advancing animal healthcare and wildlife preservation.\nAs a technical program manager, you will be responsible of leading complex multidisciplinary projects/programs that requires a high level of technical know-how. End to end responsibility throughout the entire development cycle, from inception to mass production. Play a key role in the definition & development of company’s next generation products. Working in full alignment with the internal R&D matrix as well as external stakeholders\nRequirements:\n\nB.Sc. / M. Sc in Electrical EngineeringBackground of at least 5 years as Embedded or Board designer or Embedded ArchitectAt least 5 years working as a system engineer/project/ program manager from a multidisciplinary companyExperience with leading the development of embedded productsProven capabilities to develop consumer mass production productsProven leadership & execution capabilitiesExperience working in matrix-based organization (HW, SW, subcontractors and operations)Hands-on experience in product development which involve HW, FW, SW, RF, QA, and mechanicsProficiency in MS Office and MS ProjectExcellent communication, presentation and organizational skillsShow more Report"}, {"company": "Team8", "job": "Claroty-SW Team Leader", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "Claroty empowers the world's largest enterprises to secure their cyber-physical systems across industrial (OT), healthcare (IoMT), and enterprise (IoT) environments: the Extended Internet of Things (XIoT). The Claroty Platform integrates with customers’ existing infrastructure to provide a full range of controls for visibility, risk and vulnerability management, threat detection, and secure remote access. Our platform is deployed by hundreds of organizations at thousands of sites across all seven continents.\nLaunched by the famed Team8 foundry in 2015, Claroty is headquartered in New York City, with employees across the Americas, Europe, Asia-Pacific, and Tel Aviv. Claroty has raised $635 million in funding from the world’s largest investment firms and industrial automation vendors – including SoftBank, Bessemer Venture Partners, Rockwell Automation, Schneider Electric, and Siemens – making it the most well-funded industrial cybersecurity company.\nAt Claroty, we are looking to hire individuals who embody our core values: People First, Customer Obsession, Strive for Excellence, and Integrity.\nClaroty is an equal opportunity employer and is committed to fostering a diverse and inclusive work environment for all. We encourage applications from candidates of ALL diverse backgrounds, and special accommodations are available upon request in all phases of the hiring process.\nWe are looking for you - A talented team leader looking for their next journey.\nWe offer a great workplace with a talented team, exciting changes, and a feeling of impact.\nRESPONSIBILITIES\nLead a talented team of developers that drives the core of our product throughout the development life cycle\nDrive technical excellence, high product quality, innovation, and timely delivery in an agile environment\nWork closely with Product Management, Customer Care, and other stakeholders from ideation to real customer value\nMentor and grow team members in their career path\nRequirements:\n\n3+ years in leading R&D teams - Must\n5+ years of experience in backend/full-stack development - Must\nExperience in developing large-scale applications in Python - Must\nKnowledge and experience with a popular JavaScript framework (Angular/React) - Advantage\nProven experience, in both architecture and implementation-level software design of high-scale systems\nExperience in Cyber Security, Linux & Networking - Advantage\nTeam player, mentor, strong communication and problem-solving skills\nWillingness to work in a fast-paced, and driven team in a context-switching environment\nTeam8:\n\nClarotyShow more Report"}]]