[{"company": "Iguazio", "job": "Junior Customer Success Engineer", "city": "Herzliya", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=0000018626f30ec395e6a89717e1af2f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_922d9d15&cb=1676382036747&jobListingId=1007162902118&jrtk=3-1-1gp82fom1kbm3801-1gojf63o8ihmu800-dbce8dd378654dcb-", "description": "About The Position\nIguazio is looking for a Data Engineer to be part of our all-star Customer Success Team, that spearheads the company's customer engagements, and play a critical role in our mission delivering a ground-breaking solution to the market.\n\nThe Customer Success Team is responsible for enabling customers to build new data science applications they could only dream of, building batch and real-time data pipelines using serverless distributed frameworks.\n\nYou can expect to drive Data Science Platform POCs for Data Scientists and their Data engineering teams, consult and implement data solutions within Tier1 enterprise customers.\n\n\nWhat You'll Do\n\nEngage directly with customers on data science automation at scale including data pipeline acceleration and optimization\nWork closely with Data scientists and take part in data science tasks\nWork directly with Iguazio teams of Solution Architect, Sales, Product Management and R&D, feeding requirements and priorities\n\n\nEssential Skills\n\nYou must be a fast thinker and executor, have great communication skills, patient, a people's person, sharp and details oriented.\n\n\nDoes This Describe You?\n1-2 years of experience with Python / Scala / Java / GO Coding - must\n1+ years of experience building solutions with the Big Data tools and frameworks such as Spark, Hadoop, Cassandra, NoSQL, etc\nExperience working with external clients as PS engineer/customer engagement and great communication skills\nExperience with Cloud-Native and Cloud Data Services such as GCP, Azure or AWS (DynamoDB, Kinesis, EMR or RedShift) - advantage\nExperience with Docker, Kubernetes and serverless computing and architecture - an advantage\nExperience working closely with Data scientists - big advantage\nExperience working on Data science tasks and/or data science training / courses - big advantage\n\n\nAbout the Company\n\nData science is too important to today's enterprise to be held back by delays and inefficiencies.\n\nWe're building a faster, easier, and smarter way for data science to flow seamlessly from raw idea to real-world impact. This is data science brought to life.\n\nIguazio provides an MLOps (machine learning operations) platform which automates and accelerates the data science process, enabling the rollout of new AI services continuously across the enterprise. The company raised $72M from top financial and strategic VCs, is led by a team of serial entrepreneurs, and serves a diverse set of customers worldwide, ranging from technology companies such as NetApp, financial service companies like Payoneer and healthcare customers like the Sheba Medical Center.\n\nWe're looking for top talent to help us continue our growth — and grow with us!Show more Report"}, {"company": "Ciklum", "job": "Junior Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": ""}, {"company": "Veeva Systems", "job": "Junior Site Reliability Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Planned Parenthood Keystone", "job": "Medical Care Assistant - Warminster", "city": "Central", "date": "30d+", "rating": "3.5", "link": "", "description": "Planned Parenthood Keystone (PPKey) serves 37 counties in Pennsylvania, home to over half of Pennsylvania residents. We have administrative offices in the Lehigh Valley, Harrisburg, Warminster, and York. We operate 9 medical centers that serve over 22,000 patients annually and offer comprehensive sexuality education that reaches thousands of young adults.\nPlanned Parenthood Keystone is looking for individuals who are committed to supporting our shared goal of strengthening and enhancing our awareness and commitment to advancing the cause of racial & social justice in our organization.\nPlanned Parenthood Keystone is looking Full-time (35 hours/week), non-exempt, Medical Care Assistant based out of our Warminster Medical Center. A Medical Care Assistant is responsible for providing exceptional customer service to our patients while serving as a member of our dedicated team of medical center employees.\nYou will participate in a team approach to the delivery of quality reproductive healthcare in accordance with Planned Parenthood’s policies and medical protocols. The Medical Care Assistant must proficiently perform responsibilities in areas of medical center support operations: Front Desk, Patient Intake, and Clinical (Back Office).\nESSENTIAL FUNCTIONS:\nFront Desk Responsibilities:\nPerform general front desk duties including answering phones, scheduling appointments, and greeting & assisting patients/ visitors Follow the Planned Parenthood safety and security procedures for screening visitors\nServe as the first point of contact for maintaining efficient work flow.\nAlert appropriate staff to any issues that may affect patient flow\nAccurately register and update the patient record, verify income and program status and update as necessary, including verifying purpose of the patient’s visit, assigning appropriate electronic template, and updating the patient information in the practice management system Identify patient insurance, scan insurance documents, and verify insurance coverage and if necessary, complete benefits information to include Medicaid/ Medicaid Managed Care patients and Commercial insurance Determines and collects patient fees, receives and records current charges, payments of accounts, records balance due at the end of the visit\nAccurately accounts for pharmacy sales in the medical center Performs end of the day close and reconciles cash and credit cards against the day sheet and prepares bank deposits. Documents in notes any issues regarding balances, payments, credit, etc.\nPatient Intake Responsibilities:\nInform patients about general reproductive health care, abortion services, all FDA approved birth control methods, sexually transmitted disease testing and treatment, HIV testing, safer sex, and medical center procedures\nProvide factual, unbiased information to patients seeking abortion.\nDescribe the difference between medication and surgical abortion Educates patients of fees, visit procedures, contraception, STDs, etc.\nVerifies and correctly documents patient income as well as accurately determines eligibility for financial assistance funding or private pay\nCounsel patients on pregnancy outcome electives in a non-directive manner including adoption, abortion, and parenting.\nProvide community referral resources\nObtains informed consent and written signature on most recent patient education sheets\nClinical (Back Office) Responsibilities:\nProvide room assistance for specialty procedures including, but not limited to colposcopy and loop electrosurgery\nPerforms appropriate lab procedures including venipuncture, urine dipstick, weight, blood pressure, anemia and RH factor tests\nEnsures labs are prepped and packaged for the appropriate lab companies\nSupports Advanced Practice Clinicians (APCs) by prepping patients, labs, and supplies\nPerforms infection control tasks in accordance to Planned Parenthood, CLIA and OSHA guidelines when working with specimens and cleaning instruments\nActively participates with compliance measures for pharmaceuticals including removing expired products and rotating stock\nAbortion Care Responsibilities:\nAides in the completion of surgical abortion procedures by examining the products of conception in accordance with Planned Parenthood protocol\nMaintains an efficient workflow while adhering to all protocols related to working alongside MDs and RNs during abortion procedures in the Procedure Room, Post-Procedure Room or on Infection Control Alerts MDs to findings as needed\nGeneral Medical Center Responsibilities:\nWork collaboratively with the health center team to meet patient needs as well as individual and center productivity levels and patient cycle times\nCompliance with Throughput (TP) priorities, strategies and Team Centered Patient Care (TCPC) components\nProvide support services related to Telehealth in accordance with federal and state laws and applicable regulations\nMaintain facility for cleanliness, appropriate instruments, and optimum supply levels.\nMaintain equipment for proper functioning in accordance with the policies and standards of Planned Parenthood and regulatory agencies\nAssist with inventory maintenance including keeping records, stocking and ordering supplies\nParticipates in emergency drills and follows emergency procedures\nEnsure a culture that embraces diversity, fair and respectful treatment of all persons, and customer-focused delivery throughout the organization\nEnsure completion of all required training, including, but not limited to: CALs & CPR Adhere to all HIPAA and patient privacy regulations.\nMaintain patient and medical center confidentiality\nParticipate in the quality assurance/risk management process, including incident reports and follow up\nAdhere to the Personal protective Equipment (PPE) protocol as well as protocols outlined in the affiliate infection control program\nComply with all medical protocols, policies and procedures, including any federal & state laws and regulations governing the services provided by Planned Parenthood\nWork collaboratively with center team to meet patient needs, individual/center productivity levels\nCompetently use the patient information system software in all of its applications, if applicable to job\nServe as an Ambassador for the organization to inspire support and connection with the mission and services provided by the affiliate\nThe above essential functions are not an exhaustive list of required responsibilities, duties, and skills. Other duties may be added, or this job description may be amended at any time.\nVALUES AND COMMITMENTS:\nCommitment to Planned Parenthood’s mission and conviction to health equity and access to sexual and reproductive healthcare\nUnderstanding of racism and commitment to racial & social justice\nAwareness of multiple group identities and their dynamics, bringing a high level of self-awareness, empathy, and humility to interpersonal interactions; building of trust across diverse groups of people\nDemonstrated ability to communicate and hear effectively across differences and reflect and act on feedback related to identity and equity with the aim to learn\nCommitment to Planned Parenthood’s In This Together service ethos, workplace values, and service standards\nQUALIFICATIONS AND EXPERIENCE:\nRequired:\nCompletion of an accredited high school program or equivalent is required\nComputer literacy, including competency in affiliate email, Microsoft suite, internet, and electronic health record system, if applicable to job\nGood interpersonal, problem solving, and communication skills\nAbility to read and interpret documents such as policies and procedures\nAbility to write routine reports and correspondence\nAbility and willingness to work a flexible schedule including nights and weekends\nComputer literacy, including competence in affiliate email, Internet, and patient management systems software\nStrong commitment to quality healthcare and excellent customer service\nAbility and willingness to travel. Reliable means of transportation\nPreferred:\n1-2 years of experience with progressive responsibility in the reproductive health or general healthcare industry (ies).\nActive Medical Assistant or Nursing Assistant Certification\nSALARY AND BENEFITS:\nCompensation for this position starts at $17.25 per hour and goes up from there based on experience\nMedical, Dental, and Vision coverage options for you and eligible dependents\nShort Term Disability\nLife/AD&D and Long Term Disability policy voluntary coverage options\nGenerous vacation, leave, and holiday benefits\nPlanned Parenthood is an equal employment opportunity employer. We comply with all applicable laws prohibiting discrimination based on race, color, religion, gender and gender expression/identity, age, ethnicity, national origin, ancestry, physical or mental disability, uniformed service member/veteran status, marital status, medical condition, pregnancy, sexual orientation, citizenship status, genetic information, as well as any other category protected by federal, state, or local. We are committed to building an inclusive workplace that values racial & social justice. We strongly encourage all persons to apply, including people of color and members of the LGBTQ community.Show more Report"}, {"company": "", "job": "Junior Recruiter", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=0000018626f30ec395e6a89717e1af2f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_15cd1bed&cb=1676382043102&jobListingId=1007579621552&jrtk=3-1-1gp82futbih5h801-1gojf63o8ihmu800-132e9ac4253d6d3f-", "description": "Location: Jerusalem City Center, Israel\nReport to: Recruitment Manager\n\nSchedule: Sundays (from home, 10am to 4pm), Mondays through Thursdays (from the office, 3.3pm to midnight)\n\nJob Description:\n\nThe Junior Recruiter will plan and execute strategic sourcing of candidates within the Healthcare sector using a wide variety of resources and conduct first-level screening calls with candidates.\n\nWho are you:\nNative or native-level English\nHighly motivated and eager to learn about the recruiting world.\nCareer-oriented and competitive.\nGood listener.\nComfortable talking on the phone and reaching out to new contacts.\nOrganized and professional.\n\nKey Responsibilities:\n\nLocate & source active and passive job seekers in the healthcare industry through various sources, including the company database, social media, internet, professional networks, referrals, cold calling, networking, identifying applicant associations/pools/professional groups and affiliations etc. in order to constantly increase the number of candidates in the database.\nBuild healthy, robust pipelines of candidates on a continuous basis through multiple sourcing channels (i.e., web, social, network, etc.)\nCreate, categorize & maintain hotlists of passive and active candidates on a daily basis.\nConduct first-level screening calls and engage with candidates to determine suitability of candidate and refer to the recruitment team via management.\nDevelop relationships with candidates over the phone and give them a highly professional and world-class candidate experience.\nDemonstrate knowledge and excitement about our business and be able to answer basic candidate questions.\nSupport our recruiting processes as it relates to sourcing and identifying candidates.\nTransfer screened candidates to the recruitment manager or schedule follow up appointments for candidates who are not available to continue screening at that time.\nIdentify new methods to increase traffic of leads and manage pipeline.\nCommunicate progress and develop and execute innovative recruitment and sourcing strategies.\nConduct research to understand the market and competitive factors.\nAccountable for goals, productivity and quality of pipeline, and conversion rates.\nOther duties as required.Show more Report"}, {"company": "", "job": "Junior Recruiter / Talent Sourcer", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": "The Junior Recruiter will plan and execute strategic sourcing of candidates within the Healthcare sector using a wide variety of resources and conduct first-level screening calls with candidates.\n\nWho are you:\nNative or native-level English\nHighly motivated and eager to learn about the recruiting world.\nCareer-oriented and competitive.\nGood listener.\nComfortable talking on the phone and reaching out to new contacts.\nOrganized and professional.Show more Report"}]