[{"company": "GE Healthcare", "job": "Verification Intern", "city": "Haifa", "date": "3d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=0000018626f2de78b08ced912d86828b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9b4e24ce&cb=1676382025590&jobListingId=1008447299430&jrtk=3-1-1gp82fdohp6df801-1gojf5nltgrij800-d55a5cd7c7672f4e-", "description": "Job Description Summary\nVerification Intern\n\nDescription:\n Design and write STD with understanding testing methodology.\n Analyze and debug failures and issue founded reports.\n Customer documentation verification.\nJob Description\nVerification Intern\nDescription:\nDesign and write STD with understanding testing methodology.\nAnalyze and debug failures and issue founded reports.\nCustomer documentation verification.\nIntegrated work with development teams.\nDetermining priority for test scenario and creating execution plans for implementation.\n\nAdvantage and Qualification:\nExperience in SW & System testing.\nExperience in writing test plans and challenge the development and system teams.\nTeam player who has excellent interpersonal skills.\nFast learner and looking to be exposed and work with new technologies.\nHighly dedicated and motivated engineer.\nISTQB is an advantage.\nTest tools and framework ALM & Jira.\nInclusion and Diversity\nGE Healthcare is an Equal Opportunity Employer where inclusion matters. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\nWe expect all employees to live and breathe our behaviors: to act with humility and build trust; lead with transparency; deliver with focus, and drive ownership – always with unyielding integrity.\nOur total rewards are designed to unlock your ambition by giving you the boost and flexibility you need to turn your ideas into world-changing realities. Our salary and benefits are everything you’d expect from an organization with global strength and scale, and you’ll be surrounded by career opportunities in a culture that fosters care, collaboration and support.\nAdditional Information\nThe job is open to men and women equally\nRelocation Assistance Provided: NoShow more Report"}, {"company": "Diageo", "job": "2023 MBA Summer Internship, Marketing", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=0000018626f2de78b08ced912d86828b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_319ccb38&cb=1676382026928&jobListingId=1008115081249&jrtk=3-1-1gp82ff21p6dd801-1gojf5nltgrij800-9fd0c7582cfd434b-", "description": "Job Description :\nDiageo is a global leader in beverage alcohol with an outstanding collection of over 200 brands - old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world! Brands like Crown Royal, Ciroc, Johnnie Walker, Guinness, Tanqueray, Captain Morgan, Baileys, Smirnoff, Bulleit, Ketel One and Don Julio are at the very heart of what we do. Global or local, every one of our brands has a story - all have a unique purpose and role to play in creating enduring connections with people.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. This, as well as celebrating our inclusive and diverse culture, is core to our purpose of “celebrating life, every day, everywhere”!\nYOUR ROLE\nAs a 2023 summer intern, you will get first-hand experience with our work, our people, our values, and our culture. Interns are given real responsibilities and challenges with projects that have an immediate impact on the business. Throughout the summer, you are given multiple opportunities to interact with senior management through both their project work as well as informative and cultural events. All interns receive individual mentoring and training from their immediate manager, and the opportunity to show results. You are expected to perform to our high standards and are given the same kind of performance feedback we give our full-time employees.\nDuring the 10-week summer internship, you will be asked to immerse yourself in one of our key organizational business units and develop a business plan proposal that will get us a step closer in achieving our ambition.\nSample Marketing Projects from past internships\nDevelop an in-depth understanding of the Guinness Extra Stout (GES) consumer and develop a marketing plan to enhance the volume opportunity for GES\nDeliver a relationship marketing strategy for the Tanqueray portfolio.\nDevelop a revitalization plan for the iconic Seagram’s 7.\nBuild a strategy to double the volume of Smirnoff Ice in five years.\nLeverage sports and the multiverse to drive Captain Morgan growth to multicultural audiences\nKey Qualifications\nCurrently enrolled in an MBA program\nMarketing MBA interns typically have 2 to 5 years of work experience\nLeadership, with a particular focus on transformational and inspirational problem solvers\nCreativity\nCritical thinking\nAbility to work autonomously\nData analysis, synthesis, and interpretation\nStrong communication and presentation skills\nRelationship building\nSalary Range:\nMinimum Salary:\n$50.00/hour\nMaximum Salary:\n$50.00/hour\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US based employees are eligible for healthcare benefits, retirement benefits, short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the roles primary location.\nWorker Type :\nInternship (Fixed Term)\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2022-09-02-07:00Show more Report"}, {"company": "Diageo", "job": "2023 MBA Summer Internship, Finance", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=0000018626f2de78b08ced912d86828b&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0eaea8e4&cb=1676382028220&jobListingId=1008115081246&jrtk=3-1-1gp82fgbgmfre801-1gojf5nltgrij800-7da8b3ecf589cc22-", "description": "Job Description :\nDiageo is a global leader in beverage alcohol with an outstanding collection of over 200 brands - old and new, large, and small, global and local – that are enjoyed in more than 180 countries around the world! Brands like Crown Royal, Ciroc, Johnnie Walker, Guinness, Tanqueray, Captain Morgan, Baileys, Smirnoff, Bulleit, Ketel One and Don Julio are at the very heart of what we do. Global or local, every one of our brands has a story - all have a unique purpose and role to play in creating enduring connections with people.\nOur performance ambition is to be one of the best performing, most trusted and respected consumer products companies in the world. We are proud of the brands we make and the enjoyment they give to millions. We are passionate about alcohol playing a positive role in society as part of a balanced lifestyle. This, as well as celebrating our inclusive and diverse culture, is core to our purpose of “celebrating life, every day, everywhere”!\nYOUR ROLE\nAs a 2023 summer intern, you will get first-hand experience with our work, people, values, and culture. Summer interns are given responsibilities and challenges with projects that have an immediate impact on the business. Throughout the summer, you are given multiple opportunities to engage with senior management through both project work, as well as informative and cultural events. All interns receive individual coaching and training from their immediate manager and program buddy. You are encouraged to perform to our high standards and are given the same kind of performance feedback we give our full-time employees.\nDuring the 10-week summer internship, you will be immersed in one of our key organizational business units and develop a business plan proposal that will get us a step closer in achieving our ambition.\nSample Finance Projects from past internships\nDevelop pricing strategies and consumer insights to promote growth within tequila and convenience brands\nBuild competitive benchmarking template to drive understanding of competitive landscape for luxury and reserve brands\nIdentify P&L impacts on Diageo Beer Company to forecast category trends and future commercial impacts\nProvide transparency into financial impact of cost components, structures, and drivers across North American market to drive cost savings\nKey Qualifications\nCurrently enrolled in an MBA program\nFinance MBA interns typically have 2 to 5 years of work experience\nSelf-starter; ability to work independently and own summer project\nProblem solving and critical thinking skills\nShown analytical / financial modeling skills\nExcellent verbal, written and interpersonal communication skills\nHighly ambitious, geographically mobile, and high level of business maturity\nProven high analytical capabilities and insight generation, emerging high potential future leader\nSalary Range:\nMinimum Salary:\n$50.00/hour\nMaximum Salary:\n$50.00/hour\nAt Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US based employees are eligible for healthcare benefits, retirement benefits, short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the roles primary location.\nWorker Type :\nInternship (Fixed Term)\nPrimary Location:\n3WTC\nAdditional Locations :\nJob Posting Start Date :\n2022-09-02-07:00Show more Report"}, {"company": "Finaro", "job": "", "city": "Herzliya", "date": "", "rating": "4.6", "link": "", "description": "Finaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments.\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind. At Finaro we manage critical internet-scale finance transaction services. Stability is a core value, and the BizOps analyst’s main responsibility is to deliver information-based analytics to achieve stability.\nAs part of our continued growth, we are looking for a BizOps Analyst student (60%).\nIn this role, you will operate Finaro’s core systems, analyze data lakes, build new monitoring methods and deliver better visibility and stability to Finaro’s information services.\nResponsibilities:\nDevelop methods with IT and business units to support the information system’s stability.\nMonitor business applications’ health using a variety of technologies.\nBecome an application expert and support business issues and bugs around it\nBuild Kibana (ELK) base dashboards and SQL-based reports.\nAnalyze systems malfunctions in real-time using multiple analyzing and Big data tools.\nProduce Root Cause Analysis post incidents and manage the process of proper fixes and future mitigation.\nManage real-time incidents, communicate with IT operators, Business users, and management, act as a focal point and lead the incident to proper resolution in the most responsible manner.\nRequirements:\n\nAnalyst - Strong analytical skills with the ability to collect, organize and analyze significant amounts of information with accuracy.\nStrong problem-solving skills and attention to details\nSQL - mandatory. Firm knowledge in SQL coding.\nKibana – knowledge in Kibana analysis, create reports/dashboards - advantage\nResilient – be able to sustain critical incidents.\nPossess excellent organizational and interpersonal communication skills.\nWorking in a Production environment – a strong advantage\nB.Sc. in Industrial Engineering/math/information system or other quantitative fieldsShow more Report"}, {"company": "Nym Health", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "3.0", "link": "", "description": "At Nym, we’re passionate about simplifying healthcare by automating the accurate interpretation of clinical language.\nOur interdisciplinary team has developed an innovative technology that can understand clinical language and provides an entirely new way of analyzing and decoding medical records into clear, concise, and actionable information. This ultimately ensures clinical and administrative teams can spend more time focused on patient care.\nAt Nym, the future is bright. Our engine currently processes over five million charts annually in more than 150 emergency department and urgent care settings across the US. We are backed by top-tier VCs and growing rapidly, with offices in NYC and Tel Aviv.\nCome join us!\nRole and Responsibilities:\nNym is looking for a Medical Data Analyst to join our growing Implementation group, reporting to our Squad Lead. The ideal candidate will be responsible for ensuring the successful implementation of new clients and analyzing both historical and real-time client data while supporting the on-going configuration of Nym’s CLU engine according to the client’s needs and specifications.\nAs a Medical Data Analyst, you will:\nAnalyze and understand clients’ business objectives and needs while customizing Nym’s CLU engine accordingly.\nEnsure the successful integration of Nym’s products for the client.\nSupport Nym’s clients throughout the technical integration process, including identifying bugs and recommending fixes and improvements.\nWork with our multidisciplinary R&D team (Software Engineers, Linguists and Medical Doctors, Product team, and Customer Success team.\nProvide technical solutions for alerts and incoming escalated tickets from our customers, including extensive troubleshooting and root cause assessment.\nFind workarounds and solutions for technical challenges – doing whatever it takes for the customer to get the best service out of our product.\nPerform configuration changes, deployments, and product expansions for our customers.\nDevelop automation tools and scripts to make your work more efficient.\nRequirements:\n\nHands-on SQL or Pandas skills.\nFamiliarity with medical terminology.\nAbility to work as part of a team in a fast-growing start-up.\nHigh performer in challenging situations.\nFluent in English – both written and spoken.\nPython knowledge and experience- Strong advantage.Show more Report"}, {"company": "Deloitte", "job": "", "city": "Ramat Gan", "date": "", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=343&guid=0000018626f2e0cb92a357ef26ff603b&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_38873360&cb=1676382032337&jobListingId=1008283064128&jrtk=3-1-1gp82fkc92gpu001-1gojf5ohjihmu800-d42e7a93de0dde04-", "description": "Description\n\nDeloitte is looking for an Information Systems Analyst to join our growing team.\n\nCharacterization of customer needs\nBuilding solutions\nBuilding work processes\nUser support\nAcceptance testing\nOperation monitoring management\nStatus and Integration meetings\nDiscussion summaries\nTask tracking\nRequirements\nIndustry & Management /Information Systems graduates\n1-2 Years of experience as Information systems analyst or in a similar role\nBackground and experience in the field of health- Advantage\ngood communication skills while interfacing with clients and managers\nMultitasking and self-management skills\n\nFull time Job\n\nLocation: Sheba Hospital, Ramat Gan/Airport City\n\nWe at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.Show more Report"}, {"company": "Credorax", "job": "", "city": "Herzliya", "date": "", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=343&guid=0000018626f2e0cb92a357ef26ff603b&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_46d15bcb&cb=1676382033724&jobListingId=1008328375499&jrtk=3-1-1gp82flo6jor3801-1gojf5ohjihmu800-0c5b6b8dc30970ab-", "description": "Location: Sapir Street 6, Herzliya, Israel\nAre you brilliant?\nFinaro is reimagining the payment industry.\nIf you value friendship, learning, and getting things done; if you consider yourself creative, enthusiastic and passionate about solving problems – We want to meet you!\nFinaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind.\nWe work with some of the biggest industry giants including Plus500, WOLT, Kiwi.com, Air Baltic, Payrexx, Revolut, Go2Mobile and Hero Gaming. With a growing global staff of 350 employees, main offices in Israel and Malta, and presence all across Europe, in China, Hong Kong, and North America, the future looks fantastic.\nThe future looks Finaro.\nDescription\nFinaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments.\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind. At Finaro we manage critical internet-scale finance transaction services. Stability is a core value, and the BizOps analyst’s main responsibility is to deliver information-based analytics to achieve stability.\nAs part of our continued growth, we are looking for a BizOps Analyst student (60%).\nIn this role, you will operate Finaro’s core systems, analyze data lakes, build new monitoring methods and deliver better visibility and stability to Finaro’s information services.\nResponsibilities:\nDevelop methods with IT and business units to support the information system’s stability.\nMonitor business applications’ health using a variety of technologies.\nBecome an application expert and support business issues and bugs around it\nBuild Kibana (ELK) base dashboards and SQL-based reports.\nAnalyze systems malfunctions in real-time using multiple analyzing and Big data tools.\nProduce Root Cause Analysis post incidents and manage the process of proper fixes and future mitigation.\nManage real-time incidents, communicate with IT operators, Business users, and management, act as a focal point and lead the incident to proper resolution in the most responsible manner.\nRequirements\nAnalyst - Strong analytical skills with the ability to collect, organize and analyze significant amounts of information with accuracy.\nStrong problem-solving skills and attention to details\nSQL - mandatory. Firm knowledge in SQL coding.\nKibana – knowledge in Kibana analysis, create reports/dashboards - advantage\nResilient – be able to sustain critical incidents.\nPossess excellent organizational and interpersonal communication skills.\nWorking in a Production environment – a strong advantage\nB.Sc. in Industrial Engineering/math/information system or other quantitative fieldsShow more Report"}, {"company": "SMSEdge", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=343&guid=0000018626f2e0cb92a357ef26ff603b&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_1d2a8010&cb=1676382035067&jobListingId=1007245813876&jrtk=3-1-1gp82fn1onccp801-1gojf5ohjihmu800-f97a8203fe0bd901-", "description": "Job Description\nResponsibilities\nWork with complex data to draw actionable insights\nDesign and create automatic reports, triggers, dashboards to promote data-driven decision making across the company.\nGenerate data analysis reports and translate them to the required business functions - Customer success, product or marketing\nWork with the team to determine KPI's, budget allocation and overall processes health.\nWork with our client's campaigns and creating actionable advice for our clients to use the platform.\nSomeone to bring insights and suggestions to stakeholders and customers by conducting deep analysis and research\n‍\nRequirements\n1+ years of experience as a Business/Data Analyst\nHighly proficient in SQL – a must\nExperience working with reporting tools (Tableau/QlikView/PowerBi/Sisense) - a must\nExperience with experimental design (A/B tests) and statistical data analysis\nAbility to turn large amounts of ambiguous data into a concise, meaningful story\nScripting Language: Python/R/PHP – an advantage\nBSc/BA in a quantitative field - advantage\nWorking with product team - advantage\nWorking with a business CS team - advantage\nWorking previously with SaaS product - advantage\n‍\nEmail: jobs@smsedge.com\nProduct Information\nPresentation - smsedge.com/presentation\nVideo - smsedge.com/video\n\nApply via email at: jobs@smsedge.comShow more Report"}]