[{"company": "Rimini Street, Inc.", "job": "Sr Client Success Manager, Israel", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "3.3", "link": "", "description": "Job Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nThe company is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs.\nWe have an exciting opportunity available right now to join us as a Sr Client Success Manager, responsible for a subset of clients within the EMEA region, based in Israel.\nPosition Summary\nWe are seeking an experienced Sr Client Success Manager who will be responsible for managing and expanding the partnership with our clients. The right candidate will have an entrepreneurial spirit, a proven track record of Client Management or Business Development & Executive Relationships excellence with the ability to provide solutions and guidance to meet business objectives and taking business to the next level. You must have a passion for clients. We need someone that can be very hands-on, do whatever it takes to deliver value, develop relationships, and be a strategic thinker with the ability to create long-term relationships with our clients\nAs a Sr Client Success Manager with Rimini Street, Inc., you’ll be managing a portfolio of named clients – driving client lifecycle – leading to adoption, cross-sell, advocacy and client satisfaction across your portfolio.\nEssential Duties and Responsibilities:\nDeliver and communicate ROI throughout the client lifecycle\nBuild C-level and executive relationships, establishing trusted advisor status\nDrive growth, value, retention and partnerships for our important clients to ensure active engagement and full recognition of ROI\nDevelop key account plans including; retention strategies, cross-sell opportunities, powermaps, client advocacy\nMeet/Exceed quarterly quota targets (renewals/cross-sell/advocacy)\nCreate awareness and demand for Rimini Street products and services\nIdentify, cultivate and engage on cross-sell opportunities within your portfolio for services and/or strategic solutions\nEnsure client retention through actively driving retention strategy, retention content including ROI models and proposals, and assisting with retention sales execution\nProvide ongoing proactive client management through executive business reviews, client onsite visits, executive relationships and overall client communications\nBuild and foster our Client Champion Community. Secure client sales and marketing advocates, ensuring client referenceability and driving client participation in select client marketing programs, events, interviews, etc.\nImplement and utilize current Social and Digital selling strategies to maximize opportunities via Social Networking platforms\nQuarterback the team and coordinate across executive leadership, sales, service delivery, marketing, etc.\nAdditional Duties & Responsibilities\nMonitor client consumption of Rimini Street services with the support of standard dashboards\nMaintain up-to-date client information in Salesforce.com and other systems\nProvide detailed and timely status reporting to all management as requested\nAssure client communications and escalations are performed on time, sufficiently and accurately\nOther job-related duties and responsibilities may be assigned from time-to-time\nQualifications/Skills/Experience:\n\nEducation\nBA/BS (MBA/Master preferred)\nLocation\nIsrael\nEssential Language Skills: English and Hebrew\nExperience\nGood knowledge of the enterprise software industry\nSpecific experience with Oracle and/or SAP preferable\nExperience dealing with CXO’s\nSignificant experience in Consultative Sales, Account Management, or Business Development\nExperience in managing a portfolio of clients in different industries\nExperience in cross-selling – identifying opportunities through trusted advisor partnership with clients and ability to coordinate and lead cross-functional team to drive better results for cross-sell and retention, etc.\nExperience in renewing and/or negotiating client support contracts\nExperience in working with complex, multi-divisional, multi-geographical customers\nExperience working with cross-functional teams (e.g. Sales, Renewals, Marketing, Services, etc.)\nSkills\nImpressive executive presence and communication abilities\nDemonstrated ability to provide proactive account management to a large portfolio of clients\nExceptional leadership, time management, facilitation, and organizational skills\nBias for action\nPassion for technology and for being a part of a fast-growing technology company\nProven analytical and problem-solving abilities\nProven experience with Social and Digital selling techniques\nAbility to create structure and prioritize tasks to best manage different situations\nStrong documentation skills MS Office Suite (Word, Visio, Excel, and PowerPoint); Salesforce CRM, Smartsheet, etc.\nRimini Street views all employees as partners, and is committed to providing an exciting, participatory and team-oriented work environment. In addition to our very competitive compensation packages, be prepared for challenging professional growth and fun along the way in our work-hard, play-hard corporate environment.\n#LI-DNI\nCompany Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nRimini Street is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs. According to Gartner, the third-party support market will grow to $1.05 billion by 2023, a 200% increase. With tight IT budgets and flat global economic growth, IT and procurement professionals are actively looking for proven methods to cut costs while improving service. Rimini Street enables organizations to free up budget for strategic business initiatives by delivering savings of up to 90 percent on total maintenance and support costs, and to date, the company has saved organizations over $5 billion in total maintenance costs since its inception.\nWe’re building something special at Rimini Street. A company where people care about each other and trust each other to do the right thing. A company where highly intelligent and talented people come together to do challenging and meaningful work that makes a real difference to our clients, ending each day with a sense of achievement and balance in their lives.\nBe Treated Like the Best\nRimini Street hires only the best – and provides the compensation, bonus and benefit programs appropriate for proven top-performing professionals. We want our employees to have an opportunity to share in the financial success that results from our dedication to service excellence, high-quality deliverables and an unparalleled client experience\nNo bureaucracy, thousand-page rule books or politics — just everyone working together to build a great company through service excellence and client success\nWork hard, play hard environment – Rimini Street is a group of hard-working professionals who are passionate about achieving success, but we also enjoy opportunities to meet up at fun company events\nWe are also passionate about giving back to our communities around the world, with plenty of opportunities for volunteering and charity through the Rimini Street Foundation\nAll Rimini Street professionals are encouraged to grow and learn new skills\nAccelerating Company Growth\nTrading on Nasdaq under ticker symbol RMNI since October 2017\nAdded to the US Russell 2000® Index in 2018\nOver 4,000 clients, to date including 100 of the Fortune 500 and Global 100\nAnnual 2021 financial results of $326.8 million, up 16.3% year over year\nFiscal year operating cash flow of $42.1 million, up 107% year over year\nAnnounced the new patent pending Rimini Street Artificial Intelligence Support Applications, a result of the Company’s continued investment in optimizing support processes and ensuring global service delivery outcomes at scale. Using the AI Applications, Rimini Street has been able to deliver a better client experience and reduce software issue resolution times by 23%.\nCelebrated the 15th anniversary of the Company’s founding in 2005 to redefine the enterprise software support market and bring choice and value to software licensees around the world.\nRecent Industry Recognition\nReceived 33 awards in 2020, including 15 awards for excellence in customer service from awards companies such as the International Stevie Awards, the American Stevie Awards, and the Stevie Awards for Sales & Customer Service\nHonored with four Gold awards for Company of the Year in 2020.\nThe Rimini Street Foundation recognized with two awards in 2020 for Corporate Social Responsibility Program of the Year\nIn addition, in 2020 the Company supported more than 120 charities around the world through the Rimini Street Foundation, providing financial contributions, volunteer hours and in-kind donations including personal protective equipment to healthcare workers, senior centers, food banks and youth organizations globally. The Foundation also extended its charitable work in 2020 to Hong Kong, Malaysia, Mozambique, Sweden and the UAE.\nTo learn more about how Rimini Street is redefining the enterprise software support industry, visit http://www.riministreet.com\nRimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, national origin, sexual orientation, gender or gender identity, disability and protected veterans status or any other characteristic protected by law.\nPlease Note: Rimini Street does not accept resumes submitted by recruiting/staffing firms unless specifically requested by Human Resources. Unsolicited resumes will be ineligible for referral fees.Show more Report"}, {"company": "Lilly", "job": "Sr. Associate - Oncology Medical Science Liaison", "city": "Raanana", "date": "5d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=302&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_48e9eba7&cb=1676382131495&jobListingId=1008443297074&jrtk=3-1-1gp82il54p6df801-1gojf8alfih63800-d72af6f9cd756197-", "description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 35,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.\nResponsibilities\nThe Medical Science Liaison is a highly knowledgeable scientific person who is primarily responsible for answering the scientific and clinical needs of Scientific Experts (SE). He / She will be placed in a dynamic and motivating environment dedicated to the launch of new products and in a path of professional career. The Medical Science Liaison is a field-based role.\n\nKey Responsibilities:\nIdentification of SEs and development of relationship with them\nProvide deep and advanced disease state and product expertise to SE\nEngage in continuous learning within their therapy area, through literature search, participation in scientific congresses etc.\nCommunication of scientific intelligence and clinical insights\nRespond to unsolicited request, also at congresses\nParticipation in consultant meetings\nDrive digital innovation in engaging customers\nBasic Qualifications\nAdvanced degree in health sciences (PharmD, MD, PhD in a medically related field) OR Masters / bachelor’s level degree in health sciences (e.g. BSN, RPh, PA, NP) with previous experience in Oncology TA.\nAdditional Skills/Preferences\nEnglish proficiency (written and oral): Advanced (B2/C1)\nPassion for science, results, and high standards\nGreat and demonstrable learning agility\nBusiness acumen (starting from scientific information)\nProactive – takes independent action and responds quickly.\nEnthusiasm for a variety of digital technologies with the ability to assimilate complex information and systems.\nConfidence and willingness\nAsk questions, understand, and translate into suggestions/ new solutions.\nDemonstrable ability to operate in a compliant way.\nBrilliant and demonstrable presentation skills\nAbility to effectively communicate scientific data into meaningful, clear, and compliant content.\nAbility to manage a complex environment and prioritize different projects at the same time.\nEli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.\nLilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n#WeAreLillyShow more Report"}, {"company": "Medtronic", "job": "Sales Representative II Patient Monitoring & Respiratory Interventions", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=303&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cd3144c5&cb=1676382132751&jobListingId=1008407683093&jrtk=3-1-1gp82imenjor3801-1gojf8alfih63800-2df411b02464b91b-", "description": "Careers that Change Lives\nWe’re a mission-driven leader in medical technology and solutions with a legacy of integrity and innovation.\nWork with us to incentivize better patient care, and partner across the industry to make healthcare more affordable and accessible. Be a part of a community of experts committed to ensuring quality, affordable healthcare worldwide.\nCome strengthen your specialized skills and enhance your expertise. We’ll support you with the training, mentorship, guidance, and networks you need to advance, and empower you to work in the way that’s best for you.\nTogether, we can confront the challenges that will change the face of healthcare. Join us for a career that changes lives.\nThe main purpose of this role is to sell the Patient Monitoring & Respiratory Interventions range of products based on clinical expertise and strong network in order accelerate adoption for new technologies and improve outcome and patient safety.\nA Day in the Life\nThe jobholder is primarily responsible for selling the full range of products in assigned territory in a professional manner to hospitals and related healthcare professionals. He/she will build strong ethical business relationships with customers to ensure usage of our products and expanding the market and penetration, leading through value selling. He / she will cooperate and coordinate activities with the Clinical Application Specialists in the territory in order to maximize PM&RI business opportunities.\nCustomer Management\nAchieve AOP and increase market share and market penetration.\nPresent and sell PM&RI products and services to current and potential customers.\nPrepare presentations, proposals, and sales contracts.\nIdentify and resolve customers concerns.\nCoordinates offers and tenders.\nHandles complaints and back orders.\nRises awareness around solutions. Organizes and coordinates product demo and workshops.\nBusiness Development\nLead with clinical selling activities within the territory. Coordinate with other MDT teams where needed.\nConduct initial product demonstrations and Initiate/coordinate clinical evaluations to OR/ICU/other staff.\nDevelop target list and selling strategy / account mapping.\nPrepare action plans and schedules to identify specific targets in order to achieve our goals.\nFollow up on new leads and referrals resulting from field activity. Identifies / quantifies opportunities and enter them in Salesforce.com.\nOccasionally interacting with purchasing managers / hospital administrators to set up and negotiate broader sales contracts.\nTake a wide organizational view of selling and managing accounts, with sufficient knowledge of competitors and their products.\nMaintain customer knowledge by gathering information about account activities and potential, key decision makers, competitive participation, market share etc.\nSupport & Training\nCommunicate current and new products, special developments, information, or feedback gathered through field activity to appropriate company staff.\nCoordinate with company staff to accomplish the work required to close sales.\nProvide verbal technical support and organize regular in-services.\nPromotes and sells Medtronic's products and services within an assigned geographic area and /or specific customer accounts to meet or exceed sales targets.\nResponsible for developing, building, and strengthening long-term relationships with stakeholders including distributors and healthcare professionals.\nResponsible for pursuing leads, assessing needs and providing product services to maximize the benefits derived from Medtronic's products and/or services.\nPromotes and establishes education of the company's products and/or services.\nConducts market research including customers and competitors' activities.\nImplements market development plans/strategies and changes as needed.\nCommunicates customer feedback on new products and/or modifications to existing products or applications to internal stakeholders including R&D, Operations and Marketing.\nMust Have: Minimum Requirements\nDegree in Life-science, Marketing, Business Administration or Biology, Paramedic or another relevant, advanced degree\nGood selling techniques and excellent selling strategies. As well as thorough knowledge of the decision-making process with customers (economic buyer, reimbursement)\nFluency in English\nProven track record to work independently, highly motivated with a “can do” attitude.\n Nice to have\nParamedic\nExperience in the medical device industry\nAbout Medtronic\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.***\nPhysical Requirements\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.\nAt Medtronic, you will find a diverse team of innovators who bring their unique backgrounds and their individual life experiences to work every day. We work hard to cultivate a workforce that reflects our patients and partners, we believe it’s the only way to drive healthcare forward. We want to attract a diverse workforce, regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, veteran status, or any other characteristic protected by state or local law. Join us, and bring the power of your point of view to our culture of collaboration and innovation. It is through strong diversity, inclusion, and engagement that we can remain a leader in medical technology and solutions. And by embracing everything you have to offer —your unique perspectives, talents, and contributions —we can live up to the promise of our Mission\n***This position is an exciting and new opportunity to work with Medtronic’s Patient Monitoring, Respiratory Interventions and/or Medtronic Care Management System businesses. Currently a part of Medtronic, these businesses are being transitioned either into a new stand-alone company (currently referred to as NewCo) or will be merged into the business of another company. While you will start your employment with Medtronic, upon establishment of NewCo or upon the transition of the business unit to another company, in approximately 12-15 months your employment will transfer to one of these entities and you will no longer be employed by Medtronic.\nThe business will have the same singular focus, financial commitment, deep domain expertise, and global footprint needed to accelerate the development and commercialization of affordable and scalable healthcare technologiesShow more Report"}, {"company": "Medtronic", "job": "Senior Clinical Data Annotation Specialist - Petah Tikva", "city": "Petah Tikva", "date": "7d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a16d8c32&cb=1676382133981&jobListingId=1008435589255&jrtk=3-1-1gp82inktjoq2801-1gojf8alfih63800-fc87c5c4caac516e-", "description": "Careers that Change Lives\nWe’re a mission-driven leader in medical technology and solutions with a legacy of integrity and innovation. Be a part of a community of experts committed to ensuring quality, affordable healthcare worldwide.\nCome strengthen your specialized skills and enhance your expertise. We’ll support you with the training, mentorship, guidance, and networks you need to advance, and empower you to work in the way that’s best for you.\nTogether, we can confront the challenges that will change the face of healthcare. Join us for a career that change lives.\nA Day in the Life\n\nJoin the data annotation team which focuses on tagging and labeling clinical imagery that will be used for artificial intelligence training. Use advanced visualization tools to locate, label, tag and categorize critical bodily structures. Support our Machine Learning team by providing feedback to improve processing tools and add new features. In this role you will:\nJoin the annotation team of minimally invasive surgical imagery composed of physicians, nurses, medical students.\nHelp create annotation work methodology creation and execution for effective annotations used for artificial intelligence efforts.\nTeam member of a multi-disciplinary R&D team, including close work with algorithm developers and software developers.\nWork closely with clinical advisors to improve deliverables and provide precise and detailed output.\nMust Have\nEducation:\nM.Sc or higher in medical or biomedical related fields.\nExperience:\nDeep knowledge in human anatomy, physiology.\nAt least one (1) year of experience in working with clinical data.\nExperience and passion for adopting new and developing technologies\nA data driven and analytical mindset. A keen sharp eyed observant.\nClinical background, especially in surgical procedures - a plus\nAbout Medtronic\n\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\n\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.\nPHYSICAL REQUIREMENTS\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.Show more Report"}, {"company": "Medtronic", "job": "Senior Quality Operations Manager", "city": "Israel", "date": "30d+", "rating": "4.0", "link": "", "description": ""}, {"company": "PerceptionBox", "job": "T2-3 Technical Support", "city": "Herzliya", "date": "19d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=306&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_21d2a262&cb=1676382136587&jobListingId=1008412072796&jrtk=3-1-1gp82iq67j4gi801-1gojf8alfih63800-4bd94b659c3cd65e-", "description": "On behalf of our client PerceptionBox is looking for a T2-3 Technical Support Engineer to work on a challenging healthcare project.\n\nResponsibilities:\n\nWork on resolving various technical incidents for the Company’s customers involving various software, networking and hardware environments;\nMaintain deep knowledge of Company operations to support client/team technical requests effectively;\nState machine management via UI (creating/modification states), troubleshooting;\nInvestigation of bugs, logs analysis, route case system research;\nDevelop documentation regarding installation, upgrades, support, and compatibility issues.\n\nRequirements\n\n2 years of experience in an L2-L3 technical support;\nT3 Tech support with 2-3 years experience in AWS systems\nExtensive knowledge of SQL scripting;\nStrong ability to take ownership from initial report and follow through until full resolution and customer satisfaction;\nKnowledge of web technologies: HTML, CSS, JS, etc.;\nBasic knowledge of troubleshooting performance issues in a distributed microservices environment;\nExperience with monitoring/logging tools (Such as Grafana, Kibana, OpenTelemetry, Jaeger);\nProven record of working in a highly pressured multi-tasking environment and working independently;\nExperience with OpenVPN;\nGood communication skills and customer service focus;\nPassion for troubleshooting and ability to come up with efficient solutions for unordinary issues.\nUpper Intermediate English.\n\nWill Be a Plus\n\nAWS Cloud - Experience working with Cloud solutions or in Cloud software Support Team;\n2 years of experience as a Junior Node JS developer willing to do 6 months of Tech Support prior to joining the development team.\nWe Offer:\nCompetitive salary fixed in USD;\nPrivate Entrepreneurship formalisation;\nCozy office in Tel-Aviv AND Opportunity to work remotely from the whole world;\nSick Leave coverage;\nVacation – 17 working days (flexible, if you need more);\nWork within growing service company with prospectives for education and career advancement;\nParticipation in projects within the active development stage;\nThe friendly international team of strong professionals that will help you to achieve results;\nAgile management & internal mobility, no bureaucracy and initiative-friendly attitude;\nPossibilities for business trips abroad;\nCorporate team building events.Show more Report"}, {"company": "Edwards Lifesciences", "job": "Manager Sales & Clinical Field Clinical Specialist TMTT", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=307&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a8cecbd7&cb=1676382138727&jobListingId=1008431373140&jrtk=3-1-1gp82is9hp6d7801-1gojf8alfih63800-eba939df8627f46f-", "description": "Develops clinical education materials in connection with clinical investigations. Provides expertise and clinical insights on the device, procedure and protocol throughout the life cycle of the clinical investigation.\n\nKey Responsibilities:\n\nEstablish, maintain and develop mutually, profitable business relationships between Edwards Lifesciences and its customers (both external and internal) with appropriate levels of clinical/management in hospitals by offering service, product knowledge, and clinician education excellence\nProvide education during the procedure on all aspects of the device, device handling, implantation and troubleshooting techniques related to equipment, tools and products required for device implants.\nReview market and competitor information and propose action plans to increase our position in the marketplace\nDevelop strategy to facilitate product presentation, product trials, implementation and in-service education to meet customer’s requirements\nDevelop strategy for focused education plans for key accounts and potential accounts to support sales in collaboration with Sales Managers and Sales Reps\nAttend and educate at conferences as needed\nOther incidental duties\n\nEducation and Experience:\n\nBachelor's Degree or Equivalent in a related field\nSales/Commercial experience within the medical device field and/or clinical experience\nTraining experience in clinical / technical environment Preferred\n\nAdditional Skills:\n\nProven expertise in MS Office Suite\nStrong written and verbal communication skills, presentation, and interpersonal relationship skills including negotiating and relationship management skills\nExcellent problem-solving and critical thinking skills\nGood ability to read, write and speak English, preferred\nExpert knowledge and understanding of cardiovascular science\nExpert understanding of cardiovascular anatomy, pathology and physiology\nExpert understanding of medical device regulatory requirements and documents, device accountability and adverse events reporting\nAbility to manage confidential information with discretion\nStrict attention to detail\nAbility to interact professionally with all organizational levels\nAbility to manage competing priorities in a fast paced environment\nMust be able to work in a team environment, including inter-departmental teams and key contact representing the organization on contracts or projects\nAbility to interact with senior internal and external personnel, including key opinion leaders (KOLs) on significant matters often requiring coordination between organizations\nAdhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Philips", "job": "Regulatory Affairs Program Manager", "city": "Haifa", "date": "27d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=308&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_01d59a8a&cb=1676382140652&jobListingId=1008396590116&jrtk=3-1-1gp82iu5aj4it801-1gojf8alfih63800-03c442bbd6b80b89-", "description": "Job Title\nRegulatory Affairs Program Manager\nJob Description\nPhilips is a global leader in health technology, committed to improving billions of lives worldwide and striving to make the world healthier and more sustainable through innovation. Driven by the vision of a better tomorrow.\nBut it’s not just what we do, it’s who we are. We are 80,000, wonderfully unique individuals, with two things in common. An unwavering sense of purpose and a relentless determination to deliver on our customers’ needs. It’s what inspires us to create meaningful solutions – the kind that make a real difference – when it matters most.\nIn this role, you have the opportunity to make life better\nYou will be part of the Regulatory Affairs team for CT business within Precision Diagnosis. Leading teams in regulatory strategy development that ensure and maintain global market access of these products, directly impacts the lives of patients.\nYou are responsible for\nLeading a global Regulatory Affairs team for end-to-end regulatory affairs input and deliverables for new product introductions and product changes across the globe.\nRepresent the Regulatory Affairs function at the leadership team.\nThrough end-to-end regulatory processes, ensuring safe and effective products / solutions are brought to market, on time, and sustained throughout life cycle via compliant, innovative regulatory strategies\nProvide critical input on regulatory risk assessments to support portfolio selection\nCollaborate and extend in proactive, strategic relationships with external stakeholders (Notified Bodies, FDA, Competent Authorities and other Regulatory bodies) to ensure that requirements are known early during strategy development, enabling rapid market access with the current portfolio in connection with future innovations.\nLead and enable strong cross-functional partnership between Regulatory Affairs and all key stakeholders including R&D, Marketing, Quality, Clinical Affairs and other functions at all levels within the business, and the local Regulatory Affairs teams in the Philips international markets organization.\nHiring and development of critical talent within the global Regulatory Affairs team through creating and sustaining robust development plans, ongoing coaching and feedback, and identifying and addressing capabilities gaps, may become a part of your responsibility\nYou are a part of\n\nYou will be an integral team member of the Precision Diagnosis Regulatory Affairs team and therefore, influence and shape the regulatory capabilities for future success of Philips.\nTo succeed in this role, you’ll need a customer-first attitude and the following\nMaster’s degree, preferably in a life-scientific field.\nA minimum of 10 years of experience working in Regulatory Affairs within a medical device industry.\nExtensive knowledge and authoring of FDA and other regulatory submissions (Pre-submissions, IDE, 510(k), PMA, Technical Files/Design Dossier).\nExtensive knowledge of MDD, MDR, MedDev’s, FDA QSR’s, ISO 13485 & 14155, and other for the market EMEA applicable regulations and standards for Hardware/Software medical devices\nExperienced in strategic relationships with external stakeholders (e.g., Notified Bodies, FDA, Competent Authorities);\nExperienced in formulating and implementing global regulatory strategies to ensure compliance with worldwide regulations to improve product market access.\nAn excellent communicator and collaborator who can build and maintain cross-functional partnerships in support of business successes.\nSelf-directed with a strong work ethic and with an ability to work in a goal-oriented environment.\nAn ability to work on issues of diverse scope where analysis of situation or data requires evaluation of a variety of factors, including an understanding of current business trends. Follows processes and operational policies in selecting methods and techniques for solution.\nIdeally, 5 years of people management – with a strong track-record in successfully leading a Regulatory Affairs team to bring products to market on time.\nIn return, we offer you\na chance to be part of a company that is committed to improving the lives of 2.5 billion people a year by 2030 through market-driven innovations in healthcare.\nWe are passionate about offering our employees the challenges, responsibilities, coaching, and learning opportunities needed for their personal and professional development.\nWe believe that we are at our best as a company when you are at your best as a person.\n\nThus, we offer competitive benefits, a flexible work environment, and access to regular local health & well-being-focused activities.\nThis is in addition to:\nWe care about your career development and at Philips, you will enjoy endless job opportunities all over the world\nWe truly care about your work-life balance and offer you a Flexible and Hybrid working model with 2-3 working days from home\nPhilips University is available to all employees for learning and developing the skills that matter to you\nFree of charge gym in our hubs and exercise classes to help you look after your body\nWe're making every effort to ensure that our teams are more diverse and to create an inclusive work environment where every person feels like they belong\nA great opportunity to be more involved in the community, to volunteer, and take part in different community projects as part of your role\nAccess to a wide variety of company benefits – with a strong focus on health and well-being and family activities\nThe Philips employee shop allows employees to buy Philips products at a discounted price\nWhy should you join Philips?\nWorking at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on innovative, customer-first health technology solutions. Help us improve the health and well-being of billions of people, every year. Ultimately creating a career that no one could have planned for. Even you.\n\nTo find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there, you can also learn about our recruitment process, or find answers to some of the frequently asked questions.\n#LI-EUShow more Report"}, {"company": "Vim", "job": "Senior Technical Project Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "We are looking for a Senior Technical Project Manager!\n\n\nWhy a Career at Vim?\n\nVim is building massively scalable digital infrastructure to improve US healthcare for all involved. Our mission is to power affordable, high quality healthcare through seamless technology connectivity, and we work with the most innovative health plans and providers in the country to get it done.\n\nThe US healthcare system is a $3.2 trillion mess - a system that accounts for 18% (and rising) of US GDP, and where no one is happy with the current state. Our innovative technology connects data to the point of care across the health system, and our product capabilities address the critical cost, quality, and experience levers of healthcare improvement. The result is lower costs, higher quality, and improved experience for care teams and patients.\n\nVim is a company where employees can thrive and grow. We're a progressive and inclusive meritocracy. Bring your unique background and experience, improve our business operations, and make the US health system better for everyone.\n\n\nThe Delivery Team:\n\nOur Delivery Team is a critical function in our growing business. This team is tasked with ensuring that Vim's channel partners successfully shift from closed sales opportunities into live solutions through onboarding, R&D-customer coordination and analytics.\n\nWhat you'll do:\n\nServe as the point of contact and project manager for all implementation and integration activities with the project's channel partner, collaborating closely with our R&D leaders and leading detailed scoping, data integration, project planning, KPIs definition and control, project execution, UATs and go live process.\nTrack progress internally and externally, making sure the project is on the right path while identifying and managing risks on completion.\nLead execution process from end to end, controlling customer requests and managing expectations on both sides.\nCollaborate across the organization: work closely with Provider Growth, Payer Sales and Account Management, Marketing, Product and R&D development leaders to create a seamless channel partner experience.\nBe the project within Vim in a \"Deliver or Die\" state of mind.\n\n\nWho we are looking for:\n\nHighly independent: you take ownership of challenges, researching and recommending solutions and driving execution\nInterpersonal skills: you thrive in a fast-paced team environment with high performance standards\n'Can-do' attitude: you bring a strong desire and drive to tackle complex problems\nBroad perspective: you can see the big picture while staying detail-oriented\nDriven by a 'why': personally dedicated to improving health care\n\n\nWhat you will need:\n\nMust Have\n\n5+ years technical project management within Saas tech companies (3+ in US healthcare organizations- advantage).\nStrong project management and organization skills, with demonstrated experience delivering results across multiple workstreams and projects at once.\nProven experience driving customer integrations and deploying project management best practices\nExperience with creating verbal and written communication products for clients, including presentations, tutorials, demos and whitepapers\nShare Vim values: win as a team, obsess over purpose, integrity, constant improvement ownership, going big and positive energy and enthusiasm.\nPossess outstanding interpersonal and communication (written and verbal) skills that allow you to quickly and authentically connect to colleagues and customers.\n\nNice to Have\n\nSolid knowledge of the health information technology landscape as relevant for working directly with healthcare businesses.\nTechnological background (actual software engineering).\nCustomer success background- preferred.\n\nAbout us: We are headquartered in New York, with R&D in Tel Aviv, and are backed by Sequoia, GreatPoint Ventures, Optum Ventures, and large BCBS payers. Our customers include health plans and physician-led healthcare systems.\n\nBy inputting your information and clicking \"Submit Application\", you acknowledge that you have read and agree to Vim's Candidate Privacy Notice.Show more Report"}, {"company": "GE Healthcare", "job": "MICT Program Sourcing Leader", "city": "Haifa", "date": "16d", "rating": "4.3", "link": "", "description": ""}, {"company": "Edwards Lifesciences", "job": "Senior Sales Specialist - Distributor Surgical", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=311&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d0cb32ac&cb=1676382144800&jobListingId=1008447723501&jrtk=3-1-1gp82j26vkbnn801-1gojf8alfih63800-b120728b73f7bd86-", "description": "Advise sales management on distributed sales customer information, market trends, and Edwards' historical sales data for development of strategies to achieve business development goals. Ensure validity of all distributed sales transactions and pricing.\n\nBe the primary contact with Israeli cardiac surgeons and hospital staff to ensure sales and promotion of the Surgical portfolio in collaboration with local distributor.\n\nKey Responsibilities:\n\nLead in analyzing customer pricing data, and developing and updating customer pricing data reports for provision to Distributors, in keeping with Distributor agreement\nAnalyze Distributor chargeback/rebate claims; negotiate and provide solutions to resolve discrepancies with Distributors\nLead in analyzing Distribution sales trends, develop findings, and propose solutions for sales management\nResolve complex Distributor issues and propose solutions to achieve desired sales results\nAssess and prioritize Distributor AR account issues in collaboration with Finance to allocate resources to address discrepancies\nConfirm accuracy of sales tracings and Distributor sales shipments\nWorks independently on complex projects and/or lines of work\n\nEducation and Experience:\nBachelor's Degree in in related field of study, previous commercial background, business analysis experience including, spreadsheets, database management systems, and word processing Required\n\nAdditional Skills:\n\nProven expertise in MS Office Suite including Word, PowerPoint, Access, and Excel; Qlik experience preferred\nExcellent written and verbal communication skills and interpersonal relationship skills including consultative and relationship management skills\nAbility to quantify abstract conceptual data into concrete analysis\nAdhere to all company rules and requirements (e.g., pandemic protocols, Environmental Health & Safety rules) and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control\nExperience with distribution contracts preferred\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Cisco Systems", "job": "Associate Solutions Engineer - Bachelor/Master (Graduate) - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=312&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_32ff1b43&cb=1676382146701&jobListingId=1008313665965&jrtk=3-1-1gp82j426ih5h801-1gojf8alfih63800-0e20aed5fb47c639-", "description": "Start date: 31st July 2023\nTraining location: Amsterdam, Netherlands\nPost-training location: Tel Aviv, Israel\nArea of Interest: Sales –Product\nWhat You’ll Do:\nCisco Sales Associates Program offers a global environment that provides structured training and on-the-job-experience. We will develop your technical, sales and communication skills and give the opportunity to rotate through a variety of areas based on our model of Education Exposure Experience. You will learn how to position Cisco’s architectures, solutions and products to our customers.\nYour career will continue in a sales engineering role as part of Cisco’s Global Virtual Engineering (GVE) Team. GVE is a technical presales organisation, that provides software and systems engineering services to customers, partners, and internal Cisco sales employees. As a sales engineer, you’ll discover, demonstrate and design solutions by engaging with our customers and partners to bring simple solutions to their complex challenges.\nFrom there, your career can develop and grow into a variety of sales opportunities at Cisco.\nWhile challenging, it will push you to become the best version of yourself. You will achieve industry-standard certifications, as part our perpetual learning approach, and be assessed and mentored through customer simulations and on-the-job activities. We’ll offer you a safe and fun environment to practice what you’ve learnt, all the while providing you with feedback to develop your potential.\nWho You'll Work With:\nYou’ll be part of our Cisco Sales Associates Program (CSAP), an award-winning and industry recognised early-in-career development program for top university graduates from around the world. You’ll train alongside incredibly hardworking individuals, like yourself, from different countries and diverse backgrounds. Early on, you’ll make long-lasting friendships and belong to a rich human network that will support you throughout your career.\nAs a successful Associate Solutions Engineer (ASE), you’ll expand your software and networking knowledge to collaborate with Cisco sales professionals and provide technical solutions that drive business outcomes for our customers and partners.\nYou’ll learn from experts and coaches in an unrivalled setting using our own leading-edge technology. You’ll have your own mentor, a CSAP alumnus who’s been in your shoes and will help guide you in your first year. With a strong Cisco team committed to your success, you’ll gain hands-on education and experience, while receiving an attractive salary and pursuing your career dreams!\nWho You Are:\nRecent graduate or on your final year of studies towards a degree or related program or other academic certification in any of the STEM subject areas ideally with an emphasis on networking and computing\nMust have graduated by May 2021 or later\nFluent in English and Hebrew\nMust be able to legally live and work in Israel, without visa support or sponsorship (student visas or visas obtained on your own are not applicable for the program)\nWilling to relocate for 12 months to a designated CSAP training hub as required. Immigration and relocation support will be provided should the program be delivered in training hubs as opposed to virtually.\nTechnology enthusiast who enjoys innovating ideally with a demonstrated passion and interest in software languages. such as Java or Python\nDemonstrate an eagerness to establish a long-term Sales career with Cisco Israel.\nWhy Cisco\nAt Cisco, each person brings their own talents to work as a team and make a difference.\nYes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people.\nWe connect everything – people, process, data and things – and we use those connections to change our world for the better.\nWe innovate everywhere - From launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education and more.\nWe benefit everyone - We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities.\nColourful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Be you, with us. #WeAreCisco\nCisco is an equal opportunity employer.\n@Cisco #CiscoJobs #WeAreCisco\nCisco are always looking to identify talented people. If you are reading this posting then we may not have an open job right now, however it is highly likely we will in the future. If you are interested in working for Cisco in this capacity then please submit your details and CV or resume against this requisition so that when a suitable vacancy arises a Cisco representative can contact you directly.\nPlease note that vacancies will be filled on a rolling basis after opening, and we will close applications as offers are accepted; possibly before the stated deadline. Therefore, we highly recommend you submit your application as early as possible in order to be considered for the opportunity of your choice\n\nJoin us for Cisco in 60 - a set of 60-minute webinars from November 2021 – April 2022 for potential candidates to experience Cisco. More info and register HERE.\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "Medtronic", "job": "(Senior) Robotics Field Service Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=313&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f8d9821a&cb=1676382147951&jobListingId=1008340888970&jrtk=3-1-1gp82j59ck60h801-1gojf8alfih63800-055db631b01181b7-", "description": "Careers that Change Lives\nThe Robotics Field Service Engineer is responsible for all aspects of equipment support performed at customer sites or before delivery, and to ensure that it is completed in compliance with all company policies and standard operating procedures. This will include, pre-installation checks, system installation/commissioning, planned maintenance, troubleshooting, assessment, and breakdown repair.\nThe Robotics Field Service Engineer is the main contact point with the local customers and the local commercial team for all Service and Repair related questions.\nA Day in the Life\nLead and execute installations and commissioning of new equipment.\nPerform preventive maintenance as per service manual checklist. Perform appropriate testing to confirm system functionality according to the manufacturer's specifications.\nAttend breakdown calls and perform repairs and troubleshooting independently.\nProvide testing and validation support and data to the Global Service organization.\nAssist in technical support for users of Robotic systems. Including phone and remote support for users and technical staff.\nCollaborate with other field service engineers to troubleshoot difficult service activities.\nTravel to sites to work as a member of the local team to provide efficient repair/installation support.\nMust-Haves\nBachelor's degree is required – minimum of 4 years of relevant experience or advanced degree with a minimum of 2 years of relevant experience. Good knowledge of troubleshooting methods/skills and capital equipment control.\nSystems are primarily used in the operating room, so healthcare / surgical setting experience is required.\nExperience with robotics or motion control within a large capital equipment environment.\nTeam player with strong interpersonal skills.\nAvailable to travel (around 50% of the time) domestically and internationally and work outside of core office hours.\nStrong analytical and problem-solving skills that are balanced with speed and effectiveness.\nEffective verbal and written English and Hebrew communication skills.\nNice to Haves\nVocational/ Trade certificate with minimum 8 years of experience; Diploma/ Associate Degree with minimum 5 years of experience; Bachelor's degree with minimum 3 years of experience.\nIn-depth experience with medical devices for a minimum of 3 years.\nComplete and broad knowledge of operational systems, techniques, and practices typically gained through extensive experience and/or education.\nEffective presentation and negotiation skills.\nProficiency in Microsoft Office.\nWe Offer\nWe offer a competitive salary and benefits package to all our employees:\nFlexible working environment.\nAnnual Incentive Plan % depending on company results.\nPension scheme and group discount on healthcare insurance.\nTraining possibilities via Cornerstone/Harvard Manage Monitor/Skills Lab\nEmployee Assistance Program and Recognize! (our global recognition program).\nAbout Medtronic\n\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.\n\nYour Answer\nIs this the position you were waiting for? Then please apply directly via the apply button!Show more Report"}, {"company": "K Health", "job": "Senior Technical Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1f1aab51&cb=1676382149463&jobListingId=1008375425681&jrtk=3-1-1gp82j6ocnccp801-1gojf8alfih63800-627b9ff00f9717f5-", "description": "Who we are:\n\nK Health is a venture-backed, fast-growing start-up with a mission to use the power of shared knowledge to get everyone access to higher quality, more affordable health care. We're looking for mission-driven individuals to join our growing team and help us eliminate healthcare inequalities and build a better, healthier future for us all.\n\nNamed as one of FastCompany's Most Innovative Health Companies of 2022 and to the 2021 CNBC Disruptor 50 list, K Health is using Artificial Intelligence (AI) to build the smartest digital healthcare platform in existence. Our data-driven app brings together the knowledge of thousands of doctors and the anonymous medical records of millions of people to help diagnose and treat what's wrong. We offer a free symptom checker and 24/7 access to doctors to ask questions, refill prescriptions, get care for your kids, and more. Right from your phone—no insurance needed.\n\nSince we were founded in 2016, K Health has raised over $270M in VC funding and our Series E funding round brought us to Unicorn status. Our current partners include the Mayo Clinic Platform, Anthem, and Maccabi Health Services.\nAbout the role:\n\nWe are looking for a Senior Technical Product Manager who has experience in healthcare interoperability and API management. You will focus on building consumer and provider facing product features with a multidisciplinary team of physicians, software developers, UX designers, and QA engineers. In this role, you will work with our implementations team, data science team, and other cross functional teams to understand their needs and pain points, and provide a consistently robust and high quality experience. #LI-Hybrid\n\nWhat you'll be doing:\n\nOwn the roadmap to grow and integrate all services developed by clinical automation squad.\nManage the execution of projects and support the roll-out of products, meeting product deliverable milestones and deadlines\nManage complex, cross-functional projects across a team of designers, software developers, medical and QA while managing the interfaces with stakeholders and time-zones\nDefine product requirements, user stories, mockups, and acceptance criteria in collaboration with engineering or independently\nDrive and participate in regular cadences (stand up's, retrospective, planning meeting) and be engaged with the team throughout the product life cycle\nProvide the right level of support and direction to keep the engineering team working efficiently and aligned with the overall product strategy\nOwn the tools for developers to create and manage API integrations including setup, monitoring, troubleshooting, and high-quality documentation\nOwn the core set of APIs and related processes to manage these APIs and the rollout of updates\n\nWhat we're looking for:\n\n5+ years of platform or technical product management experience\n2+ years of experience delivering platform products which have a high-degree of complexity (involving complex data pipelines, integrations, or similar)\nDeep developer empathy and the ability to distill customer use cases into a set of flexible APIs and features\nExcellent written and communication skills with the ability to collaborate & communicate with both technical and non-technical stakeholders\nAbility to provide execution details through product specs and user stories\nExcellent data and analytical skills including the ability to define and decompose relevant metrics and perform data analysis through BI tools/SQL\nNot a coder but comfortable enough to use and demo the API Product being built\nAbility to make API requests (JSON),make API calls with Postman/Curl\n\nBenefits & Perks:\n\n20 paid vacation days, 18 days sick leave, and 10 3-day weekends\nHybrid work schedule with team meals and stocked fridges\nCommuter Benefits\nCommunity focused events\nPension Plan\nStipend per day for food\nStock options for every full-time employee\nVocational Studies Fund\n\nK Health offers competitive compensation packages along with stock options based on industry benchmarks for function, level, and geographic location. Offer amounts are determined by multiple factors such as a candidate's experience and expertise.\n\nWe're deeply committed to building teams as diverse as the patients we serve and strive to cultivate an environment where everyone can bring their most authentic self to work. We depend on our differences to make our team stronger, our workplace more dynamic, and our product accessible to all of our users.\nK Health is proud to be an Equal Opportunity Employer and considers applicants for employment regardless of race, ethnicity, religion, color, national origin, ancestry, disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, sexual orientation, pregnancy, childbirth and breastfeeding, age, citizenship, military or veteran status, or any other class protected by applicable federal, state, and local laws.Show more Report"}, {"company": "Iguazio", "job": "Senior Customer Success Engineer", "city": "Herzliya", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=315&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cc0c8748&cb=1676382150738&jobListingId=1007493153004&jrtk=3-1-1gp82j802i6gq801-1gojf8alfih63800-e3eb7fde1383a7e7-", "description": "About The Position\n\nIguazio is looking for a Data Engineer to be part of our all-star Customer Success Team, that spearheads the company's customer engagements, and play a critical role in our mission delivering a ground-breaking solution to the market.\n\nThe Customer Success Team is responsible for enabling customers to build new data science applications they could only dream of, building batch and real-time data pipelines using serverless distributed frameworks.\n\nYou can expect to drive Data Science Platform POCs for Data Scientists and their Data engineering teams, consult and implement data solutions within Tier1 enterprise customers.\n\n\nWhat You'll Do\n\nEngage directly with customers on data science/engineering automation at scale including data pipeline acceleration and optimization\nWork closely with Data scientists and Date engineers.\nWork directly with Iguazio teams of Solution Architect, Sales, Product Management and R&D, feeding requirements and priorities\n\n\nEssential Skills\n\nYou must be a fast thinker and executor, have great communication skills, patient, a people's person, sharp and details oriented.\n\n\nDoes This Describe You?\n\n3-5 years of experience with Python / Scala / Java / GO Coding - Must.\n2+ years of experience developing and tuning Spark applications at high volumes – MUST\n2+ years of experience building solutions with the Big Data tools and frameworks such as Spark, Hive, Cassandra, NoSQL, etc.\n2+ years of experience working with streaming engines/message queues such as Kafka, Kinesis, Rabbit, etc.\nExperience working with external clients as PS engineer/customer engagement and great communication skills – big advantage\nExperience with Docker, Kubernetes and serverless computing and architecture - an advantage\n\n\nAbout the Company\n\nData science is too important to today's enterprise to be held back by delays and inefficiencies.\n\nWe're building a faster, easier, and smarter way for data science to flow seamlessly from raw idea to real-world impact. This is data science brought to life.\n\nIguazio provides an MLOps (machine learning operations) platform which automates and accelerates the data science process, enabling the rollout of new AI services continuously across the enterprise. The company raised $72M from top financial and strategic VCs, is led by a team of serial entrepreneurs, and serves a diverse set of customers worldwide, ranging from technology companies such as NetApp, financial service companies like Payoneer and healthcare customers like the Sheba Medical Center.\n\nWe're looking for top talent to help us continue our growth — and grow with us!Show more Report"}, {"company": "Cisco Systems", "job": "Software Team Leader (Cloud Security)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=316&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a165cf5f&cb=1676382152538&jobListingId=1008280317099&jrtk=3-1-1gp82j9o3k60o801-1gojf8alfih63800-626431e166f31eff-", "description": "Who We Are\nCisco Cloud Security TLV - A small group of about 40 Engineers, PMs, UX.\nHybrid work style, while offices located on Rothschild Blvd. Tel Aviv (moving to Azrieli area soon, next to the train station)\nWorking in a startup atmosphere with the benefits of a very successful Company.\nWe are part of the Cisco Cloud Security Group working on Cisco Umbrella.\nThe teams in TLV lead several Secure Internet Solutions such as Cloud Access Security Broker (Data Loss Prevention), Cloud Internet Gateway, Shadow-IT, Malware Detection, and more.\nProduct - Cisco Umbrella\nWho You Are:\nAn ambitious HO SW Team LeaderFluent with at least one of the programming languages Java, Python, NodeJS, Scala, Go (6+ years)Knowledgeable with frontend frameworks Reactjs (3+ years) - advantageExperienced with Relational/Non-Relational DBsFamiliar with microservices architectureVast experience in Cloud technology (AWS, Azure, GCP)Familiar with the DevSecOps culture and CI/CD processesSelf-learnerA great team player with effective collaboration skills across teams\nWhat does it mean being a Software Team Leader in our team?\nBe the hands-on team leader, and take full ownership of the team’s domainWorking in a high-scale environment in the cloud while working on cutting-edge technologies.Adhere to the standards of one of the industry cyber security leaders.Improve your skills and learn along with top-notch engineers.Create innovative solutions for complex technical problemsAlways strive to deliver high-quality additions to our productsYou build it, You own it!\nWhy Cisco?\nAt Cisco, each person brings their unique talents to work as a team and make a difference.\nYes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people.\nWe connect everything – people, process, data and things – and we use those connections to change our world for the better.\nWe innovate everywhere - From launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education, and more – from Smart Cities to your everyday devices.\nWe benefit everyone - We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities.\nColorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Be you, with us!\n#LI-TY1\n#CiscoSecureEng23\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Senior Analyst Compliance", "city": "Tel Aviv-Yafo", "date": "5d", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=317&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4c4f1233&cb=1676382153895&jobListingId=1008443115751&jrtk=3-1-1gp82jb2tkcmp801-1gojf8alfih63800-d4715b710905e1e2-", "description": "Senior Analyst Compliance\nDate: Feb 1, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 44972\nWho are we?\n\nTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds.\nWorking here means working with the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.\n\nHow you’ll spend your day\nProviding systems and reporting support to the TPDD team (primary responsibility),\nProviding systems and reporting support to the DP team in the International Markets region (secondary responsibility),\nUpdating records and documents in online tools to assist the TPDD and DP teams in their work of advising business colleagues on TPDD and DP matters,\nCreating reports from the data on these tools to help TPDD and DP teams and business colleagues understand the status of TPDD and DP matters,\nIdentifying areas for improvement in the process of using the tools or documenting processes of the TPDD and DP teams,\nSupporting Teva’s Global Compliance & Ethics program overall.\nYour experience and qualifications\n\nEducation: A university education is preferred (business, economics, etc.).\nExperience: Two to three years of corporate experience in country operations. Pharmaceutical experience preferred. Experience in control functions is helpful.\nFluent in Hebrew (local language) and English (corporate language) (speaking and writing)\nRelationship-building skills: The ability to interact effectively with colleagues having different languages, cultures, and customs.\nAnalytical skills: The ability to review and evaluate situations and make sound business recommendations.\nOrganizational skills: The ability to manage multiple tasks and data streams efficiently and quickly.\nPresentation skills: The ability to train different audiences with targeted communications.\nCreative thinking skills: The ability to identify risks, gaps, or areas of improvement.\nComputer skills: The ability to use standard computer software and applications with a high degree of sophistication, in particular Microsoft Excel and PowerPoint.\nMatrix skills: The ability to work effectively in a matrixed business structure (functional and business needs; local, regional and global projects)\nKnowledge: Rules and requirements regarding healthcare compliance and interactions with HCPs and governmental officials\nLocal pharma industry code\nData privacy environment\nEssential elements of a robust and effective compliance programs\nPolicy and process development and implementation\n\nFunction\nLegal & IP\nSub Function\nBusiness Compliance and Ethics\nReports To\n\nVP, Global Privacy Officer & Third Party Due Diligence\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "", "job": "Medical Billing & Collections Associate", "city": "Jerusalem", "date": "6d", "rating": "", "link": "", "description": "An established Healthcare company is looking to expand its Medical Billing and Collections department in our Har Chotzvim office in Jerusalem.\n\nThe ideal candidate should have strong problem-solving capabilities and be able to work well under pressure. Organization and time management are essential skills for this position. Attention to detail is imperative. This is a US-hours position, Monday through Thursday, 4pm-12am.\nNo prior experience is needed and training will be provided.\n\nJob Responsibilities:\n\nBilling all payor sources\nReviewing resident data\nMonthly reconciliations and reports\nCoordinating with nursing home staff\nResolving outstanding receivable reports\nManaging resident data in billing software\n\nClick HERE to apply!Show more Report"}, {"company": "GE Healthcare", "job": "Sourcing Site Leader", "city": "Haifa", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=319&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_715f8dc2&cb=1676382156324&jobListingId=1008233004339&jrtk=3-1-1gp82jdf0i7kt801-1gojf8alfih63800-b3ffebc9ed2abac1-", "description": "Job Description Summary\nNegotiate with dedicated providers according to specific policies. Achieve the best contractual conditions while also ensuring internal customer satisfaction. In-depth understanding of key business drivers; uses this understanding to accomplish own work. In-depth understanding of how work of own team integrates with other teams and contributes to the area.\nJob Description\nKey responsibilities:\nKey team member in a cross-functional segment team responsible for the interfacing and global owner between Development teams and the Global Operations organization, including leading the key deliverables for sourcing segment for the total product life cycle (NPI & Installed Base).\nKey focal point for all Supply Chain issues pertaining to NPI installed base component obsolesce and quality, including manage NPI deliverables required to establish an optimal supply chain focused on strategic suppliers with a strategy to achieve target product ICVs for assigned segment.\nKey focal point from MICT Sourcing team in Israel, will lead the Haifa MICT sourcing team to work closer with each functional stakeholders.\nChampion sourcing initiatives early in NPI process to ensure excellence in supplier selection, components, and platform specification including the selection of strategic suppliers and simplification and meeting target costs/management of ICV and variance targets.\nIntegrate the Engineering, Production, and Sourcing objectives in the execution of assigned segment including promoting standardization across programs for supplied product and champion sourcing initiatives early in the NPI process (including supplier P&E), and to ensure excellence in supplier selection and component and platform specification driving supplier capability measurements for assigned programs.\nCollaborate with engineering to ensure technology match occurs between supply partners and engineering & manufacturings to ensure capable product and factory fulfillment requirements are met.\nQuality Specific Goals:\nAware of and comply with the GEHC Quality Manual, Quality Management System, Quality Management Policy, Quality Goals, and applicable laws and regulations as they apply to this job type/position Complete all planned Quality & Compliance training within the defined deadlines Identify and report any quality or compliance concerns and take immediate corrective action as required Knowledge and understanding of GEHC Purchasing Controls Procedure and associated Work Instructions and operates within them to ensure that all purchased product and services conform to specified requirements. Develop and maintaining of fully qualified and compliant supply base.\nQualifications:\nBachelor’s Degree in Engineering/technical or commercial related field.\n5 plus years experience in manufacturing engineering, sourcing or engineering.\n3 years work experience technical depth/knowledge in assigned segment.\nProficiency with Microsoft Excel spreadsheets development and analysis.\nWilling to travel domestically and internationally up to 25% of time.\nPreferred Qualifications:\nWorking experience with development and production with Medical Devices.\nPractical experience in balancing and optimizing engineering process rigor with product delivery priorities.\nExcellent program/project management experience with the ability to develop and execute on integrated program plans.\nEffective problem solving ability to lead and influence others (cross-functionally and globally).\nDemonstrate strong execution skills and ability to drive change globally.\nExperience with eNPI, ePDM and Oracle systems.\nMBA or Master Degree in Technical field.\nCertified Green Belt.\nGE Healthcare is an Equal Opportunity Employer where inclusion matters. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\nWe expect all employees to live and breathe our behaviors: to act with humility and build trust; lead with transparency; deliver with focus, and drive ownership – always with unyielding integrity.\nOur total rewards are designed to unlock your ambition by giving you the boost and flexibility you need to turn your ideas into world-changing realities. Our salary and benefits are everything you’d expect from an organization with global strength and scale, and you’ll be surrounded by career opportunities in a culture that fosters care, collaboration and support.\n#LI-TM1\nAdditional Information\nThe job is open to men and women equally\nRelocation Assistance Provided: NoShow more Report"}, {"company": "Medison Pharma", "job": "Distribution Team Leader", "city": "Petah Tikva", "date": "27d", "rating": "3.7", "link": "", "description": "Medison is a global pharma company on a mission to help patients around the world get faster access to lifesaving, innovative, breakthrough therapies.\nMediHome - Medison's logistics, services, and solutions leader in healthcare is looking for a Distribution Team Leader to Manage the distribution process and manage the distribution drivers team.\nResponsible for the transportation and distribution of products to the customer, and that it meets the regulations of the company and the Ministry of Health.\nAnalysis of the distribution lines, Providing data, and Monitoring the distribution expenses,\nProviding solutions that support business activity in optimal distribution conditions\nA thinking partner for optimizing distribution in the short and long term\nRequirements:\n\nHigh school education.\nExperience and Ability to manage a team.\nAvailable to work irregular hours.\nService-oriented, Assertive, and Pedant.\nPatience, courtesy, and the ability to work independently\nResponsibilities:\n\nOpening the logistic center daily\nManagerial routines - holding team meetings, providing continuous feedback, joining distribution drives on the road for close monitoring\nholding case studies in the field of distribution\nDuring special cases - assisting the operations team, and ordering taxis with judgment.\nFinding solutions and optimizing the entire distribution field - in terms of delivery times and expenses.\nManaging real-time events while taking into account both the solution to the patient and relevant interfaces in order to execute the distribution - distribution drivers, subcontractors, and taxis.\nData analysis – production of reports that will form the database for decision-making in distribution lines, optimization, expenses, operation of subcontractors, and judgment regarding the types of vehicles.\nTesting with customers the quality of the distribution\nVehicles - managerial responsibility for choosing the type of vehicle, the installation process, and the ongoing operation of all systemsShow more Report"}, {"company": "Oqton", "job": "Senior Product Manager Clinical Software", "city": "Central", "date": "30d+", "rating": "4.6", "link": "", "description": ""}, {"company": "", "job": "RECRUITING MANAGER (US hours)", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=322&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c704e53d&cb=1676382160731&jobListingId=1008221743875&jrtk=3-1-1gp82jhp3kuha801-1gojf8alfih63800-1c33253321132427-", "description": "Job description\n\nThe Recruiting Manager is responsible for planning, implementing and directing the recruiter activities of the company in order to achieve billing objectives. As the Recruiting Manager you will lead, develop, and manage a combination of experienced team members as well as new hires within an existing, fully operational and profitable unit.\n\nThe recruiting manager will fit the following criteria:\n\nNative or native-level English\n\nRecruitment experience – Preferred\n\nExperience in the Healthcare sector – Preferred\n\nManagerial experience – 2 years minimum, with a team of minimum 5 members\n\nCareer-oriented and competitive\n\nGood listener\n\nOrganized and professional\n\nMain Job Goals, Tasks and Responsibilities\n\nYour initial goals are to maintain continued productivity, operations, build up the team, identify team leaders and put them in place to allow you to:\n\nAct as a resource to your team leaders\n\nFocus on training new staff\n\nOversite and supervision of the full cycle of operations within your team\n\nTrack, collate and interpret recruitment figures\n\nForecast annual, quarterly and monthly recruitment revenue\n\nGenerate timely recruitment reports\n\nConduct Weekly/Monthly/Quarterly meetings\n\nEvaluate performance of recruitment staff\n\nProvide feedback, support and coaching to the recruitment team during problematic situations\n\nManage and handle all personal matters arising from team members\n\nOther Duties:\n\nWill perform similar functions as he deems fit for the proper execution of his duties, and duties as delegated by the CEO.\n\nSchedule/location\nSunday: 10:00am – 4:00pm / WFH\nMonday: 3:30pm – midnight / Office\n\nTuesday: 3:30pm – midnight / Office\n\nWednesday: 3:30pm – midnight / Office\nThursday: 3:30pm – midnight / Office\nRequirements\n\nThe recruiting manager will fit the following criteria:\n\nNative or native-level English\n\nRecruitment experience – Preferred\n\nExperience in the Healthcare sector – Preferred\n\nManagerial experience – 2 years minimum, with a team of minimum 5 members\n\nCareer-oriented and competitive\n\nGood listener\n\nOrganized and professionalShow more Report"}, {"company": "", "job": "Recruiting Team Leader (US hours)", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=323&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bbdd8a98&cb=1676382162890&jobListingId=1008221743744&jrtk=3-1-1gp82jjrekhqf801-1gojf8alfih63800-d9bf425cc741785d-", "description": "Job Description\n\nThe Recruiting Leader handles planning, implementing, and directing the recruiter activities of the company in order to achieve billing objectives. As the Recruiting Leader, you will lead, develop, and manage a combination of experienced team members as well as new hires within an existing, fully operational, and profitable unit. Main Job Goals, Tasks and Responsibilities\nYour initial goals are to maintain continued productivity, operations, buildup the team, identify team leaders and put them in place to allow you to:\nAct as a resource to your teams\nFocus on training new staff\nManagement and supervision of the full cycle of operations within your team\nTrack, collate and interpret recruitment figures\nForecast annual, quarterly and monthly recruitment revenue\nGenerate timely recruitment reports\nConduct Weekly/Monthly/Quarterly meetings\nEvaluate performance of recruitment staff\nProvide feedback, support and coaching to the recruitment team during problematic situations\nManage and handle all personal matters arising from team members\n\nOther Duties: Will perform similar functions as he deems fit for the proper execution of his duties, and duties as delegated by the CEO. Schedule/location\nSunday: 10:00am – 4:00pm / Work from HomeMonday: 3:30pm – midnight / OfficeTuesday: 3:30pm – midnight / OfficeWednesday: 3:30pm – midnight / OfficeThursday: 3:30pm – midnight / Office Requirements\n\nNative-level English\nRecruitment experience – Preferred\nExperience in the Healthcare sector – Preferred\nManagerial/Team leader experience – 1-2 years minimum\nCareer-oriented and competitive\nGood listener\nOrganized and professionalShow more Report"}, {"company": "Healthee", "job": "Senior Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "About us:\nIt’s 2022, people. Health ‘benefits’ should be easy, accessible, and affordable. Enter Healthee, which helps employees discover what’s covered, which provider to see, what it costs, and how to book an appointment—all within 27 seconds. It’s a win-win for HR Pros, reducing your workload and costs, and making your employees healthier, happier, and more loyal. Empower your employees to take full advantage of their health benefits, without replacing your broker.\nWe’re on a mission to support employees and transform their health care experience. We’re building an AI powered platform that is designed to support every employee with healthcare benefits, navigate their plans and optimize care..\nWant to join our mission-driven team? Read on.\nWe are looking for an experienced product manager with proven ability to create successful products that customers love, that is excited to join our growing team and to be part of making people healthier.\n\nObjectives\nBe obsessed with the customer - understand their needs and challenges pains and motivations\nOwn your product vision and roadmap based on customer and business needs\nLead the product lifecycle from ideation to execution to drive fast impact to our customers\nDevelop and monitor key metrics to measure the success of the product to drive the business goals\nManage ongoing collaboration with engineering, PM, design, CX, Sales and marketing\nAnalyze the market and competitive landscape\nRequirements\nAt least 7 years of product experience of building impactful products\nExperience working in B2C companies\nPassionate about user experience\nStrategic thinker with a ‘can-do’ and ‘get things done’ attitude\nSelf driven, take ownership and obsess with impact\nAnalytical and data driven mindset\nA people person and team player\nAdvantage: Expert in the American health insurance system\nBenefits\nHybrid Work\nStock Options\nTraining & DevelopmentShow more Report"}, {"company": "Nuance", "job": "Software Development Lead (Healthcare Software Solutions)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=325&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_63c9b73d&cb=1676382165538&jobListingId=1008232778582&jrtk=3-1-1gp82jmf4kcmj801-1gojf8alfih63800-dd1995a82549740b-", "description": "We are Nuance Communications - a Microsoft Company and we are looking for a strong and experienced Software Development Lead/Manager to join us. Our group focuses on innovative technologies for the Health & Life Sciences industry and builds products involving conversational intelligence, natural language processing, machine learning, and diverse algorithmic approaches, delivering products to millions of users around the world. The Manager will manage a team of software developers focusing on Patient Engagement.\nAs part of our Patient Engagement Solutions (PES) team, you’ll be helping modernize the technologies patients use to interact with providers across healthcare organizations. PES combines decades of healthcare expertise with award-winning AI-powered intelligent engagement technology to automate personalized patient interactions — addressing some of the most pressing patient experience, staffing, and financial challenges. You’ll be working on solutions that provide easy access to self-service and live assistance across both voice and digital channels to optimize organizational performance, help control costs, and boost patient satisfaction.\nResponsibilities\nRequires strong technical and analytical abilities, problem solving, and design skills.\nHire, build, and manage software engineers.\nLead the design, development, quality delivery and support of software products, technologies and services focused on Health AI and Patient Engagement scenarios.\nLead the development of complex business logic of a hosted service.\nCreate engineering plans and execute them while ensuring effective quality delivery of the plans.\nOversee the production system, make sure live site issues are handled, and have his people work with support functions to resolve critical customer issues.\nLead security, privacy, and compliance processes on the engineering side.\nBe the source of knowledge of a breadth of technology skills and ensure that industry best practices are followed.\nMentor software engineers and provide technical guidance and expertise to the team members.\nRequired Skills\n6+ years full-stack development experience using .NET/C#/Java/NodeJS/TypeScript or similar.\n2+ years of experience as a Lead / Mentor / people manager of a software development team. (Essential)\nExperience with healthcare data and systems, Health & Life Sciences domain experience or biomedical knowledge. (Essential)\nTrack record of delivering services at scale and supporting complex production systems and enterprise-grade applications.\nExperience in building cloud-based solutions/services on public cloud like Azure.\nExperience in handling security, privacy, and compliance-related processes.\nStrong written and oral communications skills as well as excellent listening skills.\nMethodical, well-organized, thorough and detail oriented.\nTeam player, positive attitude, collaborative.\nDedicated, hard worker, makes things happen.\nPreferred Skills\nExperience with EMR integration (Epic, Cerner) is an advantage.\nExperience with Conversational AI / chatbot development, conversational interfaces or IVR/speech systems is an advantage.\nNLP experience is an advantage.\nEducation\nBSc or MSc in Computer Science (or equivalent).\nThis is a Hybrid work location role. Remote and In-Office as needed.\n#LI-NP1\n#LI-Hybrid\nNuance offers a compelling and rewarding work environment. We offer market competitive salaries,\nbonus, equity, benefits, meaningful growth and development opportunities and a casual yet technically\nchallenging work environment. Join our dynamic, entrepreneurial team and become part of our\ncontinuing success.Show more Report"}, {"company": "Nuance", "job": "Senior Software Development Engineer - Healthcare", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": "We are Nuance Communications - a Microsoft Company and we are looking for strong and experienced software developers to join us. Our group focuses on innovative technologies for the Health & Life Sciences industry and builds products involving conversational intelligence, natural language processing, machine learning, and diverse algorithmic approaches, delivering products to millions of users around the world. The software developers will be focusing on products and services in the area of Patient Engagement.\nAs part of our Patient Engagement Solutions (PES) team, you’ll be helping modernize the technologies patients use to interact with providers across healthcare organizations. PES combines decades of healthcare expertise with award-winning AI-powered intelligent engagement technology to automate personalized patient interactions — addressing some of the most pressing patient experience, staffing, and financial challenges. You’ll be working on solutions that provide easy access to self-service and live assistance across both voice and digital channels to optimize organizational performance, help control costs, and boost patient satisfaction.\nResponsibilities\nRequires strong technical and analytical abilities, problem solving, and design skills.\nDesign, development, quality delivery and support of software products, technologies and services focused on Health AI and Patient Engagement scenarios.\nDevelopment of service infrastructure\nEffectively execute engineering plans with quality deliveries.\nHandle production system issues and work with support functions to resolve critical customer issues.\nRequired Skills\n3+ years full-stack development experience using .NET/C#/Java/NodeJS/TypeScript or similar.\nExperience with high scale tech e.g., Kubernetes, Terraform, CI/CD pipelines.\nTrack record of delivering services at scale and supporting complex production systems and enterprise-grade applications.\nExperience in building cloud-based solutions/services on public cloud like Azure.\nExperience in handling security, privacy, and compliance-related processes.\nStrong written and oral communications skills.\nThorough and detail oriented.\nTeam player, positive attitude, collaborative, dedicated, hard worker, makes things happen.\nPreferred Skills\nExperience with healthcare data and systems, Health & Life Sciences domain experience or biomedical knowledge is an advantage\nExperience working in Azure / Microsoft technology stack\nConversational AI / chatbot development experience is an advantage.\nEducation\nBS or MS in Computer Science (or equivalent).\n#LI-NP1\n#LI-Hybrid\nNuance offers a compelling and rewarding work environment. We offer market competitive salaries,\nbonus, equity, benefits, meaningful growth and development opportunities and a casual yet technically\nchallenging work environment. Join our dynamic, entrepreneurial team and become part of our\ncontinuing success.Show more Report"}, {"company": "Analog Devices", "job": "Staff Engineer, Field Applications", "city": "Raanana", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=327&ao=1136043&s=58&guid=0000018626f42a6ca8269f1bd882dd37&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_936c3b2b&cb=1676382168901&jobListingId=1008377232479&jrtk=3-1-1gp82jpkf2dh9001-1gojf8alfih63800-089b856340ff0d2e-", "description": "Analog Devices (NASDAQ: ADI) designs and manufactures semiconductor products and solutions. We enable our customers to interpret the world around us by intelligently bridging the physical and digital worlds with unmatched technologies that sense, measure and connect.\nCandidate will provide field applications support, pre-sales and post-sales technical support to Strategic and Key customers for Analog Devices products used in industrial Automation and Healthcare. The Candidate also will support the Broadmarket. These parts range from Amplifiers, Data Converters, Power Supplies to industrial Communications. This involves working with customers, sales teams and products lines to identify key opportunities and position the best solutions tailored to customer needs to grow Analog Devices market share\nActivities include, but are not limited to:\nUnderstanding customers' system and proposing solutions using as many ADI components as possible.\nDeveloping and maintaining strong relationships with the customer and ensuring fast responses.\nTraining customers on Analog Devices' solutions and products and presenting at seminars.\nTraining Product Lines, Sales, and Applications on customer’s system requirements.\nRun evaluation systems/boards, being able to provide on-site customer lab support.\nWorking together and coordinating activities with the Account Managers, driving customer’s technical support activities and coordinating actions with Marketing and Product Lines.\nDeveloping and maintaining good relationships with Product Lines, Marketing and Application teams. Providing regular inputs and updates to help the definition of new products.\nProviding regular inputs on opportunities/designs wins and losses.\nQualifications\nGraduate/Postgraduate degree in electronics engineering, preferably MSEE or PhD\n3-5 years of analog experience at board/system level or previous experience as Field Application Engineer or similar role will be an advantage.\nMixed signal circuit applications/design at the board/system level. Experience in Networks (Hard- and Software) is a plus\nGood organizational skills and the ability to multi-task many projects and set priorities. Able to organize activities in an independent way.\nTeam player, outgoing personality with a ‘can-do’ attitude. Capability to present to and work with all levels of Management, Sales, and Engineering\nFlexibility and proactive attitude are a must.\nGood lab measurement and debug skills.\nGood verbal, written communication and interpersonal skills. Fluent English and local language.\nAbility to deliver convincing presentations\nRegional Travel (within territory) 35-50%\nFor positions requiring access to technical data, Analog Devices, Inc. may have to obtain export licensing approval from the U.S. Department of Commerce - Bureau of Industry and Security and/or the U.S. Department of State - Directorate of Defense Trade Controls. As such, applicants for this position – except US Citizens, US Permanent Residents, and protected individuals as defined by 8 U.S.C. 1324b(a)(3) – may have to go through an export licensing review process.\nAnalog Devices is an equal opportunity employer. We foster a culture where everyone has an opportunity to succeed regardless of their race, color, religion, age, ancestry, national origin, social or ethnic origin, sex, sexual orientation, gender, gender identity, gender expression, marital status, pregnancy, parental status, disability, medical condition, genetic information, military or veteran status, union membership, and political affiliation, or any other legally protected group.\nJob Req Type: Experienced\n\nRequired Travel: Yes, 50% of the time\n\nShift Type: 1st Shift/DaysShow more Report"}, {"company": "Team8", "job": "Claroty-SW Team Leader", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "Claroty empowers the world's largest enterprises to secure their cyber-physical systems across industrial (OT), healthcare (IoMT), and enterprise (IoT) environments: the Extended Internet of Things (XIoT). The Claroty Platform integrates with customers’ existing infrastructure to provide a full range of controls for visibility, risk and vulnerability management, threat detection, and secure remote access. Our platform is deployed by hundreds of organizations at thousands of sites across all seven continents.\nLaunched by the famed Team8 foundry in 2015, Claroty is headquartered in New York City, with employees across the Americas, Europe, Asia-Pacific, and Tel Aviv. Claroty has raised $635 million in funding from the world’s largest investment firms and industrial automation vendors – including SoftBank, Bessemer Venture Partners, Rockwell Automation, Schneider Electric, and Siemens – making it the most well-funded industrial cybersecurity company.\nAt Claroty, we are looking to hire individuals who embody our core values: People First, Customer Obsession, Strive for Excellence, and Integrity.\nClaroty is an equal opportunity employer and is committed to fostering a diverse and inclusive work environment for all. We encourage applications from candidates of ALL diverse backgrounds, and special accommodations are available upon request in all phases of the hiring process.\nWe are looking for you - A talented team leader looking for their next journey.\nWe offer a great workplace with a talented team, exciting changes, and a feeling of impact.\nRESPONSIBILITIES\nLead a talented team of developers that drives the core of our product throughout the development life cycle\nDrive technical excellence, high product quality, innovation, and timely delivery in an agile environment\nWork closely with Product Management, Customer Care, and other stakeholders from ideation to real customer value\nMentor and grow team members in their career path\nRequirements:\n\n3+ years in leading R&D teams - Must\n5+ years of experience in backend/full-stack development - Must\nExperience in developing large-scale applications in Python - Must\nKnowledge and experience with a popular JavaScript framework (Angular/React) - Advantage\nProven experience, in both architecture and implementation-level software design of high-scale systems\nExperience in Cyber Security, Linux & Networking - Advantage\nTeam player, mentor, strong communication and problem-solving skills\nWillingness to work in a fast-paced, and driven team in a context-switching environment\nTeam8:\n\nClarotyShow more Report"}, {"company": "Claroty", "job": "SW Team Leader", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "Claroty empowers the world's largest enterprises to secure their cyber-physical systems across industrial (OT), healthcare (IoMT), and enterprise (IoT) environments: the Extended Internet of Things (XIoT). The Claroty Platform integrates with customers’ existing infrastructure to provide a full range of controls for visibility, risk and vulnerability management, threat detection, and secure remote access. Our platform is deployed by hundreds of organizations at thousands of sites across all seven continents.\nLaunched by the famed Team8 foundry in 2015, Claroty is headquartered in New York City, with employees across the Americas, Europe, Asia-Pacific, and Tel Aviv. Claroty has raised $635 million in funding from the world’s largest investment firms and industrial automation vendors – including SoftBank, Bessemer Venture Partners, Rockwell Automation, Schneider Electric, and Siemens – making it the most well-funded industrial cybersecurity company.\nAt Claroty, we are looking to hire individuals who embody our core values: People First, Customer Obsession, Strive for Excellence, and Integrity.\nClaroty is an equal opportunity employer and is committed to fostering a diverse and inclusive work environment for all. We encourage applications from candidates of ALL diverse backgrounds, and special accommodations are available upon request in all phases of the hiring process.\nWe are looking for you - A talented team leader looking for their next journey.\nWe offer a great workplace with a talented team, exciting changes, and a feeling of impact.\nRequirements:\n\n3+ years in leading R&D teams - Must\n5+ years of experience in backend/full-stack development - Must\nExperience in developing large-scale applications in Python - Must\nKnowledge and experience with a popular JavaScript framework (Angular/React) - Advantage\nProven experience, in both architecture and implementation-level software design of high-scale systems\nExperience in Cyber Security, Linux & Networking - Advantage\nTeam player, mentor, strong communication and problem-solving skills\nWillingness to work in a fast-paced, and driven team in a context-switching environment\n\nResponsibilities:\n\nLead a talented team of developers that drives the core of our product throughout the development life cycle\nDrive technical excellence, high product quality, innovation, and timely delivery in an agile environment\nWork closely with Product Management, Customer Care, and other stakeholders from ideation to real customer value\nMentor and grow team members in their career path\n\nRegion:\n\nTel AvivShow more Report"}, {"company": "Hello Heart", "job": "Engineering Team Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "About Hello Heart:\n\nHello Heart is the only digital therapeutics company to focus exclusively on heart disease, the leading cause of death for U.S. adults. Through a connected device and mobile app that uses AI, behavioral science, and personalized digital coaching to drive lifestyle changes, Hello Heart empowers people to embrace healthier behavior, which can reduce the risks of high blood pressure and heart disease. It also helps users catch blood pressure readings that are extremely high and encourages them to talk to their doctor to identify potential risk in time. Validated in peer-reviewed studies and trusted by leading Fortune 500 companies, Hello Heart is easy to use and works alongside an employer's benefits ecosystem. Founded in 2013, Hello Heart is a member of the American Heart Association's Innovators' Network and is part of the CVS Health Point Solutions Management program. Hello Heart is backed by leading VCs including Stripes, Khosla Ventures, IVP, Blue Run and Resolute. Visit www.helloheart.com for more information.\nAbout the role:\n\nWe're looking for an engineering leader to manage a full-stack engineering team. Someone who is passionate about technology and people (The order does not matter). Someone who can manage complex projects with high quality and meet deadlines.\n\nIf you love working in a fast-paced, collaborative environment and have an execution-oriented mindset, we've been waiting for you.\n\nAreas of responsibility:\n\nBuild the product that is used daily around the world and actually saves lives!\nLead all aspects of software development in the team - from technologies stack, quality, scalability, and security, to processes and people development.\nDrive technical excellence, high product quality, and timely delivery to meet company business goals.\nHire, retain and lead a team of talented engineers.\n\nQualifications:\n\n3+ years of experience in managing Full-Stack Engineers.\n5+ years working as a software engineer.\nExperienced with React JS/React Native/Scala/Java - advantage.\nBSc Computer Science, Mathematics, or related degree.\nExperience designing and building complex production web applications.\nHighly motivated and passionate about developing people, teams, and technology.\nLead by example with a \"hands-on\" management style.\n\nHit the links below to know us better:\n\nNew research reveals: This is how we help people to reduce high blood pressure\n\nHow does it feel when your code saves people from sudden death?\n\nThe way our technology is upgrading the field of healthcare\n\nDeveloping entrepreneurship within our company\nHello Heart has a positive, diverse, and supportive culture - we look for people who are collaborative, creative, and courageous. Oh, and if you want to see some recent evidence of the fun things we do at Hello Heart, check out our Instagram page.Show more Report"}]