[{"company": "Driscoll Health", "job": "Registered Respiratory Therapist (PRN) - Neonatal Care Center South", "city": "Central", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=0000018626f1c26ea503535563b10fdc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c0c5bc46&cb=1676382009653&jobListingId=1008317808031&cpc=1F3C18ACF2451959&jrtk=3-1-1gp82eu7nma4q801-1gojf3glji7mo800-b307f95e9cab37fc--6NYlbfkN0CNm3PQhVQL26QWFq7acN2axG3nvaiWZ3xVvjxZ1gvo8Wb6xNYctLE2fVVxE17FbRasWj7g9QRuaNqA0NUmRmNVlgdgLeRpdm8JkJfJdcDpqOVvsxMpaPWMoMTqWrDAFbD-lSXlkGAczSObA-C1eQ_Oc_C6NRBLJE77Ug1BXtwiR4m8-H-F2-rtKyszGXEelSuEUBBJIH7D5NO6P5SHh8Y17xBLXIyufN7gBPvwcIwOI5YGKDllFfGfuqaL9qDnAA6z6mKEVf0VhTVduGSXYxwRzDpZO9hkH68e5p3zPcUNn5ggNI1e3fhyzC0oi0l8nm9D2d4TXufxliWAYIVg-H9H9a9yNUm35ofrRb9KFwScEDBK-u3dQZ7eDX0UqkAaN-hTAAQ7XWhQj1IjKt7MdiyPWyrKlPqnfQnRz3nvGwyE41WzfUsSKmuTpdrRr_N5xrhdX24cDwkodM8rJ_85lMHk1gaw7VP7uVsFTAVkefD43Lka8l3dH7dn6iYfjortiABjm5yYa19jl-9YR9Rx26jVDii95id_3rDZCwYBp41N9PqkauaMGXkOyXww79raF-UH8iShUBK2PK3wnTrVb6tSXGIcEA3JLBT6igpd1-HnVea2bN2jjGAfYJ9nY81LXaeQJCyRT9na9UFc51KVpx7rlGO45DVbXUIhuZDCjl5vhU2XUeQz5Cygu36wgBfQxASYFc0yyUt-zsuK1i6i6_eU", "description": "Where compassion meets innovation and technology and our employees are family.\nThank you for your interest in joining our team! Please review the job information below.\nPURPOSE OF JOB:\nThe staff respiratory therapist (RRT) is a professional that provides respiratory therapy services to patients within the hospital and complies within the established standards of practice, policies and clinical guidelines reflective of evidence-based best practice. The respiratory therapist plans and delivers effective patient care within their scope of practice and within the frame work of Driscoll Health System's vision of excellence and integrated care delivery. The practice of the respiratory therapist contributes to creating an environment that is patient focused, family centered and is designed to provide continuation of care and patient transition management.\nESSENTIAL FUNCTIONS AND BEHAVIORAL EXPECTATIONS:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills, and/or abilities required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job description is not intended to be all-inclusive; employees will perform other reasonably related business duties as assigned by the immediate supervisor and/or hospital administration as required.\nAssembles respiratory therapy equipment prior to patient use.\nSetup, troubleshoot, and evaluate effectiveness of respiratory support systems in use.\nSetup and monitoring of respiratory therapy equipment and administer therapy to include but not limited to: aerosol, oxygen, chest percussion, positive pressure breathing, lung lavage, breathing exercises transcutaneous oxygen/carbon dioxide monitors, end tidal carbon dioxide monitors, pulse oximeters nitric oxide, nitrogen, heliox therapy equipment and mechanical ventilators.\nResponds to emergency situations to assist or manage respiratory support measures and assist with cardiopulmonary resuscitation and patient transports.\nMonitors patient pulmonary condition and progress, and reports any abnormal findings to shift supervisor and/or nurse.\nSuggest therapeutic modification of care plan to prescribing physician.\nAssist with training of new employees.\nAssist with department's continued quality improvement plan.\nAssist with equipment cleaning / disinfection measures during peak workloads.\nTransport patients within or out of hospital.\nVolunteer for hospital / community service.\nLICENSE, EDUCATION AND/OR EXPERIENCE:\nAssociate in Applied Science (AAS) or graduate from an accredited Respiratory Therapy program.\nLicense to practice Respiratory Care issued by the Texas Medical Board\nNational Certification in specialty must be attempted within 3 years of completing orientation and continuously maintained ongoing\nCERTIFICATES, REGISTRATIONS:\nRegistered Respiratory Therapist credentialed by the National Board for Respiratory Care. One year general care experience and/or one year pediatric care experience preferred\nBasic Life Support (BLS) for Healthcare Provider (before hire)\nNeonatal Resuscitation Program (NRP) (within 1 year of hire)\nPediatric Advance Life Support (PALS) (within I year of hire)\nPerinatal/Pediatric Specialist (NPS) — Preferred (must attempt within 3 years of hire)Show more Report"}, {"company": "Driscoll Health", "job": "Registered Respiratory Therapist - Pool/PRN", "city": "Central", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1110586&s=58&guid=0000018626f1c26ea503535563b10fdc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_414681ae&cb=1676382011702&jobListingId=1007824928043&cpc=C433947A107EB3A8&jrtk=3-1-1gp82f07sp6dn801-1gojf3glji7mo800-b89001af1ba8c4b8--6NYlbfkN0CNm3PQhVQL26QWFq7acN2axG3nvaiWZ3xVvjxZ1gvo8Wb6xNYctLE2fVVxE17FbRbVZOx5nhf_e_buVb5ggziwihceDVMp0JTyQxO9DOioiZZJyi4gqZy8oll_t10jzcOa0sBeyCq0RmE1YgSJIod-I__UfWYc5yUc40CHiOgirIlnLRjiWwgvqDBCzP8dJTIHX-B7EQHiCUy471v6xvMHlPcqzDhxW8RERw1D7r-CaXKGMI809Ed7cEx1krijQN4LasA_xjVdHze0xCoM3ZVogjSmPlcKziJLKHvvC9-3SPhc7Wr-W3dvcmjS4SbjJT_KaZfAaTC-uHmFp9S6fXOEMIGM60wUVsg5C1jfjM6ZkU5a1baQpAHnGbJIAw-8hB_V0zq8m7phMFbQk1G_X4g0OwMAl5j_erY6phAFg6gwhL44eemIEVHRLGf11-GhmOsA8r1UIwYZ7mWaEovaj6gEk_dZhzVC8zwq93XpANihMHUCsGJfhxNmSV0cfyBPIll-OAF_4wQZqvcwUHD0QSOmnVcH5n93xpEfXonv4db3mw6RZxz43EhbEI6Zl_CXSk5iPqCqUWsBFSMPyYqs35qgY8lplZePlVTb6Ni3NdjoYXMrVc1yprd4xNxKrf5FvPddt7YKqNUTtzuHUSgfzuQ485CEgwO0cE7rLWe1GZxyxP094EpDjs-H", "description": "Where compassion meets innovation and technology and our employees are family.\nThank you for your interest in joining our team! Please review the job information below.\nGeneral Purpose of Job:\nUnder the supervision of the Shift Supervisor, the RRT provides respiratory therapy to patients within an assigned unit of the hospital, in accordance with accepted clinical practices and established hospital policies and procedures. may function as Shift Supervisor during the absence of supervisor.\nEducation and/or Experience:\nAssociate degree (A.A.) from school with Registered Respiratory Therapist credentialed by the National Board for Respiratory Care. One-year general care experience with one year pediatric care experience preferred. Preceptor course recommended.\nCertificates, Licenses, Registrations:\nRegistered Respiratory Therapist credentialed by the National Board for Respiratory Care\nLicense to practice Respiratory Care issued by the Texas Department of Health\nBasic Life Support (BLS) for Healthcare Provider\nNeonatal Resuscitation Program (NRP)\nPediatric Advanced Life Support (PALS)\nPerinatal/Pediatric Specialist (NPS) - Preferred\nEssential Duties and Responsibilities:\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job description is not intended to be all-inclusive; employees will perform other reasonably related business duties as assigned by the immediate supervisor and/or hospital administration as required.\nMaintain utmost level of confidentiality at all times.\nAdheres to hospital policies and procedures.\nDemonstrates business practices and personal actions that are ethical and adhere to corporate compliance and integrity guidelines.\nResponds to emergency situations to assist or manage respiratory support measures and assist with cardiopulmonary resuscitation and patient transports.\nAssembles and tests ventilators and related respiratory therapy equipment prior to patient use.\nSetup, troubleshoot, and evaluate effectiveness of respiratory support systems in use.\nSetup and monitoring of respiratory therapy equipment and administer therapy to include but not limited to aerosol, oxygen, chest percussion, positive pressure breathing, lung lavage, breathing exercises transcutaneous oxygen/carbon dioxide monitors, and tidal carbon dioxide monitors, pulse oximeters, nitric oxide, nitrogen, and heliox therapy equipment and mechanical ventilators.\nMonitors patient pulmonary condition and progress and reports any abnormal findings to shift supervisor and/or nurse.\nSuggest therapeutic modification of care plan to prescribing physician.\nAssist with training of new employees.\nAssist with department's continued quality improvement plan.\nAssist with equipment cleaning/disinfection measures during peak workloads.\nTransport patients within or out of hospital.\nVolunteer for hospital/community service.\nSupervisory Responsibilities (Relieve Shift Supervisor when Indicated):\nEffectively administers performance management systems including:\nDevelopmental feedback.\nGoal Setting.\nAssesses competency.\nProgressive discipline.\nKnowledge of and effective in administering hospital policies and procedures.\nMakes and implements departmental decisions compatible with organizational goals.\nSupervises the following job classes:\nRegistered/Graduate Therapist\nCertified/Graduate Therapist\nRespiratory Therapist Assistants\nEquipment Technicians.\nLicensed Respiratory Care Practitioner.Show more Report"}, {"company": "VALD", "job": "Business Development Manager (Part-Time)", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "3.0", "link": "", "description": "Are you a sports management, business management, sports performance or health professional thinking about a career change? The role of a part-time VALD Business Development Manager in Israel could be the change you need!\nAbout VALD\nVALD is the world leader in musculoskeletal technology, providing innovative human-measurement technology to over 2,500 of the world's most elite sporting teams, universities and Defense departments.\nIf you have a favorite team in the NBA, EPL, or NFL, there's a good chance they use VALD products.\nSeven years on from its humble beginnings around a share-house dining room table in Brisbane, Australia, VALD has grown to a team of over 200 team members in 19 countries, with three offices across Australia, the UK and USA.\nDriven by a multidisciplinary team of researchers, clinicians, sports scientists, designers, developers and engineers, VALD's suite of systems offer unparalleled insight into human movement, performance, injury risk and rehabilitation.\nAbout the VALD Business Development Team\nThe Business Development team are on the front line for VALD. As part of a truly global team, you will attend conferences and perform product demonstrations (both in-person and teleconferences) in clinical, performance, and tactical settings. You'll set up and oversee product trials, nurture new leads and look for new opportunities for VALD.\nWith an education-based approach to sales, as a Business Development Manager, you must have an intimate knowledge of VALD's systems. As part of your onboarding, you'll travel to our Australian HQ to become entirely up to speed on our systems to equip you for success. You'll then leverage your industry expertise and product knowledge to demonstrate how our clients can get the most out of our systems to provide value to their business.\nIs this you?\nA degree (or relevant qualification) in Sports Management, Business Management, Sports Science or Physiotherapy\nPrior experience working in a business development, sports management, high performance sport, clinical or allied health setting, such as a physiotherapist/physical therapist, sports scientist, business development manager or similar role.\nExcellent communication and interpersonal skills via various mediums, including team calls, in-person interaction and sales pipeline reporting.\nFluent in English, both written and verbal.\nFluent in Hebrew, both written and verbal\nBe comfortable with targeting new clients.\nWilling and able to travel for client meetings and represent VALD at industry conferences and events.\nConfidence to persuasively demonstrate VALD systems and communicate product and industry knowledge to clients.\nA self-starter who holds themselves accountable for reaching sales targets.\nA desire to work with and nurture existing distributor relationships.\nPrior experience using CRMs and the Microsoft Office 365 suite of products.\nIt's not expected that any single candidate would check every box here.\nWe strongly encourage you to apply if you're at all interested. Show us how your experience could improve our team and widen our perspective. Our selection process includes assessing the requirements of the role vs the individual, and how well we think they will work in the VALD team.\nWhy VALD?\n\nAn opportunity to travel the world utilizing your health and performance experience is just the beginning when you join VALD. Recently named in LinkedIn's Top 25 Startups for 2022 in Australia, VALD's best asset is not our technology but our people and culture.\nWe have a range of benefits we offer to our team, such as:\nIndustry-leading compensation with healthy performance-based incentives.\nThe opportunity to work in a company that is redefining allied healthcare.\nLearn from a range of high-performing individuals and teams across various disciplines.\nBe part of a down-to-earth, inclusive and vibrant team.\n• Regular travel opportunities to get the entire VALD team together for your ongoing development. • The latest equipment and remote setup to perform at your best.\nMonthly fitness and wellness allowance.\nMonthly co-working space allowance.\nKeen to learn more? Check out vald.com and watch our 'About VALD' video:\nVALD\nDiversity & Inclusion Commitment\n\nVALD's best asset is not our technology but our people and culture. A culture of inclusion and diversity is critical to our business. We know diverse teams perform better. It's not a separate initiative – we aim to embed inclusion and diversity in everything we do. We are committed to fostering an inclusive work environment and embracing diversity, including gender, nationality, disability, age, marital/parental status, ethnicity, gender identity, socioeconomic background and sexual orientation. We welcome applications from people from all backgrounds\nConditions of Employment\nSuccessful applicants will be subject to background checks (including identity and criminal record checks). It will be a condition of employment that the background checks return acceptable results.Show more Report"}, {"company": "M-SOR s.r.o.", "job": "First SORUDO International Sales Manager in Israel", "city": "Jerusalem", "date": "19d", "rating": "5.0", "link": "", "description": "First SORUDO International Sales Manager in IsraelThis isn't just an ordinary job offer. We don't seek an ordinary salesman. We are looking for someone, who will take our successful products from Europe and help them grow in your country.We are SORUDO, a company which saves lives through a unique system of Complex Self-defense and First Aid Training, which we organize for companies and institutions. (only B2B)Sales talent is pointless, unless you sell something you can believe in, something that helps others and has a meaning itself.We will hire only 1 person in your country. If we choose you, you will get a job, which you can be proud of.We have more than 80 courses and products that we can offer to clients in your country.Our offer is suitable for clients such as:Security agencies (G4S)Healthcare sector (Hospitals / Psychiatry Institutes)Government agenciesLarge Corporate companiesManufacturing companiesAre you able to do it? Do you have the courage for it? Read more and help us save lives in your home country.Find out more at: https://sorudo.cz/international-sales-manager-2/Working with us, you save lives, but you also get:Reward up to 16,700 € / month (high commissions for profit up to 25% of a contract)→ Our sales representatives and managers usually earn up to 467% of the local average salary.→ There is no limit for commission, that is only up to you.→ Possibility of a fixed salary for smooth start.(So that you can gradually grow your sales that will build higher salary based on commission)Career potential, you can grow really fast to become→ Team manager (you can grow with our local company)→ Country director (and eventually become our partner for the country)We seek someone who is:Ambitious (wants to achieve high goals, we don't want an average person)Finisher (someone who constantly pushes the deal forward)Great at communication, presentable manners are natural requirementFluent in English (you need to be fluent for communication with our company and other colleagues abroad)We know that our work saves lives and our ambition is no smaller than global expansion. Our company sets high expectations and seeks only colleagues, who want to improve themselves with us.Find out more at: https://sorudo.cz/international-sales-manager-2/Job Types: Full-time, Part-timeSalary: Up to 61,500.00₪ per monthShow more Report"}, {"company": "INTEL", "job": "Supply chain technical analyst", "city": "Haifa", "date": "10d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=0000018626f1c26ea503535563b10fdc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9113a8dd&cb=1676382016472&jobListingId=1008432576164&jrtk=3-1-1gp82f4sbkluo801-1gojf3glji7mo800-ad133f56bb86c656-", "description": "Job Description\nWe are looking for Supply chain technical analyst.\nThe New Product planner (NPP) ensure NPI samples are correctly forecasted, built to specifications, and delivered in the most timely manner to support internal & external customers’ CPU validation efforts.\nAs part of your job, you will be responsible to:\nCoordination and startup activities for a product line from engineering to high volume manufacturing.\nCollect and scrub engineering and/or marketing sample demand by product forecast.\nAnalyze risks, capacity utilization, inventory levels, engineering requirements and customer demand, and/or delivery expectations from product start-up through product stabilization.\nDrive new product marketing and manufacturing naming and routing requirements through product planning systems setup activities.\nManage products in growing complex environment that introduce new supply chain challenges.\nInteract and manage cross-functional stakeholders.\nUnderstand both supply chain strategies and technical details of product engineering programs.\nDrive root cause solutions and improvements based on thorough understanding of the business processes and supply chain dependencies.\nCommunicate, explain and clarify complex issues with the customer business groups and divisions.\nCollaborate to develop processes and tools for new manufacturing flow and/or new product configurations.\nApply, analyze and interpret data to recommend optimized procedures and processes, identify areas of opportunity to further optimize Intel's supply chain from Wafer Starts through Assembly and Test.\nQualifications\nStudent to Bachelor's degree in Supply Chain, Industrial Engineering, Business Administration or related field.\nAt least 3 semesters until graduation.\nAnalytical skills,.\nWillingness to work in a diverse team environment.\nWork well in an ambiguous environment.\nStrong communication skills.\nAttention to details, well organized, efficiency and quality oriented.\nAbility to manage modular product (that includes several die elements such as : external die, internal die, GT, IO, etc.)\nAbility to influence business Unit decision making.\nInside this Business Group\nIntel's Sales and Marketing (SMG) organization works with global customers and partners to solve critical business problems with Intel based technology solutions. SMG works across business units to amplify the customer voice and deliver solutions that accelerate their business. We work across numerous industries, including retail, enterprise and government, cloud services and healthcare as examples. The operations team focuses on forecasting, driving alignment with factory production and delivering efficiency tools and our marketing capability drives demand and localized marketing in locations around the globe. Our sales force navigates a complex partner and customer ecosystem while shaping product roadmaps, driving value for our customers, and collaborating to harness emerging technology trends to deliver comprehensive solutions.\n\nPosting Statement\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\n\nBenefits\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://www.intel.com/content/www/us/en/jobs/benefits.html\n\nWorking Model\nThis role will be eligible for our hybrid work model which allows employees to split their time between working on-site at their assigned Intel site and off-site. In certain circumstances the work model may change to accommodate business needs.\nJobType\nHybridShow more Report"}, {"company": "Planned Parenthood Keystone", "job": "Security Specialist", "city": "Central", "date": "10d", "rating": "3.5", "link": "", "description": "Planned Parenthood Keystone (PPKey) serves 37 counties in Pennsylvania, home to over half of Pennsylvania residents. We have administrative offices in the Lehigh Valley, Harrisburg, Warminster, and York. We operate 9 medical centers that serve over 22,000 patients annually and offer comprehensive sexuality education that reaches thousands of young adults.\nPlanned Parenthood Keystone is looking for individuals who are committed to supporting our shared goal of strengthening and enhancing our awareness and commitment to advancing the cause of racial & social justice in our organization.\nPPKeystone is looking to hire a part-time (25 hours weekly), non-exempt Security Specialist for the Harrisburg Health Center. The Security Specialist reports to the VP of People and Culture and will manage the day-to-day security operations for the assigned health center. The Security Specialist will play an integral role in ensuring the safety and security of employees, contractors, visitors, guests and company property.\nEssential Functions:\nPatrol Health Center and grounds to detect possible threats, unauthorized persons/vehicles, suspicious packages or damage to property\nRespond to any incidents that occur during the shift, ensuring appropriate action is taken, all reports are properly completed, and appropriate parties are notified in a timely manner\nWrite detailed and accurate incident reports during the shift, including notation of any unusual activities and how issues were resolved; Preparing Daily Activity Reports (DAR) in accordance with established procedures\nMonitoring alarms and video equipment including fire alarms, door alarms, and duress alarms; dispatching police, fire and EMS personnel, as required\nAssist with building emergencies such as evacuations, fire alarms to ensure the safety of all\nMonitor movement of visitors and assure visitors entering the building are authorized\nEnforce the security rules and policies of the building\nPerform other duties and tasks as assigned by the senior security specialist\nAdditional tasks required as needed\nServe as an Ambassador for the organization to inspire support and connection with the mission and services provided by the affiliate\nEnsure completion of required annual training\nAdhere to all HIPAA and patient privacy regulations\nQualifications (Required):\nCOVID-19 Vaccine and Booster if applicable are required\nAssociate’s Degree in a related field, or equivalent experience\n3 – 5 years of experience with progressive responsibility in the security industry(ies).\nReliable means of transportation\nAbility and willingness to work a flexible schedule including nights and weekends\nPrior Police officers/ Correction Officers/Military encouraged to apply\nAct 235 preferred but not required\nTechnical competence, particularly in video management and alarm monitoring systems, with a strong understanding of security operations.\nExcellent written communications and report writing skills\nGood interpersonal, problem solving, and communication skills\nAbility to read and interpret documents such as policies and procedures\nSalary & Benefits:\nCompensation for this position starts at $20.00 per hour and increases based on experience\nMedical, Dental, and Vision coverage options for you and eligible dependents\nShort Term Disability\nLife/AD&D and Long Term Disability policy voluntary coverage options\n401 (k) Retirement plan with up to 2% employer match\nGenerous vacation, leave, and holiday benefits\nValues and Commitments:\nCommitment to Planned Parenthood’s mission and conviction to health equity and access to sexual and reproductive healthcare\nUnderstanding of racism and commitment to racial and social justice\nAwareness of multiple group identities and their dynamics, bringing a high level of self-awareness, empathy, and humility to interpersonal interactions; building of trust across diverse groups of people\nDemonstrated ability to communicate and hear effectively across differences and reflect and act on feedback related to identity and equity with the aim to learn\nCommitment to Planned Parenthood’s In This Together service ethos, workplace values, and service standards\nPlanned Parenthood is an equal employment opportunity employer. We comply with all applicable laws prohibiting discrimination based on race, color, religion, gender and gender expression/identity, age, ethnicity, national origin, ancestry, physical or mental disability, uniformed service member/veteran status, marital status, medical condition, pregnancy, sexual orientation, citizenship status, genetic information, as well as any other category protected by federal, state, or local. We are committed to building an inclusive workplace that values racial & social justice. We strongly encourage all persons to apply, including people of color and members of the LGBTQ community.Show more Report"}, {"company": "Baptist Health System KY & IN", "job": "Certified Medical Assistant PRN", "city": "Central", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=0000018626f1c26ea503535563b10fdc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a6cc228a&cb=1676382019057&jobListingId=1007987219338&jrtk=3-1-1gp82f7b8p2mn801-1gojf3glji7mo800-273d6e0563f13005-", "description": "Job Description:\nJob Summary:\nThe Medical Assistant II (MA) will be responsible for the coordination of direct patient care activities and providing clinical support to providers within one of our clinical practices.\nDuties include but not limited to the following: obtaining patient medical history information, expediting patient flow, rooming patients, stocking clinic with supplies, navigating electronic health record system (EPIC), scheduling and following-up with appointments and assisting with medication fill and refill requests, checking for prior authorizations and scheduling tests, procedures and consultations.\nThe MA will communicate with pharmacies, insurance companies, patients and physicians in a respectful manner and will uphold Baptist’s mission and core values that drive service excellence.\nEssential Duties and Responsibilities:\nManages the coordination and flow of patients throughout the patients visit to create an exceptional patient experience.\nProactively check the provider’s schedule and review information within the patient record to ensure that all required information is available prior to their visit.\nProactively obtains any missing information from the patient to ensure that medical records are accurate and up to date, which helps to ensure better care is being provided.\nUpon arrival, captures patient’s vital signs, past medical, social and family history, medication usage and preferred pharmacy information.\nEnsures compliance with all state and federal regulatory requirements including HIPAA/OSHA compliance.\nMinimum Requirements:\nAt least 2 years of healthcare experience working as an MA, C.N.A, EMT, LPN or RN operating and providing care within a direct patient care setting.\nBasic computer skills, specifically with navigating within databases containing highly confidential information.\nBasic Life Support and other advanced training as appropriate.\nIf you would like to be part of a growing family focused on supporting clinical excellence, teamwork and innovation, we urge you to apply now!\nEmployees will be expected to comply with Baptist Health’s infectious disease and vaccination policies, which include but may not be limited to compliance with BHS’ mandatory vaccination policies for influenza and COVID unless reasonable accommodations are needed under applicable law\nBaptist Health is an Equal Employment Opportunity employer.Show more Report"}, {"company": "", "job": "Part-Time Admin/Phone Assistant", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018626f1c26ea503535563b10fdc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d5284ea5&cb=1676382020419&jobListingId=1006911405550&jrtk=3-1-1gp82f8o7jca7801-1gojf3glji7mo800-bd7c6593a1cfad2c-", "description": "BDM, Ltd, a progressive international healthcare-billing firm located in central Tel Aviv, is looking for an Administrator/Phone Assistant with basic computer skills.\nHours: Monday -Thursday from 3PM-7PM and Sundays (flexible 4 hours).\n\nKeys Responsibilities include:\n\nAnswering phone calls from insurance companies and patients and providing assistance\nCalling insurance companies requesting documents\nScanning and uploading documents\n\nRequirements and Skills:\n\nEnglishproficiency\nBasic Microsoft office skills\n\nPlease see our website https://bdm.co.il/ for more information about our company.\n\nPlease send CV’s to miriam@bdm.co.ilShow more Report"}, {"company": "Edwards Lifesciences", "job": "R&D Student Engineer", "city": "Israel", "date": "13d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=0000018626f1c26ea503535563b10fdc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fcec13c9&cb=1676382022588&jobListingId=1008424550699&jrtk=3-1-1gp82farijc9s801-1gojf3glji7mo800-1a08725928c44023-", "description": "Support Clinical R&D team\nClinical Research\nSupport all development aspects (Animal Studies management / Analysis / setups / etc.)\nPerform & document tests & research\n\nRequired Education/Skills:\n2nd year of B.Sc. in Bio-medical engineering / Biology\nEnglish – Full proficiency\nHigh self-learning ability – willingness to read articles and cover clinical data\nIndependent & responsible person\nCreative\nStrong execution, communication & interpersonal skills\nHigh commitment & willingness to work extra hours\n\nRequired Experience:\nExperience Medical device field – an advantage\n2-3 days a week in Caesarea\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "", "job": "Part-time/Hourly Medic/ Paramedic", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=0000018626f1c26ea503535563b10fdc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6609dd6d&cb=1676382023752&jobListingId=1006601222953&jrtk=3-1-1gp82fbuoj46m801-1gojf3glji7mo800-5abd1a2f94043ada-", "description": "EMA Care is seeking a medic to be an on-call emergency room advocate to join our team. High level of professionalism and ability to create interpersonal relationships is required.\n\nDuties, Responsibilities, & Skills\n\nAvailable, when on call, to attend emergency room visits under remote guidance by our medical team\n\nIdentifies and communicates the current patient situation in the Emergency Room\n\nAdvocates on behalf of the client to the healthcare team ensuring quality health care (with team guidance)\n\nProvides updates to the client/others (as needed) regarding the plan of care (with team guidance)\n\nCommunicates plan of care with the On-call telemedicine nurse\n\nEnsures client understands the plan of care and paperwork to collect from the ER (with team guidance)\n\nDocuments appropriately\n\n12-hour shifts “on call” (available to attend ER) with stipend per shift plus generous hourly compensation when called to duty\n\n\nQualifications\n\nGeneral Medical Knowledge (Minimum medic training with experience)\n\nNative-level English\n\nFluent Hebrew (that will allow for an understanding of medical situations)\n\nHigh-level interpersonal skills\n\nAbility to multitask\n\nTeam player\n\n\nEMA Care specializes in assisting individuals to navigate the Israeli Healthcare System. Through excellent communication and customer service, we improve access to quality care, organize healthcare services, and guide individuals to meet their health goals and optimal function.\nEMA Care is staffed by medical professionals offering Case Management, 24/7 Telemedicine services, and ER support.\nIf you are passionate about healthcare and helping people through a troubling time, then we would like to hear from you.\nTo apply please send your CV to rona@healthcareisrael.comShow more Report"}]