[[{"company": "Lilly", "job": "Sr. Associate - Oncology Medical Science Liaison", "city": "Raanana", "date": "7d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1673e45c&cb=1676382308125&jobListingId=1008443297074&jrtk=3-1-1gp82o1lskcng801-1gooib049h7h6800-d72af6f9cd756197-", "description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 35,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.\nResponsibilities\nThe Medical Science Liaison is a highly knowledgeable scientific person who is primarily responsible for answering the scientific and clinical needs of Scientific Experts (SE). He / She will be placed in a dynamic and motivating environment dedicated to the launch of new products and in a path of professional career. The Medical Science Liaison is a field-based role.\n\nKey Responsibilities:\nIdentification of SEs and development of relationship with them\nProvide deep and advanced disease state and product expertise to SE\nEngage in continuous learning within their therapy area, through literature search, participation in scientific congresses etc.\nCommunication of scientific intelligence and clinical insights\nRespond to unsolicited request, also at congresses\nParticipation in consultant meetings\nDrive digital innovation in engaging customers\nBasic Qualifications\nAdvanced degree in health sciences (PharmD, MD, PhD in a medically related field) OR Masters / bachelor’s level degree in health sciences (e.g. BSN, RPh, PA, NP) with previous experience in Oncology TA.\nAdditional Skills/Preferences\nEnglish proficiency (written and oral): Advanced (B2/C1)\nPassion for science, results, and high standards\nGreat and demonstrable learning agility\nBusiness acumen (starting from scientific information)\nProactive – takes independent action and responds quickly.\nEnthusiasm for a variety of digital technologies with the ability to assimilate complex information and systems.\nConfidence and willingness\nAsk questions, understand, and translate into suggestions/ new solutions.\nDemonstrable ability to operate in a compliant way.\nBrilliant and demonstrable presentation skills\nAbility to effectively communicate scientific data into meaningful, clear, and compliant content.\nAbility to manage a complex environment and prioritize different projects at the same time.\nEli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.\nLilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n#WeAreLillyShow more Report"}, {"company": "Rimini Street, Inc.", "job": "Sr Client Success Manager, Israel", "city": "Tel Aviv-Yafo", "date": "12d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_330f15f6&cb=1676382309281&jobListingId=1008431765967&jrtk=3-1-1gp82o2r6gsq5801-1gooib049h7h6800-f2fbf06098d51b86-", "description": "Job Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nThe company is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs.\nWe have an exciting opportunity available right now to join us as a Sr Client Success Manager, responsible for a subset of clients within the EMEA region, based in Israel.\nPosition Summary\nWe are seeking an experienced Sr Client Success Manager who will be responsible for managing and expanding the partnership with our clients. The right candidate will have an entrepreneurial spirit, a proven track record of Client Management or Business Development & Executive Relationships excellence with the ability to provide solutions and guidance to meet business objectives and taking business to the next level. You must have a passion for clients. We need someone that can be very hands-on, do whatever it takes to deliver value, develop relationships, and be a strategic thinker with the ability to create long-term relationships with our clients\nAs a Sr Client Success Manager with Rimini Street, Inc., you’ll be managing a portfolio of named clients – driving client lifecycle – leading to adoption, cross-sell, advocacy and client satisfaction across your portfolio.\nEssential Duties and Responsibilities:\nDeliver and communicate ROI throughout the client lifecycle\nBuild C-level and executive relationships, establishing trusted advisor status\nDrive growth, value, retention and partnerships for our important clients to ensure active engagement and full recognition of ROI\nDevelop key account plans including; retention strategies, cross-sell opportunities, powermaps, client advocacy\nMeet/Exceed quarterly quota targets (renewals/cross-sell/advocacy)\nCreate awareness and demand for Rimini Street products and services\nIdentify, cultivate and engage on cross-sell opportunities within your portfolio for services and/or strategic solutions\nEnsure client retention through actively driving retention strategy, retention content including ROI models and proposals, and assisting with retention sales execution\nProvide ongoing proactive client management through executive business reviews, client onsite visits, executive relationships and overall client communications\nBuild and foster our Client Champion Community. Secure client sales and marketing advocates, ensuring client referenceability and driving client participation in select client marketing programs, events, interviews, etc.\nImplement and utilize current Social and Digital selling strategies to maximize opportunities via Social Networking platforms\nQuarterback the team and coordinate across executive leadership, sales, service delivery, marketing, etc.\nAdditional Duties & Responsibilities\nMonitor client consumption of Rimini Street services with the support of standard dashboards\nMaintain up-to-date client information in Salesforce.com and other systems\nProvide detailed and timely status reporting to all management as requested\nAssure client communications and escalations are performed on time, sufficiently and accurately\nOther job-related duties and responsibilities may be assigned from time-to-time\nQualifications/Skills/Experience:\n\nEducation\nBA/BS (MBA/Master preferred)\nLocation\nIsrael\nEssential Language Skills: English and Hebrew\nExperience\nGood knowledge of the enterprise software industry\nSpecific experience with Oracle and/or SAP preferable\nExperience dealing with CXO’s\nSignificant experience in Consultative Sales, Account Management, or Business Development\nExperience in managing a portfolio of clients in different industries\nExperience in cross-selling – identifying opportunities through trusted advisor partnership with clients and ability to coordinate and lead cross-functional team to drive better results for cross-sell and retention, etc.\nExperience in renewing and/or negotiating client support contracts\nExperience in working with complex, multi-divisional, multi-geographical customers\nExperience working with cross-functional teams (e.g. Sales, Renewals, Marketing, Services, etc.)\nSkills\nImpressive executive presence and communication abilities\nDemonstrated ability to provide proactive account management to a large portfolio of clients\nExceptional leadership, time management, facilitation, and organizational skills\nBias for action\nPassion for technology and for being a part of a fast-growing technology company\nProven analytical and problem-solving abilities\nProven experience with Social and Digital selling techniques\nAbility to create structure and prioritize tasks to best manage different situations\nStrong documentation skills MS Office Suite (Word, Visio, Excel, and PowerPoint); Salesforce CRM, Smartsheet, etc.\nRimini Street views all employees as partners, and is committed to providing an exciting, participatory and team-oriented work environment. In addition to our very competitive compensation packages, be prepared for challenging professional growth and fun along the way in our work-hard, play-hard corporate environment.\n#LI-DNI\nCompany Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nRimini Street is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs. According to Gartner, the third-party support market will grow to $1.05 billion by 2023, a 200% increase. With tight IT budgets and flat global economic growth, IT and procurement professionals are actively looking for proven methods to cut costs while improving service. Rimini Street enables organizations to free up budget for strategic business initiatives by delivering savings of up to 90 percent on total maintenance and support costs, and to date, the company has saved organizations over $5 billion in total maintenance costs since its inception.\nWe’re building something special at Rimini Street. A company where people care about each other and trust each other to do the right thing. A company where highly intelligent and talented people come together to do challenging and meaningful work that makes a real difference to our clients, ending each day with a sense of achievement and balance in their lives.\nBe Treated Like the Best\nRimini Street hires only the best – and provides the compensation, bonus and benefit programs appropriate for proven top-performing professionals. We want our employees to have an opportunity to share in the financial success that results from our dedication to service excellence, high-quality deliverables and an unparalleled client experience\nNo bureaucracy, thousand-page rule books or politics — just everyone working together to build a great company through service excellence and client success\nWork hard, play hard environment – Rimini Street is a group of hard-working professionals who are passionate about achieving success, but we also enjoy opportunities to meet up at fun company events\nWe are also passionate about giving back to our communities around the world, with plenty of opportunities for volunteering and charity through the Rimini Street Foundation\nAll Rimini Street professionals are encouraged to grow and learn new skills\nAccelerating Company Growth\nTrading on Nasdaq under ticker symbol RMNI since October 2017\nAdded to the US Russell 2000® Index in 2018\nOver 4,000 clients, to date including 100 of the Fortune 500 and Global 100\nAnnual 2021 financial results of $326.8 million, up 16.3% year over year\nFiscal year operating cash flow of $42.1 million, up 107% year over year\nAnnounced the new patent pending Rimini Street Artificial Intelligence Support Applications, a result of the Company’s continued investment in optimizing support processes and ensuring global service delivery outcomes at scale. Using the AI Applications, Rimini Street has been able to deliver a better client experience and reduce software issue resolution times by 23%.\nCelebrated the 15th anniversary of the Company’s founding in 2005 to redefine the enterprise software support market and bring choice and value to software licensees around the world.\nRecent Industry Recognition\nReceived 33 awards in 2020, including 15 awards for excellence in customer service from awards companies such as the International Stevie Awards, the American Stevie Awards, and the Stevie Awards for Sales & Customer Service\nHonored with four Gold awards for Company of the Year in 2020.\nThe Rimini Street Foundation recognized with two awards in 2020 for Corporate Social Responsibility Program of the Year\nIn addition, in 2020 the Company supported more than 120 charities around the world through the Rimini Street Foundation, providing financial contributions, volunteer hours and in-kind donations including personal protective equipment to healthcare workers, senior centers, food banks and youth organizations globally. The Foundation also extended its charitable work in 2020 to Hong Kong, Malaysia, Mozambique, Sweden and the UAE.\nTo learn more about how Rimini Street is redefining the enterprise software support industry, visit http://www.riministreet.com\nRimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, national origin, sexual orientation, gender or gender identity, disability and protected veterans status or any other characteristic protected by law.\nPlease Note: Rimini Street does not accept resumes submitted by recruiting/staffing firms unless specifically requested by Human Resources. Unsolicited resumes will be ineligible for referral fees.Show more Report"}, {"company": "United Nations", "job": "SENIOR COMMUNICATIONS MANAGER", "city": "Jerusalem", "date": "23d", "rating": "4.1", "link": "", "description": ""}, {"company": "Cesvi", "job": "Technical Coordinator Senior", "city": "Jerusalem", "date": "6d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3659cad0&cb=1676382312180&jobListingId=1008444241427&jrtk=3-1-1gp82o5kqjm4l801-1gooib049h7h6800-c4a911daab370d12-", "description": "WORK CONTEXT\n\nCESVI has been working in Palestine since 1994 and it has developed over the years an expertise in the area of solid waste management, water and sanitation. CESVI implemented various projects in partnership with relevant actors in the sector and active participation in the WASH cluster and other coordination networks.\n\nCESVI is currently implementing projects in the in Hebron and Gaza governorates, in consortium with local and international partners. The ongoing projects are funded by SDC and AICS\nThe main activities included in the SDC and AICS projects are:\n\nData collection and laboratory testing: data collection on current WASH practices; development of a simplified methodology for the evaluation and adaption of filters to the local context; test of the filters in laboratories;\nRehabilitation of washing facilitates in schools\nRehabilitation of water networks\nMonitoring and Implementation based on behaviour change strategy / RANAS approach\nData analysis: elaboration of data and training materials;\nDevelopment of a strategy to encourage and maximize sharing of data, methods and insights among the partners and a wider audience\nDissemination of research findings and incorporation of recommendations in design of interventions.\n\nJOB DESCRIPTION\n\nThe collaboration will start in mid-May/June 2023\n\nThe main duty station will be in Jerusalem with frequent travels in the West Bank and Gaza Strip.\nKEY RESPONSIBILITIES\n\nThe Technical Coordinator Senior will work in coordination with the Head of Mission and s/he has to coordinate with the Country Administrator\nMain tasks and responsibilities:\nS/He will ensure constant supervision of project and program managers, to monitor rate of spending in each project and coordinating project managers in direct implementation, ensuring full procedural compliance in coordination with the Head of Mission and Country Administrator\nS/he will review of any variations / amendments for the extension or revision of the projects\nS/he will Active participate in the new donors acquisition: identification of new projects within CESVI’s sector, coordinate the entire process of drafting of proposals in collaboration with all the team (PMs, CA, HoM)\nS/he will supervise MEAL officer for harmonization of data collection tools, database management and reporting\nS/he will ensure the compliance of technical requirements wash /waste) in the projects (check and write BOQ, liaise with providers, municipalities and technical stakeholders/partners\nS/He will actively participate to the Wash and waste Working Group.\nS/He will write new project proposals in coordination with HQ and the field.\nS/He will liaise with relevant stakeholders.\n\nESSENTIAL REQUIREMENTS\nUniversity or Master degree in engineering, or related field in wash sector expertise\nMinimum 5 years’ program management experience, grant management in a NGO, including experience directing and implementing programs in both protracted crisis and development contexts\nSpecific studies or training on data collection and visualization\nSolid experience in needs assessments, project proposal and reporting\nExperience in managing wash projects\nKnowledge of financial rules and regulations of International donors as EU, AICS (Italian Cooperation Agency), etc.\nKnowledge of effective financial and budgetary planning and control\nSolid diplomatic and leadership skills in managing a variety of internal and external relationships, especially with partners\nCapacity to acting effectively as a team member\nSelf-motivated, flexible, resilient, able to take initiative and work independently\nExcellent problem-solving and analytical skills\nHigh level of IT skills (Windows, Office package)\nExcellent knowledge of English written and spoken.\n\nDESIRABLE REQUIREMENTS\nPrior working experience in the Middle East and / or in the Occupied Palestinian Territory\nKnowledge of Arabic\n\nSAFEGUARDING\n\nCesvi has a zero-tolerance approach to any harm to, or exploitation of, a child or a vulnerable adult by any of our staff, related persons or partners.\n\nCesvi’s commitment to being a safe organization begins with the staff recruitment process which includes meticulous checks, such as criminal records checks or check disclosure of previous convictions, to ensure children and vulnerable people are safeguarded and abuse is prevented. Safeguarding checks are part of the selection process performance.\n\nHEALTH SAFEGUARDING\n\nCesvi pays particular attention to safeguarding the health of all the human resources of the Organisation. Therefore, in order to protect its staff, an assessment of their suitability for the position in each mission is carried out before departure. Such assessment is done by the Occupational Doctor of the Organisation, who will also examine the vaccination coverage, including the anti-Covid19 vaccination.\n\nPlease note: due to the high number of applications we receive we are unable to provide feedback if unsuccessful at the applicant stage. Only short-listed candidates will be updated on the status of their applications.Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "IT Learning Program Lead", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3aa9d793&cb=1676382313730&jobListingId=1008439474313&jrtk=3-1-1gp82o75qkcmj801-1gooib049h7h6800-37c01cdba1656f8e-", "description": "IT Learning Program Lead\nDate: Jan 31, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 44969\nWho are we?\n\nTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds.\nWorking here means working with the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.\nHow you’ll spend your day\nStrategic planning of global learning and development programs\nLeading E2E global, complex learning & development projects with different partners within global IT and external vendors, according to business focuses and best practices\nWorking with managers and SMEs to evaluate’ skills gaps and identify relevant learning solutions to address them\nDesigning and leading the implementation of learning processes and tools, where applicable\nConduct needs assessments and plan, develop, implement, and deliver training curriculum to address global and local training needs\nBuild creative and unique, tailor-made development programs, using multiple tools and methods. Learning & Development programs are various, in all subject areas (e.g. Professional knowledge, Technical skills, \"Power skills\"/ \"Soft Skills\", Culture aspects)\nUse project management skills to ensure all details of the training programs are handled with quality and care\nMonitor, measure and assess the learning programs and activities for the IT management units you support\nYour experience and qualifications\nPresentation skills\nprogram management and detailed oriented\nProven track record in executing successful learning programs\nCurrent knowledge of effective & new learning methods and tools\nHave worked in a global organization before – a must\nIT background and knowledge\nHighly proficient in English\nRelevant degree in Organizational Psychology/ Organizational behavior – an advantage\nProven experience in similar role - an advantage\nProven experience from a global company – an advantage\nExperience working with vendors\nBe able to Influence without the direct authority\nAnalytical thinker and a creative problem solver\nGets things done and very proactive\nFunction\nHuman Resources\nSub Function\nLeadership and Development\nReports To\n\nDir Project/Program Management, IT Training & People Dev\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "Oracle", "job": "Sr HR Business Partner", "city": "Israel", "date": "19d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_18c3e4b3&cb=1676382314863&jobListingId=1008416902570&jrtk=3-1-1gp82o896kbmm801-1gooib049h7h6800-8623fe11ddaa1ff4-", "description": "Sr HR Business Partner-2300005J\n\nApplicants are required to read, write, and speak the following languages: English\n\nPreferred Qualifications\nDoes being a part of a dynamic HR team who support our organization to help customers go through digital transformations and moving to the cloud excite you? Are you looking to develop your HR career in a fast moving and innovative environment?\n\nOracle has transformed the enterprise software market with cloud computing and data driven innovation. We've launched business applications and platforms that are as easy to use and have a differentiated advantage in being able to offer an identical portfolio of infrastructure and platforms services for end-to-end data management both on-premise and on-the-cloud.\nWe are looking for a dynamic, high performing individual who thrives on the challenge of working in a fast moving environment and who has a passion for technology and how it can help businesses succeed.\nResponsibilities:\nDemonstrate an understanding of general HR processes and systems.\nAct as a point of contact for a specific Line of Business (LOB) employees regarding HR issues; responding timeously, accurately and professionally to all correspondence and queries.\nProvide advice and guidance regarding Oracle’s HR policies, processes and procedures.\nEnsure all advice, support and administration is compliant with local employment legislation and Company policies.\nEnsure all HR documentation is accurate, complete and up to date\nProcess lead/coordinator for key HR processes – take ownership of the process and become established as a subject matter expert within the HR team;\nContribute to the team objectives of knowledge transfer, process improvement and making it easier to do business with HR\nMaintain up-to-date knowledge of employment law and HR practices.\nThe successful candidate will also have the opportunity to get involved in ad hoc HR related projects\n\nRequirements\nStrategic Thinker: Develop HR plans to support strategic fiscal year business plans, and drive implementation activities e.g.\nManage organisational restructure & change programmes as appropriate\nRetention & Development activities of key employees\nDrive compensation planning activities\nLeverage HR data and provide analytics to business leaders to support business objectives\nEMEA-wide projects related to the overall business strategy\n\nChange Agent:\nDrive Talent Management activity locally and working with the lob Senior Leaders. Facilitate Talent Review Boards, Succession Planning, and identification of Leadership talent\nCo-ordinate & manage senior level promotions\nEducate Management on available HR tools, programs, resources that support their employees retention & development\nProvide advice & opinion on Organisational Design\n\nProblem Solver: Senior Stakeholder and local HR to resolve complex issues effectively i.e.\n\nKey Attributes/Skills:\nSignificant HR generalist experience (5+ years), preferably with experience in the IT sector & growth strategies in a dynamic talent marketplace\n\nDetailed Description and Job Requirements\n\nPartners with business units/divisions in delivering Corporate and Divisional HR policies and programs.\n\nJoin a leading HR group consulting with management and employees on HR practices and procedures. Manage employee relations issues and conduct investigations in support of corporate ethics and values. Participate in company-wide programs and initiatives (e.g., manpower planning, salary/bonus/stock review, organizational change, performance management, and training assessment).\n\nLeading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Key skills and abilities include coaching, influencing, facilitation, presentation, communication, process development, analysis, and problem solving. Ability to travel. 8 years generalist experience and BA/BS degree. Experience in an HR specialty a plus.\n\nAs part of Oracle's employment process candidates will be required to successfully complete a pre-employment screening process. This will involve identity and employment verification, professional references, education verification and professional qualifications and memberships (if applicable).\n\nJob: Human Resources\nLocation: Israel\nJob Type: Regular Employee Hire\nOrganization: OracleShow more Report"}, {"company": "AdvanSoft", "job": "Senior Technical Recruiter", "city": "Israel", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cd767358&cb=1676382317235&jobListingId=1008320303435&jrtk=3-1-1gp82oak1p6cj801-1gooib049h7h6800-734fdef452d8df35-", "description": "Location : IL\nEducation : Bachelor's Degree in Technology Management, Engineering Management, Human Resources, or related bachelor of science discipline or equivalent experience\nJob Type : Full Time\nJob Responsibilities :\nCoordinate with the clients and stakeholders to identify the resource gaps in the process and requirement of technical resources for the project outcome\nElicit the requirements of the position by collaborating with the technical team and delivery managers to source the suitable profiles\nPublish and promote the position offering in various technological forums like GitHub and application tracking systems like the stack overflow and other various traditional methodologies to identify the suitable profiles for the required position\nScreen resources to observe the communication skills and understand the experiential history of the resource and explain the hiring practice to complete hiring program in a seamless way\nCoordinate with the delivery manager, technical team and HR manager to evaluate the profile standards to obtain the results for the suitability for the position requirement\nConduct the reference/background verification checks for the finalized resources and report the results to the HR manager and leadership team by using the analytical method\nConstant touch with technical teams, hiring managers, delivery managers, and HRBP to conduct and evaluate the performance of the new hires and existing employees\nConduct periodical meetings with the leadership team, the technical team, and HRBP to understand the current technology trends and build a new hiring practice and strategy for sustainable performances of employees\nCoordinate and conduct workshops at engineering schools and other technology institutes to explain the current trends and revolutions in technology to aware and counsel students\n\nSend resume & specify position you are seeking to :\nEmail : info@adso.com\nCall : 847-952-0000\nAdvanSoft International,Inc.\n135 E Algonquin Rd, Suite B, Arlington Heights, IL 60005Show more Report"}, {"company": "Mitsubishi Motors (Thailand) Co., Ltd", "job": "TRAINING - SENIOR STAFF", "city": "Central", "date": "25d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_07f3548c&cb=1676382318551&jobListingId=1008406011167&jrtk=3-1-1gp82obt2p6cj801-1gooib049h7h6800-88887897fa6600b7-", "description": "Job Summary\nResponsible for HRD, training master plan and SOP &WI of HRD function\nJob Description\n\nConduct training courses and employee development activities both in-house and/ or external facilitators as planned and aligned with MMTh competency and Department of Skill Development (DSD) requirement.\n\nConduct training need survey and prepare training need survey summary report\n\nDevelop training courses as assigned and contact the instructor and training institute to create the course outline aligned with MMTh training requirement and competency.\n\nAnalyze and prepare monthly training reports.\n\nControl and update HRD SOP and WI aligned with HRD tasks and ensure that all training members work activities aligned with this standard.\n\nManage training registration and record on Learning Management System (LMS)\n\nJob Specification\n\nMale or Female, age between 25 -30 years old.\n\nBachelor’s degree in Human Resources Management, Political Science, or other related fields\n\nAt least 2 years of working experience in OD, HRD function.\n\nStrong knowledge of Human Resources Development tools and activity management.\n\nProficiency in LMS, Microsoft Office Excel, PowerPoint, VDO editing Program.\n\nGood command of English - speaking, listening and writing.\n\nAble to work under pressure and doing multi-tasks.\n\nHaving high responsibility, can-do attitude, i nterpersonal skill, and teamwork spirit.Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Assoc Dir TGO Learning & Development", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": ""}, {"company": "Placer.ai", "job": "R&D Team Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY:\n\nAs an R&D team lead at Placer.ai you will have full ownership of core and critical Placer services. You will be responsible for planning, tech design, implementing and rolling out to production the services of our Analytics engine.\n\nIn your day to day, you will tackle challenging scaling issues, you will brainstorm with super talented team members on how to support our overall hyper growth and system complexity. You will push code to production on a daily basis.\n\n\nRESPONSIBILITIES:\n\nDesign and develop core infrastructure modules and functional services, tackle large scale and load challenges, using Python, Node and SQL / columnar / document DB’s.\nOwn a critical section of Placer’s core product.\nManage 6 to 12 backend and full stack developers.\nPerform POCs for new technology and design concepts.\nPlay a central role in building complex and large scale systems that powers Placer.ai’s platform\nMeasure, analyze and improve the performance, scalability and robustness of the product as well as processes\nTake full ownership by carrying out tasks end-to-end, from design to deployment\nTechnically mentor and assist team members to excel at their job by executing code and design reviews, and technical guidance\nCollaborate with Product, Analysts and Data Science teams in order to improve the product’s quality and deliver new features\n\n\nREQUIREMENTS:\n\n5+ years of professional backend experience, 2+ years of experience as team leader.\nExperience building large distributed production systems including event based architecture, experience with various DB’s and messaging technologies.\nBe hands-on with proficient coding skills in one or more of the following languages: Python, Java, Go.\nBSc degree in Computer Science or an equivalent\n\n\nOTHER REQUIREMENTS:\n\n2 or more roles as Team lead or Tech lead at different companies.\nExperience with frontend frameworks (React, Angular).\nExperience with big-data products, ideally with BI products.\nExperience with Google cloud, K8.\nDev Ops experience or background ideally with helm and terraform.\nExperience and knowledge with different DBs such as Mongo, postgres, Big query, Big table.\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.\n\n#LI-AC1Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Senior Manager, Learning and Development", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_103ee586&cb=1676382323087&jobListingId=1008333176386&jrtk=3-1-1gp82ogafi3bf801-1gooib049h7h6800-84f9fd3205e2f049-", "description": "Senior Manager, Learning and Development\nDate: Feb 3, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 43448\nWho are we?\nTeva is a global pharmaceutical leader and the world's largest generic medicines producer, committed to improving health and increasing access to quality health solutions worldwide. Our employees are at the core of our success, with colleagues in over 80 countries delivering the world's largest medicine cabinet to 200 million people every day. We offer a uniquely diverse portfolio of products and solutions for patients and we've built a promising pipeline centered around our core therapeutic areas. We are continually developing patient-centric solutions and significantly growing both our generic and specialty medicines business through investment in research and development, marketing, business development and innovation. This is how we improve health and enable people to live better, healthier lives. Join us on our journey of growth!\nJob Description\n\nWho are we?\nTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds.\nWorking here means working as part of the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.\nThe opportunity\nThanks to an internal promotion we have a great opportunity for to join our global Learning and Development team as Senior Manager, Corporate training. Our team is working to unleash the power of people in order to drive better business results. Our core emphasis is on the design and development of strategic skill enhancement solutions and talent development practices for our employees worldwide.\nIn the role of Senior Manager, Corporate Training, you will be a key player in enhancing our quarterly and new hire required training deployments. You will lead the design and development of the standards and methodology for the deployment of corporate training. You will be partnering with key stakeholders across the business to level up training processes including needs analysis, vendor selection, scoping, instructional design practices and solution deployment and evaluation.\nFinally, you will also be leading the design and deployment of specific cross company learning offerings initiated by HR– for example, inclusion and diversity.\nHow you will spend your day\nPartner with senior leaders and various stakeholders to conduct needs assessments, identify target audience, prioritize content, develop advanced learning solutions, and measure and report.\nCollaborate with subject-matter experts and development leads to ensure that the solution: program content, learning objectives, and delivery modes meet the business context and intended audience.\nOwner of L&D's training standards and methodologies playbook – research the latest trends and apply advanced instructional design methodologies and solutions to create meaningful learning experience - including analysis, design, development, implementation, and evaluation for synchronous and asynchronous solutions.\nQualifications\nA minimum of a Bachelor’s degree is required; an advanced degree is preferred (in Learning and development/OD or related field)\nA minimum of 8 years working in global and preferably large organizations in the area of learning & development or instructional design\n\nSkills\nExcellent command of English- Ability to engage and influence stakeholders through effective written and oral communication\nInnovative and passionate about adult learning, sound instructional design methodology and organizational capability building is required\nDemonstrated experience in project management and working independently (leading a domain and implementing new processes)\nSolid (hands on) proficiency in MS Office, training authoring tools, webinar platforms, Learning Management System (bonus –knowledge of SAP Successfactors LMS)\n\nFunction\nHuman Resources\nSub Function\nLeadership and Development\nReports To\n\nSr Dir. employee learning and development, Learning and growth IL\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "ASM Global", "job": "Operations Supervisor/Crew Chief", "city": "Central", "date": "8d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f06ec4e1&cb=1676382324841&jobListingId=1008437715371&jrtk=3-1-1gp82oi0lk6d8801-1gooib049h7h6800-326805f7f7e92861-", "description": "POSITION: Operations Supervisor/Crew Chief\nDEPARTMENT: Operations\nREPORTS TO: Director of Operations/General Manager\nFLSA STATUS: Exempt\nSummary\nASM, the leader in privately managed public assembly facilities, has an excellent and immediate opening for an Operations Supervisor for Abilene Convention Center. The Operations Supervisor is responsible for the daily activities required to run, maintain, and service the facility and the events by performing the following duties personally or through subordinate technicians prepares and maintains facility for all events throughout the complex as needed, including the Auditorium, Convention Center, and Meeting Room activity. This includes overseeing execution of all event set ups, housekeeping preparation and facilitation, and equipment maintenance and upkeep. Supervisor must be capable to supervise and coordinate activities of workers engaged in the Housekeeping & Changeover / Set Up departments. Position also supervises and assists in scheduling various aspects of operations, interfacing with City of Abilene maintenance, ACC technical services, including ADA compliance, public safety and security.\nEssential Duties and Responsibilities\nInclude the following. Other duties may be assigned.\nOversee daily housekeeping/custodial, Set up, changeover, tear down employees and tasks assigned to completion\nAssist in scheduling staff as needed for event work and general facility operation.\nManages and maintains ACC equipment including set up, housekeeping, and facility maintenance equipment.\nOperate and control some equipment via computers.\nCoordinate facility operations alongside the Audio/Visual team, third party vendors and subcontractors within the facility.\nWork extended and/or irregular hours including nights, weekends and holidays, as needed\nSupervisory Responsibilities\nEmployee will carry out supervisory responsibilities in accordance with ASM Global policies and applicable laws. Responsibilities may include assisting in hiring and interviewing new hires; responsibilities will include training employees; planning, assigning and directing work; appraising performance; rewarding; disciplining employees in conjunction with Human Resources; addressing complaints and resolving problems. Scheduling of employees and payroll data input.\nQualifications\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required.\nEducation and/or Experience\nA high school diploma or GED.\nAt least one year of facilities operations experience preferred.\nMaintain the proper operations of housekeeping equipment and change over equipment.\nCompletion of facilities management courses or sports management courses is considered a strong plus; or an equivalent combination of education and experience.\nCurrent driver’s license is required.\nSkills and Abilities\nRead and interpret documents, procedure manuals, floor plans, assignment sheets, safety rules, operating and maintenance instructions for all areas of the department\nPossess any licenses, certificates or training required by company, local, state or national authorities for the operation of the equipment found in the facility in all areas of the department\nDemonstrate knowledge in the practice and procedures related to all areas of custodial, event set up, tear down & change overs\nPossess a thorough understanding of the operational procedures, facility capabilities, industry terminology, event-related services, and technical requirements for all the types of events anticipated at the facility\nWork independently, exercising judgment and initiative.\nOrganize and prioritize to meet deadlines\nWork effectively under pressure and/or stringent schedule and produce accurate results\nFollow oral and written instructions and communicate effectively with others in both oral and written form\nMaintain an effective working relationship with clients, employees, exhibitors, patrons, tenants and others encountered in the course of employment\nRemain flexible and adjust to situations as they occur\nKnowledge of computers & programs\nPhysical Demands\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the employee is regularly required to move around the facility; to stand for long hours during events; talk and hear. This position may require work inside or outside of the building, as needed by events.\nThis position requires good vision, hearing and dexterity. Long periods of standing, walking, lifting, stooping, kneeling, crawling and crouching on concrete, ice surfaces, staircases, etc., including slippery and uneven surfaces. Lifting and moving up to 50 lbs. + over a period of time. This position requires work in both indoor and outdoor settings and may be subject to adverse conditions.\nNote\nThe essential responsibilities of this position are described under the headings above. They may be subject to change at any time due to reasonable accommodation or other reasons. Also, this document in no way states or implies that these are the only duties to be performed by the employee occupying this position.\nASM is an Equal Opportunity/Affirmative Action employer, and encourages Women, Minorities, Individuals with Disabilities, and protected Veterans to apply. VEVRAA Federal Contractor.Show more Report"}, {"company": "Cesvi Fondazione Onlus", "job": "Technical Coordinator Senior - Palestine", "city": "Jerusalem", "date": "6d", "rating": "3.6", "link": "", "description": "WORK CONTEXT\n\nCESVI has been working in Palestine since 1994 and it has developed over the years an expertise in the area of solid waste management, water and sanitation. CESVI implemented various projects in partnership with relevant actors in the sector and active participation in the WASH cluster and other coordination networks.\nCESVI is currently implementing projects in the in Hebron and Gaza governorates, in consortium with local and international partners. The ongoing projects are funded by SDC and AICS\n\nThe main activities included in the SDC and AICS projects are:\n\nData collection and laboratory testing: data collection on current WASH practices; development of a simplified methodology for the evaluation and adaption of filters to the local context; test of the filters in laboratories;\nRehabilitation of washing facilitates in schools\nRehabilitation of water networks\nMonitoring and Implementation based on behaviour change strategy / RANAS approach\nData analysis: elaboration of data and training materials;\nDevelopment of a strategy to encourage and maximize sharing of data, methods and insights among the partners and a wider audience\nDissemination of research findings and incorporation of recommendations in design of interventions.\n\nPosition:\nJOB DESCRIPTION\n\nThe collaboration will start in mid-May/June 2023\n\nThe main duty station will be in Jerusalem with frequent travels in the West Bank and Gaza Strip.\n\nKEY RESPONSIBILITIES\n\nThe Technical Coordinator Senior will work in coordination with the Head of Mission and s/he has to coordinate with the Country Administrator\n\nMain tasks and responsibilities:\nS/He will ensure constant supervision of project and program managers, to monitor rate of spending in each project and coordinating project managers in direct implementation, ensuring full procedural compliance in coordination with the Head of Mission and Country Administrator\nS/he will review of any variations / amendments for the extension or revision of the projects\nS/he will Active participate in the new donors acquisition: identification of new projects within CESVI’s sector, coordinate the entire process of drafting of proposals in collaboration with all the team (PMs, CA, HoM)\nS/he will supervise MEAL officer for harmonization of data collection tools, database management and reporting\nS/he will ensure the compliance of technical requirements wash /waste) in the projects (check and write BOQ, liaise with providers, municipalities and technical stakeholders/partners\nS/He will actively participate to the Wash and waste Working Group.\nS/He will write new project proposals in coordination with HQ and the field.\nS/He will liaise with relevant stakeholders.\nRequirements:\nESSENTIAL REQUIREMENTS\nUniversity or Master degree in engineering, or related field in wash sector expertise\nMinimum 5 years’ program management experience, grant management in a NGO, including experience directing and implementing programs in both protracted crisis and development contexts\nSpecific studies or training on data collection and visualization\nSolid experience in needs assessments, project proposal and reporting\nExperience in managing wash projects\nKnowledge of financial rules and regulations of International donors as EU, AICS (Italian Cooperation Agency), etc.\nKnowledge of effective financial and budgetary planning and control\nSolid diplomatic and leadership skills in managing a variety of internal and external relationships, especially with partners\nCapacity to acting effectively as a team member\nSelf-motivated, flexible, resilient, able to take initiative and work independently\nExcellent problem-solving and analytical skills\nHigh level of IT skills (Windows, Office package)\nExcellent knowledge of English written and spoken.\nDESIRABLE REQUIREMENTS\nPrior working experience in the Middle East and / or in the Occupied Palestinian Territory\nKnowledge of Arabic\nSAFEGUARDING\n\nCesvi has a zero-tolerance approach to any harm to, or exploitation of, a child or a vulnerable adult by any of our staff, related persons or partners.\n\nCesvi’s commitment to being a safe organization begins with the staff recruitment process which includes meticulous checks, such as criminal records checks or check disclosure of previous convictions, to ensure children and vulnerable people are safeguarded and abuse is prevented. Safeguarding checks are part of the selection process performance.\nHEALTH SAFEGUARDING\n\nCesvi pays particular attention to safeguarding the health of all the human resources of the Organisation. Therefore, in order to protect its staff, an assessment of their suitability for the position in each mission is carried out before departure. Such assessment is done by the Occupational Doctor of the Organisation, who will also examine the vaccination coverage, including the anti-Covid19 vaccination.\nPlease note: due to the high number of applications we receive we are unable to provide feedback if unsuccessful at the applicant stage. Only short-listed candidates will be updated on the status of their applications.\nOther information:\nGROSS SALARY RANGE € 3.500 - € 4.000 PER MONTH\n\n﻿€ 400 MONTHLY HOUSE ALLOWANCE IN TUNIS (TUNISIA)\n\nFULL HEALTH INSURANCE COVERAGE\n\nONE ROUND-TRIP FLIGHT EVERY 12 MONTHS OF COLLABORATIONShow more Report"}, {"company": "Placer.ai", "job": "Mobile Team Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a508f7bf&cb=1676382327529&jobListingId=1007359285516&jrtk=3-1-1gp82okkki3b3801-1gooib049h7h6800-e5e1b6ec4c873a3a-", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY:\n\n\nPlay a central role in building a brand new mobile SDK with the modern mobile toolkit and SW development best practices in mind.\nSolve non-trivial problems of navigation in the physical world while maintaining low battery consumption.\nGet to know the lower levels on Android and iOS with almost no UI work.\nEvolve your skillset by working together with the existing mobile team on Android, iOS, and big data tools.\n\n\nRESPONSIBILITIES:\n\n\nManage a team of talented mobile developers who can do more than just write iOS/Android code.\nCreate a state of the art location collection algorithms with iterative experimentation.\nDevelop and own backend services that scale up to millions of devices using serverless and managed cloud solutions.\nGo beyond location data and create a holistic data sourcing solution for foot traffic analysis.\nCollaborate with Big Data and Data Science teams to design and implement the entire data pipeline.\nHelp to implement quality measurement tools and analyze the performance data.\nImprove your software engineering skills by working with our team on Android, iOS, and Backend.\n\n\nREQUIREMENTS:\n\n\n2+ years of experience managing a team of mobile engineers\n5+ years of hands-on mobile development experience with either Android or iOS.\nSupported at least 500k DAU on a single app/SDK\nA/B Testing experience and working with gradual releases\nExperience working and/or building CI/CD pipelines and understanding of modern SW development cycle.\nIn-depth knowledge of mobile operating systems.\nSee software development as the core of what everyone in the team does, and Android/iOS/Data Analysis/QA as implementation details.\nLead by example and stay hands-on.\nTransparent, aspire for excellence but know how to compromises to meet business needs.\nAbility to operate in a flexible, dynamic, yet fast-paced work environment.\n\n\nOTHER REQUIREMENTS:\n\n\nExperience writing Mobile SDKs/Location-driven features.\nExperience optimizing battery consumption in the background.\nExperience working with AWS/GCP/Firebase other Cloud technologies.\nExperience working with Kubernetes/Spark/Kafka/Other large scale technologies.\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.\n\n#LI-AC1Show more Report"}, {"company": "Placer.ai", "job": "DevOps Team Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_941073f0&cb=1676382328726&jobListingId=1008378191601&jrtk=3-1-1gp82olmtjm6i801-1gooib049h7h6800-8b2e195ef71844fe-", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY:\n\nAt Placer.ai we process 10TB-15TB of data on a daily basis using various technologies such as Spark, BigQuery, Bigtable, Kafka and use them to solve hard geospatial problems. To serve such a huge scale, our underlying infrastructure has to be scalable and tuned to its finest levels, monitored and visible.\n\nWe are looking for a Team Lead to help build, shape and scale Placer’s DevOps Team. The primary role is to manage and lead our DevOps Team and help develop, implement and deploy complex cloud infrastructure to be used by our engineers.\nYou will partner closely with our architects and engineering managers to make sure we deploy a world class physical world analytics platform.\n\n\nRESPONSIBILITIES:\n\nLead, teach and grow a team of experienced DevOps Engineers\nBuild the team's roadmap, prioritization, and delivery\nWork closely with architects and engineering managers to define infrastructure needs and provide them with relevant tools, services and training\nResearch and integrate new technologies into our stack, from POC to battle proof in production\nManage, monitor, scale, and troubleshoot a distributed highly scalable, highly available, customer-facing software stack.\nBe hands-on and take an active role in developing and maintaining Placer’s infrastructure\n\nREQUIREMENTS:\n\n3+ years of experience as DevOps/SRE/Production Engineer team leader\nExperience with leading, mentoring, and developing a team\nComprehensive knowledge and experience of major public cloud service provider (AWS, GCP, Azure)\nHighly knowledgeable with large scale Kubernetes deployments including monitoring, maintenance and troubleshooting\nDeep understanding of IaC concepts and experience with tools such as Terraform, Cloudformation, Palumi etc.\nExperience with CI/CD methodologies\nExperience with observability tools and best practices (Prometheus, Jaeger, OTEL etc.)\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.\n\n#LI-AC1Show more Report"}, {"company": "Placer.ai", "job": "Senior Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai's platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai's customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world's top-10 retailers, 2 of the top-10 CPG firms worldwide, a world's top hospitality firm, 2 of the world's top-10 commercial real estate (CRE) firms and 2 of the world's top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\nSummary\n\nWe are looking for a Senior Data Scientist to join our expanding data group. This person will work with our team of data scientists and drive research and development of new location analytics products. The ideal candidate will be an experienced analytics leader, highly motivated and capable of learning our business in detail. He or she will work in a dynamic environment undergoing growth in new areas and will be expected to take ownership of driving research and development for a new line of data products. Passion is a MUST and passion for data even more so!\nIf you are someone who thrives outside their comfort zone, your place is at Placer.ai.\n\nResponsibilities\nUse a creative combination of AI methods, machine learning algorithms, statistics and business intelligence to build new data tools and improve existing one. This will be applied to the entire data science value chain – from exploration of use cases, through automated data quality enforcement to data modeling and serving\nWork closely with dedicated development teams ensuring high quality handshake in productization phases.\nTake an active, thought-leadership role in building new AI/ML pipelines and infrastructure.\nQuickly identify gaps in delivery and provide the right measure for constant monitoring of new products. Own the process and not just the tools\nMentor and lead other data scientists in your field of expertise while collaborating with the broader data community – data scientists, analysts, and data infrastructure teams\nRequirements\nM.Sc./PhD in a relevant field with strong quantitative skills\n5+ years of experience working as a Data Scientist in an innovative environment\nStrong analytics mindset, with good understanding of data and its limitation: sampling, frequency, manipulation and cleaning techniques to name a few\n3+ years of working experience with the python data science toolbox (Pandas, Numpy, SKlearn, etc.)\nTeam player with strong interpersonal and communication skills.\nAnalytic mindset, with the ability to envision new ways to leverage data to improve internal processes and delight our customers\nSelf-learner, always seeking to sharpen their skills and grow their knowledge\nCan do approach - it's all about the attitude\nNice to have:\nWorking experience with large data sets and good acquaintance with the Big Data eco system (Spark, GBQ, Athena, Hive, Pig, etc)\nProven visualization and presentation skills\nWorking Experience in Cloud based environments\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai's applicants are considered solely based on their qualifications, without regard to an applicant's disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai's Human Resources Department to make the need for an accommodation known.Show more Report"}, {"company": "Placer.ai", "job": "Senior Product Manager - Mobile Data Collection", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9afaf49c&cb=1676382331855&jobListingId=1007913129066&jrtk=3-1-1gp82oos9gfos801-1gooib049h7h6800-d462af157b8368eb-", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterward, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras, and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY\n\nPlacer.ai Location Collection team is responsible for building Placer’s next-gen SDK, built to help app publishers collect data optimally, balancing accuracy of location collection with footprint on the app’s performance or on the end user experience. As a product manager, you will take responsibility for managing and developing end-to-end product vision, strategy, and roadmaps of the data collection domain in collaboration with cross-functional partners inside and outside the organization.\n\n\nRESPONSIBILITIES\n\nBe the driving force behind Placer’s Location Collection team.\nSet the vision, strategy, and roadmap for the team, leading its execution end-to-end from inception through launch.\nBuild relationships with our data partners and work with them to learn their goals, pains, and needs and translate them to product requirements.\nLead sprints, planning, and retrospectives and manage agile teams made up of world-class data professionals.\nWrite detailed and precise specs, define and set KPIs for your products to make informed product decisions, uncover insights and promote discussions through a data-driven approach.\nPlay a central role in the Placer.ai product management team and design data-intensive features.\nOversee all aspects of the delivery process to achieve the growth targets of Placer’s product and guarantee smooth and efficient implementation.\nTranslate business goals into objectives and product KPIs and ensure product initiatives have the right direction and focus to succeed in the market\n\n\nREQUIREMENTS:\n\nExperience working on Data-Driven / B2B / SaaS products - Must\n2+ years as Senior Product management in a fast-paced tech environment - Must\nStrong Mobile data knowledge (Mobile operating systems, Sensors, Permission)- big advantage\nExperience working with development teams on high complexity systems\nAbility to motivate and inspire development teams to achieve beyond what they imagined possible\nEntrepreneurial and analytical; effective at managing change in a fast-moving and constantly evolving business\nStrong understanding of customer needs and the ability to translate them into a technical solution\nDetail oriented\nEffective written and verbal communication skills in English\nComputer Science, Engineering, or Statistics degree\nNICE TO HAVE:\n\nExperience working with Location Data\nExperience managing an SDK / product for developers\nBA/BSc degree or equivalent practical experience. Master's degree - Advantage\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are an industry-leading start-up.\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent and excellent people.\nCompetitive salary\nExcellent benefits\nHybrid wok model\n\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.Show more Report"}, {"company": "Tenable", "job": "Senior Product Designer, Attack Path Analysis, Tenable One", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_89c51abc&cb=1676382333268&jobListingId=1008390732444&jrtk=3-1-1gp82oq8hghpc801-1gooib049h7h6800-d65464bac1bf77c9-", "description": "Who is Tenable?\nTenable® is the Exposure Management company. 40,000 organizations around the globe rely on Tenable to understand and reduce cyber risk. Our global employees support 60 percent of the Fortune 500, 40 percent of the Global 2000, and large government agencies. Come be part of our journey!\nWhat makes Tenable such a great place to work?\nAsk a member of our team and they’ll answer, “Our people!” We work together to build and innovate best-in-class cybersecurity solutions for our customers; all while creating a culture of belonging, respect, and excellence where we can be our best selves. When you’re part of our #OneTenable team, you can expect to partner with some of the most talented and passionate people in the industry, and have the support and resources you need to do work that truly matters. We deliver results that exceed expectations and we win together!\nYour Role:\nIf you’re looking for an opportunity to work as a startup in a cyber giant, your place is with us. We're building Tenable's new Cyber Exposure Platform that will reach tens of thousands of customers and leverage the latest technologies. You will be part of an engineering team responsible for the UI/UX of the Attack Path product.\nYour Opportunity:\nAs a member of our team, you will be in charge of researching, designing, and implementing design features in our exciting application. It’s super challenging work, combining work with PM, leadership, and engineers, to build the best Attack Path application out there.\nThis team is in charge of a newly established product of Tenable that plays a key part in Tenable strategy.\nIt's a unique opportunity to join a small new team that works like a startup with the backing of a large and successful company. This is a great place for passionate individuals who are looking for a chance to make an impact, learn, and grow!\nWhat you’ll need:\n5+ years of UX/UI design, working for B2C SaaS companies, with an emphasis on integrating visual design components into industrial products.\nExperience working across the full product lifecycle, from early generative research – to ship – to in-market UX research.\nWorking knowledge of Agile methodologies\nFluent in Figma\nCreative and technical background\n A link to your portfolio\nAnd ideally:\nGeneral Knowledge of the Cyber Security domain\nA good understanding of HTML and CSS is an advantage\nSelf-motivated and passionate attitude\nTeam player mindset\nIf you’ve reached this point, and you’re still not sure if you should apply…..Just do it! We’re human and we don’t fit a perfect mold. Having diverse backgrounds, experiences and perspectives, that’s a good thing! If you’re coming from outside of the cyber industry - great! If you’re looking to try something new - awesome! All we ask is you bring passion to all that you do, crave creativity and innovation, and embrace the hard work of gaining new skills and accepting big challenges.\nWe’re committed to promoting Equal Employment Opportunity (EEO) at Tenable - through all equal employment opportunity laws and regulations at the international, federal, state and local levels.Show more Report"}, {"company": "Marriott International, Inc", "job": "Engineering Ass. Manager", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e14d8218&cb=1676382334596&jobListingId=1008411040517&jrtk=3-1-1gp82orhv2a81001-1gooib049h7h6800-49619e9084f04e92-", "description": "Job Number 23010130\nJob Category Engineering & Facilities\nLocation The Jaffa a Luxury Collection Hotel Tel Aviv, 2 Louis Pasteur Street, Tel Aviv-Jaffa, 0, Israel VIEW ON MAP\nSchedule Full-Time\nLocated Remotely? N\nRelocation? N\nPosition Type Management\nJOB SUMMARY\nAssists department head in managing budget, capital expenditures, preventative maintenance and energy conservation. Accountable for maintaining the building and grounds with particular attention towards safety, security and asset protection. Assigns, tracks and follows up on status of work assigned to staff and contractors. Helps to increase guest and employee satisfaction through effective communications and training.\nCANDIDATE PROFILE\nEducation and Experience\nHigh school diploma or GED; 4 years experience in the engineering and maintenance or related professional area; technical training in HVAC-R/electrical/plumbing.\nOR\n2-year degree from an accredited university in Building and Construction, Engineering, Mechanics, or related major; 2 years experience in the engineering and maintenance or related professional area; technical training in HVAC-R/electrical/plumbing.\nCORE WORK ACTIVIITES\nSupporting management of Property Operations\nSupervises distribution of repair work orders.\nEnsures property policies are administered fairly and consistently.\nAssists in effectively planning, scheduling and evaluating preventative maintenance programs.\nEstablishes and maintains open, collaborative relationships with employees.\nMonitors timeliness and quality of completion of repair work orders.\nSupervises Engineering and related areas in absence of the Director of Engineering.\nAssists in managing the physical plant including equipment, refrigeration, HVAC, plumbing, water treatment, electrical and life safety systems.\nEnsures that regular on-going communication occurs with employees in order to create awareness of business objectives, communicate expectations and recognize performance.\nRecommends or arranges for additional services such as painting, repair work, renovations, and the replacement of furnishings and equipment.\nSelects and order or purchase new equipment, supplies, and furnishings.\nSupervises the day to day operations of Engineering and related departments.\nMaintaining Property Standards\nInspect and evaluate the physical condition of facilities in order to determine the type of work required.\nMaintains accurate logs and records as required.\nOperates generators and fire pumps as necessary.\nProvides emergency response services 24/7.\nRepairs equipment (e.g., refrigeration, laundry) as necessary.\nEnsures all employees have the proper supplies, equipment and uniforms.\nEnsuring Exceptional Customer Service\nEmpowers employees to provide excellent customer service.\nEmphasizes guest satisfaction during all departmental meetings and focuses on continuous improvement.\nSets a positive example for guest relations.\nConducting Human Resources Activities\nHelps train employees in safety procedures.\nSupports a departmental orientation program for employees to receive the appropriate new hire training to successfully perform their job.\nCommunicates performance expectations in accordance with job descriptions for each position.\nEnsures disciplinary procedures and documentation are completed according to Standard and Local Operating Procedures (SOPs and LSOPs) and support the Peer Review Process.\nAssists as needed in the interviewing and hiring of employee team members with the appropriate skills.\nParticipates in the employee performance appraisal process, providing feedback as needed.\nUses all available on the job training tools for employees.\nSolicits employee feedback.\nSupervises staffing levels to ensure that guest service, operational needs and financial objectives are met.\n\nMarriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law.\n\nThe Luxury Collection is a glittering ensemble of locally authentic hotels and resorts from around the world. Our hotel teams curate the world’s most enriching and desirable destination experiences. Our mission is to guide our guests, these seasoned travelers on transformative journeys that touch their spirits, enrich their lives and create lasting memories. If you are someone with an appreciation for evocative storytelling and a desire to provide genuine, personalized, and anticipatory service, then we invite you to join us on our journey and explore a career with The Luxury Collection.Show more Report"}, {"company": "AppsFlyer", "job": "Regional Marketing Manager- Temporary", "city": "Herzliya", "date": "21d", "rating": "4.5", "link": "", "description": "Are you a passionate B2B marketer with experience in hyper-growth SaaS and mobile businesses? If you are, read on!\n\nOur mission at AppsFlyer is to give digital marketers the very best tools and insights to help them be as successful as they can be. With a highly talented, global team of over 1,500 people, and growing, we're only just getting started.\n\nWe're looking for a hungry, passionate, tech-savvy B2B marketer to join our vibrant, friendly office in Herzliya and lead our field marketing programs and customer lifecycle activities in SANI region (South Europe, Africa, Nordics, Israel). You'll be taking a market-leading, mission critical SaaS offering out to digital marketers and brands in the region.\n\nIn your B2B toolkit, you'll be highly analytical, independent, a competent storyteller, a first class project manager and have a flair for putting together exceptional events and experiences.\n\nWorking closely with your local colleagues in Sales, Customer Success and Partnership Development, as well as a large, cross-functional team of marketing experts in our Global HQ. You'll be responsible for planning, coordinating, executing and reporting all revenue-focused marketing programs for each individual market to deliver new customer leads, existing customer engagement and partnership development goals.\n\nThe role reports to the Managing Director of EMEA-SANI, and to the Head of Marketing for those respective markets\n\nThis position is temporary for one year\n\nWhat you'll do:\n\nEvents - You're passionate and hands-on about events and will work with Sales, Customer Success, Partnership Development and third party partners, such as trade associations and conference organizers, to create a pipeline of events across all markets that help raise AppsFlyer's brand awareness, position the business as the domain authority for mobile measurement and drive new demand and upsell opportunities.\n\nContent, thought leadership & PR - You enjoy creative copywriting and are responsible for positioning AppsFlyer as the market leader in your local markets. You'll be working closely with the Global Content & Mobile Insights + Comms teams, as well as local PR partners, you'll create thought leadership campaigns to promote AppsFlyer's portfolio or cross-device measurement and fraud protection services. These could be anything from blogs and white papers, to major PR campaigns or event content\n\nData - You're all about the numbers. As the lead for the individual country growth squads, you'll be responsible for managing ongoing growth initiatives, reporting the results of our time and financial investments and optimizing our activities on an ongoing basis. You'll have the support of our Global Marketing Operations team to do so, as well as numerous BI tools\n\nTeam player - You're a go getter and problem solver with a great team spirit. You're happy being part of a close knit team that works hard and plays hard and you're not afraid to roll your sleeves up and do what's right for the team\n\nWhat you have:\n\n3-5 years of experience in B2B marketing roles ideally within the technology, SaaS or mobile software sectors\nProven track record of planning and executing on field marketing campaigns, generating pipeline and strengthening customer relationships.\nExceptional project management skills, writing, communication, and presentation in English.\nPassionate about technology and the latest trends and best practice in B2B marketing\n\nBonus Points:\n\nA degree in Marketing or related subject area\nExperience in CRM and events systems (Salesforce, Splash & Marketo as advantage).\nCompetitive analysis and account mapping experience - an advantage\nAbility to speak an additional relevant language other than English is highly desirable, but not a must have\nKnowledge of the E-commerce, gaming or finance mobile marketing world an advantage\n\nAs a global company operating from 20 offices worldwide, we reflect the human mosaic of the diverse and multicultural world in which we live. We ensure equal opportunities for all of our employees and promote the recruitment of diverse talents to our global teams without consideration of race, gender, culture, or sexual orientation. We value and encourage curiosity, diversity, and innovation from all our employees, customers, and partners.\n\n\"As a Customer Obsessed company, we must first be Employee Obsessed. We need to make sure that we provide the team with the tools and resources they need to go All-In.\" Oren Kaniel, CEOShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Principal Regulatory Affairs Specialist", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_011a988e&cb=1676382337478&jobListingId=1007959075834&jrtk=3-1-1gp82ouc8j4it801-1gooib049h7h6800-fc8e5c52ca76b03a-", "description": "Principal Regulatory Affairs Specialist\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Hybrid\nOnsite Location(s):\nYokneam, IL\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nWe as Boston Scientific are expanding our Regulatory Affairs team in Israel ( Yokneam) due to our growth and the acquisition of Lumenis Israel- Medical Lasers.\nThat's why we are recruiting for a Principal Regulatory Affairs Specialist\n\nAbout this role as Principal Regulatory Affairs Specialist- Israel:\nResponsible for Regulatory Affairs support of submissions and on going regulatory compliance for product development process.\n\nYour key responsibilities will be:\nReviews and signs-off on product design control documentation for compliance with applicable regulations.\nProvides technical/regulatory guidance to cross-functional teams.\nActs as company representative, developing and maintaining positive relationships with device reviewers through oral and written communications regarding pre-submission strategy/regulatory pathway development, testing requirements, clarification and follow-up of submissions under review.\nDevelops and implements regulatory strategies for modified products.\nActs as a core member on manufacturing and remediation teams, providing regulatory feedback and guidance throughout the program, and coordinating team inputs for submissions.\nResponsible for preparation and submission of global regulatory applications, as well as internal regulatory file documentation.\nReviews and signs-off on product and manufacturing changes for compliance with applicable regulations.\nEstablish and support a work environment of continuous improvement that supports BSC’s Quality Policy, Quality System and the appropriate regulations for the area they support. Ensure employees are trained to do their work and their training is documented.\n\nWho are we looking for:\nBachelor’s degree or equivalent work experience, preferably in a scientific or technical discipline\n8+ years Regulatory Affairs experience, medical device experience required\nWorking knowledge of design control documentation/requirements required\nWorking knowledge of FDA and international regulations\nGeneral understanding of product development process\nWorking knowledge of regulatory requirements for implantable, capital equipment and single use disposable devices\nAbility to manage several projects\nProficiency with Microsoft Office\nEffective research and analytical skills\nEffective written and oral communication, technical writing and editing skills\nAbility to work independently with minimal supervision\nLanguage skills: English and Hebrew\n\nQuality System Requirements:\nIn all actions, demonstrates a primary commitment to patient safety and product quality by maintaining compliance to the Quality Policy and all other documented quality processes and procedures.\nAssures that appropriate resources (personnel, tools, etc.) are maintained in order to assure Quality System compliance and adherence to the BSC Quality Policy.\nEstablishes and promotes a work environment that supports the Quality Policy and Quality System.\nRequisition ID: 532619\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\n\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code § 2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.\n\nPlease be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.\n\nJob Segment: Regulatory Affairs, Compliance, Technical Writer, Law, Medical Device, Legal, Technology, HealthcareShow more Report"}, {"company": "AppsFlyer", "job": "Software Team Lead - Platform", "city": "Haifa", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "HiredScore", "job": "DevOps Team Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "HiredScore brings deeply integrated big data and AI solutions to the global Fortune 500. By leveraging data from companies' Human Resources Data ecosystem, HiredScore enables to automate and augment the hiring process, enriching recruiters' decisions with smart insights and candidate prioritization grades using NLP and Machine Learning algorithms.\nHiredScore's Artificial Intelligence Engine uses past company hiring data, global hiring data, and other data sources, including labor market data, employee performance data, and CRM data, to revolutionize the end-to-end recruiting workflow as well as integrate seamlessly with other HR Systems such as chatbots, assessment tests, video interviews, and other automation tools. HiredScore's mission is to bring data science into the Human Resources domain.\nWe are looking for a motivated and experienced individual who is passionate about building infrastructure and DevOps to empower the company to scale effectively. As DevOps Team Lead, you will be responsible for the operations and infrastructure that tap into Fortune500 companies systems, and for the tools that make our R&D department productive and efficient.\nYou will work in a high-velocity startup with a fun environment where products and ecosystems are still being defined and developed. giving you the chance to influence some of the core tools used and be a part of every stage of development from concept to deployment. You will need to be a self-starter, ready to dig in and own projects, collaborate cross-functionally and deliver quality results\nRoles & Responsibilities:\n\nLead a team of professional and ambitious DevOps engineers\nHire, train, and mentor new team members as the team grows\nLead the design and implement solutions to improve new and existing infrastructure\nBuild solutions that allow our R&D teams to work productively at scale\nDesign and implement robust CI/CD pipelines\nLearn and apply industry best practices and share this knowledge within the team and with other teams.\nSolve diverse production-grade complex problems.\nContinuously learn and evaluate new technologies to stay ahead of the curve and perfect our services\nSolve performance bottlenecks and continuously improve the security and resilience of our platform\nMaintain HiredScore availability by participating in DevOps on-call shifts\nControl and improve HiredScore’s cloud consumption costs\nWhat You Need:\n\nAt least 5 years of experience in a AWS focused startup company as an engineer or manager.\nMore than 2 years of experience as a manager\nPeople skills- Be a team player with a strong sense of ownership able to communicate and collaborate with developers and stakeholders.\nPassion for building powerful products for engineers. enabling them to build, deploy and operate systems at scale.\nStrong coding skills in at least one general-purpose language (Python, etc.) as well as Bash.\nMandatory: Experience in AWS cloud.\nExperience in designing and building GitOps CI/CD (Jenkins, CircleCI, ArgoCD).\nProven hands-on experience with containerized environments and microservices; Kubernetes - A must\nExperience with configuration management (Chef, Puppet, Ansible, etc.).\nExperience with infrastructure as a code (Terraform, Pulumi, Crossplane, etc.).\nProficient at Linux system administration (CentOS / Ubuntu).\nHands-on experience with logging & monitoring solutions (Prometheus/Grafana/Thanos/ELK).Show more Report"}, {"company": "WalkMe", "job": "Senior Tech Lead- DeepUI", "city": "Tel Aviv-Yafo", "date": "15d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_61ad07aa&cb=1676382341954&jobListingId=1008424331258&jrtk=3-1-1gp82p2o52hel001-1gooib049h7h6800-eea23130a812f774-", "description": "We are developing WalkMe’s revolutionary runtime engine and transforming the online experience for hundreds of millions of users. Our proprietary AI-based technology is bringing the world’s leading digital adoption platform to the next level by understanding and interacting in real time with graphical user interfaces at a human level.We are looking for people who are passionate about leading technology to the extreme.If you are striving to develop an innovative product, make an impact, and work with the industry’s brightest talent as part of one of the fastest-growing and successful startups around – WalkMe is where you want to be!\nWhat will you actually be doing?\nResponsible for defining aspects of Walkme core engine architecture and design.\nDirectly engage with the product management for requirement analysis and clarifications and play a key role in assisting engineering/product management to define product and engineering road-map items.\nDetermine performance requirements by evaluating business strategies and end user requirements; researching information performance standards; conducting system performance analyses; studying architecture/platform; identifying performance issues;\nEnd to end design and implementation of platform performance\nDesign servers infrastructures.\nProvides leadership to technical resources to meet project deadlines and ensure project objectives are met in an efficient way.\nEnsures that code artifacts produced are of the highest quality, conforming to set or agreed upon standards. Should advocate such consistency to all members of the team.\nProvides realistic and accurate estimates and continuously improves team productivity to achieve on-time Delivery.\nFollows the software engineering processes, agile practices and motivates his/her team members to do so.\nEscalates and communicates issues, risks and concerns to the management on time.\nAccepts project delivery responsibilities and demonstrates accountability to leadership.\nBuilds competencies in product and technology domain to set expectations.\nMaintains a sense of individuality in thinking and decision making.\nIs a professional in work aspects as well as conduct with other individuals.\nProvides feedback regarding product quality, performance, other nonfunctional requirements and lead corrective measures.\nSupports the engineering management in the recruitment process.\n\n\nWhat should you bring to the table?\nSenior Tech lead who is passionate about web and product development.\nEager to solve complex problems.\nBachelor’s degree in CS/EE from a leading university.\nAt least 5 years of experience with Web technologies, both front and back-end.\nProficient in Typescript, Node.js, Nest, React ,Vanilla JS.\nExperience in JavaScript architecture.\nExperience with CI\\CD methodology.\nExcellent English - written and verbal.Show more Report"}, {"company": "ALSTOM", "job": "Telecom Engineering Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_58578e6e&cb=1676382343335&jobListingId=1007804604703&jrtk=3-1-1gp82p3tvk27m801-1gooib049h7h6800-e68909470281e449-", "description": "Req ID:287568\nLeading societies to a low carbon future, Alstom develops and markets mobility solutions that provide the sustainable foundations for the future of transportation. Our product portfolio ranges from high-speed trains, metros, monorail, and trams to integrated systems, customised services, infrastructure, signalling and digital mobility solutions. Joining us means joining a caring, responsible, and innovative company where more than 70,000 people lead the way to greener and smarter mobility, worldwide\n\nManagement of the Project Telecoms activities in setting of budgets, personal objectives, training, development and succession planning.\nManage and lead the Telecoms Design, Installation, Testing and Commissioning activities in the delivery of major and minor project works predominantly acting as Telecoms Design and Construction, taking responsibility for coordinated delivery of all aspects of the design, installation, testing and commissioning solutions.\nMonitor resourcing levels against all projects\nProvide an effective mechanism for team management with clear communication lines, creating a sense of urgency to safely meet project deliverables, timescales and budget expectations.\nManage telecoms engineering delivery performance ensuring consistency of design output and compliance with defined company standards, power design principles, industry standards and clients project requirements.\nLiaise with Planner and other discipline leads to develop and maintain accurate delivery schedules and resource forecasts.\nMonitor, action and accountable for discrepancies where deviations to programme and forecast occur.\nManage Authority to Work and Mentorship requirements within the Telecoms activities\nMotivate and develop staff, empowering team members to achieve their plans and growth targets and ensure the long-term sustainability of the team\nRole model and promote health, safety and environment\nEnsure procedures and work practices are documented and managed\nLead the tendering telecoms elements\nTo comply with, undertake and promote all relevant Environment, Health & Safety measures, responsibilities and activities.\nCompletion of Performance Management Cycle for Telecoms department\nTelecoms performance against project plans, to budget and acceptable quality\nAssist with investigation reports\nSubcontractor QCD performance monitoring\nProvide Client and sub-contractor feedback\nWork package progress reports\nEnsure Timely delivery of work packages\nProvide safety statistics reportable incidents\nUndertake risk assessments carried out\nEnsure that telecoms department productivity targets met (budgeted hours and earned value)\nReduce rework volumes for design, installation and testing\nImprove consistency of design production\nImprove audit performance\nEnsure resource demands are met\nManagement of staff issues\nColabrate and contribute technical matters with regional and central engineering team.\nAuthorities to Work in place\nMentorship Plans in place\nTraining and development plans with succession plans in place\nMonitor IRSE licences of staff\nMinimum 10 year of experience\nGraduated from electronic and/or communication engineering.\n\nAlstom is the leading company in the mobility sector, solving the most interesting challenges for tomorrow’s mobility. That’s why we value inquisitive and innovative people who are passionate about working together to reinvent mobility, making it smarter and more sustainable. Day after day, we are building an agile, inclusive and responsible culture, where a diverse group of people are offered opportunities to learn, grow and advance in their careers, with options across functions and geographic locations. Are you ready to join a truly international community of great people on a challenging journey with a tangible impact and purpose?\n\nEqual opportunity statement:\nAlstom is an equal opportunity employer committed to creating an inclusive working environment where all our employees are encouraged to reach their full potential, and individual differences are valued and respected. All qualified applicants are considered for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, age, national origin, disability status, or any other characteristic protected by local law.\n\nJob Type:Experienced\n\nJob Segment: Manager, Telecom, Telecommunications, Performance Management, Management, Technology, Human ResourcesShow more Report"}, {"company": "Edwards Lifesciences", "job": "Senior R&D Engineer - Temporary position", "city": "Israel", "date": "15d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1c50f808&cb=1676382344630&jobListingId=1008424550789&jrtk=3-1-1gp82p5bukhq4801-1gooib049h7h6800-590d3029aa97851a-", "description": "Lead the design of novel mechanisms according to design requirements – Technical lead\nResearch materials, technologies, and suppliers\nEarly-stage R&D\nManage matrix resources & suppliers\nIntegrate technical & clinical aspects of the device & procedure\nDesign & build testing systems – Hands-on\nParticipate in animal studies\nPerform & document tests & analysis\nEx-vivo\nIn-vivo\nStatistics\nComputational\n\nRequired Education/Skills:\nB.Sc. in Mechanical engineering\nHigh self-learning ability\nEnglish – Full proficiency (Clinical & Technical publications reading)\nInnovative / Creative\nIndependent & responsible person\nStrong execution, communication & interpersonal skills\nHigh commitment & willingness to work extra hours\n\nRequired Experience:\n7 years' experience as mechanical engineer\nMultidisciplinary experience\n3 years in the medical device field\nExperience with Nitinol based mechanisms\nExperienced with catheter technologies\nExperience in leading off-shore suppliers – high level of technical English\nFamiliarity with Cardiovascular anatomy – An advantage\nExperience in Animal/Human studies – An advantage\nExperience with Implantable sensors – An advantage\n\n\nFull-time job in Caesarea – until the end of 2023\n\n** Flexibility to work one day from home\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Placer.ai", "job": "Senior Product Manager- Growth Team", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3ac00116&cb=1676382345978&jobListingId=1008179805159&jrtk=3-1-1gp82p6l1i9gm801-1gooib049h7h6800-93058043be5b5c8a-", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1900 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY:\n\nPlacer is looking for an outstanding Product Manager to join its Growth team, and help Placer get its revolutionary products into new audiences. Placer’s Growth team is working closely with both Product and Marketing teams, looking for innovative ways to broaden the product’s reach, and accelerate the lead generation process. As a Growth Product Manager you will work on analytically optimizing our existing user acquisition channels, while creatively looking for new ones\n\n\nRESPONSIBILITIES:\n\nOwn the company’s lead-gen products and their roadmap\nConduct rapid experimentation for improving conversions and funnels\nWork with Placer business leaders and Marketing, interview customers and prospects, develop a clear understanding of customers use cases and personas\nWork with Product Analysts, Data Scientists and Engineering in building MVPs, validating the technical feasibility and the market need.\nProduce PRDs and mockups for new growth oriented experiences\nEffectively manage trade-offs between cost/schedule versus business benefit\nBuild and maintain a product backlog of projects with top of the funnel impact\nPitch new product ideas to management, be able to build a product thesis and defend it. Evangelize and promote new products internally to the rest of the product and engineering organization after the MVP has been validated\n\n\nREQUIREMENTS:\n\n4+ years of experience as a product manager in an analytical, data-driven environment\n2+ years experience in AB testing and funnel optimizations\nThrives in a startup environment and 0 to 1 initiatives\nExcellent communication skills\nHighly analytical background and proven attention to detail.\nInnovative, entrepreneurial, ability to multitask.\nStrong understanding of customer needs and the ability to translate them into a technical solution\nEffective written and verbal communication skills in English.\n\n\nADVANTAGES:\n\nExperience in growth driving partnerships\nExperience in marketing automation\nExperience in driving conversions in a freemium product\nExperience in SEO\nExperience working on Data-Driven B2B SaaS products\nComputer Science or equivalent technical background\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\nHybrid work model\n\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.Show more Report"}, {"company": "Eleos Health", "job": "Senior Product Manager", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "5.0", "link": "", "description": "Who is Eleos Health?\nToday, more people than ever are speaking publicly about their mental health. Whether it's ourselves, our friends and family or even public figures, taking care of your behavioral health is no longer a taboo, it's vital, and it's only human. Eleos is on a mission to help deliver the world's most effective behavioral care through data, measurement, and personalization. Or simply put, We want to give clinicians the support they need to do the important work only they can do.\n\nWhat is this opportunity?\nAs a Product Manager at Eleos Health, you will work cross-functionally to take products from conception to launch. You will connect the technical, clinical, and business worlds in order to break down complex problems and drive impact to the company’s strategic initiatives. You’ll be a primary domain owner, reporting to the Director of Product.\n\nWho are you?\nYou are creative, nimble, and scrappy with experience in earlier-stage companies, undaunted by the ambiguity and opportunity that comes with breaking new ground. You are excellent at managing your time and resources with a sharp eye for detail.\n\nHow will you contribute?\nEnd-to-end research, development, rollout, and optimization of new products in an extremely uncertain environment that involves market education.\nLead product strategy within a product domain, balancing between 0 to 1 and scaling existing value proposition.\nCreating and managing product roadmaps and feature backlogs, balancing varying customer needs and partner requests.\nWork collaboratively with engineering, data science, customer success, and sales to develop solutions that drive maximal impact on the company’s goals.\nAnalyse complex data and analytics to identify new opportunities for growth.\n\nWhat qualifications and skills will help you to be successful?\n4+ years of product management experience. Previous experience in B2B and working with data science is an advantage.\nStrong product sense.\nHigh-level execution skills are a must.\nDemonstrated success in defining and launching products.\nDeep understanding and experience with analytics platforms like Mixpanel.\nExcellent verbal and written communication skills.\n\nThis is a unique opportunity to join a startup that is having a meaningful impact on the well-being and mental health of thousands.\n\nWe have:\nA product that positively impacts peoples' lives every single day.\nA team of amazing people with a shared vision and the infinite drive to make it happen\nWe offer significant equity.\nOpportunity to build, grow and become highly instrumental in shaping how technology can increase the effectiveness of therapy.\nHybrid work opportunities.\nMental health days off you can take any given moment simply because you need them.Show more Report"}, {"company": "Marriott International, Inc", "job": "Supervisor-Training", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9ed1d76f&cb=1676382348750&jobListingId=1008381843769&jrtk=3-1-1gp82p9c6i14l801-1gooib049h7h6800-f9363767e6e7c603-", "description": "Nº do Cargo 23000216\nCategoria de emprego Human Resources\nLocal The Ritz-Carlton Herzliya, 4 Hashunit Street, Herzliya, Israel, Israel VER NO MAPA\nHorário Full-Time\nLocalização remota? N\nRemanejamento? N\nTipo de cargo Non-Management\nA Marriott International é uma empresa que oferece oportunidades iguais de trabalho. Temos como princípios a contratação de mão de obra diversificada e a manutenção de uma cultura inclusiva e voltada para as pessoas.Repudiamos qualquer forma de discriminação, seja ela por deficiência, idade ou qualquer outra forma disposta na lei.\n\n\nEm mais de 100 propriedades premiadas no mundo todo, The Ritz-Carlton Ladies and Gentlemen cria experiências tão excepcionais que elas permanecem com os hóspedes até muito depois de suas estadias. Sendo os provedores de experiências luxuosas mais importantes do mundo, nós definimos o padrão de serviços de luxo especiais e raros no mundo todo. Nós o convidamos para explorar The Ritz-Carlton.Show more Report"}, {"company": "RYB Technologies", "job": "Sr. Product Manager 842074", "city": "Israel", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=0000018631258039b4d51c1e81fd6ace&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c7c99943&cb=1676382350083&jobListingId=1007565521709&jrtk=3-1-1gp82palvkbns801-1gooib049h7h6800-68b59773f0d4fc3f-", "description": "We are looking for a Sr. Product Manager to build their own team of product managers and UX designers. Experience with SaaS products in Fintech or Human Resources (HR) sectors is a plus, but not required.\nThis Product Manager will report directly to the General Manager, as an integral member of the management team that will deliver a new product.\n\nThis position is a remote position and can be located anywhere, globally.\n\nResponsibilities:\nOwn delivery and definition of our new FIntech SaaS application for HR departments\nRepresent product in all matters communicating with sales and marketing teams.\nWork with engineering management to build development teams.\n\nQualifications / Requirements:\n10+ years of Product Management or Product Marketing Management experience in a SaaS product sold directly to businesses.\nExperience in a Product Management role with geographically distributed teams\nHighly effective written and presentation skills\nEntrepreneurial experience is a plus.\n\nSend cv to jobs@rybtech.comShow more Report"}], [{"company": "Rimini Street, Inc.", "job": "Sr Client Success Manager, Israel", "city": "Tel Aviv-Yafo", "date": "12d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=201&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d1dbda71&cb=1676382351836&jobListingId=1008431765967&jrtk=3-1-1gp82pcckkcle801-1gooibsmci4lv800-f2fbf06098d51b86-", "description": "Job Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nThe company is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs.\nWe have an exciting opportunity available right now to join us as a Sr Client Success Manager, responsible for a subset of clients within the EMEA region, based in Israel.\nPosition Summary\nWe are seeking an experienced Sr Client Success Manager who will be responsible for managing and expanding the partnership with our clients. The right candidate will have an entrepreneurial spirit, a proven track record of Client Management or Business Development & Executive Relationships excellence with the ability to provide solutions and guidance to meet business objectives and taking business to the next level. You must have a passion for clients. We need someone that can be very hands-on, do whatever it takes to deliver value, develop relationships, and be a strategic thinker with the ability to create long-term relationships with our clients\nAs a Sr Client Success Manager with Rimini Street, Inc., you’ll be managing a portfolio of named clients – driving client lifecycle – leading to adoption, cross-sell, advocacy and client satisfaction across your portfolio.\nEssential Duties and Responsibilities:\nDeliver and communicate ROI throughout the client lifecycle\nBuild C-level and executive relationships, establishing trusted advisor status\nDrive growth, value, retention and partnerships for our important clients to ensure active engagement and full recognition of ROI\nDevelop key account plans including; retention strategies, cross-sell opportunities, powermaps, client advocacy\nMeet/Exceed quarterly quota targets (renewals/cross-sell/advocacy)\nCreate awareness and demand for Rimini Street products and services\nIdentify, cultivate and engage on cross-sell opportunities within your portfolio for services and/or strategic solutions\nEnsure client retention through actively driving retention strategy, retention content including ROI models and proposals, and assisting with retention sales execution\nProvide ongoing proactive client management through executive business reviews, client onsite visits, executive relationships and overall client communications\nBuild and foster our Client Champion Community. Secure client sales and marketing advocates, ensuring client referenceability and driving client participation in select client marketing programs, events, interviews, etc.\nImplement and utilize current Social and Digital selling strategies to maximize opportunities via Social Networking platforms\nQuarterback the team and coordinate across executive leadership, sales, service delivery, marketing, etc.\nAdditional Duties & Responsibilities\nMonitor client consumption of Rimini Street services with the support of standard dashboards\nMaintain up-to-date client information in Salesforce.com and other systems\nProvide detailed and timely status reporting to all management as requested\nAssure client communications and escalations are performed on time, sufficiently and accurately\nOther job-related duties and responsibilities may be assigned from time-to-time\nQualifications/Skills/Experience:\n\nEducation\nBA/BS (MBA/Master preferred)\nLocation\nIsrael\nEssential Language Skills: English and Hebrew\nExperience\nGood knowledge of the enterprise software industry\nSpecific experience with Oracle and/or SAP preferable\nExperience dealing with CXO’s\nSignificant experience in Consultative Sales, Account Management, or Business Development\nExperience in managing a portfolio of clients in different industries\nExperience in cross-selling – identifying opportunities through trusted advisor partnership with clients and ability to coordinate and lead cross-functional team to drive better results for cross-sell and retention, etc.\nExperience in renewing and/or negotiating client support contracts\nExperience in working with complex, multi-divisional, multi-geographical customers\nExperience working with cross-functional teams (e.g. Sales, Renewals, Marketing, Services, etc.)\nSkills\nImpressive executive presence and communication abilities\nDemonstrated ability to provide proactive account management to a large portfolio of clients\nExceptional leadership, time management, facilitation, and organizational skills\nBias for action\nPassion for technology and for being a part of a fast-growing technology company\nProven analytical and problem-solving abilities\nProven experience with Social and Digital selling techniques\nAbility to create structure and prioritize tasks to best manage different situations\nStrong documentation skills MS Office Suite (Word, Visio, Excel, and PowerPoint); Salesforce CRM, Smartsheet, etc.\nRimini Street views all employees as partners, and is committed to providing an exciting, participatory and team-oriented work environment. In addition to our very competitive compensation packages, be prepared for challenging professional growth and fun along the way in our work-hard, play-hard corporate environment.\n#LI-DNI\nCompany Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nRimini Street is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs. According to Gartner, the third-party support market will grow to $1.05 billion by 2023, a 200% increase. With tight IT budgets and flat global economic growth, IT and procurement professionals are actively looking for proven methods to cut costs while improving service. Rimini Street enables organizations to free up budget for strategic business initiatives by delivering savings of up to 90 percent on total maintenance and support costs, and to date, the company has saved organizations over $5 billion in total maintenance costs since its inception.\nWe’re building something special at Rimini Street. A company where people care about each other and trust each other to do the right thing. A company where highly intelligent and talented people come together to do challenging and meaningful work that makes a real difference to our clients, ending each day with a sense of achievement and balance in their lives.\nBe Treated Like the Best\nRimini Street hires only the best – and provides the compensation, bonus and benefit programs appropriate for proven top-performing professionals. We want our employees to have an opportunity to share in the financial success that results from our dedication to service excellence, high-quality deliverables and an unparalleled client experience\nNo bureaucracy, thousand-page rule books or politics — just everyone working together to build a great company through service excellence and client success\nWork hard, play hard environment – Rimini Street is a group of hard-working professionals who are passionate about achieving success, but we also enjoy opportunities to meet up at fun company events\nWe are also passionate about giving back to our communities around the world, with plenty of opportunities for volunteering and charity through the Rimini Street Foundation\nAll Rimini Street professionals are encouraged to grow and learn new skills\nAccelerating Company Growth\nTrading on Nasdaq under ticker symbol RMNI since October 2017\nAdded to the US Russell 2000® Index in 2018\nOver 4,000 clients, to date including 100 of the Fortune 500 and Global 100\nAnnual 2021 financial results of $326.8 million, up 16.3% year over year\nFiscal year operating cash flow of $42.1 million, up 107% year over year\nAnnounced the new patent pending Rimini Street Artificial Intelligence Support Applications, a result of the Company’s continued investment in optimizing support processes and ensuring global service delivery outcomes at scale. Using the AI Applications, Rimini Street has been able to deliver a better client experience and reduce software issue resolution times by 23%.\nCelebrated the 15th anniversary of the Company’s founding in 2005 to redefine the enterprise software support market and bring choice and value to software licensees around the world.\nRecent Industry Recognition\nReceived 33 awards in 2020, including 15 awards for excellence in customer service from awards companies such as the International Stevie Awards, the American Stevie Awards, and the Stevie Awards for Sales & Customer Service\nHonored with four Gold awards for Company of the Year in 2020.\nThe Rimini Street Foundation recognized with two awards in 2020 for Corporate Social Responsibility Program of the Year\nIn addition, in 2020 the Company supported more than 120 charities around the world through the Rimini Street Foundation, providing financial contributions, volunteer hours and in-kind donations including personal protective equipment to healthcare workers, senior centers, food banks and youth organizations globally. The Foundation also extended its charitable work in 2020 to Hong Kong, Malaysia, Mozambique, Sweden and the UAE.\nTo learn more about how Rimini Street is redefining the enterprise software support industry, visit http://www.riministreet.com\nRimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, national origin, sexual orientation, gender or gender identity, disability and protected veterans status or any other characteristic protected by law.\nPlease Note: Rimini Street does not accept resumes submitted by recruiting/staffing firms unless specifically requested by Human Resources. Unsolicited resumes will be ineligible for referral fees.Show more Report"}, {"company": "United Nations", "job": "SENIOR COMMUNICATIONS MANAGER", "city": "Jerusalem", "date": "23d", "rating": "4.1", "link": "", "description": ""}, {"company": "Cesvi", "job": "Technical Coordinator Senior", "city": "Jerusalem", "date": "6d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=203&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_abf1bad4&cb=1676382354170&jobListingId=1008444241427&jrtk=3-1-1gp82pelh2pv5001-1gooibsmci4lv800-c4a911daab370d12-", "description": "WORK CONTEXT\n\nCESVI has been working in Palestine since 1994 and it has developed over the years an expertise in the area of solid waste management, water and sanitation. CESVI implemented various projects in partnership with relevant actors in the sector and active participation in the WASH cluster and other coordination networks.\n\nCESVI is currently implementing projects in the in Hebron and Gaza governorates, in consortium with local and international partners. The ongoing projects are funded by SDC and AICS\nThe main activities included in the SDC and AICS projects are:\n\nData collection and laboratory testing: data collection on current WASH practices; development of a simplified methodology for the evaluation and adaption of filters to the local context; test of the filters in laboratories;\nRehabilitation of washing facilitates in schools\nRehabilitation of water networks\nMonitoring and Implementation based on behaviour change strategy / RANAS approach\nData analysis: elaboration of data and training materials;\nDevelopment of a strategy to encourage and maximize sharing of data, methods and insights among the partners and a wider audience\nDissemination of research findings and incorporation of recommendations in design of interventions.\n\nJOB DESCRIPTION\n\nThe collaboration will start in mid-May/June 2023\n\nThe main duty station will be in Jerusalem with frequent travels in the West Bank and Gaza Strip.\nKEY RESPONSIBILITIES\n\nThe Technical Coordinator Senior will work in coordination with the Head of Mission and s/he has to coordinate with the Country Administrator\nMain tasks and responsibilities:\nS/He will ensure constant supervision of project and program managers, to monitor rate of spending in each project and coordinating project managers in direct implementation, ensuring full procedural compliance in coordination with the Head of Mission and Country Administrator\nS/he will review of any variations / amendments for the extension or revision of the projects\nS/he will Active participate in the new donors acquisition: identification of new projects within CESVI’s sector, coordinate the entire process of drafting of proposals in collaboration with all the team (PMs, CA, HoM)\nS/he will supervise MEAL officer for harmonization of data collection tools, database management and reporting\nS/he will ensure the compliance of technical requirements wash /waste) in the projects (check and write BOQ, liaise with providers, municipalities and technical stakeholders/partners\nS/He will actively participate to the Wash and waste Working Group.\nS/He will write new project proposals in coordination with HQ and the field.\nS/He will liaise with relevant stakeholders.\n\nESSENTIAL REQUIREMENTS\nUniversity or Master degree in engineering, or related field in wash sector expertise\nMinimum 5 years’ program management experience, grant management in a NGO, including experience directing and implementing programs in both protracted crisis and development contexts\nSpecific studies or training on data collection and visualization\nSolid experience in needs assessments, project proposal and reporting\nExperience in managing wash projects\nKnowledge of financial rules and regulations of International donors as EU, AICS (Italian Cooperation Agency), etc.\nKnowledge of effective financial and budgetary planning and control\nSolid diplomatic and leadership skills in managing a variety of internal and external relationships, especially with partners\nCapacity to acting effectively as a team member\nSelf-motivated, flexible, resilient, able to take initiative and work independently\nExcellent problem-solving and analytical skills\nHigh level of IT skills (Windows, Office package)\nExcellent knowledge of English written and spoken.\n\nDESIRABLE REQUIREMENTS\nPrior working experience in the Middle East and / or in the Occupied Palestinian Territory\nKnowledge of Arabic\n\nSAFEGUARDING\n\nCesvi has a zero-tolerance approach to any harm to, or exploitation of, a child or a vulnerable adult by any of our staff, related persons or partners.\n\nCesvi’s commitment to being a safe organization begins with the staff recruitment process which includes meticulous checks, such as criminal records checks or check disclosure of previous convictions, to ensure children and vulnerable people are safeguarded and abuse is prevented. Safeguarding checks are part of the selection process performance.\n\nHEALTH SAFEGUARDING\n\nCesvi pays particular attention to safeguarding the health of all the human resources of the Organisation. Therefore, in order to protect its staff, an assessment of their suitability for the position in each mission is carried out before departure. Such assessment is done by the Occupational Doctor of the Organisation, who will also examine the vaccination coverage, including the anti-Covid19 vaccination.\n\nPlease note: due to the high number of applications we receive we are unable to provide feedback if unsuccessful at the applicant stage. Only short-listed candidates will be updated on the status of their applications.Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "IT Learning Program Lead", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=204&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b83cc03b&cb=1676382355666&jobListingId=1008439474313&jrtk=3-1-1gp82pg3uirl1801-1gooibsmci4lv800-37c01cdba1656f8e-", "description": "IT Learning Program Lead\nDate: Jan 31, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 44969\nWho are we?\n\nTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds.\nWorking here means working with the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.\nHow you’ll spend your day\nStrategic planning of global learning and development programs\nLeading E2E global, complex learning & development projects with different partners within global IT and external vendors, according to business focuses and best practices\nWorking with managers and SMEs to evaluate’ skills gaps and identify relevant learning solutions to address them\nDesigning and leading the implementation of learning processes and tools, where applicable\nConduct needs assessments and plan, develop, implement, and deliver training curriculum to address global and local training needs\nBuild creative and unique, tailor-made development programs, using multiple tools and methods. Learning & Development programs are various, in all subject areas (e.g. Professional knowledge, Technical skills, \"Power skills\"/ \"Soft Skills\", Culture aspects)\nUse project management skills to ensure all details of the training programs are handled with quality and care\nMonitor, measure and assess the learning programs and activities for the IT management units you support\nYour experience and qualifications\nPresentation skills\nprogram management and detailed oriented\nProven track record in executing successful learning programs\nCurrent knowledge of effective & new learning methods and tools\nHave worked in a global organization before – a must\nIT background and knowledge\nHighly proficient in English\nRelevant degree in Organizational Psychology/ Organizational behavior – an advantage\nProven experience in similar role - an advantage\nProven experience from a global company – an advantage\nExperience working with vendors\nBe able to Influence without the direct authority\nAnalytical thinker and a creative problem solver\nGets things done and very proactive\nFunction\nHuman Resources\nSub Function\nLeadership and Development\nReports To\n\nDir Project/Program Management, IT Training & People Dev\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "Oracle", "job": "Sr HR Business Partner", "city": "Israel", "date": "19d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=205&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_504001c9&cb=1676382357026&jobListingId=1008416902570&jrtk=3-1-1gp82phecjoq8801-1gooibsmci4lv800-8623fe11ddaa1ff4-", "description": "Sr HR Business Partner-2300005J\n\nApplicants are required to read, write, and speak the following languages: English\n\nPreferred Qualifications\nDoes being a part of a dynamic HR team who support our organization to help customers go through digital transformations and moving to the cloud excite you? Are you looking to develop your HR career in a fast moving and innovative environment?\n\nOracle has transformed the enterprise software market with cloud computing and data driven innovation. We've launched business applications and platforms that are as easy to use and have a differentiated advantage in being able to offer an identical portfolio of infrastructure and platforms services for end-to-end data management both on-premise and on-the-cloud.\nWe are looking for a dynamic, high performing individual who thrives on the challenge of working in a fast moving environment and who has a passion for technology and how it can help businesses succeed.\nResponsibilities:\nDemonstrate an understanding of general HR processes and systems.\nAct as a point of contact for a specific Line of Business (LOB) employees regarding HR issues; responding timeously, accurately and professionally to all correspondence and queries.\nProvide advice and guidance regarding Oracle’s HR policies, processes and procedures.\nEnsure all advice, support and administration is compliant with local employment legislation and Company policies.\nEnsure all HR documentation is accurate, complete and up to date\nProcess lead/coordinator for key HR processes – take ownership of the process and become established as a subject matter expert within the HR team;\nContribute to the team objectives of knowledge transfer, process improvement and making it easier to do business with HR\nMaintain up-to-date knowledge of employment law and HR practices.\nThe successful candidate will also have the opportunity to get involved in ad hoc HR related projects\n\nRequirements\nStrategic Thinker: Develop HR plans to support strategic fiscal year business plans, and drive implementation activities e.g.\nManage organisational restructure & change programmes as appropriate\nRetention & Development activities of key employees\nDrive compensation planning activities\nLeverage HR data and provide analytics to business leaders to support business objectives\nEMEA-wide projects related to the overall business strategy\n\nChange Agent:\nDrive Talent Management activity locally and working with the lob Senior Leaders. Facilitate Talent Review Boards, Succession Planning, and identification of Leadership talent\nCo-ordinate & manage senior level promotions\nEducate Management on available HR tools, programs, resources that support their employees retention & development\nProvide advice & opinion on Organisational Design\n\nProblem Solver: Senior Stakeholder and local HR to resolve complex issues effectively i.e.\n\nKey Attributes/Skills:\nSignificant HR generalist experience (5+ years), preferably with experience in the IT sector & growth strategies in a dynamic talent marketplace\n\nDetailed Description and Job Requirements\n\nPartners with business units/divisions in delivering Corporate and Divisional HR policies and programs.\n\nJoin a leading HR group consulting with management and employees on HR practices and procedures. Manage employee relations issues and conduct investigations in support of corporate ethics and values. Participate in company-wide programs and initiatives (e.g., manpower planning, salary/bonus/stock review, organizational change, performance management, and training assessment).\n\nLeading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Key skills and abilities include coaching, influencing, facilitation, presentation, communication, process development, analysis, and problem solving. Ability to travel. 8 years generalist experience and BA/BS degree. Experience in an HR specialty a plus.\n\nAs part of Oracle's employment process candidates will be required to successfully complete a pre-employment screening process. This will involve identity and employment verification, professional references, education verification and professional qualifications and memberships (if applicable).\n\nJob: Human Resources\nLocation: Israel\nJob Type: Regular Employee Hire\nOrganization: OracleShow more Report"}, {"company": "AdvanSoft", "job": "Senior Technical Recruiter", "city": "Israel", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=206&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4fe364f0&cb=1676382358474&jobListingId=1008320303435&jrtk=3-1-1gp82pirjp6dn801-1gooibsmci4lv800-734fdef452d8df35-", "description": "Location : IL\nEducation : Bachelor's Degree in Technology Management, Engineering Management, Human Resources, or related bachelor of science discipline or equivalent experience\nJob Type : Full Time\nJob Responsibilities :\nCoordinate with the clients and stakeholders to identify the resource gaps in the process and requirement of technical resources for the project outcome\nElicit the requirements of the position by collaborating with the technical team and delivery managers to source the suitable profiles\nPublish and promote the position offering in various technological forums like GitHub and application tracking systems like the stack overflow and other various traditional methodologies to identify the suitable profiles for the required position\nScreen resources to observe the communication skills and understand the experiential history of the resource and explain the hiring practice to complete hiring program in a seamless way\nCoordinate with the delivery manager, technical team and HR manager to evaluate the profile standards to obtain the results for the suitability for the position requirement\nConduct the reference/background verification checks for the finalized resources and report the results to the HR manager and leadership team by using the analytical method\nConstant touch with technical teams, hiring managers, delivery managers, and HRBP to conduct and evaluate the performance of the new hires and existing employees\nConduct periodical meetings with the leadership team, the technical team, and HRBP to understand the current technology trends and build a new hiring practice and strategy for sustainable performances of employees\nCoordinate and conduct workshops at engineering schools and other technology institutes to explain the current trends and revolutions in technology to aware and counsel students\n\nSend resume & specify position you are seeking to :\nEmail : info@adso.com\nCall : 847-952-0000\nAdvanSoft International,Inc.\n135 E Algonquin Rd, Suite B, Arlington Heights, IL 60005Show more Report"}, {"company": "Mitsubishi Motors (Thailand) Co., Ltd", "job": "TRAINING - SENIOR STAFF", "city": "Central", "date": "25d", "rating": "3.8", "link": "", "description": "Job Summary\nResponsible for HRD, training master plan and SOP &WI of HRD function\nJob Description\n\nConduct training courses and employee development activities both in-house and/ or external facilitators as planned and aligned with MMTh competency and Department of Skill Development (DSD) requirement.\n\nConduct training need survey and prepare training need survey summary report\n\nDevelop training courses as assigned and contact the instructor and training institute to create the course outline aligned with MMTh training requirement and competency.\n\nAnalyze and prepare monthly training reports.\n\nControl and update HRD SOP and WI aligned with HRD tasks and ensure that all training members work activities aligned with this standard.\n\nManage training registration and record on Learning Management System (LMS)\n\nJob Specification\n\nMale or Female, age between 25 -30 years old.\n\nBachelor’s degree in Human Resources Management, Political Science, or other related fields\n\nAt least 2 years of working experience in OD, HRD function.\n\nStrong knowledge of Human Resources Development tools and activity management.\n\nProficiency in LMS, Microsoft Office Excel, PowerPoint, VDO editing Program.\n\nGood command of English - speaking, listening and writing.\n\nAble to work under pressure and doing multi-tasks.\n\nHaving high responsibility, can-do attitude, i nterpersonal skill, and teamwork spirit.Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Assoc Dir TGO Learning & Development", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": ""}, {"company": "Placer.ai", "job": "R&D Team Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=209&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e9ae4194&cb=1676382362595&jobListingId=1008363481458&jrtk=3-1-1gp82pmscm6oi801-1gooibsmci4lv800-a8f1d6f8dbbe70ab-", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY:\n\nAs an R&D team lead at Placer.ai you will have full ownership of core and critical Placer services. You will be responsible for planning, tech design, implementing and rolling out to production the services of our Analytics engine.\n\nIn your day to day, you will tackle challenging scaling issues, you will brainstorm with super talented team members on how to support our overall hyper growth and system complexity. You will push code to production on a daily basis.\n\n\nRESPONSIBILITIES:\n\nDesign and develop core infrastructure modules and functional services, tackle large scale and load challenges, using Python, Node and SQL / columnar / document DB’s.\nOwn a critical section of Placer’s core product.\nManage 6 to 12 backend and full stack developers.\nPerform POCs for new technology and design concepts.\nPlay a central role in building complex and large scale systems that powers Placer.ai’s platform\nMeasure, analyze and improve the performance, scalability and robustness of the product as well as processes\nTake full ownership by carrying out tasks end-to-end, from design to deployment\nTechnically mentor and assist team members to excel at their job by executing code and design reviews, and technical guidance\nCollaborate with Product, Analysts and Data Science teams in order to improve the product’s quality and deliver new features\n\n\nREQUIREMENTS:\n\n5+ years of professional backend experience, 2+ years of experience as team leader.\nExperience building large distributed production systems including event based architecture, experience with various DB’s and messaging technologies.\nBe hands-on with proficient coding skills in one or more of the following languages: Python, Java, Go.\nBSc degree in Computer Science or an equivalent\n\n\nOTHER REQUIREMENTS:\n\n2 or more roles as Team lead or Tech lead at different companies.\nExperience with frontend frameworks (React, Angular).\nExperience with big-data products, ideally with BI products.\nExperience with Google cloud, K8.\nDev Ops experience or background ideally with helm and terraform.\nExperience and knowledge with different DBs such as Mongo, postgres, Big query, Big table.\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.\n\n#LI-AC1Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Senior Manager, Learning and Development", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=210&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2d55fdf2&cb=1676382364323&jobListingId=1008333176386&jrtk=3-1-1gp82pohrjrp9801-1gooibsmci4lv800-84f9fd3205e2f049-", "description": "Senior Manager, Learning and Development\nDate: Feb 3, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 43448\nWho are we?\nTeva is a global pharmaceutical leader and the world's largest generic medicines producer, committed to improving health and increasing access to quality health solutions worldwide. Our employees are at the core of our success, with colleagues in over 80 countries delivering the world's largest medicine cabinet to 200 million people every day. We offer a uniquely diverse portfolio of products and solutions for patients and we've built a promising pipeline centered around our core therapeutic areas. We are continually developing patient-centric solutions and significantly growing both our generic and specialty medicines business through investment in research and development, marketing, business development and innovation. This is how we improve health and enable people to live better, healthier lives. Join us on our journey of growth!\nJob Description\n\nWho are we?\nTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds.\nWorking here means working as part of the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.\nThe opportunity\nThanks to an internal promotion we have a great opportunity for to join our global Learning and Development team as Senior Manager, Corporate training. Our team is working to unleash the power of people in order to drive better business results. Our core emphasis is on the design and development of strategic skill enhancement solutions and talent development practices for our employees worldwide.\nIn the role of Senior Manager, Corporate Training, you will be a key player in enhancing our quarterly and new hire required training deployments. You will lead the design and development of the standards and methodology for the deployment of corporate training. You will be partnering with key stakeholders across the business to level up training processes including needs analysis, vendor selection, scoping, instructional design practices and solution deployment and evaluation.\nFinally, you will also be leading the design and deployment of specific cross company learning offerings initiated by HR– for example, inclusion and diversity.\nHow you will spend your day\nPartner with senior leaders and various stakeholders to conduct needs assessments, identify target audience, prioritize content, develop advanced learning solutions, and measure and report.\nCollaborate with subject-matter experts and development leads to ensure that the solution: program content, learning objectives, and delivery modes meet the business context and intended audience.\nOwner of L&D's training standards and methodologies playbook – research the latest trends and apply advanced instructional design methodologies and solutions to create meaningful learning experience - including analysis, design, development, implementation, and evaluation for synchronous and asynchronous solutions.\nQualifications\nA minimum of a Bachelor’s degree is required; an advanced degree is preferred (in Learning and development/OD or related field)\nA minimum of 8 years working in global and preferably large organizations in the area of learning & development or instructional design\n\nSkills\nExcellent command of English- Ability to engage and influence stakeholders through effective written and oral communication\nInnovative and passionate about adult learning, sound instructional design methodology and organizational capability building is required\nDemonstrated experience in project management and working independently (leading a domain and implementing new processes)\nSolid (hands on) proficiency in MS Office, training authoring tools, webinar platforms, Learning Management System (bonus –knowledge of SAP Successfactors LMS)\n\nFunction\nHuman Resources\nSub Function\nLeadership and Development\nReports To\n\nSr Dir. employee learning and development, Learning and growth IL\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "ASM Global", "job": "Operations Supervisor/Crew Chief", "city": "Central", "date": "8d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=211&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6dc6b4e5&cb=1676382365548&jobListingId=1008437715371&jrtk=3-1-1gp82ppoip6eb801-1gooibsmci4lv800-326805f7f7e92861-", "description": "POSITION: Operations Supervisor/Crew Chief\nDEPARTMENT: Operations\nREPORTS TO: Director of Operations/General Manager\nFLSA STATUS: Exempt\nSummary\nASM, the leader in privately managed public assembly facilities, has an excellent and immediate opening for an Operations Supervisor for Abilene Convention Center. The Operations Supervisor is responsible for the daily activities required to run, maintain, and service the facility and the events by performing the following duties personally or through subordinate technicians prepares and maintains facility for all events throughout the complex as needed, including the Auditorium, Convention Center, and Meeting Room activity. This includes overseeing execution of all event set ups, housekeeping preparation and facilitation, and equipment maintenance and upkeep. Supervisor must be capable to supervise and coordinate activities of workers engaged in the Housekeeping & Changeover / Set Up departments. Position also supervises and assists in scheduling various aspects of operations, interfacing with City of Abilene maintenance, ACC technical services, including ADA compliance, public safety and security.\nEssential Duties and Responsibilities\nInclude the following. Other duties may be assigned.\nOversee daily housekeeping/custodial, Set up, changeover, tear down employees and tasks assigned to completion\nAssist in scheduling staff as needed for event work and general facility operation.\nManages and maintains ACC equipment including set up, housekeeping, and facility maintenance equipment.\nOperate and control some equipment via computers.\nCoordinate facility operations alongside the Audio/Visual team, third party vendors and subcontractors within the facility.\nWork extended and/or irregular hours including nights, weekends and holidays, as needed\nSupervisory Responsibilities\nEmployee will carry out supervisory responsibilities in accordance with ASM Global policies and applicable laws. Responsibilities may include assisting in hiring and interviewing new hires; responsibilities will include training employees; planning, assigning and directing work; appraising performance; rewarding; disciplining employees in conjunction with Human Resources; addressing complaints and resolving problems. Scheduling of employees and payroll data input.\nQualifications\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required.\nEducation and/or Experience\nA high school diploma or GED.\nAt least one year of facilities operations experience preferred.\nMaintain the proper operations of housekeeping equipment and change over equipment.\nCompletion of facilities management courses or sports management courses is considered a strong plus; or an equivalent combination of education and experience.\nCurrent driver’s license is required.\nSkills and Abilities\nRead and interpret documents, procedure manuals, floor plans, assignment sheets, safety rules, operating and maintenance instructions for all areas of the department\nPossess any licenses, certificates or training required by company, local, state or national authorities for the operation of the equipment found in the facility in all areas of the department\nDemonstrate knowledge in the practice and procedures related to all areas of custodial, event set up, tear down & change overs\nPossess a thorough understanding of the operational procedures, facility capabilities, industry terminology, event-related services, and technical requirements for all the types of events anticipated at the facility\nWork independently, exercising judgment and initiative.\nOrganize and prioritize to meet deadlines\nWork effectively under pressure and/or stringent schedule and produce accurate results\nFollow oral and written instructions and communicate effectively with others in both oral and written form\nMaintain an effective working relationship with clients, employees, exhibitors, patrons, tenants and others encountered in the course of employment\nRemain flexible and adjust to situations as they occur\nKnowledge of computers & programs\nPhysical Demands\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the employee is regularly required to move around the facility; to stand for long hours during events; talk and hear. This position may require work inside or outside of the building, as needed by events.\nThis position requires good vision, hearing and dexterity. Long periods of standing, walking, lifting, stooping, kneeling, crawling and crouching on concrete, ice surfaces, staircases, etc., including slippery and uneven surfaces. Lifting and moving up to 50 lbs. + over a period of time. This position requires work in both indoor and outdoor settings and may be subject to adverse conditions.\nNote\nThe essential responsibilities of this position are described under the headings above. They may be subject to change at any time due to reasonable accommodation or other reasons. Also, this document in no way states or implies that these are the only duties to be performed by the employee occupying this position.\nASM is an Equal Opportunity/Affirmative Action employer, and encourages Women, Minorities, Individuals with Disabilities, and protected Veterans to apply. VEVRAA Federal Contractor.Show more Report"}, {"company": "Cesvi Fondazione Onlus", "job": "Technical Coordinator Senior - Palestine", "city": "Jerusalem", "date": "6d", "rating": "3.6", "link": "", "description": "WORK CONTEXT\n\nCESVI has been working in Palestine since 1994 and it has developed over the years an expertise in the area of solid waste management, water and sanitation. CESVI implemented various projects in partnership with relevant actors in the sector and active participation in the WASH cluster and other coordination networks.\nCESVI is currently implementing projects in the in Hebron and Gaza governorates, in consortium with local and international partners. The ongoing projects are funded by SDC and AICS\n\nThe main activities included in the SDC and AICS projects are:\n\nData collection and laboratory testing: data collection on current WASH practices; development of a simplified methodology for the evaluation and adaption of filters to the local context; test of the filters in laboratories;\nRehabilitation of washing facilitates in schools\nRehabilitation of water networks\nMonitoring and Implementation based on behaviour change strategy / RANAS approach\nData analysis: elaboration of data and training materials;\nDevelopment of a strategy to encourage and maximize sharing of data, methods and insights among the partners and a wider audience\nDissemination of research findings and incorporation of recommendations in design of interventions.\n\nPosition:\nJOB DESCRIPTION\n\nThe collaboration will start in mid-May/June 2023\n\nThe main duty station will be in Jerusalem with frequent travels in the West Bank and Gaza Strip.\n\nKEY RESPONSIBILITIES\n\nThe Technical Coordinator Senior will work in coordination with the Head of Mission and s/he has to coordinate with the Country Administrator\n\nMain tasks and responsibilities:\nS/He will ensure constant supervision of project and program managers, to monitor rate of spending in each project and coordinating project managers in direct implementation, ensuring full procedural compliance in coordination with the Head of Mission and Country Administrator\nS/he will review of any variations / amendments for the extension or revision of the projects\nS/he will Active participate in the new donors acquisition: identification of new projects within CESVI’s sector, coordinate the entire process of drafting of proposals in collaboration with all the team (PMs, CA, HoM)\nS/he will supervise MEAL officer for harmonization of data collection tools, database management and reporting\nS/he will ensure the compliance of technical requirements wash /waste) in the projects (check and write BOQ, liaise with providers, municipalities and technical stakeholders/partners\nS/He will actively participate to the Wash and waste Working Group.\nS/He will write new project proposals in coordination with HQ and the field.\nS/He will liaise with relevant stakeholders.\nRequirements:\nESSENTIAL REQUIREMENTS\nUniversity or Master degree in engineering, or related field in wash sector expertise\nMinimum 5 years’ program management experience, grant management in a NGO, including experience directing and implementing programs in both protracted crisis and development contexts\nSpecific studies or training on data collection and visualization\nSolid experience in needs assessments, project proposal and reporting\nExperience in managing wash projects\nKnowledge of financial rules and regulations of International donors as EU, AICS (Italian Cooperation Agency), etc.\nKnowledge of effective financial and budgetary planning and control\nSolid diplomatic and leadership skills in managing a variety of internal and external relationships, especially with partners\nCapacity to acting effectively as a team member\nSelf-motivated, flexible, resilient, able to take initiative and work independently\nExcellent problem-solving and analytical skills\nHigh level of IT skills (Windows, Office package)\nExcellent knowledge of English written and spoken.\nDESIRABLE REQUIREMENTS\nPrior working experience in the Middle East and / or in the Occupied Palestinian Territory\nKnowledge of Arabic\nSAFEGUARDING\n\nCesvi has a zero-tolerance approach to any harm to, or exploitation of, a child or a vulnerable adult by any of our staff, related persons or partners.\n\nCesvi’s commitment to being a safe organization begins with the staff recruitment process which includes meticulous checks, such as criminal records checks or check disclosure of previous convictions, to ensure children and vulnerable people are safeguarded and abuse is prevented. Safeguarding checks are part of the selection process performance.\nHEALTH SAFEGUARDING\n\nCesvi pays particular attention to safeguarding the health of all the human resources of the Organisation. Therefore, in order to protect its staff, an assessment of their suitability for the position in each mission is carried out before departure. Such assessment is done by the Occupational Doctor of the Organisation, who will also examine the vaccination coverage, including the anti-Covid19 vaccination.\nPlease note: due to the high number of applications we receive we are unable to provide feedback if unsuccessful at the applicant stage. Only short-listed candidates will be updated on the status of their applications.\nOther information:\nGROSS SALARY RANGE € 3.500 - € 4.000 PER MONTH\n\n﻿€ 400 MONTHLY HOUSE ALLOWANCE IN TUNIS (TUNISIA)\n\nFULL HEALTH INSURANCE COVERAGE\n\nONE ROUND-TRIP FLIGHT EVERY 12 MONTHS OF COLLABORATIONShow more Report"}, {"company": "Placer.ai", "job": "Mobile Team Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY:\n\n\nPlay a central role in building a brand new mobile SDK with the modern mobile toolkit and SW development best practices in mind.\nSolve non-trivial problems of navigation in the physical world while maintaining low battery consumption.\nGet to know the lower levels on Android and iOS with almost no UI work.\nEvolve your skillset by working together with the existing mobile team on Android, iOS, and big data tools.\n\n\nRESPONSIBILITIES:\n\n\nManage a team of talented mobile developers who can do more than just write iOS/Android code.\nCreate a state of the art location collection algorithms with iterative experimentation.\nDevelop and own backend services that scale up to millions of devices using serverless and managed cloud solutions.\nGo beyond location data and create a holistic data sourcing solution for foot traffic analysis.\nCollaborate with Big Data and Data Science teams to design and implement the entire data pipeline.\nHelp to implement quality measurement tools and analyze the performance data.\nImprove your software engineering skills by working with our team on Android, iOS, and Backend.\n\n\nREQUIREMENTS:\n\n\n2+ years of experience managing a team of mobile engineers\n5+ years of hands-on mobile development experience with either Android or iOS.\nSupported at least 500k DAU on a single app/SDK\nA/B Testing experience and working with gradual releases\nExperience working and/or building CI/CD pipelines and understanding of modern SW development cycle.\nIn-depth knowledge of mobile operating systems.\nSee software development as the core of what everyone in the team does, and Android/iOS/Data Analysis/QA as implementation details.\nLead by example and stay hands-on.\nTransparent, aspire for excellence but know how to compromises to meet business needs.\nAbility to operate in a flexible, dynamic, yet fast-paced work environment.\n\n\nOTHER REQUIREMENTS:\n\n\nExperience writing Mobile SDKs/Location-driven features.\nExperience optimizing battery consumption in the background.\nExperience working with AWS/GCP/Firebase other Cloud technologies.\nExperience working with Kubernetes/Spark/Kafka/Other large scale technologies.\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.\n\n#LI-AC1Show more Report"}, {"company": "Placer.ai", "job": "DevOps Team Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY:\n\nAt Placer.ai we process 10TB-15TB of data on a daily basis using various technologies such as Spark, BigQuery, Bigtable, Kafka and use them to solve hard geospatial problems. To serve such a huge scale, our underlying infrastructure has to be scalable and tuned to its finest levels, monitored and visible.\n\nWe are looking for a Team Lead to help build, shape and scale Placer’s DevOps Team. The primary role is to manage and lead our DevOps Team and help develop, implement and deploy complex cloud infrastructure to be used by our engineers.\nYou will partner closely with our architects and engineering managers to make sure we deploy a world class physical world analytics platform.\n\n\nRESPONSIBILITIES:\n\nLead, teach and grow a team of experienced DevOps Engineers\nBuild the team's roadmap, prioritization, and delivery\nWork closely with architects and engineering managers to define infrastructure needs and provide them with relevant tools, services and training\nResearch and integrate new technologies into our stack, from POC to battle proof in production\nManage, monitor, scale, and troubleshoot a distributed highly scalable, highly available, customer-facing software stack.\nBe hands-on and take an active role in developing and maintaining Placer’s infrastructure\n\nREQUIREMENTS:\n\n3+ years of experience as DevOps/SRE/Production Engineer team leader\nExperience with leading, mentoring, and developing a team\nComprehensive knowledge and experience of major public cloud service provider (AWS, GCP, Azure)\nHighly knowledgeable with large scale Kubernetes deployments including monitoring, maintenance and troubleshooting\nDeep understanding of IaC concepts and experience with tools such as Terraform, Cloudformation, Palumi etc.\nExperience with CI/CD methodologies\nExperience with observability tools and best practices (Prometheus, Jaeger, OTEL etc.)\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.\n\n#LI-AC1Show more Report"}, {"company": "Placer.ai", "job": "Senior Product Manager - Mobile Data Collection", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=215&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6259fdf1&cb=1676382371024&jobListingId=1007913129066&jrtk=3-1-1gp82pv4pj4gi801-1gooibsmci4lv800-d462af157b8368eb-", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterward, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras, and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY\n\nPlacer.ai Location Collection team is responsible for building Placer’s next-gen SDK, built to help app publishers collect data optimally, balancing accuracy of location collection with footprint on the app’s performance or on the end user experience. As a product manager, you will take responsibility for managing and developing end-to-end product vision, strategy, and roadmaps of the data collection domain in collaboration with cross-functional partners inside and outside the organization.\n\n\nRESPONSIBILITIES\n\nBe the driving force behind Placer’s Location Collection team.\nSet the vision, strategy, and roadmap for the team, leading its execution end-to-end from inception through launch.\nBuild relationships with our data partners and work with them to learn their goals, pains, and needs and translate them to product requirements.\nLead sprints, planning, and retrospectives and manage agile teams made up of world-class data professionals.\nWrite detailed and precise specs, define and set KPIs for your products to make informed product decisions, uncover insights and promote discussions through a data-driven approach.\nPlay a central role in the Placer.ai product management team and design data-intensive features.\nOversee all aspects of the delivery process to achieve the growth targets of Placer’s product and guarantee smooth and efficient implementation.\nTranslate business goals into objectives and product KPIs and ensure product initiatives have the right direction and focus to succeed in the market\n\n\nREQUIREMENTS:\n\nExperience working on Data-Driven / B2B / SaaS products - Must\n2+ years as Senior Product management in a fast-paced tech environment - Must\nStrong Mobile data knowledge (Mobile operating systems, Sensors, Permission)- big advantage\nExperience working with development teams on high complexity systems\nAbility to motivate and inspire development teams to achieve beyond what they imagined possible\nEntrepreneurial and analytical; effective at managing change in a fast-moving and constantly evolving business\nStrong understanding of customer needs and the ability to translate them into a technical solution\nDetail oriented\nEffective written and verbal communication skills in English\nComputer Science, Engineering, or Statistics degree\nNICE TO HAVE:\n\nExperience working with Location Data\nExperience managing an SDK / product for developers\nBA/BSc degree or equivalent practical experience. Master's degree - Advantage\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are an industry-leading start-up.\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent and excellent people.\nCompetitive salary\nExcellent benefits\nHybrid wok model\n\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.Show more Report"}, {"company": "Placer.ai", "job": "Senior Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai's platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai's customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world's top-10 retailers, 2 of the top-10 CPG firms worldwide, a world's top hospitality firm, 2 of the world's top-10 commercial real estate (CRE) firms and 2 of the world's top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\nSummary\n\nWe are looking for a Senior Data Scientist to join our expanding data group. This person will work with our team of data scientists and drive research and development of new location analytics products. The ideal candidate will be an experienced analytics leader, highly motivated and capable of learning our business in detail. He or she will work in a dynamic environment undergoing growth in new areas and will be expected to take ownership of driving research and development for a new line of data products. Passion is a MUST and passion for data even more so!\nIf you are someone who thrives outside their comfort zone, your place is at Placer.ai.\n\nResponsibilities\nUse a creative combination of AI methods, machine learning algorithms, statistics and business intelligence to build new data tools and improve existing one. This will be applied to the entire data science value chain – from exploration of use cases, through automated data quality enforcement to data modeling and serving\nWork closely with dedicated development teams ensuring high quality handshake in productization phases.\nTake an active, thought-leadership role in building new AI/ML pipelines and infrastructure.\nQuickly identify gaps in delivery and provide the right measure for constant monitoring of new products. Own the process and not just the tools\nMentor and lead other data scientists in your field of expertise while collaborating with the broader data community – data scientists, analysts, and data infrastructure teams\nRequirements\nM.Sc./PhD in a relevant field with strong quantitative skills\n5+ years of experience working as a Data Scientist in an innovative environment\nStrong analytics mindset, with good understanding of data and its limitation: sampling, frequency, manipulation and cleaning techniques to name a few\n3+ years of working experience with the python data science toolbox (Pandas, Numpy, SKlearn, etc.)\nTeam player with strong interpersonal and communication skills.\nAnalytic mindset, with the ability to envision new ways to leverage data to improve internal processes and delight our customers\nSelf-learner, always seeking to sharpen their skills and grow their knowledge\nCan do approach - it's all about the attitude\nNice to have:\nWorking experience with large data sets and good acquaintance with the Big Data eco system (Spark, GBQ, Athena, Hive, Pig, etc)\nProven visualization and presentation skills\nWorking Experience in Cloud based environments\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai's applicants are considered solely based on their qualifications, without regard to an applicant's disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai's Human Resources Department to make the need for an accommodation known.Show more Report"}, {"company": "Tenable", "job": "Senior Product Designer, Attack Path Analysis, Tenable One", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=217&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6b11d53b&cb=1676382373937&jobListingId=1008390732444&jrtk=3-1-1gp82q1vbjoro801-1gooibsmci4lv800-d65464bac1bf77c9-", "description": "Who is Tenable?\nTenable® is the Exposure Management company. 40,000 organizations around the globe rely on Tenable to understand and reduce cyber risk. Our global employees support 60 percent of the Fortune 500, 40 percent of the Global 2000, and large government agencies. Come be part of our journey!\nWhat makes Tenable such a great place to work?\nAsk a member of our team and they’ll answer, “Our people!” We work together to build and innovate best-in-class cybersecurity solutions for our customers; all while creating a culture of belonging, respect, and excellence where we can be our best selves. When you’re part of our #OneTenable team, you can expect to partner with some of the most talented and passionate people in the industry, and have the support and resources you need to do work that truly matters. We deliver results that exceed expectations and we win together!\nYour Role:\nIf you’re looking for an opportunity to work as a startup in a cyber giant, your place is with us. We're building Tenable's new Cyber Exposure Platform that will reach tens of thousands of customers and leverage the latest technologies. You will be part of an engineering team responsible for the UI/UX of the Attack Path product.\nYour Opportunity:\nAs a member of our team, you will be in charge of researching, designing, and implementing design features in our exciting application. It’s super challenging work, combining work with PM, leadership, and engineers, to build the best Attack Path application out there.\nThis team is in charge of a newly established product of Tenable that plays a key part in Tenable strategy.\nIt's a unique opportunity to join a small new team that works like a startup with the backing of a large and successful company. This is a great place for passionate individuals who are looking for a chance to make an impact, learn, and grow!\nWhat you’ll need:\n5+ years of UX/UI design, working for B2C SaaS companies, with an emphasis on integrating visual design components into industrial products.\nExperience working across the full product lifecycle, from early generative research – to ship – to in-market UX research.\nWorking knowledge of Agile methodologies\nFluent in Figma\nCreative and technical background\n A link to your portfolio\nAnd ideally:\nGeneral Knowledge of the Cyber Security domain\nA good understanding of HTML and CSS is an advantage\nSelf-motivated and passionate attitude\nTeam player mindset\nIf you’ve reached this point, and you’re still not sure if you should apply…..Just do it! We’re human and we don’t fit a perfect mold. Having diverse backgrounds, experiences and perspectives, that’s a good thing! If you’re coming from outside of the cyber industry - great! If you’re looking to try something new - awesome! All we ask is you bring passion to all that you do, crave creativity and innovation, and embrace the hard work of gaining new skills and accepting big challenges.\nWe’re committed to promoting Equal Employment Opportunity (EEO) at Tenable - through all equal employment opportunity laws and regulations at the international, federal, state and local levels.Show more Report"}, {"company": "Marriott International, Inc", "job": "Engineering Ass. Manager", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c98fbf4d&cb=1676382376444&jobListingId=1008411040517&jrtk=3-1-1gp82q4d9kbnn801-1gooibsmci4lv800-49619e9084f04e92-", "description": "Job Number 23010130\nJob Category Engineering & Facilities\nLocation The Jaffa a Luxury Collection Hotel Tel Aviv, 2 Louis Pasteur Street, Tel Aviv-Jaffa, 0, Israel VIEW ON MAP\nSchedule Full-Time\nLocated Remotely? N\nRelocation? N\nPosition Type Management\nJOB SUMMARY\nAssists department head in managing budget, capital expenditures, preventative maintenance and energy conservation. Accountable for maintaining the building and grounds with particular attention towards safety, security and asset protection. Assigns, tracks and follows up on status of work assigned to staff and contractors. Helps to increase guest and employee satisfaction through effective communications and training.\nCANDIDATE PROFILE\nEducation and Experience\nHigh school diploma or GED; 4 years experience in the engineering and maintenance or related professional area; technical training in HVAC-R/electrical/plumbing.\nOR\n2-year degree from an accredited university in Building and Construction, Engineering, Mechanics, or related major; 2 years experience in the engineering and maintenance or related professional area; technical training in HVAC-R/electrical/plumbing.\nCORE WORK ACTIVIITES\nSupporting management of Property Operations\nSupervises distribution of repair work orders.\nEnsures property policies are administered fairly and consistently.\nAssists in effectively planning, scheduling and evaluating preventative maintenance programs.\nEstablishes and maintains open, collaborative relationships with employees.\nMonitors timeliness and quality of completion of repair work orders.\nSupervises Engineering and related areas in absence of the Director of Engineering.\nAssists in managing the physical plant including equipment, refrigeration, HVAC, plumbing, water treatment, electrical and life safety systems.\nEnsures that regular on-going communication occurs with employees in order to create awareness of business objectives, communicate expectations and recognize performance.\nRecommends or arranges for additional services such as painting, repair work, renovations, and the replacement of furnishings and equipment.\nSelects and order or purchase new equipment, supplies, and furnishings.\nSupervises the day to day operations of Engineering and related departments.\nMaintaining Property Standards\nInspect and evaluate the physical condition of facilities in order to determine the type of work required.\nMaintains accurate logs and records as required.\nOperates generators and fire pumps as necessary.\nProvides emergency response services 24/7.\nRepairs equipment (e.g., refrigeration, laundry) as necessary.\nEnsures all employees have the proper supplies, equipment and uniforms.\nEnsuring Exceptional Customer Service\nEmpowers employees to provide excellent customer service.\nEmphasizes guest satisfaction during all departmental meetings and focuses on continuous improvement.\nSets a positive example for guest relations.\nConducting Human Resources Activities\nHelps train employees in safety procedures.\nSupports a departmental orientation program for employees to receive the appropriate new hire training to successfully perform their job.\nCommunicates performance expectations in accordance with job descriptions for each position.\nEnsures disciplinary procedures and documentation are completed according to Standard and Local Operating Procedures (SOPs and LSOPs) and support the Peer Review Process.\nAssists as needed in the interviewing and hiring of employee team members with the appropriate skills.\nParticipates in the employee performance appraisal process, providing feedback as needed.\nUses all available on the job training tools for employees.\nSolicits employee feedback.\nSupervises staffing levels to ensure that guest service, operational needs and financial objectives are met.\n\nMarriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law.\n\nThe Luxury Collection is a glittering ensemble of locally authentic hotels and resorts from around the world. Our hotel teams curate the world’s most enriching and desirable destination experiences. Our mission is to guide our guests, these seasoned travelers on transformative journeys that touch their spirits, enrich their lives and create lasting memories. If you are someone with an appreciation for evocative storytelling and a desire to provide genuine, personalized, and anticipatory service, then we invite you to join us on our journey and explore a career with The Luxury Collection.Show more Report"}, {"company": "AppsFlyer", "job": "Regional Marketing Manager- Temporary", "city": "Herzliya", "date": "21d", "rating": "4.5", "link": "", "description": "Are you a passionate B2B marketer with experience in hyper-growth SaaS and mobile businesses? If you are, read on!\n\nOur mission at AppsFlyer is to give digital marketers the very best tools and insights to help them be as successful as they can be. With a highly talented, global team of over 1,500 people, and growing, we're only just getting started.\n\nWe're looking for a hungry, passionate, tech-savvy B2B marketer to join our vibrant, friendly office in Herzliya and lead our field marketing programs and customer lifecycle activities in SANI region (South Europe, Africa, Nordics, Israel). You'll be taking a market-leading, mission critical SaaS offering out to digital marketers and brands in the region.\n\nIn your B2B toolkit, you'll be highly analytical, independent, a competent storyteller, a first class project manager and have a flair for putting together exceptional events and experiences.\n\nWorking closely with your local colleagues in Sales, Customer Success and Partnership Development, as well as a large, cross-functional team of marketing experts in our Global HQ. You'll be responsible for planning, coordinating, executing and reporting all revenue-focused marketing programs for each individual market to deliver new customer leads, existing customer engagement and partnership development goals.\n\nThe role reports to the Managing Director of EMEA-SANI, and to the Head of Marketing for those respective markets\n\nThis position is temporary for one year\n\nWhat you'll do:\n\nEvents - You're passionate and hands-on about events and will work with Sales, Customer Success, Partnership Development and third party partners, such as trade associations and conference organizers, to create a pipeline of events across all markets that help raise AppsFlyer's brand awareness, position the business as the domain authority for mobile measurement and drive new demand and upsell opportunities.\n\nContent, thought leadership & PR - You enjoy creative copywriting and are responsible for positioning AppsFlyer as the market leader in your local markets. You'll be working closely with the Global Content & Mobile Insights + Comms teams, as well as local PR partners, you'll create thought leadership campaigns to promote AppsFlyer's portfolio or cross-device measurement and fraud protection services. These could be anything from blogs and white papers, to major PR campaigns or event content\n\nData - You're all about the numbers. As the lead for the individual country growth squads, you'll be responsible for managing ongoing growth initiatives, reporting the results of our time and financial investments and optimizing our activities on an ongoing basis. You'll have the support of our Global Marketing Operations team to do so, as well as numerous BI tools\n\nTeam player - You're a go getter and problem solver with a great team spirit. You're happy being part of a close knit team that works hard and plays hard and you're not afraid to roll your sleeves up and do what's right for the team\n\nWhat you have:\n\n3-5 years of experience in B2B marketing roles ideally within the technology, SaaS or mobile software sectors\nProven track record of planning and executing on field marketing campaigns, generating pipeline and strengthening customer relationships.\nExceptional project management skills, writing, communication, and presentation in English.\nPassionate about technology and the latest trends and best practice in B2B marketing\n\nBonus Points:\n\nA degree in Marketing or related subject area\nExperience in CRM and events systems (Salesforce, Splash & Marketo as advantage).\nCompetitive analysis and account mapping experience - an advantage\nAbility to speak an additional relevant language other than English is highly desirable, but not a must have\nKnowledge of the E-commerce, gaming or finance mobile marketing world an advantage\n\nAs a global company operating from 20 offices worldwide, we reflect the human mosaic of the diverse and multicultural world in which we live. We ensure equal opportunities for all of our employees and promote the recruitment of diverse talents to our global teams without consideration of race, gender, culture, or sexual orientation. We value and encourage curiosity, diversity, and innovation from all our employees, customers, and partners.\n\n\"As a Customer Obsessed company, we must first be Employee Obsessed. We need to make sure that we provide the team with the tools and resources they need to go All-In.\" Oren Kaniel, CEOShow more Report"}, {"company": "AppsFlyer", "job": "Software Team Lead - Platform", "city": "Haifa", "date": "30d+", "rating": "4.5", "link": "", "description": ""}, {"company": "Boston Scientific Corporation", "job": "Principal Regulatory Affairs Specialist", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e684f64f&cb=1676382383643&jobListingId=1007959075834&jrtk=3-1-1gp82qbeukcm2801-1gooibsmci4lv800-fc8e5c52ca76b03a-", "description": "Principal Regulatory Affairs Specialist\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Hybrid\nOnsite Location(s):\nYokneam, IL\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nWe as Boston Scientific are expanding our Regulatory Affairs team in Israel ( Yokneam) due to our growth and the acquisition of Lumenis Israel- Medical Lasers.\nThat's why we are recruiting for a Principal Regulatory Affairs Specialist\n\nAbout this role as Principal Regulatory Affairs Specialist- Israel:\nResponsible for Regulatory Affairs support of submissions and on going regulatory compliance for product development process.\n\nYour key responsibilities will be:\nReviews and signs-off on product design control documentation for compliance with applicable regulations.\nProvides technical/regulatory guidance to cross-functional teams.\nActs as company representative, developing and maintaining positive relationships with device reviewers through oral and written communications regarding pre-submission strategy/regulatory pathway development, testing requirements, clarification and follow-up of submissions under review.\nDevelops and implements regulatory strategies for modified products.\nActs as a core member on manufacturing and remediation teams, providing regulatory feedback and guidance throughout the program, and coordinating team inputs for submissions.\nResponsible for preparation and submission of global regulatory applications, as well as internal regulatory file documentation.\nReviews and signs-off on product and manufacturing changes for compliance with applicable regulations.\nEstablish and support a work environment of continuous improvement that supports BSC’s Quality Policy, Quality System and the appropriate regulations for the area they support. Ensure employees are trained to do their work and their training is documented.\n\nWho are we looking for:\nBachelor’s degree or equivalent work experience, preferably in a scientific or technical discipline\n8+ years Regulatory Affairs experience, medical device experience required\nWorking knowledge of design control documentation/requirements required\nWorking knowledge of FDA and international regulations\nGeneral understanding of product development process\nWorking knowledge of regulatory requirements for implantable, capital equipment and single use disposable devices\nAbility to manage several projects\nProficiency with Microsoft Office\nEffective research and analytical skills\nEffective written and oral communication, technical writing and editing skills\nAbility to work independently with minimal supervision\nLanguage skills: English and Hebrew\n\nQuality System Requirements:\nIn all actions, demonstrates a primary commitment to patient safety and product quality by maintaining compliance to the Quality Policy and all other documented quality processes and procedures.\nAssures that appropriate resources (personnel, tools, etc.) are maintained in order to assure Quality System compliance and adherence to the BSC Quality Policy.\nEstablishes and promotes a work environment that supports the Quality Policy and Quality System.\nRequisition ID: 532619\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\n\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code § 2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.\n\nPlease be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.\n\nJob Segment: Regulatory Affairs, Compliance, Technical Writer, Law, Medical Device, Legal, Technology, HealthcareShow more Report"}, {"company": "ALSTOM", "job": "Telecom Engineering Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=222&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c5fffe6a&cb=1676382385730&jobListingId=1007804604703&jrtk=3-1-1gp82qdfgjfko801-1gooibsmci4lv800-e68909470281e449-", "description": "Req ID:287568\nLeading societies to a low carbon future, Alstom develops and markets mobility solutions that provide the sustainable foundations for the future of transportation. Our product portfolio ranges from high-speed trains, metros, monorail, and trams to integrated systems, customised services, infrastructure, signalling and digital mobility solutions. Joining us means joining a caring, responsible, and innovative company where more than 70,000 people lead the way to greener and smarter mobility, worldwide\n\nManagement of the Project Telecoms activities in setting of budgets, personal objectives, training, development and succession planning.\nManage and lead the Telecoms Design, Installation, Testing and Commissioning activities in the delivery of major and minor project works predominantly acting as Telecoms Design and Construction, taking responsibility for coordinated delivery of all aspects of the design, installation, testing and commissioning solutions.\nMonitor resourcing levels against all projects\nProvide an effective mechanism for team management with clear communication lines, creating a sense of urgency to safely meet project deliverables, timescales and budget expectations.\nManage telecoms engineering delivery performance ensuring consistency of design output and compliance with defined company standards, power design principles, industry standards and clients project requirements.\nLiaise with Planner and other discipline leads to develop and maintain accurate delivery schedules and resource forecasts.\nMonitor, action and accountable for discrepancies where deviations to programme and forecast occur.\nManage Authority to Work and Mentorship requirements within the Telecoms activities\nMotivate and develop staff, empowering team members to achieve their plans and growth targets and ensure the long-term sustainability of the team\nRole model and promote health, safety and environment\nEnsure procedures and work practices are documented and managed\nLead the tendering telecoms elements\nTo comply with, undertake and promote all relevant Environment, Health & Safety measures, responsibilities and activities.\nCompletion of Performance Management Cycle for Telecoms department\nTelecoms performance against project plans, to budget and acceptable quality\nAssist with investigation reports\nSubcontractor QCD performance monitoring\nProvide Client and sub-contractor feedback\nWork package progress reports\nEnsure Timely delivery of work packages\nProvide safety statistics reportable incidents\nUndertake risk assessments carried out\nEnsure that telecoms department productivity targets met (budgeted hours and earned value)\nReduce rework volumes for design, installation and testing\nImprove consistency of design production\nImprove audit performance\nEnsure resource demands are met\nManagement of staff issues\nColabrate and contribute technical matters with regional and central engineering team.\nAuthorities to Work in place\nMentorship Plans in place\nTraining and development plans with succession plans in place\nMonitor IRSE licences of staff\nMinimum 10 year of experience\nGraduated from electronic and/or communication engineering.\n\nAlstom is the leading company in the mobility sector, solving the most interesting challenges for tomorrow’s mobility. That’s why we value inquisitive and innovative people who are passionate about working together to reinvent mobility, making it smarter and more sustainable. Day after day, we are building an agile, inclusive and responsible culture, where a diverse group of people are offered opportunities to learn, grow and advance in their careers, with options across functions and geographic locations. Are you ready to join a truly international community of great people on a challenging journey with a tangible impact and purpose?\n\nEqual opportunity statement:\nAlstom is an equal opportunity employer committed to creating an inclusive working environment where all our employees are encouraged to reach their full potential, and individual differences are valued and respected. All qualified applicants are considered for employment without regard to race, colour, religion, gender, sexual orientation, gender identity, age, national origin, disability status, or any other characteristic protected by local law.\n\nJob Type:Experienced\n\nJob Segment: Manager, Telecom, Telecommunications, Performance Management, Management, Technology, Human ResourcesShow more Report"}, {"company": "HiredScore", "job": "DevOps Team Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "HiredScore brings deeply integrated big data and AI solutions to the global Fortune 500. By leveraging data from companies' Human Resources Data ecosystem, HiredScore enables to automate and augment the hiring process, enriching recruiters' decisions with smart insights and candidate prioritization grades using NLP and Machine Learning algorithms.\nHiredScore's Artificial Intelligence Engine uses past company hiring data, global hiring data, and other data sources, including labor market data, employee performance data, and CRM data, to revolutionize the end-to-end recruiting workflow as well as integrate seamlessly with other HR Systems such as chatbots, assessment tests, video interviews, and other automation tools. HiredScore's mission is to bring data science into the Human Resources domain.\nWe are looking for a motivated and experienced individual who is passionate about building infrastructure and DevOps to empower the company to scale effectively. As DevOps Team Lead, you will be responsible for the operations and infrastructure that tap into Fortune500 companies systems, and for the tools that make our R&D department productive and efficient.\nYou will work in a high-velocity startup with a fun environment where products and ecosystems are still being defined and developed. giving you the chance to influence some of the core tools used and be a part of every stage of development from concept to deployment. You will need to be a self-starter, ready to dig in and own projects, collaborate cross-functionally and deliver quality results\nRoles & Responsibilities:\n\nLead a team of professional and ambitious DevOps engineers\nHire, train, and mentor new team members as the team grows\nLead the design and implement solutions to improve new and existing infrastructure\nBuild solutions that allow our R&D teams to work productively at scale\nDesign and implement robust CI/CD pipelines\nLearn and apply industry best practices and share this knowledge within the team and with other teams.\nSolve diverse production-grade complex problems.\nContinuously learn and evaluate new technologies to stay ahead of the curve and perfect our services\nSolve performance bottlenecks and continuously improve the security and resilience of our platform\nMaintain HiredScore availability by participating in DevOps on-call shifts\nControl and improve HiredScore’s cloud consumption costs\nWhat You Need:\n\nAt least 5 years of experience in a AWS focused startup company as an engineer or manager.\nMore than 2 years of experience as a manager\nPeople skills- Be a team player with a strong sense of ownership able to communicate and collaborate with developers and stakeholders.\nPassion for building powerful products for engineers. enabling them to build, deploy and operate systems at scale.\nStrong coding skills in at least one general-purpose language (Python, etc.) as well as Bash.\nMandatory: Experience in AWS cloud.\nExperience in designing and building GitOps CI/CD (Jenkins, CircleCI, ArgoCD).\nProven hands-on experience with containerized environments and microservices; Kubernetes - A must\nExperience with configuration management (Chef, Puppet, Ansible, etc.).\nExperience with infrastructure as a code (Terraform, Pulumi, Crossplane, etc.).\nProficient at Linux system administration (CentOS / Ubuntu).\nHands-on experience with logging & monitoring solutions (Prometheus/Grafana/Thanos/ELK).Show more Report"}, {"company": "WalkMe", "job": "Senior Tech Lead- DeepUI", "city": "Tel Aviv-Yafo", "date": "15d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=224&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_139f2df5&cb=1676382389919&jobListingId=1008424331258&jrtk=3-1-1gp82qhj4jorf801-1gooibsmci4lv800-eea23130a812f774-", "description": "We are developing WalkMe’s revolutionary runtime engine and transforming the online experience for hundreds of millions of users. Our proprietary AI-based technology is bringing the world’s leading digital adoption platform to the next level by understanding and interacting in real time with graphical user interfaces at a human level.We are looking for people who are passionate about leading technology to the extreme.If you are striving to develop an innovative product, make an impact, and work with the industry’s brightest talent as part of one of the fastest-growing and successful startups around – WalkMe is where you want to be!\nWhat will you actually be doing?\nResponsible for defining aspects of Walkme core engine architecture and design.\nDirectly engage with the product management for requirement analysis and clarifications and play a key role in assisting engineering/product management to define product and engineering road-map items.\nDetermine performance requirements by evaluating business strategies and end user requirements; researching information performance standards; conducting system performance analyses; studying architecture/platform; identifying performance issues;\nEnd to end design and implementation of platform performance\nDesign servers infrastructures.\nProvides leadership to technical resources to meet project deadlines and ensure project objectives are met in an efficient way.\nEnsures that code artifacts produced are of the highest quality, conforming to set or agreed upon standards. Should advocate such consistency to all members of the team.\nProvides realistic and accurate estimates and continuously improves team productivity to achieve on-time Delivery.\nFollows the software engineering processes, agile practices and motivates his/her team members to do so.\nEscalates and communicates issues, risks and concerns to the management on time.\nAccepts project delivery responsibilities and demonstrates accountability to leadership.\nBuilds competencies in product and technology domain to set expectations.\nMaintains a sense of individuality in thinking and decision making.\nIs a professional in work aspects as well as conduct with other individuals.\nProvides feedback regarding product quality, performance, other nonfunctional requirements and lead corrective measures.\nSupports the engineering management in the recruitment process.\n\n\nWhat should you bring to the table?\nSenior Tech lead who is passionate about web and product development.\nEager to solve complex problems.\nBachelor’s degree in CS/EE from a leading university.\nAt least 5 years of experience with Web technologies, both front and back-end.\nProficient in Typescript, Node.js, Nest, React ,Vanilla JS.\nExperience in JavaScript architecture.\nExperience with CI\\CD methodology.\nExcellent English - written and verbal.Show more Report"}, {"company": "Edwards Lifesciences", "job": "Senior R&D Engineer - Temporary position", "city": "Israel", "date": "15d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=225&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c17f59ec&cb=1676382391127&jobListingId=1008424550789&jrtk=3-1-1gp82qio8p6df801-1gooibsmci4lv800-590d3029aa97851a-", "description": "Lead the design of novel mechanisms according to design requirements – Technical lead\nResearch materials, technologies, and suppliers\nEarly-stage R&D\nManage matrix resources & suppliers\nIntegrate technical & clinical aspects of the device & procedure\nDesign & build testing systems – Hands-on\nParticipate in animal studies\nPerform & document tests & analysis\nEx-vivo\nIn-vivo\nStatistics\nComputational\n\nRequired Education/Skills:\nB.Sc. in Mechanical engineering\nHigh self-learning ability\nEnglish – Full proficiency (Clinical & Technical publications reading)\nInnovative / Creative\nIndependent & responsible person\nStrong execution, communication & interpersonal skills\nHigh commitment & willingness to work extra hours\n\nRequired Experience:\n7 years' experience as mechanical engineer\nMultidisciplinary experience\n3 years in the medical device field\nExperience with Nitinol based mechanisms\nExperienced with catheter technologies\nExperience in leading off-shore suppliers – high level of technical English\nFamiliarity with Cardiovascular anatomy – An advantage\nExperience in Animal/Human studies – An advantage\nExperience with Implantable sensors – An advantage\n\n\nFull-time job in Caesarea – until the end of 2023\n\n** Flexibility to work one day from home\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeShow more Report"}, {"company": "Placer.ai", "job": "Senior Product Manager- Growth Team", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=226&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2df95220&cb=1676382392626&jobListingId=1008179805159&jrtk=3-1-1gp82qk74p2kl801-1gooibsmci4lv800-93058043be5b5c8a-", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1900 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\n\nSUMMARY:\n\nPlacer is looking for an outstanding Product Manager to join its Growth team, and help Placer get its revolutionary products into new audiences. Placer’s Growth team is working closely with both Product and Marketing teams, looking for innovative ways to broaden the product’s reach, and accelerate the lead generation process. As a Growth Product Manager you will work on analytically optimizing our existing user acquisition channels, while creatively looking for new ones\n\n\nRESPONSIBILITIES:\n\nOwn the company’s lead-gen products and their roadmap\nConduct rapid experimentation for improving conversions and funnels\nWork with Placer business leaders and Marketing, interview customers and prospects, develop a clear understanding of customers use cases and personas\nWork with Product Analysts, Data Scientists and Engineering in building MVPs, validating the technical feasibility and the market need.\nProduce PRDs and mockups for new growth oriented experiences\nEffectively manage trade-offs between cost/schedule versus business benefit\nBuild and maintain a product backlog of projects with top of the funnel impact\nPitch new product ideas to management, be able to build a product thesis and defend it. Evangelize and promote new products internally to the rest of the product and engineering organization after the MVP has been validated\n\n\nREQUIREMENTS:\n\n4+ years of experience as a product manager in an analytical, data-driven environment\n2+ years experience in AB testing and funnel optimizations\nThrives in a startup environment and 0 to 1 initiatives\nExcellent communication skills\nHighly analytical background and proven attention to detail.\nInnovative, entrepreneurial, ability to multitask.\nStrong understanding of customer needs and the ability to translate them into a technical solution\nEffective written and verbal communication skills in English.\n\n\nADVANTAGES:\n\nExperience in growth driving partnerships\nExperience in marketing automation\nExperience in driving conversions in a freemium product\nExperience in SEO\nExperience working on Data-Driven B2B SaaS products\nComputer Science or equivalent technical background\n\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\nHybrid work model\n\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.Show more Report"}, {"company": "Eleos Health", "job": "Senior Product Manager", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "5.0", "link": "", "description": "Who is Eleos Health?\nToday, more people than ever are speaking publicly about their mental health. Whether it's ourselves, our friends and family or even public figures, taking care of your behavioral health is no longer a taboo, it's vital, and it's only human. Eleos is on a mission to help deliver the world's most effective behavioral care through data, measurement, and personalization. Or simply put, We want to give clinicians the support they need to do the important work only they can do.\n\nWhat is this opportunity?\nAs a Product Manager at Eleos Health, you will work cross-functionally to take products from conception to launch. You will connect the technical, clinical, and business worlds in order to break down complex problems and drive impact to the company’s strategic initiatives. You’ll be a primary domain owner, reporting to the Director of Product.\n\nWho are you?\nYou are creative, nimble, and scrappy with experience in earlier-stage companies, undaunted by the ambiguity and opportunity that comes with breaking new ground. You are excellent at managing your time and resources with a sharp eye for detail.\n\nHow will you contribute?\nEnd-to-end research, development, rollout, and optimization of new products in an extremely uncertain environment that involves market education.\nLead product strategy within a product domain, balancing between 0 to 1 and scaling existing value proposition.\nCreating and managing product roadmaps and feature backlogs, balancing varying customer needs and partner requests.\nWork collaboratively with engineering, data science, customer success, and sales to develop solutions that drive maximal impact on the company’s goals.\nAnalyse complex data and analytics to identify new opportunities for growth.\n\nWhat qualifications and skills will help you to be successful?\n4+ years of product management experience. Previous experience in B2B and working with data science is an advantage.\nStrong product sense.\nHigh-level execution skills are a must.\nDemonstrated success in defining and launching products.\nDeep understanding and experience with analytics platforms like Mixpanel.\nExcellent verbal and written communication skills.\n\nThis is a unique opportunity to join a startup that is having a meaningful impact on the well-being and mental health of thousands.\n\nWe have:\nA product that positively impacts peoples' lives every single day.\nA team of amazing people with a shared vision and the infinite drive to make it happen\nWe offer significant equity.\nOpportunity to build, grow and become highly instrumental in shaping how technology can increase the effectiveness of therapy.\nHybrid work opportunities.\nMental health days off you can take any given moment simply because you need them.Show more Report"}, {"company": "RYB Technologies", "job": "Sr. Product Manager 842074", "city": "Israel", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=228&ao=1136043&s=58&guid=000001863125f279a4733604b2cb33d4&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_57abcf06&cb=1676382395762&jobListingId=1007565521709&jrtk=3-1-1gp82qn8kjfll801-1gooibsmci4lv800-68b59773f0d4fc3f-", "description": "We are looking for a Sr. Product Manager to build their own team of product managers and UX designers. Experience with SaaS products in Fintech or Human Resources (HR) sectors is a plus, but not required.\nThis Product Manager will report directly to the General Manager, as an integral member of the management team that will deliver a new product.\n\nThis position is a remote position and can be located anywhere, globally.\n\nResponsibilities:\nOwn delivery and definition of our new FIntech SaaS application for HR departments\nRepresent product in all matters communicating with sales and marketing teams.\nWork with engineering management to build development teams.\n\nQualifications / Requirements:\n10+ years of Product Management or Product Marketing Management experience in a SaaS product sold directly to businesses.\nExperience in a Product Management role with geographically distributed teams\nHighly effective written and presentation skills\nEntrepreneurial experience is a plus.\n\nSend cv to jobs@rybtech.comShow more Report"}, {"company": "Placer.ai", "job": "Fullstack Tech Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai's platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai's customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world's top-10 retailers, 2 of the top-10 CPG firms worldwide, a world's top hospitality firm, 2 of the world's top-10 commercial real estate (CRE) firms and 2 of the world's top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\nSUMMARY:\n\nBuild end-to-end features in our main data-driven product.\nDesign, develop and implement complicated web applications based on heavy data processing and data analytics, GIS, rich UI modules, and complicated algorithms.\nInvolve and lead functional and infrastructure modules architecture and design\nWork closely with our business product teams and architects\nTechnically mentor, and technically lead frontend and full stack developers\n\n\nRESPONSIBILITIES:\n\nTechnically lead and mentor a team of talented Fullstack and Frontend developers\nDesign and create state of the art web application and UI and data oriented modules and infrastructure\nDevelop and own micro-services, features and components\nCollaborate with other teams (architects, data, backend, analytics, data scientists, …)\nDefine implement and improve monitoring KPIs, performance, stability and overall quality of infrastructure and functional modules\nREQUIREMENTS:\n\nAt least 4 years experience as a Fullstack Developer\nAt least 2 years of experience as technical leader / software architect\nAt least 2 years working knowledge of React 16.8+\nDeep understanding in at least one: Node.js / Python\nDeep understanding of at least one of Redux, MobX, NgRx, Akita, GraphQL\nDeep understanding in unitest in React (Jest - advantage), Node.js\nUnderstanding of WebPack\nCS degree or relevant experience\n\nOTHER REQUIREMENTS:\n\n2+ years experience with Pandas, Celery, RabbitMQ, MongoDB - advantage\nExperience with microservice architecture\nExperience with Docker & Kubernetes advantage\nExperience with Cloud (experience with Google Cloud Platform - advantage)\nExperience with large scale data pipelines - advantage\nExperience with CI/CD flow under Jenkins\nExperience with different Mapbox/Google map solutions - advantage\nA leader and a mentor, self-initiating, self-motivating, self-learner\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai's applicants are considered solely based on their qualifications, without regard to an applicant's disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai's Human Resources Department to make the need for an accommodation known.\n\n#LI-AC1Show more Report"}, {"company": "Placer.ai", "job": "Fullstack Team Lead", "city": "Ramat Gan", "date": "30d+", "rating": "4.5", "link": "", "description": "ABOUT PLACER.AI:\n\nPlacer.ai is a fast-growing big data startup led by seasoned executives and repeat entrepreneurs who are building the world's first \"Google Analytics for the physical world.\" Placer.ai’s platform provides instant visibility into any property in the U.S., presenting accurate details about visitation patterns and demographic breakdowns of visitors. Placer.ai’s customers can see where visitors have been before, where they go afterwards, where they typically go for sports, entertainment, groceries, etc., and what their interests are. Placer.ai's A.I.-based SaaS platform replaces archaic solutions such as manual surveys, installed cameras and other people-counting systems, creating a blue ocean market of more than $100B.\n\nPlacer.ai has grown 3x year-over-year for the past 3 years, counting more than 1000 paying customers across a range of industries, including 2 of the world’s top-10 retailers, 2 of the top-10 CPG firms worldwide, a world’s top hospitality firm, 2 of the world’s top-10 commercial real estate (CRE) firms and 2 of the world’s top multinational asset managers and hedge funds. Placer.ai has just raised $100M for Unicorn ($1B+) valuation in Series C funding.\n\nSUMMARY:\n\nBuild end-to-end features in our main product, a data-driven product that provides, in near real-time, insights that relate to physical places and entities.\nDesign, develop and implement complicated web applications based on heavy data processing and data analytics, GIS, reach UI modules, and complicated algorithms.\nWork closely with our business product teams and architects\nRecruit, mentor, and lead a FS R&D team\n\n\nRESPONSIBILITIES:\n\nManage a team of talented Full-stack and Frontend developers\nCreate state of the art web applications based on heavy data processing and data analytics, GIS, reach UI modules, and complicated algorithms.\nDevelop and own micro-services, features and components\nCollaborate with other teams (data, backend, analytics, data scientists, …)\nDefine implement and improve monitoring KPIs, performance, stability and overall quality of infrastructure and functional modules\nREQUIREMENTS:\n\nAt least 2 years experience as a Team Lead (a group of +4 developers)\nAt least 4 years experience as a Full Stack Developer\nAt least 2 years experience working knowledge of React 16.8+\nDeep understanding in at least one: Node.js / Python\nDeep understanding of at least one of Redux, MobX, NgRx, Akita, GraphQL\nCS degree or relevant experience\n\nOTHER REQUIREMENTS:\n\n2+ years experience with Pandas, Celery, RabbitMQ, MongoDB - advantage\nExperience with microservice architecture\nExperience with Docker & Kubernetes advantage\nExperience with Cloud (experience with Google Cloud Platform - advantage)\nExperience with large scale data pipelines - advantage\nExperience with different Mapbox/Google map solutions - advantage\nA leader and a mentor, self-initiating, self-motivating, self-learner\n\nWHY JOIN PLACER.AI?\n\nJoin a rocketship! We are pioneers of a new market that we are creating\nTake a central and critical role at Placer.ai\nWork with, and learn from, top-notch talent\nCompetitive salary\nExcellent benefits\n\nNOTEWORTHY LINKS TO LEARN MORE ABOUT PLACER\n\nPlacer.ai in a nutshell\nPlacer.ai's recent $100M round C funding (unicorn valuation!)\nPlacer.ai's data\nPlacer.ai in the news\nCOVID-19 Economic Recovery Dashboard\n\n\nPlacer.ai is an equal opportunity employer, and we are committed to building a team culture that celebrates diversity and inclusion.\n\nPlacer.ai’s applicants are considered solely based on their qualifications, without regard to an applicant’s disability or need for accommodation. Any Placer.ai applicant who requires reasonable accommodations during the application process should contact Placer.ai’s Human Resources Department to make the need for an accommodation known.Show more Report"}]]