[{"company": "SciPlay", "job": "Office Manager & Employee Experience Partner", "city": "Ramat Gan", "date": "5d", "rating": "3.9", "link": "", "description": ""}, {"company": "Sartorius", "job": "Human Resources Service Partner", "city": "Israel", "date": "22d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8dda8452&cb=1676382175979&jobListingId=1008410299266&jrtk=3-1-1gp82k0lgp6d7801-1gooi7if1g2qs800-f6ef89f12e2a696e-", "description": "The HR Service Administrator will be responsible for providing an efficient and effective support service to all HR customers, predominantly to the HR Business Partner or HR Manager. The holder of this position will oversee the onboarding process and be the first point of contact for employee enquiries. The position holder will also administer defined HR processes and procedures such as Workday processes and document creation, always aiming at high efficiency, quality and customer satisfaction as well as contributing to continuous process and quality improvement.\nThe HR Service Administrator will be responsible for providing an efficient and effective support service to all HR customers, predominantly to the HR Business Partner or HR Manager. The holder of this position will oversee the onboarding process and be the first point of contact for employee enquiries. The position holder will also administer defined HR processes and procedures such as Workday processes and document creation, always aiming at high efficiency, quality and customer satisfaction as well as contributing to continuous process and quality improvement.\nThe HR Service Administrator will be responsible for providing an efficient and effective support service to all HR customers, predominantly to the HR Business Partner or HR Manager. The holder of this position will oversee the onboarding process and be the first point of contact for employee enquiries. The position holder will also administer defined HR processes and procedures such as Workday processes and document creation, always aiming at high efficiency, quality and customer satisfaction as well as contributing to continuous process and quality improvement.\nMain Responsibilities & Tasks:\nProvide first level support (e.g. for self-service tools), payroll, administer compensation and benefits incl. pension, preparing HR reporting materials and dashboards, maintaining accurate HR data in systems\nPerform all routine employee-life cycle workday processes (e.g. hire, job changes, compensation, leave of absence, exits)\nEnsure high quality maintenance of personnel data\nPerform all administration and data maintenance tasks related to organizational changes\nOrganize and manage employee and manager onboarding (and welcome days)\nCreate contracts, documents and certifications, and maintenance of personnel files\nProvide quick and quality answers and solutions to employee inquiries\nCreate standard HR reports and analytics\nContribute to continuous improvement and monitor KPIs to improve and adjust service levels and customer satisfaction\nCreate of knowledge articles and cases for knowledge and case management tool\nQualification & Skills:\nGood level of education in relevant field\nProven working experience in an HR role and in a confidential environment\nAccurate and sound administration experience\nAbility to competently and accurately work with databases, spreadsheets and software packages\nCapable of prioritising workload quickly and conscientiously, without sacrificing attention to detail\nClear and effective written and verbal communication skills\nCustomer focused\nApproachable and able to demonstrate confidence in dealing with employees at all levels of the Company\nEffective problem solving skills\nFluent in English\nWe look for employees who would like to grow with us and move the innovative life sciences sector forward. In the process, we focus on agile project work, mutual support within teams and working as equals. Sartorius thrives as a company with people who give their very best every day and who are eager to develop personally and professionally.\nFurther insights into our world of work can be found on www.sartorius.com/careersShow more Report"}, {"company": "Hilton", "job": "Human Resources Coordinator", "city": "Jerusalem", "date": "20d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_985ff62a&cb=1676382177304&jobListingId=1008414812827&jrtk=3-1-1gp82k1urii0r801-1gooi7if1g2qs800-a0690421651864ac-", "description": "As a Human Resource coordinator, you are responsible for managing HR administration responsibilities to deliver an excellent staff experience. You will also be responsible for operating the recruitment process within the hotel and respond to all applicant requirements. The Human Resources Coordinator coordinates and implements department activities and projects, as assigned and responsible for providing first-class employee relation services to the hotel.\nManage HR administration such as contracts, letters and personnel files\nTaking care of salary aspects from new employees to end of employment, employee hours reports, employee pensions, special cases and more.\nAssist and resolve team member and management queries\nCoordinates projects and activities, as assigned.\nProvides clerical and office support and assistance to department management\nAssist in the organization of Team Member social events\nEnsure all recruitment techniques are used in the hiring of employees\nWork with local organizations and schools to promote the hospitality industry\nRespond to all applicants requirements in a professional, courteous manner in line with brand standards\n\nWhat are we looking for?\nRelevant academic degree\nPrevious experience in Human Resources\nExperience in recruitment\nPositive attitude\nGood communication skills\nCommitted to delivering a high level of customer service\nAbility to work on their own or in teams\nFluent in Hebrew and English\nFull time positionShow more Report"}, {"company": "InspHire", "job": "HRBP", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "We are seeking an experienced and results-driven HR business partner to join a company with the vision to simplify and streamline the work of Managed Service Providers and IT professionals, and to align the company's HR initiatives and functions with business objectives and business needs. Duties for the HR business partner will include aligning staff to business objectives, recruiting the right talent, enhancing staff performance, supporting employee development, enhancing recruitment efforts, planning strategic HR initiatives, managing HR consultants, running orientation and onboarding processes, communicating role expectations, designing succession plans, maintaining staff relations, managing internships, updating policies and practices, and overseeing wellness and health initiatives. Your experience in human resources management will aid the organization in adding value to overall business objectives, providing HR solutions, resolving personnel grievances, retaining a talented workforce, and ensuring compliance with regulations.\n\nThe ideal candidate for this role should have a good understanding of business functions, good communication skills, good interpersonal skills, strategic thinking, and good organizational skills. The noteworthy HR business partner should improve HR initiatives, enhance staff morale, enhance relations between staff and employers, contribute to attaining business goals, promote good HR practices, and attract talented recruits.\nHR Business Partner Responsibilities:\nDeveloping the HR agenda.\nDeveloping HR strategies, policies, and practices.\nImproving and monitoring employee productivity.\nStructuring compensation and benefit packages.\nManaging staff wellness initiatives.\nImproving relations between staff and employers.\nEvaluating staffing needs.\nOverseeing recruitment efforts.\nManaging and allocating HR funds.\nEngaging with heads of department.\nHR Business Partner Requirements:\nDegree in human resources management.\nStrong leadership skills.\nExcellent communication skills.\nAnalytical skills.\nProblem-solving skills.\nProactive nature.\nExcellent interpersonal skills.\nMeticulous attention to details.\nHighly organized.\nGood people skills.Show more Report"}, {"company": "JAC Recruitment UK Ltd", "job": "Japanese speaking Office Administration", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "3.8", "link": "", "description": ""}, {"company": "Elementor", "job": "HRBP", "city": "Ramat Gan", "date": "30d+", "rating": "4.1", "link": "", "description": "We are expanding, growing, and developing! Join the best, and become an authentic influencer as an HRBP at Elementor.\nWe’re looking for a professional who can build an organizational infrastructure, drive a transformation, and scale programs and processes across teams, geographies, and an entire business group.\nAs an HRBP at Elementor, you will drive professional excellence and business strategy into the human resources organization. You will partner with senior business leaders and influence the future of HR at Elementor.\nRequirements:\n\nAt least 5 years of experience as an HRBP with a startup company\n3 years of experience in consulting and coaching managers\nAbility to develop strong relationships and influence a wide range of stakeholders including senior leaders\nExperience with the rapid and complex changing work environment\nA true hands-on approach as well as the ability to successfully monitor the \"pulse\" of the employees to ensure a high level of employee engagement\nStrong analytical skills, and experience using and presenting data to make decisions.\nFlexibility, fantastic communication skills, and huge amounts of drive\nAbility to work independently in a fast-paced environment.\nSelf-motivated & strong interpersonal and communication skills\nHigh level of Hebrew and English\nWork Environment:\n\nWhat do we do?\nElementor is the leading website-building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 11M websites powered by Elementor. More than 7% of all websites worldwide are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe’re all about empowering people, both our employees, and our users.\nElementor is a place where you can truly grow.\nWe encourage professional development and personal growth.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey.\nElementor's constant scaling is an important aspect we take great pride in.\nResponsibilities:\n\nMember of the unit's management and leadership\nMember of the HR management\ncross-organizational responsibility on a specific HR topic\nInitiate strategic business plans and drive execution to ensure the units meet both business and HR-related targets\nAct as a focal point for managers and employees\nCoach and provide feedback to key stakeholders to help improve business and communication efficiency\nTypo and support our R&D / Marketing teams, ensuring they are inspiring their teams\nMeasure organizational health and lead appropriate employee engagement\nProactively identify organizational needs and offer HR solutionsShow more Report"}, {"company": "InspHire", "job": "Technical Recruitment Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "We at InspHire know that the right talent acquisition is a critical aspect for any organization to grow and that a recruitment specialist is a force for hiring such resources. We are on the lookout for a technical recruitment specialist who can undertake all hiring activities for our clients (in HR as a Service projects) and help them get rich talent onboard in the Technical domain.\nCore responsibilities\nA technical recruitment specialist is required to connect with potential candidates online and offline for current open roles, screen applications, support hiring managers, and coordinate the hiring process end-to-end. In a nutshell, you will be responsible for hiring qualified people while maintaining a positive candidate experience. If you have prior experience evaluating candidates for roles of various fields and seniority levels, we would like to work with you.\nWhat does the role demand?\nYou will need to create and publish technical job ads in various portal. You must have an excellent knowledge of Internet-based recruiting tools, job sites such as LinkedIn, networking sites, and other sourcing methods. As a technical recruitment specialist, you will collaborate with hiring managers to set qualification criteria for future employees.\nOther responsibilities include:\nPresent quarterly and annual hiring plans.\nScreen resumes and job applications.\nConduct initial phone interviews to shortlist qualified candidates.\nUnderstand technical resource requirements proactively.\nInterview candidates in-person for roles in various levels – junior, senior, and executive.\nTrack hiring metrics including time-to-hire, time-to-fill, and source of hire.\nHost and participate in job fairs and follow up with candidates throughout the hiring process.\nMaintain a database of potential candidates for future job openings.\nDo you have it in you?\nDo you have proven experience as a recruitment specialist, recruiter, or similar role, hands-on experience with the largest job sites like Indeed, and strong interpersonal skills? If you are familiar with applicant tracking systems, have good written and verbal communication skills, and can work with true team spirit, we’d like to meet you. Freshers who have the ability to work independently and multi-task in a fast-paced environment are also welcome.\nQualification\nBachelor’s in Human Resources Management, Organizational Psychology, Business Administration or relevant field.Show more Report"}, {"company": "InspHire", "job": "Office Manager & HR Admin", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "A Media Group, investing in and working with global media and digital marketing companies & startups is looking for an Office Manager & HR Admin.\nRole Description:\nThe Office Manager will report to the group’s HR Director, based at the Herzliya office.\nThe responsibilities will be as following:\nOrganize and coordinate office administration and procedures, in order to ensure organizational effectiveness, efficiency, and safety.\nPlan and execute all the welfare and wellbeing activities of the group.\nAdministrative assistance to all group’s CEOs and executives.\nRecruitment duties – Creating JD’s, job posting, screening CVs, conducting interviews, working with the hiring managers on the hiring processes, working with external placement agencies and head hunters on senior positions. (on a later stage)\nWe are looking for an energetic individual who loves wearing multiple hats. Experienced in handling a wide range of administrative and executive support related tasks, able to work independently, and has a clear passion & sensitivity towards HR and welfare roles.\nDay-to-Day Responsibilities:\nOffice upkeep: Handle storage, construction & maintenance, cleaning staff, responsible for maintaining a clean environment at all times\nOrdering: Maintaining and stocking of Food, Refreshments, Office Supplies\nCompany events: Scheduling and handling of company outings, lunches, dinners and social events\nGeneral HR: Planning holiday gifts to clients, birthday gifts to employees, office announcements\nComm with the group’s Management: Meeting room requests, communications with property management, key fobs, building access\nCompany swag - managing the stock, getting quotes and sending out to partners etc.\nRecruitment: Scan candidates, manage job postings, schedule interviews and contact candidates as needed\nHead Hunting & Sourcing – Experience with working on Premium LinkedIn accounts\nQualifications:\nExperience in working as an HR, Office Admin Manager – mandatory.\nWork experience as a wellness and culture company -facilitator - an advantage\nExcellent organizational, time management skills and ability to multi-task and prioritize work\nGreat interpersonal skills and strong emotional intelligence\nGood verbal and written communication skills\nBA in Human Resources Management or relevant field Positive, energetic and team player – A must!\nHigh level of English!Show more Report"}, {"company": "Fluent Trade Technologies", "job": "Technical Recruiter & HR at Hi-Tech company", "city": "Jerusalem", "date": "30d+", "rating": "3.9", "link": "", "description": "Fluent Trade Technologies is the fastest ‘end-to-end’ data & trading technology provider in the FX, FI and Futures markets.\nFluent is a market leader with a significant tier 1 & 2 client base in the financial world .\nPlease visit us at www.fluenttech.net\nFluent Trade is a global product company with a head office in Jerusalem and a team in Ukraine, EU and the Philippines. We are proud to have top professionals at the Fluent Family and have been expanding it, expecting new projects.\nWe are looking for a candidate who will support the full scope of Technical Recruitment and Human Resources responsibilities to meet the Hi-Tech business needs on hiring and people management. They will maintain and enhance the organization's human resources by attracting candidates, planning, implementing and evaluating human resources policies, programs, and practices.\nWhat you will do:\nSource and arrange Hi-Tech Talent Acquisition in the Jerusalem area, EU, Ukraine and the Philippines\nRecruit in cooperation with the technical hiring team and Onboard new hires\nConduct HR operations and administration not limited to job offers, contracts and personnel data maintaining, trials follow-up, performance management and providing feedback, retention and exit procedures\nManage Payroll and benefits for employees\nResponsibility for the welfare of employees\nWhat you will bring:\n3+ years' experience in both Technical Headhunting/Sourcing and Human Resources in a Hi-Tech Company\nStrong technical sourcing and recruiting with demonstrated ability to improve talent acquisition strategies\nExperience in collaboration with the hiring team and managers to assess their hiring and management needs and expectations\nStrong organizational, critical thinking and communications skills\nAttention to detail and good judgment\nBachelor’s or College Degree\nNote: the office is in Jerusalem (near the train/central bus station)Show more Report"}, {"company": "Solaredge", "job": "HRBP", "city": "Herzliya", "date": "30d+", "rating": "3.8", "link": "", "description": "Power the Future with us!\nSolarEdge (NASDAQ: SEDG), is a global leader in high-performance smart energy technology, with over 5000 employees, offices in 34 countries, and millions of products installed in over 133 countries. Our diverse product offering comprises intelligent solar inverters, battery storage, backup systems, EV charging, and complete home energy management ecosystems. By leveraging world-class engineering capabilities and with a relentless focus on innovation, we strive to create a world where clean, green energy from the sun is the primary source of power for our homes, businesses, and just about everywhere we thrive.\nThe HRBP is responsible for providing a full range of strategic HR Business partnerships and recruiting support to the business unit.\nWe are looking for Human Resources Business Partner to work with our Local and Global (R&D, Sales, Service) groups and who has the ability to diagnose problems, and identify and drive appropriate solutions. A successful candidate will be able to partner and interact effectively with all levels, deliver value-added services that reflect the business objectives, and possess excellent communication skills, business acumen, and the agility to function in a fast-paced and innovative environment.\nResponsibilities:\nBuilds a strong business relationship with the managers.\nProactively supports the delivery of HR Processes in the units:\nOnboarding of new associates, employee relations, performance & talent management, org structure, training and development, and special projects (with the assistance of HR management).\n Participates in the design, implementation, and management of compensation initiatives to ensure that compensation practices are linked to the overall strategy to attract, reward, and retain top talent.\n Process and maintain organization and associate updates to ensure that reporting structures/job titles are correct and current.\n Answers general HR questions and resolves issues in a timely manner.\nActively identifies gaps, and proposes and implements changes necessary to cover risks.\n Facilitates the management team to bring the best solutions for employees.\n Acts as the performance improvement driver and provides positive changes in people management.\n Designs succession plans for key talents and key job positions.\nSupport other cross-COE HR tasks/projects as will be defined.\nRequirements:\n\n5+ years of experience in Human Resources Management including OD processes in global hi-tech organizations.\nFluent English –MUST.\nAbility to work remotely with global sites\nRelevant Bachelor’s degree, Master's degree- an advantage.\nExcellent relationship-building and coaching skills.\nAbility to thrive in a fast-paced environment with multiple priorities.\nTeam Player.\n Communication & negotiation Skills.\nProject Management and Change Management Skills.\nStrong Business Insight.\nStrong Time Management and Priorities Management Skills.\nResults orientation and time management skills.\nExperience in recruitment.\nProficient with Microsoft Outlook, Word, Excel, and PowerPoint.\nSolarEdge recognizes its talented and diverse workforce as a key competitive advantage. Our business success is a reflection of the quality and skill of our people. SolarEdge is committed to seeking out and retaining the finest human talent to ensure top business growth and performance.\nCountry:\n\nIsrael - Center\n\nCity:\n\nIsrael-HerzliyaShow more Report"}, {"company": "Inspire MD", "job": "מוביל/ת Lean Production", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "JobInfo", "job": "Technical Recruiter", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_be478812&cb=1676382189910&jobListingId=1007420683994&jrtk=3-1-1gp82ke4vjooh801-1gooi7if1g2qs800-9ed43fbfbfc3572b-", "description": "Job Description:\nCreate and implement a social media marketing plan and manage social media pages and profiles related to talent attraction\nWrite compelling recruiting-related content that can be used in email templates and on social media, blogs, and our careers websitePlan and manage meaningful recruitment campaigns to drive talent attraction and brand awareness\nAdditional Positions:\nHuman Resources Manager, Recruitment Coordinator\nLocation:\nSharon area, Tel Aviv - Center\nCategory:\nHuman Resources\nJob Qualifications:\nAt least 3 years of experience as a technical recruiter for Hi-tech companies.\nProven sourcing skills.\nExperience working with Social Media platforms (such as LinkedIn Recruiter, GitHub and more).\nGreat interpersonal skills.\nPrevious experience in organizing welfare activities.\nBachelor’s degree.\nExcellent written and verbal communication skills (Hebrew and English).\nStrong team player, positive and can-do approach.\nAble to follow up and get things done in a fast-moving and changing environment.\nIndependent and able to juggle multiple tasks effectively.\nCreativity and quick learning abilityShow more Report"}, {"company": "Sedgwick", "job": "Benefit Liaison", "city": "Israel", "date": "7d", "rating": "3.2", "link": "", "description": ""}, {"company": "IQVIA", "job": "Mgr, Flexible Resourcing", "city": "Israel", "date": "8d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ff520e8c&cb=1676382192489&jobListingId=1008439780888&jrtk=3-1-1gp82kgp2joq1801-1gooi7if1g2qs800-2a866afa6972428b-", "description": "Job Overview\nManage a team of clinical staff working in support of clinical studies to ensure projects are appropriately resourced and employees are trained and meeting project objectives.\nEssential Functions\nManage staff in accordance with organization’s policies and applicable regulations. Responsibilities include planning, assigning, and directing work, assessing performance and guiding professional development, rewarding and disciplining employees, and addressing employee relations issues and resolving problems.Participate in the selection for hiring new employees by conducting candidate review and participating in the interviewing process. Ensure that new employees are properly onboarded and trained.Ensure that staff has the proper materials, systems access and training to complete job responsibilities. Provide oversight for the execution of the training plan, SOP review and training experiences, as applicable.Participate in the allocation of resources to clinical research projects by assigning staff to clinical studies based on their experience and training.Manage the quality of assigned staff's clinical work through regular review and evaluation of work product.Identifies quality risks and issues and create appropriate corrective action plans to prevent or correct deficiencies in performance of staff.Ensures that staff are meeting defined workload and quality metrics through regular review and reporting of findings as outlined by clinical operations management.May collaborate with other clinical teams and other functional leadership to manage project related challenges and to achieve exemplary customer service.Participates in corporate or organizational departmental quality or process improvement initiatives.\nQualifications\nBachelor's Degree Degree in scientific discipline or health care preferred. PrefPrior clinical trial experience including experience in a management/leadership capacity or equivalent combination of education, training and experience.In-depth knowledge of applicable clinical research regulatory requirements (i.e., Good Clinical Practice (GCP) and International Conference on Harmonization (ICH) guidelines).Good leadership skills.Computer skills including proficiency in use of Microsoft Word, Excel and PowerPoint.Written and verbal communication skills including good command of English.Excellent organizational and problem solving skills.Effective time management skills and ability to manage competing priorities.Ability to establish and maintain effective working relationships with coworkers, managers, and clients.\n#LI -Remote\nIQVIA is a leading global provider of advanced analytics, technology solutions and clinical research services to the life sciences industry. We believe in pushing the boundaries of human science and data science to make the biggest impact possible – to help our customers create a healthier world. Learn more at https://jobs.iqvia.comShow more Report"}, {"company": "HiredScore", "job": "Customer Success Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "HiredScore brings deeply integrated big data and AI solutions to the global Fortune 500. By leveraging data from companies' Human Resources data ecosystem, HiredScore automates and augments the hiring process, enriching recruiters' decisions with smart insights and candidate prioritization grades of A, B, C, or D using deep technology innovations in artificial intelligence and algorithms.\nHiredScore's Artificial Intelligence engine uses past company hiring data, global hiring data, and other data sources including labor market data, employee performance data, and CRM data, to revolutionize the end-to-end recruiting workflow as well as integrate seamlessly with other HR Systems such as chatbots, assessment tests, video interviews, and other automation tools.\nWe’re looking for a highly driven, results-oriented Customer Success Manager to join our growing Customer Success Team in Israel. Our Customer Success Team is the face of HiredScore to our customers and they reflect the “voice of the customer” internally to all cross-functional teams within the organization. They interact directly with our largest clients and stakeholders, facilitate product training for end-users, drive user engagement and adoption, and work with our Product, Marketing, Data Science, Engineering, and Delivery and Revenue teams to identify opportunities for innovation and bring to market new products and capabilities that deliver even more value for our clients. Our CS Team is tasked with ensuring our product remains the best in the industry and that its value and business impact are accurately reflected.\nRoles & Responsibilities:\n\nDevelop, maintain, and own relationships with existing clients to ensure success, satisfaction, and long-term retention.\nWork cross-functionally with Delivery, Product, Data Science, BI, and Engineering Teams + Customer Success Managers to identify opportunities and communicate insights and feedback from our customers to the rest of the company.\nDefine user engagement strategy and execution for your clients in order to grow customers’ adoption of our solution and continuous improvement of customer experience.\nOwn user onboarding, training, and feedback. Own coordination of feedback to drive product enhancements with both internal and external client stakeholders.\nUnderstand client KPIs and goals for product utilization and collaborate with clients to achieve these goals.\n\nWhat You Need:\n\n3+ years of work experience in a B2B SaaS Customer Success, Account Management, or technical account management role supporting enterprise customers.\nMust be fluent in English and able to work with high-level stakeholders in English.\nPassion for and ability to work in a fast-paced, highly entrepreneurial environment with multiple, concurrent priorities.\nExceptional collaboration and communication skills, and the ability to balance customer priorities while maintaining strong cross-functional relationships internally.\nResults-oriented with a strong track record for success in delivering business objectives with the ability to self-manage and execute projects from scratch.\nExcellent presentation and project management skills, ability to deliver impactful business reviews\nExcellent interpersonal skills with exceptional communication skills across all platforms\nExperience in end-user training: 1-on-1s and group training sessions\nStrong analytical experience working with business intelligence and data platforms for customer analysis.\nWillingness to work flexible hours, as needed, with a global team and customer base - later evenings are needed a few times a week to accommodate global clients.\nAdvantages:\n\nProficiency in additional languages\nExperience working with Fortune 500 and global enterprise accounts\nExperience in HR-TechShow more Report"}, {"company": "Lilly", "job": "Sr. Associate - Oncology Medical Science Liaison", "city": "Raanana", "date": "7d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_eda08cc5&cb=1676382195530&jobListingId=1008443297074&jrtk=3-1-1gp82kjok20b0001-1gooi7if1g2qs800-d72af6f9cd756197-", "description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 35,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world.\nResponsibilities\nThe Medical Science Liaison is a highly knowledgeable scientific person who is primarily responsible for answering the scientific and clinical needs of Scientific Experts (SE). He / She will be placed in a dynamic and motivating environment dedicated to the launch of new products and in a path of professional career. The Medical Science Liaison is a field-based role.\n\nKey Responsibilities:\nIdentification of SEs and development of relationship with them\nProvide deep and advanced disease state and product expertise to SE\nEngage in continuous learning within their therapy area, through literature search, participation in scientific congresses etc.\nCommunication of scientific intelligence and clinical insights\nRespond to unsolicited request, also at congresses\nParticipation in consultant meetings\nDrive digital innovation in engaging customers\nBasic Qualifications\nAdvanced degree in health sciences (PharmD, MD, PhD in a medically related field) OR Masters / bachelor’s level degree in health sciences (e.g. BSN, RPh, PA, NP) with previous experience in Oncology TA.\nAdditional Skills/Preferences\nEnglish proficiency (written and oral): Advanced (B2/C1)\nPassion for science, results, and high standards\nGreat and demonstrable learning agility\nBusiness acumen (starting from scientific information)\nProactive – takes independent action and responds quickly.\nEnthusiasm for a variety of digital technologies with the ability to assimilate complex information and systems.\nConfidence and willingness\nAsk questions, understand, and translate into suggestions/ new solutions.\nDemonstrable ability to operate in a compliant way.\nBrilliant and demonstrable presentation skills\nAbility to effectively communicate scientific data into meaningful, clear, and compliant content.\nAbility to manage a complex environment and prioritize different projects at the same time.\nEli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively “Lilly”) are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.\nLilly does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n#WeAreLillyShow more Report"}, {"company": "BioCatch", "job": "Solutions Data and Quality Analyst", "city": "Tel Aviv-Yafo", "date": "5d", "rating": "4.7", "link": "", "description": "BioCatch is the leader in Behavioral Biometrics, a technology that leverages machine learning to analyze an online user’s physical and cognitive digital behavior to protect individuals online. BioCatch’s mission is to unlock the power of behavior and deliver actionable insights to create a digital world where identity, trust and ease seamlessly co-exist. Today, BioCatch counts over 25 of the top 100 global banks as customers who use BioCatch solutions to fight fraud, drive digital transformation, and accelerate business growth. BioCatch’s Client Innovation Board, an industry-led initiative including American Express, Barclays, Citi Ventures, and National Australia Bank, helps BioCatch to identify creative and cutting-edge ways to leverage the unique attributes of behavior for fraud prevention. With over a decade of analyzing data, more than 80 registered patents, and unparalleled experience, BioCatch continues to innovate to solve tomorrow’s problems. For more information, please visit www.biocatch.com.\nWe’re looking for an experienced Data/BI Analyst with strong project management skills to oversee BioCatch implementations' quality and performance.\nIn this role, you will develop and maintain BI tools to track BioCatch anti-fraud solutions, both on their progress health and quality of implementations.\nThe majority of our customers are financial institutions (Banks, Credit Cards issuers, etc.) but not only. You'll be working with Project Managers, Solutions Engineers and Developers.\nAt BioCatch, you'll be part of the Solutions and Operations department, which provides all technical services to customers worldwide.\nAs part of the Solutions Engineering team, you'll be also contributing to our documentation, leading workshops, and helping to improve our processes and implementation practices.\nKey roles and responsibilities:\nData Quality process owner - as BioCatch solutions heavily rely on client-data collection, you will be developing and maintaining PowerBI datasets and reports, and Snowflake queries pool for in-depth investigations.\nReduce the related efforts to evaluate the implementations' data qualities - make it easier for the solutions engineers to perform.\nEfficiency tracking - Human Resources consumption based on worklogs (time tracking) records, especially for process improvements (i.e. spot the areas where time is over-wasted)\nImplementations' projects progress monitoring - alert on stuck projects, or projects at risk etc.\nRequirements:\n\nMust have:\nAt least 2 years experience in data analysis or equivalent. Our stack includes Snowflake, PowerBI, SQL, MongoDB, Postgresql and others.\nSolid project management experience: timelines, cross-teams coordination, followup skills, sense of urgency etc.\nExceptional communication and teamwork skills.\nFluency in verbal and written English.\nGood to have:\nCustomer service experience: professional attitude, understanding of business goals, etc.\nTraining skills such as leading either internal/external technical workshops.\nWeb or mobile apps development/integration experience: HTML, JS, iOS / Android / similar - big advantage.\nExperience working with big data engines like SQL, Splunk, Elastic, Snowflake, etc.\nExperience working with large financial (or similar) institutions.\nOther languages, especially Spanish or Portuguese.Show more Report"}, {"company": "Adidas", "job": "HR Data Specialist (Temp)", "city": "Holon", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2c622abf&cb=1676382198223&jobListingId=1008331311019&jrtk=3-1-1gp82kmcjp2kl801-1gooi7if1g2qs800-212d24ce8ea3a0be-", "description": "Purpose:\nAs part of the HR services team, provide support in all administrational tasks and processes as part of the Service Catalogue. Support and assist in undertaking all HR related tasks to ensure we are delivering best in class HR support and quality service to our business partners, line managers, and employees.\nKey Responsibilities:\nMaintain current HR systems and Data and be responsible for data accuracy management\nResponsible for monthly local and global reporting activities including non-payroll relevant data audits and standard reporting\nTracking of paperwork and employee eFile maintenance\nExecute seamless on-boarding and exit processes of employees in the respective business areas including facilitating all necessary process steps.\nSupport all administrative tasks with regard to employee changes, such as issuing new letters or other required documents\nFirst point of contact for employees and line managers for all standard questions (or re-routing to payroll/benefits). Processes and answers all incoming tickets, phone calls and emails within the scope of service catalogue.\nProblem-solving skills\nWork closely with Payroll department to ensure employee data integrity\nOwnership of ticketing for respective HR Management and business area.\nPartners to ensure constant and proper information flow. Process requests timely to meet deadlines in accordance with service level agreements (SLAs).\nKeep knowledge base up to date in close cooperation with all HR Services Specialists\nHigh level of Hebrew and English – a must\nKnowledge, Skills and Abilities:\n\nSAC RFC Light monthly submission\nEnsuring the alignment of HRBP and Finance team for FTE's\nChange request Management - from HRBP's and Managers\nHR Data management - cleaning and maintaining Employee database for Israel\nSupporting HRBP, TA, Talent and Rewards Team with any data related query/requirement\nSupport GBS implementation in Israel by providing support in terms of Data/Report\nCreate and maintain New templates wherever required\nCreating Dashboards to present the HR Key Metrices in a PPT/PowerBI\nHelp the team in automating their daily tasks through available tools (MS Office, Power Platforms etc.)\nSupporting EM HUB Team with any data/report request for Israel as a HR Data Champion\nExcellent interpersonal skills & Customer Service attitude\nExcellent verbal and written communication in English\nExcellent organization skills with a strong attention to detail\nAble to prioritize multiple tasks simultaneously\nEnergetic, proactive manner and action oriented behavior\nAbility to multi-task and prioritize workload in a fast paced environment.\nStrong interpersonal and relationship building skills.\nAbility to set clear goals and deliver into key objectives with minimal supervision.\nAction oriented and proactive approach to working with hiring managers, HR teams.\nAbility to exercise good judgment and decision making skills. Able to manage confidential and sensitive information and use appropriately.\nAdvanced SAP-HR and MS Office skills and experience in applicant tracking systems\nAbility to communicate effectively in English, both written and oral.\n\nKey Relationships:\nHR Business Partners (Junior Management up to Senior Management)\nHR Services & Rewards Teams\nHR Management & Talent Acquisition\nLine Managers\nEmployees\n\nMinimum Qualifications:\nUniversity degree\nMinimum 3 years of experience as HR Specialist / Junior HRPB – a must Fluent in labour law – a must\nSpecialization in HR world preferred.\nStrong MS-Office (MS-Excel, MS-Word, MS-PowerPoint) user-knowledge\nHigh level of Hebrew and English\nSAP-HR - a Must\nStrong proficiency with technology and grasping new technology solutions\n\nAT ADIDAS WE HAVE A WINNING CULTURE. BUT TO WIN, PHYSICAL POWER IS NOT ENOUGH. JUST LIKE ATHLETES OUR EMPLOYEES NEED MENTAL STRENGTH IN THEIR GAME. WE FOSTER THE ATHLETE’S MINDSET THROUGH A SET OF BEHAVIORS THAT WE WANT TO ENABLE AND DEVELOP IN OUR PEOPLE AND THAT ARE AT THE CORE OF OUR UNIQUE COMPANY CULTURE: THIS IS HOW WE WIN WHILE PLAYING FAIR.\nCOURAGE: Speak up when you see an opportunity; step up when you see a need..\nOWNERSHIP: Pick up the ball. Be proactive, take responsibility and follow-through.\nINNOVATION: Elevate to win. Be curious, test and learn new and better ways of doing things.\nTEAMPLAY: Win together. Work collaboratively and cultivate a shared mindset.\nINTEGRITY: Play by the rules. Hold yourself and others accountable to our company’s standards.\nRESPECT: Value all players. Display empathy, be inclusive and show dignity to all.\n\nADIDAS CELEBRATES DIVERSITY, SUPPORTS INCLUSIVENESS AND ENCOURAGES INDIVIDUAL EXPRESSION IN OUR WORKPLACE. WE DO NOT TOLERATE THE HARASSMENT OR DISCRIMINATION TOWARD ANY OF OUR APPLICANTS OR EMPLOYEES. WE ARE AN EQUAL OPPORTUNITY EMPLOYER.\n\nJOB TITLE:\nHR Data Specialist (Temp)\nBRAND:\nadidas\nLOCATION:\nHolon\nTEAM:\nHuman Resources\nSTATE:\nM\nCOUNTRY/REGION:\nIL\nCONTRACT TYPE:\nFull time\nNUMBER:\n491629\nDATE:\nFeb 2, 2023Show more Report"}, {"company": "Semperis", "job": "HR Generalist- Temp for maternity leave", "city": "Tel Aviv-Yafo", "date": "26d", "rating": "", "link": "", "description": "Semperis puts people first. Within the Semperis team are world-class thought leaders, distinguished engineers, top technology experts, and visionary professionals. Our team members shape the Semperis culture, which champions strategic vision, specific expertise, intelligent and precise solutions, and continuous innovation. With teams across North America, EMEA and APAC, you’ll be working alongside top global talent from around the world. Semperis is ranked as one of the fastest-growing companies in Deloitte’s 2021 Technology Fast 500.What’s your passion? If you’re a purpose-driven person who always sees the glass as half full, seizes opportunities, and has an urge to learn and develop your skills while managing a balanced, healthy life&mdash;we’d love to hear from you.Semperis focuses on creating an employee experience that is aligned with our vision&mdash;being a Force for Good&mdash; starting with being a good workplace that empowers its employees and fosters an inclusive environment.*What we are looking for:*We are looking for an experienced HR Generalist to join our team in Israel.What you will be doing:At Semperis, we understand that our business thrives when our employees thrive, and that starts by hiring the right HR professionals .Human Resources (HR) is focused on understanding what people need and knowing how to provide it. We’re in search of a qualified and resourceful HR generalist to support our HR department in ensuring smooth and efficient business operations. The HR generalist will have both administrative and strategic responsibilities, helping us to plan and administer important functions, such as training and development. You will take part in HR activities and initiatives, lead various projects to constantly perfect employee engagement, onboarding and welfare activities.Build and maintain relationships with employees, managers, and site leadership.Liaising with the local and global HR team to take part in different HR projects to implement the regional human resources strategy.Proactively identify organizational needs and offer HR solutions.Handle operational tasks for HR activities such as onboarding and managing our HR information system; BambooHR.Plan and execute welfare events.Provide support to employees in various HR-related topics.Manage HR analytics, conduct and analyze onboarding surveys, interviews, and HR processes to make actionable recommendations to improve processes based on data.Use experience, skills, and knowledge of the HR industry to make an impact in key areas such as change management and employee engagement.What you will bring to the table:Bachelor's degree in Human Resources or related field.3-5 years of experience as an HR of which at least 2 years of experience as an HR in a high tech company (preferred from a startup)High-level English both written and spoken.A passion for speaking to people and having an impact on their career pathAbility to work independently from start to finish, with a “can-do” attitude, and engage others.Ability to see the big picture with hands-on and problem-solving approaches.Excellent verbal and written communication skillsBonus Points:Previous experience in global, high-growth organizations.Recruitment experience. A technology-centric organizations will be a strong plus.*The Semperis Story*For security teams charged with defending hybrid and multi-cloud environments, Semperis ensures the integrity and availability of critical enterprise directory services at every step in the cyber kill chain and cuts recovery time by 90%. Purpose-built for securing hybrid Active Directory environments, Semperis’ patented technology protects over 50 million identities from cyberattacks, data breaches, and operational errors. The world’s leading organizations trust Semperis to spot directory vulnerabilities, intercept cyberattacks in progress, and quickly recover from ransomware and other data integrity emergencies.Semperis is proud to be an Equal Opportunity Employer. We welcome applicants of any gender, age, life status, or culture. We see only the potential and capabilities of each candidate and the unique contribution of every employee. Should you require accommodation during the recruitment process, please do not hesitate to ask.#LI-RR1#LI-HybridJob Type: Full-timeShow more Report"}, {"company": "Sedgwick", "job": "Workforce Absence Care Team Representative", "city": "Israel", "date": "13d", "rating": "3.2", "link": "", "description": ""}, {"company": "SciPlay", "job": "HRBP – Maternity Leave", "city": "Ramat Gan", "date": "5d", "rating": "3.9", "link": "", "description": "SciPlay is a leading developer and publisher of digital games on mobile and webplatforms, providing highly entertaining free-to-play games that millions of people play every day.\nFirst line human resources support to management and employees for our dynamic social gaming studio in Israel. Looking for an experienced HR professional who thrives in a fast paced work environment and who has a passion for helping others achieve their potential. Duties include: employee relations, management coaching and consultation, compensation administration, organizational development and change management. Simultaneously fostering a culture of fun, passion and commitment to excellence in all we do.\nRequirements:\n\nA temporary position Maternity leave coverage for 7-9 months.\n4+ years in Human Resources including a background in recruitment, employee relations, and/or training\nExperience handling multiple projects and successfully meeting timelines\nExcellent interpersonal skills\nMust have the ability to make recommendations to effectively resolve problems or issues by using judgment that is consistent with standards, practices, policies, procedures, regulation, and all applicable laws\nAbility to objectively coach employees and management at all levels through complex, difficult, emotional, and sensitive issues\nExperience managing benefits and compensation in a Human Resources Information System (HRIS), preferably Workday, Oracle or ADP.\nExcellent communication and organizational skills.\nStrong people and project management skills.\nStrong analytical, problem-solving, and decision-making skills.\nKey Responsibilities:\n\nDay-to-day HR support of the management and employees of our Israeli studio\nFacilitates and supports the onboarding and training of new employees\nResponds to employee relations issues such as performance management, employee concerns and suggestions, policy interpretation and administration, and investigations\nAssists in development, modification and execution of personnel policies, forms and procedures\nSupports managers in workforce planning, organizational development and change management\nSupports projects to improve and administer HR department data management related to HRIS, employee forms and data processing\nParticipates in developing department goals, objectives, and systems. Assists in evaluation of reports, decisions, and results of department in relation to established goals.\nRecommends new approaches, policies, and procedures to effect continual improvements in efficiency of department and services performed\nPartners with employees and management to communicate various Human Resources policies, procedures, standards and regulations through training, coaching and counselingShow more Report"}, {"company": "Adidas", "job": "Retail HR Specialist", "city": "Holon", "date": "30d+", "rating": "4.0", "link": "", "description": "Purpose:\nAs part of the HR services team, provide support in all administrational tasks and processes as part of the Service Catalogue. Support and assist in undertaking all HR related tasks to ensure we are delivering best in class HR support and quality service to our business partners, line managers, and employees.\nKey Responsibilities:\nExecute seamless on-boarding and exit processes of employees in the respective business areas, all retail stores nationwide, including facilitating all necessary process steps.\nSupport all administrative tasks with regard to employee changes, such as issuing new letters or other required documents\nFirst point of contact for employees and line managers for all standard questions (or re-routing to payroll/benefits). Processes and answers all incoming tickets, phone calls and emails within the scope of service catalogue.\nVisiting retail stores nationwide as often as required\nProblem-solving skills\nMaintain current HR systems and be responsible for data accuracy management\nResponsible for monthly local and global reporting activities including non-payroll relevant data audits and standard reporting\nTracking of paperwork and employee eFile maintenance\nWork closely with Payroll department to ensure employee data integrity\nOwnership of ticketing for respective HR Management and business area.\nPartners to ensure constant and proper information flow. Process requests timely to meet deadlines in accordance with service level agreements (SLAs).\nKeep knowledge base up to date in close cooperation with all HR Services Specialists\nHigh level of Hebrew and English – a must\nKnowledge, Skills and Abilities:\n\nExcellent interpersonal skills & Customer Service attitude\nfluent verbal and written communication in English\nExcellent organization skills with a strong attention to detail\nAble to prioritize multiple tasks simultaneously\nEnergetic, proactive manner and action oriented behavior\nAbility to multi-task and prioritize workload in a fast paced environment.\nStrong interpersonal and relationship building skills.\nAbility to set clear goals and deliver into key objectives with minimal supervision.\nAction oriented and proactive approach to working with hiring managers, HR teams.\nAbility to exercise good judgment and decision making skills. Able to manage confidential and sensitive information and use appropriately.\nAdvanced SAP-HR and MS Office skills and experience in applicant tracking systems\nReadiness to visit the retail stores nationwide as often as required\n\nKey Relationships:\nHR Business Partners (Junior Management up to Senior Management)\nHR Services & Rewards Teams\nHR Management & Talent Acquisition\nLine Managers\nDistrict managers\nRetail Employees\n\nMinimum Qualifications:\n\nUniversity degree\nMinimum 2 years of experience as HR Specialist – a must\nFluent in labour law – a must\nSpecialization in HR world preferred.\nStrong MS-Office (MS-Excel, MS-Word, MS-PowerPoint) user-knowledge\nHigh level of Hebrew and English\nSAP-HR working knowledge\nStrong proficiency with technology and grasping new technology solutions\n\nAT ADIDAS WE HAVE A WINNING CULTURE. BUT TO WIN, PHYSICAL POWER IS NOT ENOUGH. JUST LIKE ATHLETES OUR EMPLOYEES NEED MENTAL STRENGTH IN THEIR GAME. WE FOSTER THE ATHLETE’S MINDSET THROUGH A SET OF BEHAVIORS THAT WE WANT TO ENABLE AND DEVELOP IN OUR PEOPLE AND THAT ARE AT THE CORE OF OUR UNIQUE COMPANY CULTURE: THIS IS HOW WE WIN WHILE PLAYING FAIR.\nCOURAGE: Speak up when you see an opportunity; step up when you see a need..\nOWNERSHIP: Pick up the ball. Be proactive, take responsibility and follow-through.\nINNOVATION: Elevate to win. Be curious, test and learn new and better ways of doing things.\nTEAMPLAY: Win together. Work collaboratively and cultivate a shared mindset.\nINTEGRITY: Play by the rules. Hold yourself and others accountable to our company’s standards.\nRESPECT: Value all players. Display empathy, be inclusive and show dignity to all.\n\nADIDAS CELEBRATES DIVERSITY, SUPPORTS INCLUSIVENESS AND ENCOURAGES INDIVIDUAL EXPRESSION IN OUR WORKPLACE. WE DO NOT TOLERATE THE HARASSMENT OR DISCRIMINATION TOWARD ANY OF OUR APPLICANTS OR EMPLOYEES. WE ARE AN EQUAL OPPORTUNITY EMPLOYER.\n\nJOB TITLE:\nRetail HR Specialist\nBRAND:\nadidas\nLOCATION:\nHolon\nTEAM:\nHuman Resources\nSTATE:\nM\nCOUNTRY/REGION:\nIL\nCONTRACT TYPE:\nFull time\nNUMBER:\n492343\nDATE:\nFeb 7, 2023Show more Report"}, {"company": "JobInfo", "job": "Technical Talent Acquisition Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_351a94c7&cb=1676382205788&jobListingId=1007346702304&jrtk=3-1-1gp82kt6u34ag001-1gooi7if1g2qs800-cb8bbad70f9dd959-", "description": "Job Description:\nTalent Acquisition Partner will\n\nBe responsible for Building and Managing the full life cycle of the hiring process,\nWork closely with and advise the leadership team on everything from profile the best candidates to design the hiring process.\nBe responsible for assessing the best talents by conducting an in-person interview.\nCreate top-notch talent pipelines by using innovative talent acquisition channels\nFind and engage passive candidates through the use of various sourcing techniques.\nCreate and maintain an excellent Candidate experience.\nAdditional Positions:\nCategory:\nHuman Resources\nJob Qualifications:\nPassion for recruiting!\n\nFrom sourcing to extending offers,\nAt least 2 years of talent acquisition experience in high-tech environment, with the ability to understand relevant tech skills, target companies, and be connected to the HR and Recruiting communities.\nExperience in sourcing including building new and creative sourcing strategies.\nExperience in conducting HR interviews and candidates assessment,\nMulti-tasking ability and desire to work in a dynamic and startup mentality.\nCreative, friendly, and outgoing personality, strong team player, positive, and can-do approach\nExperience in managing cross-functional projects and events\nHigh level of English - written and verbal.Show more Report"}, {"company": "ASM Global", "job": "Box Office Manager", "city": "Central", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cb049637&cb=1676382206980&jobListingId=1008346872619&jrtk=3-1-1gp82kuud2jq8001-1gooi7if1g2qs800-48117aa0e081b51d-", "description": "POSITION: Box Office Manager\nDEPARTMENT: Box Office\nREPORTS TO: Director of Finance/General Manager\nFLSA STATUS: Salaried, Exempt\nSummary\nOversees ticket sales and all aspects of box office operation by performing the following duties personally or through subordinates:\nEssential Duties and Responsibilities\nDirects and oversees the internal control of daily operations as outlined in the ASM Global Box Office Manual.\nCoordinates all event information between the promoter, facility personnel and the ticket company in a timely manner.\nWorks with event promoter and appropriate personnel to establish ticket pricing and seating configuration.\nBuilds and modifies all computer ticket events and issues computer access codes to facility management.\nCoordinates the house scale for all ticket events.\nMaintains communication with ticket company representatives for updates and/or revisions in computer operations.\nMonitors daily ticket sales for all upcoming events and communicates information to the Director and promoter representative.\nPrepares cash bank and daily accurate inventory of all tickets distributed and available for sale.\nPrepares and presents the final box office statement for settlement of each event.\nResponds to customer complaints and service requests to maintain a positive rapport with the ticket buying public.\nEstablishes files on each event that consist of seats on-hold for the building and promoter, complimentary ticket vouchers, event audits and ticket inventory schedules.\nSupervises, instructs, and trains ticket sellers as to the proper selling procedures.\nAssists or sells tickets as needed.\nOpens and or closes ticket window as required.\nAccurately dispenses tickets as requested by patrons; accepts payment and makes change accurately.\nMaintains accurate count when selling hard tickets or accesses computer for count of computer printed tickets.\nMaintains accurate record of daily balance of cash received, tickets sold and change bank/vault.\nFills reservations for seats by telephone or mail, handles Will-Call window according to procedures, or other related duties as assigned by supervisor.\nDemonstrates excellent customer service skills, responds promptly to customer needs, responds to requests for service and assistance, able to work independently and handle most box office questions without assistance.\nEfficiently and courteously answers questions concerning prices, seating and events. Gives information concerning coming attractions.\nPrepares and submits daily report of business transactions.\nMakes bank deposits.\nMaintains accurate count of tickets sold, money received from ticket sellers and change banks\nSupervisory Responsibilities\nManages the Ticket Sellers or other Box Office staff. Is responsible for the overall direction, coordination, and evaluation of these units.\nCarries out supervisory responsibilities in accordance with ASM Global’s policies and applicable laws.\n Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding; disciplining employees in conjunction with Human Resources; addressing complaints and resolving problems.\nQualifications\nAbility to work with minimal supervision\nAbility to work flexible hours based on events, including daytime, evening, weekends and holidays, as needed.\nMust be able to speak, read, and write English.\nMust have professional attitude and appearance.\nEducation and/or Experience\nBachelor's Degree preferred\n3 years related experience required\nOr equivalent combination of education and experience\nExperience in accounting and customer service essential\nBox office experience in a similar environment strongly preferred\nSupervisory experience preferred\nSkills and Abilities\nExcellent communication, problem solving and organizational skills required\nDemonstrated knowledge of accounting and financial procedures, including record keeping and reconciliation\nAbility to analyze data and figures\nKnowledge of supervisory principles and practices\nAbility to coordinate and schedule staff\nExcellent good customer service and public relations skills\nDemonstrated knowledge of ticket selling/box office operations\nAbility to count money, make change accurately\nPhysical Demands\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the employee is regularly required to use hands to handle and count coins and currency. The person must be able to climb stairs and walk long distances to access all seating. Specific vision abilities required by this job include close vision.\nNOTE: The essential responsibilities of this position are described under the headings above. They may be subject to change at any time due to reasonable accommodation or other reasons. Also, this document in no way states or implies that these are the only duties to be performed by the employee occupying this position.\nASM Global is an Equal Opportunity/Affirmative Action employer, and encourages Women, Minorities, Individuals with Disabilities, and protected Veterans to apply. VEVRAA Federal Contractor.Show more Report"}, {"company": "Haleon", "job": "Digital Key Account Manager", "city": "Israel", "date": "7d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4c15b854&cb=1676382210472&jobListingId=1008440067373&jrtk=3-1-1gp82l2bakcml801-1gooi7if1g2qs800-00f4edd3798d24d8-", "description": "Job Description\nSite Name: Petach Tikvah\nPosted Date: Jan 31 2023\nHello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands – including Sensodyne, Advil, Voltaren, Otrivin, and Centrum – through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.\nJob Title\nDigital Key Account Manager\nIn this role you will hold account management for omnichannel Mass Market e-commerce and key e-pharmacy customers across Haleon’s full portfolio.\nIn This Role You Will…\nBuild customer base partnerships that maximizes Haleon’s potential growth in the e-commerce channel. Exceed and meet customer expectations through optimized Haleon resources management and optimized solution propositions under time and budget constrained business context.\nUnderstand full channel and customer potential for Haleon Categories and brands\nDeliver sales, profit and visibility targets for customer group.\nDevelop credible relationships that lead to win/win agreements ensuring Haleon strategy is implemented, and we are recognized as a supplier of choice in the categories we operate in.\nGain agreement on annual plan and monitor to ensure brilliant execution is carried out and corrective actions are taken when necessary. Ensure proper measurement and evaluation is in place.\nIdentify opportunities based on customer insights and work with cross functional teams to translate to actionable proposals that grow our categories.\nResponsible for data consolidation and reporting across customers\nLeverage all available data and insights to monitor KPIs per customer and drive action. Drive solutions that grow customer’s trust in Haleon, to overcome problems efficiently\nConduct regular reviews of business performance internally and externally and ensure agreed actions are put in place.\nValidate the Service Invoices and Credit Notes that are related to the annual agreement and the trade budget spent.\nCoordinate and collaborate closely with distributors to ensure execution compliance and to maximize Haleon potential and consistency within omni channel customers\nMonitor competition and identify risk and opportunities\nWhy You?\nQualifications & Skills:\nUniversity degree or equivalent in Business\nProficient in Hebrew and English\n3+ years’ experience in KA management. E – commerce customer experience desirable.\nStrong commercial acumen and passion about digital & e-commerce\nFamiliar with digital media KPIs\nExperience in customer marketing roles will be considered an asset\nAbility to find solutions in new areas and move things forward through stakeholder buy-in and compelling customer propositions\nProven skills to manage a high degree of complexity in changing environment\nNegotiation/influence skills\nAccountability for results\nExcellent use of Microsoft Office\nWhy Join Us?\nThe future of everyday health is changing. And we’re the people changing it. In front of us is an incredible opportunity to go beyond what any of us have done before. And make everyday health more achievable, more inclusive and more sustainable. For more and more people. So join us, as we build one of the world’s leading consumer healthcare companies. Join us to innovate our category-leading brands. To better understand people’s everyday health needs. To tackle the biggest barriers that stand in their way. To change individual and societal behavior. Join us to work with colleagues who share your restless energy. To explore your interests. To stretch yourself to do the best work of your career. And join us, as together we build a working experience that encourages us all to lead happier, healthier, more productive lives. The way we see it, every day is an opportunity for better. And we’re going all in to realize it.\nDiversity, Equity, and Inclusion\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create an unmatched understanding of each other, and promotes fair and equitable outcomes for everyone.\nWe’re striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives.\nWe believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\nCare to join us. Find out what life at Haleon is really like www.haleon.com/careers/\n\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\n\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\n\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Show more Report"}, {"company": "JobInfo", "job": "Talent Acquisition Specialist**", "city": "Central", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ac0840d1&cb=1676382211909&jobListingId=1007429168781&jrtk=3-1-1gp82l3o2k6dk801-1gooi7if1g2qs800-2288f18173bcdfea-", "description": "Job Description:\n•Manage end to end recruitment Processes- CV screen, phone interviews, HR interviews, reference checks, salary offers and contracts.\nCreatively recruit top-notch candidates and maintain a strong pipeline of talent while executing a meaningful candidate experience.Develop and maintain innovative sourcing channels and recruitment campaignsWork closely with hiring managers in order to build and facilitate the best hiring processes.Develop strong and effective partnerships with relevant vendorsOngoing HR support including on-boarding and off-boarding support\nAdditional Positions:\nCategory:\nHuman Resources\nJob Qualifications:\nThis position will be responsible for sourcing, recruiting, screening, and recommending placement of applicants for all positions throughout our site. The Talent Acquisition Specialist will be a valuable contributor to the growth of the organization.\n\n3+ years of experience as a Talent Acquisition Specialist.\nProven experience in recruiting E2E positions for R&D, Product, Marketing, etc.Proven sourcing skills and experience with recruiting databases and Social Media platforms\nExcellent interpersonal and communication skillsSelf-sufficient and able to work independentlyA team player and always looking to improve the department/companyExcellent organizational and collaboration skillsExcellent verbal and written communication skills in Hebrew and English\nA Bachelor’s degree in business, psychology, organizational behaviour, or related fieldsShow more Report"}, {"company": "AdvanSoft", "job": "Senior Technical Recruiter", "city": "Israel", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8685f7d6&cb=1676382213023&jobListingId=1008320303435&jrtk=3-1-1gp82l4r8ma4n801-1gooi7if1g2qs800-734fdef452d8df35-", "description": "Location : IL\nEducation : Bachelor's Degree in Technology Management, Engineering Management, Human Resources, or related bachelor of science discipline or equivalent experience\nJob Type : Full Time\nJob Responsibilities :\nCoordinate with the clients and stakeholders to identify the resource gaps in the process and requirement of technical resources for the project outcome\nElicit the requirements of the position by collaborating with the technical team and delivery managers to source the suitable profiles\nPublish and promote the position offering in various technological forums like GitHub and application tracking systems like the stack overflow and other various traditional methodologies to identify the suitable profiles for the required position\nScreen resources to observe the communication skills and understand the experiential history of the resource and explain the hiring practice to complete hiring program in a seamless way\nCoordinate with the delivery manager, technical team and HR manager to evaluate the profile standards to obtain the results for the suitability for the position requirement\nConduct the reference/background verification checks for the finalized resources and report the results to the HR manager and leadership team by using the analytical method\nConstant touch with technical teams, hiring managers, delivery managers, and HRBP to conduct and evaluate the performance of the new hires and existing employees\nConduct periodical meetings with the leadership team, the technical team, and HRBP to understand the current technology trends and build a new hiring practice and strategy for sustainable performances of employees\nCoordinate and conduct workshops at engineering schools and other technology institutes to explain the current trends and revolutions in technology to aware and counsel students\n\nSend resume & specify position you are seeking to :\nEmail : info@adso.com\nCall : 847-952-0000\nAdvanSoft International,Inc.\n135 E Algonquin Rd, Suite B, Arlington Heights, IL 60005Show more Report"}, {"company": "Jumpcloud", "job": "Partner Account Executive - SEEM - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c978874&cb=1676382214756&jobListingId=1008320878179&jrtk=3-1-1gp82l6ghkcng801-1gooi7if1g2qs800-27df9643a07af091-", "description": "All roles at JumpCloud are Remote unless otherwise specified in the Job Description.\nAbout JumpCloud\nJumpCloud’s mission is to Make Work Happen®, providing simple, secure access to an organization’s technology resources from any device, or any location. The JumpCloud Open Directory Platform gives IT, security operations, and DevOps a single, cloud-based solution to control and manage employee identities and their devices, and apply conditional access controls based on Zero Trust principals. Since launching in 2012, our global user base has grown to more than 150,000 organizations, with more than 5,000 paying customers including Cars.com, GoFundMe, Grab, ClassPass, Uplight and Peloton. JumpCloud has raised over $400M from world-class investors including Sapphire Ventures, General Atlantic, Sands Capital, Atlassian, and CrowdStrike. Our teams are growing fast, too, and we're looking for talent across engineering, sales, customer success, marketing, product management, and more. Join our team of dedicated, passionate, and creative people who are eager to change the IT industry forever.\nAbout the Role:\nWe are looking for a Partner / Channel Sales professional who loves selling to highly technical buyers. This role is responsible for selling our Cloud Directory Platform to our increasing partners network (VAR/ MSP) addressing their small to medium enterprise customer base.\nWe work in a Product Led Growth model serving IT professionals and business stakeholders to help them improve the security posture of their organization and to increase the effectiveness of their IT organization.\nKey Metrics:\nQuota attainment on Partners generates sales\nMonthly Recurring Revenue achieved through the Channel\nPartner ecosystem growth, coverage and overall productivity\n\n\nResponsibilities\nDrive new revenue through on boarding and incubating new partners and expanding existing book of partners\nDevelop business plans and drive lead generation with partners in assigned market segment\nAccelerating new partner account’s time to revenue by facilitating onboarding, training and overall enablement programs\nPresent, promote, and sell the JumpCloud platform to prospective partners and their customers\nActively participate / work with partners in key deals sales cycle from start to finish\nProvide day-to-day support for JumpCloud Partners to help them sell, implement and support JumpCloud offerings\nAssist partners with quotes and proposals for JumpCloud services\nWork with internal cross-functional teams to assist with partner implementation, support and escalations\nParticipation in industry events such as trade shows, seminars and Partner events\nCollaborating with internal stakeholders (Support, Marketing, Product, etc.) to ensure an ideal and constantly improving partner experience\nSkills and Knowledge\n5 - 7 years of business development, sales, and/or account management experience, ideally in a SaaS environment with an IT-focused product\nExperience selling to and through channel partners is preferred especially MSP, VAR, VAD\nProven experience meeting or exceeding key performance metrics\nBA / BS or equivalent education and relevant experience\nStrong interpersonal skills, ability to convey and relate ideas to others\nAbility to excel in a team-oriented, collaborative, and fast-paced environment with energetic attitude, willingness to perform and get things done.\nExperience using Salesforce.com for opportunity management and forecasting\nExperience selling to the SMEs/Commercial segment and/or with IAM/Security/Directory solutions a plus\nEducation and Experience\nEducation and Experience:\nMinimum 3 years sales experience selling a SaaS product\nExceptional track record of targeting and closing deals with small to medium enterprise customers\nBA or BS preferred\nFluent in English\n#LI-MH1\nWhere you’ll be working/Location:\nJumpCloud is committed to being Remote First, meaning that you are able to work remotely within the country noted in the Job Description.\nYou must currently live in and be authorized to work in Israel without sponsorship to be considered for this role.\nWhy JumpCloud?\nIf you thrive working in a fast, SaaS-based environment and you are passionate about solving challenging technical problems, we look forward to hearing from you! JumpCloud is an incredible place to share and grow your expertise! You’ll work with amazing talent across each department who are passionate about our mission. We’re out of the box thinkers, so your unique ideas and approaches for conceiving a product and/or feature will be welcome. You’ll have a voice in the organization as you work with a seasoned executive team, a supportive board and in a proven market that our customers are excited about.\n\nOne of JumpCloud's three core values is to “Build Connections.” To us that means creating \" human connection with each other regardless of our backgrounds, orientations, geographies, religions, languages, gender, race, etc. We care deeply about the people that we work with and want to see everyone succeed.\" - Rajat Bhargava, CEO\n\nPlease submit your résumé and brief explanation about yourself and why you would be a good fit for JumpCloud. Please note JumpCloud is not accepting third party resumes at this time.\n\nJumpCloud is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.\n#LI-Remote #BI-RemoteShow more Report"}, {"company": "Check Point Software Technologies Ltd.", "job": "Global HR Planning & Operations Manager - Maternity Leave Cover", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=000001863123c9a48c674ae26ca5b648&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bde32141&cb=1676382216014&jobListingId=1008372500068&jrtk=3-1-1gp82l7odp6d7801-1gooi7if1g2qs800-cd84e164e6976ad1-", "description": "Your Team\n\nCheck Point is looking for a global leader for the HR operations team, maternity leave coverage for 6 months.\nYour Impact & Responsibilities\n\nThe team is responsible for:\n\nDefining and implementing company human resources related strategies, processes and systems (e.g. compensation, hiring and performance management )\nThe integrity of all employees related records and transactions\nHR related analytics.\n\nWhat are you going to do?\n\nManage performance review processes worldwide and help promote excellence across the organization and presenting meaningful analysis accompanied with action items\nManage the headcount and related compensation for new hires and existing employees\nManage the daily operations of the HR transactions.\nLead a local team and work closely with the team in California.\nYour Knowledge & Skills\nExcellent analytical skills and expert in excel - Must\nPassion for analytics, creating global processes - Must\nBA in economics, psychology, any other related degree (BA.MA) - Must\nAbility to manage interfaces within HR and outside HR and ability to work in a complex environment under pressure and multi-task\nStrong Project Management Skills\nExcellent English and communication skills\nDriving execution skills and passion for work\nManagement experience - a plus\nExperience in working in an international environment – a plusShow more Report"}, {"company": "ABBVIE", "job": "Professional Medical Representative, Immunology, Rheumatology", "city": "Hod HaSharon", "date": "12d", "rating": "4.0", "link": "", "description": ""}]