[{"company": "InspHire", "job": "HR Business Partner", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are seeking an experienced and results-driven HR business partner to join our HR as a Service solutions and to align our clients' HR initiatives and functions with business objectives and business needs. Duties for the HR business partner will include aligning staff to business objectives, recruiting the right talent, enhancing staff performance, supporting employee development, enhancing recruitment efforts, planning strategic HR initiatives, managing HR consultants, running orientation and onboarding processes, communicating role expectations, designing succession plans, maintaining staff relations, managing internships, updating policies and practices, and overseeing wellness and health initiatives. Your experience in human resources management will aid our clients' organization in adding value to overall business objectives, providing HR solutions, resolving personnel grievances, retaining a talented workforce, and ensuring compliance with regulations.\nThe ideal candidate for this role should have a good understanding of business functions, good communication skills, good interpersonal skills, strategic thinking, and good organizational skills. The noteworthy HR business partner should improve HR initiatives, enhance staff morale, enhance relations between staff and employers, contribute to attaining business goals, promote good HR practices, and attract talented recruits.\nHR Business Partner Responsibilities:\nDeveloping the HR agenda.\nDeveloping HR strategies, policies, and practices.\nImproving and monitoring employee productivity.\nStructuring compensation and benefit packages.\nManaging staff wellness initiatives.\nImproving relations between staff and employers.\nEvaluating staffing needs.\nOverseeing recruitment efforts.\nManaging and allocating HR funds.\nEngaging with heads of department.\nHR Business Partner Requirements:\nDegree in human resources management.\nStrong leadership skills.\nExcellent communication skills.\nAnalytical skills.\nProblem-solving skills.\nProactive nature.\nExcellent interpersonal skills.\nMeticulous attention to details.\nHighly organized.\nGood people skills.Show more Report"}, {"company": "IBM", "job": "Hybrid Cloud- MSc and PhD Summer internship 2023- Research Lab", "city": "Haifa", "date": "21d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=0000018631245bc484b3fb892e68a48f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_65e24f25&cb=1676382267126&jobListingId=1008412649732&jrtk=3-1-1gp82mpksjc9s802-1gooi8n0ah7h6800-56f88b2905176543-", "description": "Introduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, let's talk.\n\nYour Role and Responsibilities\n\nDo you want to work with top cloud researchers? The Hybrid Cloud department at IBM Research is looking for an outstanding research intern with experience and interest in cloud computing and distributed systems. We have a number of openings in which you can be a part of a research team in the following areas:\nSolving real-world problems for managing big data\nBuilding the next generation of high performance and programmable networks for the multi-cloud era\nSpace isolation in the Linux kernel for secure cloud computing\nSecure storage systems\nMulti-cloud observability\nEdge computing\nOur summer internship program offer you an opportunity to join our research team for 3 months internship (working 5 days a week) in either Haifa, Tel Aviv or Beer Sheva sites (according to each internship). During the internship, you will be working with our talented researcher on top projects, helping create the next generation of AI, security, quantum, cloud and much more.\n\nRequired Technical and Professional Expertise\nMSC or PhD candidate from CS in advanced stages of studies, in distributed systems, data management, networking, computing architecture or related fields. Knowledge and preferably research experience in either: distributed computing, cloud environments, networking, optimization, operating systems, data stores.\nExperience in programming languages (e.g., Go, Python, Rust, Java, C++)\nPlease add your grade sheet to your application.\n\nPlease add your grade sheet to your application.\n\nPreferred Technical and Professional Expertise\nPublication/s at top-tier peer-reviewed conferences or journals\nExperience with software development in a Linux and/or Kubernetes environment. Basic knowledge of cloud computing concepts (microservices, service discovery, distributed coordination, load balancers, block storage services etc.)\n\nAbout Business Unit\nWith more than 3,000 researchers in 12 labs located across six continents, IBM Research brings together hundreds of researchers who possess unparalleled industry expertise to address some of the world's most challenging problems. Join us as we do pioneering work in areas such as cognitive computing, augmented intelligence, quantum computing, and blockchain, to name a few.\n\nYour Life @ IBM\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\nAre you ready to be an IBMer?\nThis job requires you to provide your COVID-19 vaccination status with supporting documentation, where legally permissible.\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\nIBM wants you to bring your whole self to work and for you this might mean the ability to work flexibly. If you are interested in a flexible working pattern, please talk to our recruitment team to find out if this is possible in the current working environment.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.Show more Report"}, {"company": "IBM", "job": "AI Privacy - MSc and PhD Summer Internship 2023 - Research Lab", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=0000018631245bc484b3fb892e68a48f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5e194cad&cb=1676382270087&jobListingId=1008351491957&jrtk=3-1-1gp82msfvkbmc801-1gooi8n0ah7h6800-ac083fbc1b0647b2-", "description": "Introduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.\n\nYour Role and Responsibilities\n\nJoin the Data Security and Privacy group in IBM Research - Haifa to contribute to cutting-edge technologies at the intersection between security/privacy and machine learning.\n\nWe are developing novel techniques for assessing the privacy risk of AI models via various attacks (such as membership and attribute inference attacks), creating privacy-preserving models (e.g., by applying differential privacy), as well as selective removal of specific samples from trained models (unlearning).\nJoin us to contribute to one of these fascinating and innovative areas, with the goal of publishing results in top conferences/journals and contributing to leading open-source projects in the area of Trustworthy AI. This is an opportunity to work on advanced research topics but bringing them into the context of real-world scenarios and use cases based on real customer pain-points.\n\nRelevant Publication: https://www.research.ibm.com/haifa/ccoe/collaboration.shtml\nOur summer internship program offer you an opportunity to join our research team for 3 months internship (working 5 days a week). During the internship, you will be working with our talented researcher on top projects, helping create the next generation of AI, security, quantum, cloud and much more.\n\nRequired Technical and Professional Expertise\n\nMSc or PhD student in Computer Science at leading university\nGood theoretical knowledge of ML/DL\nHands-on experience in python and ML/DL frameworks (e.g., pytorch)\nAuthorized to work in Israel or hold an applicable work permit required by the Israeli law\nPlease add your grade sheet to your application.\n\n\nPreferred Technical and Professional Expertise\nKnowledge in privacy related technology, data protection, attacks/defences on ML models, ML explainability, maths/statistics theory.\n\nAbout Business Unit\nWith more than 3,000 researchers in 12 labs located across six continents, IBM Research brings together hundreds of researchers who possess unparalleled industry expertise to address some of the world's most challenging problems. Join us as we do pioneering work in areas such as cognitive computing, augmented intelligence, quantum computing, and blockchain, to name a few.\n\nYour Life @ IBM\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\nBeing an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\nAre you ready to be an IBMer?\nThis job requires you to provide your COVID-19 vaccination status with supporting documentation, where legally permissible.\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nLocation Statement\nIBM wants you to bring your whole self to work and for you this might mean the ability to work flexibly. If you are interested in a flexible working pattern, please talk to our recruitment team to find out if this is possible in the current working environment.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.Show more Report"}, {"company": "IBM", "job": "Cloud Quality - MSc/PhD Summer internship 2023 - Research Lab", "city": "Haifa", "date": "30d+", "rating": "4.2", "link": "", "description": ""}, {"company": "Sartorius", "job": "", "city": "Israel", "date": "", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=343&guid=0000018631245d618c7ae65d89753f39&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_d7338267&cb=1676382273216&jobListingId=1008410299266&jrtk=3-1-1gp82mvjfjoq2801-1gooi8ni5itnc800-f6ef89f12e2a696e-", "description": "The HR Service Administrator will be responsible for providing an efficient and effective support service to all HR customers, predominantly to the HR Business Partner or HR Manager. The holder of this position will oversee the onboarding process and be the first point of contact for employee enquiries. The position holder will also administer defined HR processes and procedures such as Workday processes and document creation, always aiming at high efficiency, quality and customer satisfaction as well as contributing to continuous process and quality improvement.\nThe HR Service Administrator will be responsible for providing an efficient and effective support service to all HR customers, predominantly to the HR Business Partner or HR Manager. The holder of this position will oversee the onboarding process and be the first point of contact for employee enquiries. The position holder will also administer defined HR processes and procedures such as Workday processes and document creation, always aiming at high efficiency, quality and customer satisfaction as well as contributing to continuous process and quality improvement.\nThe HR Service Administrator will be responsible for providing an efficient and effective support service to all HR customers, predominantly to the HR Business Partner or HR Manager. The holder of this position will oversee the onboarding process and be the first point of contact for employee enquiries. The position holder will also administer defined HR processes and procedures such as Workday processes and document creation, always aiming at high efficiency, quality and customer satisfaction as well as contributing to continuous process and quality improvement.\nMain Responsibilities & Tasks:\nProvide first level support (e.g. for self-service tools), payroll, administer compensation and benefits incl. pension, preparing HR reporting materials and dashboards, maintaining accurate HR data in systems\nPerform all routine employee-life cycle workday processes (e.g. hire, job changes, compensation, leave of absence, exits)\nEnsure high quality maintenance of personnel data\nPerform all administration and data maintenance tasks related to organizational changes\nOrganize and manage employee and manager onboarding (and welcome days)\nCreate contracts, documents and certifications, and maintenance of personnel files\nProvide quick and quality answers and solutions to employee inquiries\nCreate standard HR reports and analytics\nContribute to continuous improvement and monitor KPIs to improve and adjust service levels and customer satisfaction\nCreate of knowledge articles and cases for knowledge and case management tool\nQualification & Skills:\nGood level of education in relevant field\nProven working experience in an HR role and in a confidential environment\nAccurate and sound administration experience\nAbility to competently and accurately work with databases, spreadsheets and software packages\nCapable of prioritising workload quickly and conscientiously, without sacrificing attention to detail\nClear and effective written and verbal communication skills\nCustomer focused\nApproachable and able to demonstrate confidence in dealing with employees at all levels of the Company\nEffective problem solving skills\nFluent in English\nWe look for employees who would like to grow with us and move the innovative life sciences sector forward. In the process, we focus on agile project work, mutual support within teams and working as equals. Sartorius thrives as a company with people who give their very best every day and who are eager to develop personally and professionally.\nFurther insights into our world of work can be found on www.sartorius.com/careersShow more Report"}, {"company": "Aidoc", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "4.6", "link": "", "description": "About The Position\n\nAidoc is the market leader in Healthcare AI. We deliver the most widely used portfolio of AI solutions to help physicians prioritize life threatening cases and improve patient outcomes. Aidoc’s solutions are in use in over 1,000 hospitals including the leading health systems in the US. Aidoc is funded by top VCs, having raised more than $250 million to date, and was chosen as one of TIME’s 50 most genius companies.\nAbout this role\n\nWe are looking for a Senior People business partner (S.HRBP) to join our People team and become a meaningful partner in the establishment of the HR domain at Aidoc. You will play a key role in the formation of the People team, in its deep purpose of enabling the growth and success of the company.\nThe People Business Partner will report to the VP of People.\nResponsibilities\nLead various HR activities along the employee lifecycle while establishing the highest HR standards that align with the business strategy and needs\nProvide end-to-end HR support, including designing from the ground up HR programs, processes, policies and infrastructure, and implementing them\nProactively support the department’s scale up journey, lead organizational changes with determination and sensitivity\nMaintain both a strategic and tactical HR perspective to proactively tailor effective and flexible HR solutions.\nBe a trusted partner for Aidoc people and managers and provide them with the right guidance\nStrongly connect to the Aidoc values, culture and unique DNA and incorporate the Aidoc spirit into all aspects of your role.\nCreate HR solutions jointly with the people, for the people (co-creation approach).\nRequirements\n+ 10 years of experience as an HR/People business partner in a global Hi-tech company, Experience in a large organization -advantage\nProfound knowledge in the various HR domains, including OD & Learning, Talent Acquisition, Compensation & Benefits, Employee Experience, Labor Law etc.\nTremendous passion to impact, build and make people in the company happy and satisfied.\nA person who is bold and isn’t afraid to do things differently. Curious and passionate about constant learning, proactive with a “can-do” approach.\nAbility to understand business needs and initiate HR activities accordingly\nAbility to develop strong and healthy relationships with various stakeholders within the organization.\nData-driven with the ability to analyze and extract insights to support decision-making.\nExcellent English - speaking and writing.\nOur perks\nAmazing culture - collaborative, transparent & fun!\nAttractive compensation package & benefits\nOffice close to HaShalom train station with free parking\nHybrid work model\nStocked up kitchen, catered breakfastsShow more Report"}, {"company": "InspHire", "job": "", "city": "Herzliya", "date": "", "rating": "5.0", "link": "", "description": "We are seeking an experienced and results-driven HR business partner to join our HR as a Service solutions and to align our clients' HR initiatives and functions with business objectives and business needs. Duties for the HR business partner will include aligning staff to business objectives, recruiting the right talent, enhancing staff performance, supporting employee development, enhancing recruitment efforts, planning strategic HR initiatives, managing HR consultants, running orientation and onboarding processes, communicating role expectations, designing succession plans, maintaining staff relations, managing internships, updating policies and practices, and overseeing wellness and health initiatives. Your experience in human resources management will aid our clients' organization in adding value to overall business objectives, providing HR solutions, resolving personnel grievances, retaining a talented workforce, and ensuring compliance with regulations.\nThe ideal candidate for this role should have a good understanding of business functions, good communication skills, good interpersonal skills, strategic thinking, and good organizational skills. The noteworthy HR business partner should improve HR initiatives, enhance staff morale, enhance relations between staff and employers, contribute to attaining business goals, promote good HR practices, and attract talented recruits.\nHR Business Partner Responsibilities:\nDeveloping the HR agenda.\nDeveloping HR strategies, policies, and practices.\nImproving and monitoring employee productivity.\nStructuring compensation and benefit packages.\nManaging staff wellness initiatives.\nImproving relations between staff and employers.\nEvaluating staffing needs.\nOverseeing recruitment efforts.\nManaging and allocating HR funds.\nEngaging with heads of department.\nHR Business Partner Requirements:\nDegree in human resources management.\nStrong leadership skills.\nExcellent communication skills.\nAnalytical skills.\nProblem-solving skills.\nProactive nature.\nExcellent interpersonal skills.\nMeticulous attention to details.\nHighly organized.\nGood people skills.Show more Report"}, {"company": "Moon Active", "job": "", "city": "Tel Aviv-Yafo", "date": "", "rating": "4.7", "link": "", "description": "Moon Active is one of the world's fastest-growing mobile game companies, providing entertainment to millions of active users across the universe. The company is headquartered in the heart of Tel Aviv.\nWe're looking for a Talent Acquisition Partner to join our growing team. As a Talent Acquisition Partner, you’ll have the opportunity to make a real impact on our success and enable our growth by hiring excellent people for multiple domains in our core business. We’re looking for someone who lives and breathes recruiting and candidate experience, has a deep understanding of in-depth interviews, is innovative and driven by challenges and data.\nResponsibilities\nResponsible for full-cycle recruitment process, focused on our business domains\nPartner and work closely with hiring managers to ensure high-quality recruitment\nConduct in-depth face to face HR interviews while meeting Moon Active's quality\nHire top-notch candidates\nBuild a strong talent pool for key positions, develop and maintain innovative sourcing channels and recruitment campaigns\nUse data and build strategic plans to meet hiring plan in terms of quality\nCreate and maintain an excellent candidate experience\nRequirements\nAt least 4 years of experience as a Talent Acquisition Partner\nProven experience in managing hiring processes end to end\nProven experience in conducting in depth interviews\nAbility to prioritize and work in a dynamic environment\nExcellent verbal and written communication skills in Hebrew and English\nB.Sc. in Human Resources, Behavioral Science or equivalent - Advantage\n#LI-HybridShow more Report"}, {"company": "RYB Technologies", "job": "", "city": "Israel", "date": "", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=343&guid=0000018631245d618c7ae65d89753f39&src=GD_JOB_VIEW&t=SR-JOBS-HR&vt=w&cs=1_ab233ccb&cb=1676382278901&jobListingId=1007372022562&jrtk=3-1-1gp82n55c2hel001-1gooi8ni5itnc800-028caca2e0ef7010-", "description": "Modiin, Israel-based Internet startup that has built a B2B social network for enterprise technology professionals, is looking for an enthusiastic VP of HR to lead our HR activity. This role is an amazing opportunity to make a true impact, take part in organizational success and be a focal point for HR issues in the company. If you are excited about contributing to the business success, hiring talent, working closely with the managers, consulting, developing the unique culture, building & improving HR structures & processes, we are looking for you to join us.\n Location: Modiin\n\nDescription:\n\nManage and execute talent acquisition processes for various positions, demonstrating out-of-the-box thinking and initiative thinking.\n\nBuild strong inter-organizational relationships and help establish great communication channels between managers & employees as well as building more effective cross-departmental collaboration and internal communications across the organization.\n\nBuild & maintain strong business partnerships by providing consultancy to managers at all levels on HR-related issues and influencing them on the best course of action.\n\nPartner with the CEO and the senior leaders to develop optimal organizational structures that support growth and scale.\n\nProactively identify organizational needs and offer HR solutions to leverage organizational and employees’ success.\n\nLead all HR needs such as employee engagement & retention, employee performance, training and development, annual compensation review, workforce planning, promotions & personal growth, terminations, and more…\n\nResponsibility for all compensation & benefits aspects - creating benchmarks, building markets analysis, etc.\n\nDesign & Implement key strategic HR policies & processes.\n\nBe a trusted adviser and provide HR support to our managers and employees.\n\nAble to problem solve and demonstrate operational and strategic skills.\n\nMaintain knowledge of industry trends, employment legislation, and cost-efficient solutions.\n\nRequirements:\n\n10+ years of HR hands-on experience in hi-tech companies (preferably startups)\n\nExperience with hands-on talent acquisition in hi-tech companies\n\nExperience managing HR at an international company\n\nExperience at a high growth tech company selling to the US market\n\nExperience working with senior leaders, Strong consultation skills, including the ability to challenge and impact senior stakeholders.\n\nHighly organized, with the ability to initiate, build and manage effective internal programs, processes, and procedures\n\nDiverse HR background to demonstrate professionalism in both \"soft\" HR domains (Change Management, OD, etc.) and operational HR domains (C&B, Labor law, etc.)\n\nEducation: Bachelor’s degree – Must, MBA/MA – Advantage\n\nExcellent communication skills - writing and verbal, both Hebrew and English\n\n Send CV to jobs@rybtech.comShow more Report"}]