[{"company": "Eybna Technologies", "job": "Marketing Intern", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=00000186131d9a488f2c601e53c3b5ed&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_49be6353&cb=1676381581573&jobListingId=1008156930182&jrtk=3-1-1gp821s5pkclr801-1go9hr6kfj4hf800-a8629c073121de32-", "description": "Full-time Internships\n\nResponsibilities:\n\nCollect quantitative and qualitative data from marketing campaigns\n\nPerform market analysis and research on the competition\n\nSupport the marketing team in daily administrative tasks\n\nAssist in marketing and advertising promotional activities (e.g. social media, direct mail, and web)\n\nPrepare promotional presentations\n\nHelp distribute marketing materials\n\nManage and update company database and customer relationship management systems (CRM)\n\nHelp organize marketing events\n\n\nQualifications:\n\nStrong desire to learn along with a professional drive\n\nSolid understanding of different marketing techniques\n\nExcellent verbal and written communication skills\n\nExcellent knowledge of MS Office\n\nFamiliarity with marketing computer software and online applications (e.g. CRM tools, Online analytics, and Google Adwords)\n\nPassion for the marketing industry and its best practices\n\nCurrent enrollment in a related BS or Master’s degreeShow more Report"}, {"company": "CyberArk", "job": "Knowledge and Technical Community Intern", "city": "Petah Tikva", "date": "24h", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186131d9a488f2c601e53c3b5ed&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d9da32b8&cb=1676381582883&jobListingId=1008444448691&jrtk=3-1-1gp821tecitng801-1go9hr6kfj4hf800-54694ae773bc2829-", "description": "Date: Feb 1, 2023\nLocation:\nIsrael, Petach Tikva\nJob Category: Education Services\nDepartment: Customer Success\nWho we are:\nCyberArk (NASDAQ: CYBR), the global leader in Identity Security, Centered on privileged access management, CyberArk provides the most comprehensive security offering for any identity – human or machine – across business applications, distributed workforces, hybrid cloud workloads and throughout the DevOps lifecycle. The world’s leading organizations trust CyberArk to help secure their most critical assets\n\nWhat will you do:\nThe CyberArk Knowledge & Community team strives to deliver relevant information to the right people at the right time through our content, tools, and processes. We foster a dynamic community with over 12,000 monthly unique member logins and are dedicated to producing high-quality, engaging, and accessible content that boosts confidence and engagement with CyberArk's products.\n\nOur team serves as a primary point of contact for technical customers and partners and thereby plays a key role in driving positive outcomes both internally and externally.\nWith such a crucial role and a large user base, there’s never a dull moment as our work environment is fast paced, constantly evolving, and includes a diverse range of projects.\n\nActivities may include some or all of the following:\nInteract with Technical Community members by responding to questions and comments, addressing flagged items, and maintaining a supportive and positive environment.\nCreate reports and dashboards to track key metrics related to knowledge and community and use data insights to suggest areas for improvement.\nMonitor and analyse usage metrics such as search queries and content consumption to continually optimize the knowledge management system.\nAssist in the design, development, testing, and implementation of knowledge management systems, processes, and workflows.\nCollect, organize, and curate technical content from internal and external sources to ensure relevant and engaging content is available to the community.\nCollaborate with other community team members to plan, execute, and manage community initiatives and projects.\n\nWhat you need to succeed:\n\nEducational Background: Currently pursuing a degree in a related field such as Industrial Engineering, Information Systems, Marketing, Communications, Cybersecurity, or Computer Science.\nTechnical Understanding: Proficiency in technical concepts with the ability to clearly explain complex ideas.\nAnalytical Ability: Skilled in collecting, analyzing, and interpreting data to make informed decisions.\nStrong Communication: Excellent interpersonal and communication skills with the ability to work effectively with cross-functional teams.\nCustomer Focus: Able to think from the customer's perspective to ensure community and knowledge management initiatives meet their needs.\nSelf-motivated and Team-oriented: Able to handle multiple tasks and prioritize time effectively, while also being a strong team player.\nPassion for Technology and Security: Enthusiastic about software, technology, and security.\nExcellent English: Fluent in spoken and written English.\n\nHow will you stand out from the crowd:\nRelevant work experience or relevant coursework in the areas of community management, knowledge management, or information management.\nStrong skills in data analysis and visualizing insights, with the ability to turn data into actionable insights.\nFamiliarity with knowledge management tools and technologies, such as content management systems, customer relationship management (CRM) software, or analytics platforms.\n\nTo learn more about CyberArk, visit https://www.cyberark.com, read the CyberArk blogs or follow on Twitter via @CyberArk, LinkedIn or Facebook.\n#LI-OC1Show more Report"}, {"company": "Alpha Omega", "job": "Intern Application Specialist", "city": "Northern", "date": "8d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186131d9a488f2c601e53c3b5ed&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0293ba93&cb=1676381584141&jobListingId=1008428123597&jrtk=3-1-1gp821ulom6rj801-1go9hr6kfj4hf800-f4d12671bc3a33ae-", "description": "Application Specialist is the entry level position at Alpha Omega. The Application Specialist’s primary responsibility is maintaining customer and distributor satisfaction and to assist in implementing Alpha Omega technology into their practice by providing clinical surgery support, neuroscience support, performing routine inspections on Alpha Omega equipment, and proactively addressing any customer needs. Success in this role is driven by the employee’s ability to handle case support, solve technical issues, and keep accurate records independently without constant supervision. This role reports to the Marketing manager and may be asked to perform other tasks to reach revenue quotas or maintain customer satisfaction as the Clinical and Research Product Development Manager deems necessary.\n\nResponsibilities\nPerform Clinical case support\nPerform installation and training at customer site (clinical and research)\nAssist in demos\nPerform equipment preventative maintenance\nAchieve regional support revenue quota\nAssist in achieving regional revenue targets\n\nQualifications\n\nstudent of Bachelors or higher degree in Neuroscience, Biomedical Engineering or Life Sciences\nExcellent communication skills\nAbility to lift 50+ lbs. and stand for long hours in the operating room\nAbility to travel\nHigh level of English- a mustShow more Report"}, {"company": "Texas Instruments", "job": "Sales Engineering / Account Management Intern – Ra'anana near Tel Aviv, Israel", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186131d9a488f2c601e53c3b5ed&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_40dde888&cb=1676381585448&jobListingId=1008333254479&jrtk=3-1-1gp821vv3gfos801-1go9hr6kfj4hf800-c26252f8b0a0692c-", "description": "We can't predict what the future holds, but we know Texas Instruments will have a part in shaping it.\nAre you an early technology adopter and want a glimpse of the latest products before anyone else? A Technical Sales Engineer internship may be a fit for you. Combine your technical skills with selling and marketing skills to help our customers solve their most challenging problems, and to develop and deliver innovative solutions across various end equipments. Technical Sales Engineers at TI work directly with customers to ensure TI technologies are in the world’s next-generation innovations.\n\nTechnical Sales Engineer Intern responsibilities include:\nGain hands-on experience in one of our Field Sales Offices (FSO) learning the Technical Sales Engineer role and how we conduct business with our customers\nLearn how our Technical Sales force engages with TI’s business units\nWork on hands-on, challenging projects and have opportunities to present your findings to leaders, including running a market analysis, customer case studies, running a project kick off, choosing high growth accounts, and making a final intern presentation\nTexas Instruments will not sponsor job applicants for visas or work authorization for this position.\nMinimum Requirements:\nPursuing a Bachelors degree in Electrical Engineering, Computer Engineering, Electrical and Computer Engineering or related field\nPreferred Qualifications:\nAbility to effectively balance strong technical skills with solid relationship-building capabilities\nDemonstrated strong analytical and problem solving skills\nStrong written, verbal communication skills\nAbility to work in teams and collaborate effectively with people across various functions\nStrong time management skills that enable on-time project delivery\nDemonstrated ability to build strong, influential relationships\nAbility to work effectively in a fast-paced and rapidly changing environment\nAbility to take the initiative and drive for results\nWhy TI?\nEngineer your future. We empower our employees to truly own their career and development. Come collaborate with some of the smartest people in the world to shape the future of electronics.\nWe’re different by design. Diverse backgrounds and perspectives are what push innovation forward and what make TI stronger. We value each and every voice, and look forward to hearing yours. Meet the people of TI\nBenefits that benefit you. We offer competitive pay and benefits designed to help you and your family live your best life. Your well-being is important to us.\nAbout Texas Instruments\nAs a global semiconductor company, we design, manufacture, test and sell analog and embedded processing chips to nearly 100,000 customers. Our products enable electronics everywhere and in things you experience every day - from health care, smart homes and connected cars to drones, smart phones and more. Our passion to create a better and more sustainable world by making electronics more affordable through semiconductors drives us to make our technology smaller, more efficient, more reliable and more affordable.\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment.\n\nIf you are interested in this position, please apply to this requisition.Show more Report"}, {"company": "Toonimo", "job": "Internship at Toonimo", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186131d9a488f2c601e53c3b5ed&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b91a7351&cb=1676381586779&jobListingId=1008143997956&jrtk=3-1-1gp82219020b0001-1go9hr6kfj4hf800-88ca4ea9997298c3-", "description": "Looking to learn your ways in a startup environment?\nAt Toonimo you can achieve practical \"real-life\" knowledge and watch a rapidly growing startup from the inside.\nWe have openings from time to time in various departments in the company. We try to make everyone feel at home as possible and strive for long-term relationship with individuals in the company.\nR&D - Full stack web developer\nRequirements:\nWants to work as part of a team\nFront End Developer experience\nCreative, motivated and hard worker\nFull stack developer experienced in all aspects of web/mobile\nExpertise in developing iOS and/or Android applications – Advantage\nHigh level of auto-deduction & self-management\nDeveloped in HTML5, CSS3, jQuery, Ajax, Backbone/angular, RequireJs\nStrong “pure javascript” background - advantage\nChrome extensions knowledge - advantage\nMarketing\nDesired Skills:\nNative American English speaker - a must!\nExperience producing online content and/or social content.\nExperience managing social presence and activity over multiple networks.\nOutstanding communications and storytelling skills\nAble to break complex concepts to simple messages.\nSales Development\nDesired Skills:\nExcellent communication skills\nExcellent spoken and written English\nExperience in SalesForce CRM - advantage\nAvailable to work U.S. business hours\nJob Description:\nA dynamic sales oriented role, focused on initiating sales leads\nProspect and qualify new leads (SalesForce experience required)\nFollow up on leads from marketing campaigns and conferences\nEngage potential leads via phone, email and social media\nTo apply kindly send you CV to jobs@toonimo.com - See you there :)Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Legal Intern", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186131d9a488f2c601e53c3b5ed&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9b524d9e&cb=1676381588432&jobListingId=1008150562454&jrtk=3-1-1gp8222rnitm9801-1go9hr6kfj4hf800-69bc9d020d090ceb-", "description": "Legal Intern\nDate: Feb 10, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 41245\nWho are we?\nTeva is a global pharmaceutical leader and the world's largest generic medicines producer, committed to improving health and increasing access to quality health solutions worldwide. Our employees are at the core of our success, with colleagues in over 80 countries delivering the world's largest medicine cabinet to 200 million people every day. We offer a uniquely diverse portfolio of products and solutions for patients and we've built a promising pipeline centered around our core therapeutic areas. We are continually developing patient-centric solutions and significantly growing both our generic and specialty medicines business through investment in research and development, marketing, business development and innovation. This is how we improve health and enable people to live better, healthier lives. Join us on our journey of growth!\nJob Description\n\nTeva's legal department is looking for a legal intern for august 2023.\nThe firm's main area of activity is providing ongoing legal support to the company's business units in the civil/commercial field.\nThe role consists of:\nPreparation and review of contracts in English and Hebrew.\nParticipation in negotiation meetings.\nResponding to queries with regards to existing agreements in English and Hebrew.\nConducting legal research on a wide range of topics.\n\nThe position is located in the company's offices in Tel Aviv.\n\nQualifications\n\nGraduate of a law degree- university only\nEnglish and Hebrew at a very high level (mother tongue level), which includes writing ability.\n\nFunction\nLegal & IP\nSub Function\nLegal Support\nReports To\n\nSr Dir Legal Generalist II, Legal\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "", "job": "Admissions and Internship Coordinator", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186131d9a488f2c601e53c3b5ed&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_845aee08&cb=1676381589670&jobListingId=1006740078089&jrtk=3-1-1gp82243lp6ci801-1go9hr6kfj4hf800-25b9677c883d3806-", "description": "A Kiruv Program in the Old City is looking for a Recruiter and Internship Placement Coordinator for an internship program.\nResponsibilities:\n\n- Marketing and recruiting for the program - including networking abilities\nGathering applications\nInterviewing applicants\nGuiding applcants through the acceptance process\n\n- Internship placement - finding companies to host interns and matching the participants to the internship\nVisiting internship companies in person\nAttending various networking and recruiting events\n\nRequirements:\nFluent in English, proficient in Hebrew (MUST)\nHIGHLY Organized\nExcellent interpersonal skills both in person and on the phone\nAbility to work some night hours\nstrong networking skills\ngo getter\nwillingness to work with a team\nconfident\npassionate about kiruv\nquick learnerinternet savvyShow more Report"}, {"company": "", "job": "Recruiter and Internship Placement Coordinator", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186131d9a488f2c601e53c3b5ed&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_333bc576&cb=1676381590950&jobListingId=1006813369360&jrtk=3-1-1gp8225b5itm9801-1go9hr6kfj4hf800-bdb6713a406205b7-", "description": "A Kiruv Program in the Old City is looking for a Recruiter and Internship Placement Coordinator for an internship program.\n\nThis is a part-time job. Work in office and work from home position.\n\nResponsibilities:\n\n- Marketing and recruiting for the program - including networking abilities\nGathering applications\nInterviewing applicants\nGuiding applicants through the acceptance process\n\n- Internship placement - finding companies to host interns and matching the participants to the internship\nVisiting internship companies in person\nAttending various networking and recruiting events\n\nRequirements:\nFluent in English, proficient in Hebrew (MUST)\nHIGHLY Organized\nExcellent interpersonal skills both in person and on the phone\nAbility to work some night hours\nstrong networking skills\ngo getter\nwillingness to work with a team\nconfident\npassionate about kiruv\nquick learner\ninternet savvy\n\nIf yu feel as though you fit the bill, please send your CV, cover letter and 2 references to Tzivya Kisestein coordinator@heritage.org.ilShow more Report"}]