[[{"company": "Investing", "job": "Junior Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "Investing.com, the leading global financial news & data platform, is on the lookout for a Junior Marketing Analyst to join our team and create, analyze, and optimize large-scale campaigns.\nWhat you’ll be doing:\nHands-on campaign management on various ad networks and platforms\nBuild and maintain strategic relationships with key acquisition partners\nCollaborate with different teams members within the marketing department to deliver and execute successful mobile marketing campaigns\nProvide complete performance reporting and analysis on all device marketing campaigns and take relevant action on insights gained.\nEstablish, implement and measure the effectiveness of acquisition initiatives\nWhat you’ll bring:\nUniversity Graduate - Industrial Engineering or Business Management/Economics\nStrong analytical skills\nAbility to work in a fast-paced environment\nSQL capabilities\nProficiency with Excel\nAbility to manipulate and analyze large quantities of data and present it in reports\nHigh attention to detail and proven ability to manage multiple, competing for priorities simultaneously\nStrong organizational, analytical, presentation, and problem-solving skills\nFluent English - verbal and written\nSelf-motivated and meticulous, with a creative and resourceful mind, bright, proactive, works well independently and as part of a team\nWho we are:\nInvesting.com was founded in 2007 and now has over 350 employees across the world.\nWith 60 million monthly unique visitors, 4 billion page views, over 500 million sessions, and over 300,000 financial instruments covered, Investing.com is one of the top two global financial websites.\nInvesting.com offers unlimited access to cutting-edge financial market tools such as real-time quotes and charts, customized portfolios, personal live alerts, calendars, calculators, and financial insights, completely free of charge. In addition to the global stock markets, Investing.com also covers world indices, ETFs, commodities, bonds & interest rates, cryptocurrencies, futures, and options“. Investing.com strives to be a one-stop-shop for traders and investors with apps available.\nWhat we offer:\nA chance to join one of the leading financial markets platforms worldwide\nChallenging assignments in a local and international environment\nEnjoy excellent benefits and a high-energy working environment\nAs with all investing.com positions - we're looking for someone who is self-motivated and meticulous, with a creative and resourceful mind, bright, proactive, and works well independently and as part of a team.\nCheck out openings on our brand new career website: https://www.investing-careers.com/\nOur Privacy Policy: Your resume and information will be kept confidential\n\nEmployment Type:\n\nEmployeeShow more Report"}, {"company": "Agmatix", "job": "Marketing Manager", "city": "Ramat Gan", "date": "1d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fd18a877&cb=1676381415144&jobListingId=1008443326714&jrtk=3-1-1gp81spl0p6dd801-1go9ho02sjigg800-ee3cda846bbfc25f-", "description": "About Agmatix\nagmatix’s vision is to create best of class sustainable agriculture for the future by making high quality and standardized agronomic data freely available for ag professionals to translate into impact. To do that, agmatix is building a leading digital field trials technology that is revolutionizing data driven agriculture. Our technology disrupts a domain where lack of common language, connectivity and data curation methodologies are significant barriers for improvements. Implementing agmatix solutions will allow agricultural professionals around the world to increase crops yields while reducing environmental damage and improving crop quality over time.\nagmatix is built on a set of 6 core values, we are proud to say we stick to the following:\nCutting Edge- Constant state of mind to improve, grow and learn\nDaring- We strive to change the world with the best solutions, Reshaping the future of agriculture.\nData-Driven- We live and breathe data-driven decisions in everything we do.\nDetermination- We strive to change the world with the best solutions\nRooted- The fabric of our DNA is connected to the principles that matter to our clients, our people, and the planet\nTrustworthy- We are a source of confidence to our clients, our employees, partners, and colleagues\nAbout the Role\nDo you want to help us take our product marketing to the next level? Do you want to bring an innovative, data-driven approach to demand generation techniques, digital strategies, and field marketing? Do you want to elevate our brand and gain market share? If so, then we're looking for you!\nWe're looking for a Marketing Manager who will report directly to the VP of Marketing. As a Marketing Manager at agmatix, you'll be part of an exciting team that works together to drive our business forward. We encourage creativity and innovation—and we appreciate hard work!\nWe are looking for someone with experience in marketing with a focus on product marketing and sales enablement.\nYou will develop and oversee all things related to our products and coordinate with external agencies in a variety of areas such as website, digital marketing, social media, etc.\nThe ideal candidate will have worked in a SaaS company focusing on B2B enterprise customers and have experience with supporting several products/solutions.\nWhat You will do?You will work cross-functionally with the sales, product, and agronomy teams to align messaging to better position our solutions to our target personas and impact the success of inbound and outbound marketing.You will create content to educate internal and external stakeholders on product features and benefits.You will support the Sales team by preparing custom-made product marketing materials for the different segments and pipeline life cycle needs. This includes email templates, PPTs, RPF templates, etc.You will create content for assets such as blogs, power points, solution briefs, white papers, email newsletters, and website copy in coordination with our internal experts and external agency vendors. You will need a strong ability to take a concept or idea and turn it into reality.You will define, analyze, and optimize the metrics of success for paid media campaigns based on the performance of account KPIs, data-driven reporting, and managing budgetary goals. Work with your manager to bring the most effective ads to market.You will manage campaigns for mobile app advertising in key media outlets and paid channels for our market segments.You will identify key events and execute logistics and planning related to personnel, budget, and projected ROI for lead generation and brand awareness goals.You will work closely with agency partners to monitor website traffic, revise content, and optimize SEO.You will partner with a PR agency on industry-related topics and key initiatives.\nAbout YouYou are seasoned professional and have an experience in B2B marketing, ideally in a high-growth startup company.You gain strong mobile app marketing experience.You have a SaaS industry experience, with an understanding of the evolving digital marketing landscape and specific needs to market software solutions.You have strong proficiency in Google Analytics, Google Ads, and LinkedIn Ads.You gain proven record of successful budget management and management of advertising channels to meet target KPIs thresholds necessary for the business’ success.You are highly data-driven marketer with a proven track record of delivering initiatives that help achieve overall company goals.Ability to deep dive and learn new domains, technology fields, products, and solutions.You have an exceptional communication skills, both verbal and written.Have the ability to multitask, change priorities rapidly and work under pressure.You gain an experience in agency relationships and management.You are a self-starter with strong project management skills is a must.If you have agriculture or food industry experience it is preferred.Proficient in PowerPoint, WordPress, Canva, Figma, Monday, Slack, and other tools.Show more Report"}, {"company": "Imagen", "job": "Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Imagen is developing a disruptive technology for the professional photo editing market. We use edited photos from each of our users, to create personalized AI profiles and to reduce and eliminate editing efforts. Creating a personalized profile based on user data gives great value to our users and creates many challenges.With a very strong market validation, a crazy month-over-month growth, and a top-tier VC backing us, we’re looking for the first team members to join our team. It’s an opportunity to be part of something huge and be a leader in a fast-growing company.What will you do:Lead the marketing data activities in the companyAnalysis and decision-making based on data insightsVisualize data with dashboards to address key questions for the company’s in-house teams like Marketing, Growth, Product, and moreDesign and execute BI ETL flowsRequirements:BA / BSc in Industrial Engineering and Management / Information Systems / Engineering / Economics / Statistics / Mathematics / similar background.3+ years of experience as a Data Analyst / BI Analyst / similar positions2+ years of experience with B2C data-driven productsStrong SQL experience querying large, complex data setsExperience in building BI visualizations and dashboards (Tableau – an advantage)Knowledge of Python for data prep and analysis – an advantageJob Type: Full-timeShow more Report"}, {"company": "SuperCom", "job": "VP Sales & Marketing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": "DESCRIPTION\nSuperCom is seeking an experienced leader to join our executive team as VP Sales & Marketing. We are looking for someone who can thrive in a results and performance-based culture and brings an exceptional combination of strategic understanding, drive, persistence, and execution. You will report to the CEO and lead the company’s sales and marketing department across all global regions and our 3 business units– IoT, Cyber and eGov.\nAs part of this role, you will develop the company’s worldwide sales and marketing strategy, forecast sales volumes and oversee the department’s day-to-day activities.\nResponsibilities:\nLead our global sales and marketing teams with set annual quotas and goals.\nDesign and oversee marketing campaigns, including production of marketing collateral and messaging content.\nInfluence, collaborate and work with cross-functional leaders, departments, and teams to develop and execute successful strategies.\nMonitor customer, market and competitor activity and provide feedback to company leadership team and other company functions.\nCoach, grow and develop employees on a regular basis to build a dynamic sales and marketing organization.\n\nREQUIREMENTS\nAt least 15 years of sales experience with complex tech solutions and products.5 years of experience managing a sales and marketing team.5 years of experience in government sales to customers in North America and Europe.5 years of experience in direct sales with a personal quota.Proven experience leading a company’s sales and marketing organization in a global setting with focus on North America and Europe.Experience with B2G sales relying heavily on public procurement processes.Experience in selling both directly and through partners (system integrators, channel partners, agents etc.).Successful experience building a go-to-market strategy and corporate sales plan.Proven success driving consistent revenue growth year-over-year.Experience with solutions consisting of both hardware and software - an advantage.Experience with public safety solutions - an advantage.Experience with cyber security products – an advantage.Great problem-solving skills.Excellent verbal and written communication skills in English.Flexible in a dynamic environment.Show more Report"}, {"company": "Elementor", "job": "Product Marketing Manager", "city": "Ramat Gan", "date": "7d", "rating": "4.2", "link": "", "description": "Elementor is the leading website creation platform WordPress, empowering professionals and aspiring creators to create incredible websites.\nThe Product Marketing team at Elementor sits at a strategic intersection, connecting the product, the users, and the market.\nWe're looking for an enthusiastic and motivated individual who understands the power of exceptional product marketing.\nAs a Product Marketing Manager, you'll become an expert on our product, customers, the market, and the competitive landscape.\nYou'll shape our go-to-market strategy and the future of our product by working cross-functionally with our leadership, marketing, and product teams.\nRequirements:\n\nYou'll thrive as a Product Marketing Manager at Elementor if you:\nHave 3+ years of experience as a product marketing manager\nAre a storyteller with innovative and creative skills, and a strong team player\nHave a track record in crafting positioning, user segmentation, and packaging new and existing products in the market\nHave experience creating high-end marketing collateral across multiple channels\nHave experience creating high-detail wireframes and mockups for web pages, emails, product screens, etc\nPossess a high degree of design aesthetics, and can guide other stakeholders toward the best results\nHave strong proven analytical skills, are data-driven, and are familiar with A/B testing\nAble to operate independently across a set of cross-functional partners\nHave a background in SaaS, B2C, and or design software industry. Experience with targeting SMBs/mid-market is a plus.\nExcellent verbal and written communication skills in English.\nWork Environment:\n\nWhat do we do?\nElementor is the leading website building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 12M websites powered by Elementor. More than 8% of all websites around the world are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe believe in empowering both our employees and our users.\nElementor is a place where you can truly grow professionally and personally.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey. We take great pride in Elementor's constant scaling.\nResponsibilities:\n\nPartner with our product team to develop, implement and execute a world-class product go-to-market and launch strategy\nDevelop and communicate Elementor’s value proposition through marketing materials, web pages, emails, product screens, and more, to drive feature adoption, success, and retention\nDevelop an expert understanding of Elementor’s products, use cases, and the markets in which we compete to drive unique market positioning, messaging & adoption strategies.\nConduct customer interviews/market research and redefine our view of the competitive landscape to influence decisions regarding the roadmap and go-to-market strategy\nWork cross-functionally with sales and growth teams to meet revenue and customer goalsShow more Report"}, {"company": "Cyesec", "job": "Marketing Operations Specialist", "city": "Herzliya", "date": "22d", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8d5dbbe6&cb=1676381422179&jobListingId=1008399617802&jrtk=3-1-1gp81t0grp6dd801-1go9ho02sjigg800-10b119e6f6dbacd1-", "description": "CYE is building a data-driven cybersecurity optimization SaaS platform that allows organizations to continuously improve their cyber resilience. Using our platform, organizations can assess, quantify, and mitigate their cyber risk.\nAt CYE, we understand that the best results are achieved by combining the power of AI with human expertise. That’s why we’ve built a world-class team of cybersecurity experts that augment the power of our platform.\nWe are looking for an enthusiastic, motivated, and passionate Marketing Operations Specialist to join our growing marketing team.\nResponsibilities\nBe responsible for all aspects of our marketing CRM.\nManage end-to-end automated marketing campaigns: from ideation, through set up, segmentation, monitoring & QA, and analysis & optimization.\nBuild a cross-channel experience with several touchpoints, such as emails and social, to create automated, triggered, and transactional programs.\nMonitor and analyze ongoing campaigns and end results to deliver recommendations based on insights and troubleshoot when necessary.\nPush operations and automation at CYE to the limit: explore best practices, become the MarTech SME, own your role.\nManage all data syncs between sales and marketing systems (mainly Hubspot<>Salesforce)\nMonitor and ensure first- (e.g. website, landing pages) and third-party (e.g. directories) content is accurate and up to date (e.g. take down broken links, update company information, etc.)\nOptimize the company website for search engines based on keyword research and market insights.\nBuild reports and dashboards to reflect website traffic and conversions and generate insights to improve the visitors’ experience.\nFrequently experiment: execute A/B tests on email concepts, subject lines, content, CTAs, sending times, layouts, and more.\nQualifications\n2-3 years' experience in a similar role, working for a global company – B2B experience is preferred.\nHands-on experience with marketing automation platforms (preferably HubSpot and SalesForce).\nStrong business and analytical skills to translate business objectives to MarTech.\nUnderstanding of digital marketing, including paid media, email marketing and conversion rate optimization.\nIndependent self-starter with demonstrated ability to communicate and influence internal stakeholders.\nAbility to manage multiple tasks simultaneously, shift gears, and prioritize to meet schedules.\nOrganized and detail oriented.\nService oriented.\nExcellent project management skills.\nBasic knowledge of HTML – advantage.\nEnglish – excellent spoken and written; additional languages – advantage.\nAbout us\nCYE offers a SaaS cybersecurity optimization platform that combines technology with red team activity to deliver the most comprehensive and contextual organizational security assessments. By quantifying security data, CYE delivers business insights that help businesses make the right decisions about cybersecurity.Show more Report"}, {"company": "K2view", "job": "Marketing designer", "city": "Hod HaSharon", "date": "2d", "rating": "4.1", "link": "", "description": "We are looking a Marketing designer with outstanding conceptual and visual design skills to join our growing marketing team.\nThe ideal candidate is a creative thinker, has strong UI/UX skills, is organized with a good eye for details, and can contribute and develop in a fast-paced, well-funded startup.\nResponsibilities\nDevelop visual concepts for social media and campaigns that convert\nDesign, create and maintain engaging and brand-consistent marketing assets: ebooks, customer-facing PowerPoint presentations\nExecute creative designs and upkeep of our website - design page layouts, ensuring they are pixel-perfect, inspiring, and user-friendly\nDesign and maintain converting landing pages\nA/B testing and live results focus on user experience\nWork closely with your colleagues in the marketing, product, and sales teams\nMaintain and evolve graphic and brand standards for K2View\n\nRequirements:\n\nWe’d love to hear from you if you have:\n2-4 years experience working in a professional design environment, software or technology company.\nExcellent level of Adobe Suit: Photoshop, Illustrator, Indesign, Adobe XD, Microsoft (PPT)\nStrong visual design skills, including an eye for good typography, composition, and use of color and images\nAbility to adapt easily to changes and meet deadlines in a fast-paced environment\nCreative team player that enjoys brainstorming and working in a team\nHigh level of English (written and spoken)\nSelf-learner, keeping up with design trends, and motivated self-starter\nUX design experience for web and mobile\nPortfolio of completed design projects\nAdvantage:\nExperience with video editing, animation, and motion design.\nExperience in HubSpotShow more Report"}, {"company": "אנטריפוינט", "job": "VP of Marketing", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "3.0", "link": "", "description": "VP of marketing needed For a company that manage safety management system Responsibilities Analyzing existing branding and marketing strategies and improving upon them. Leading a capable marketing team and delegating tasks fairly. Preparing and reviewing monthly, quarterly, and yearly budgets, and allocating resources appropriately. Reporting to the company CEO.\n\nConducting market research and implementing new strategies based on findings. Monitoring industry trends and scheduling meetings to share new information with the team. Setting daily, weekly, monthly and yearly targets, and implementing various incentives to ensure they are achieved. Closely monitoring competitors’ successes and failures and learning from them.\n\nSupervising marketing events and launches and using these spaces to network with industry professionals. Assisting with the recruitment, training, and onboarding of new staff. VP of Marketing Requirements: BSc in marketing, branding, business, PR, or a similar field. Master’s degree may be preferable.\n\nExtensive experience in a similar role. Superb marketing and research skills. Knowledge and practical experience with SEO, digital marketing tools, and related software. Highly observant and analytical.\n\nStrong leadership skills and the ability to make difficult decisions. Excellent communication and interpersonal abilities. Willingness to travel and work long hoursShow more Report"}, {"company": "Tenengroup Ltd.", "job": "Influencer Marketing Coordinator", "city": "Tel Aviv-Yafo", "date": "15d", "rating": "3.6", "link": "", "description": "The Influencer Marketing Coordinator, will be responsible for leading the Company’s influencer outreach & brand ambassador strategy.\nThe influencer Marketing will support monthly marketing campaigns and drive brand awareness.\nThis is a full time position in our Tel Aviv Area offices.\nPlease provide the link to your Instagram page.\nRequirements:\n\nBachelor’s degree or certificate in Marketing/Communications, or related field\n1-2 years digital influencer experience - preferred\nMarketing orientation: understanding of customer psychological behavior and User Experience logic\nAffinity to jewelry and fashion\nOnline shopping addict\nGood visual eye\nStrong analytical capabilities- The ability to turn data into insights\nExcellent time management and project prioritization skill\nExcellent communication skills\nWorks well under pressure\nDetail oriented / accurate\nFast learning ability\nA passion for social media & the beauty industry and knowledge of beauty content creators across all social platforms\nStrong organization skills and a demonstrated ability to execute projects on time & work collaboratively in a fast-paced team environment\nExcellent written & verbal communication skills\nResponsibilities:\n\nIdentify, acquire and maintain new influencer contacts to join internal brand relations program thought social media platforms including Instagram, Pinterest, Facebook, Twitter and YouTube\nAssist Social Media Manager with execution of strategic plan to grow brand awareness/advocacy & drive incremental exposure for our key products while bringing brand DNA to life.\nCultivate and develop consistent and ongoing relationships with new and current influencers via off channel social moderation.\nSpearhead the entire influencer campaign management process from contract negotiation to creative briefs through live integration and technical tasks\nOversee and evolve the Company’s brand ambassador program to amplify the key messaging and story lines of the Company.\nDevelop the Influencer Marketing Annual Plan and cultivate new ideas and campaign concepts that can integrate the brand and its product lines in innovative ways.\nDivision:\n\nLine Of BusinessShow more Report"}, {"company": "Eybna Technologies", "job": "Marketing Specialist", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c031f7a9&cb=1676381429961&jobListingId=1008156930151&jrtk=3-1-1gp81t845khq4801-1go9ho02sjigg800-f20158b51df4f0b8-", "description": "Full-time\n\nResponsibilities:\n\nCollect quantitative and qualitative insight from the marketing campaign’s data\n\nLead generation – managing and monitoring workflows for inbound leads and finding solutions to create new opportunities\n\nSupport the marketing team in daily administrative tasks\n\nPerform market analysis and research on the competition\n\nAssist in marketing and advertising promotional activities and campaigns (e.g. PPC, Google Search, Social, Instagram & Facebook, Mailchimp – Newsletter, LinkedIn – Targeted Campaigns, Woo-Commerce, websites user experience QA and optimizations)\n\nPrepare promotional presentations and company’s sales decks\n\nHelp distribute marketing materials and sales assets – including knowledge in copywriting\n\nHelp organize marketing events – Booth design and marketing assets\n\nQualifications:\n\nStrong desire to learn along with a professional drives Solid understanding of different marketing techniques and strategies\n\nExcellent verbal and written communication skills – Fluent English\n\nExcellent knowledge of MS Office\n\nFamiliarity with marketing computer software and online applications (e.g. CRM tools,\n\nOnline analytics, Google Adwords) Passion for the marketing industry and its best practicesShow more Report"}, {"company": "Craft.io", "job": "Director of Content Marketing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_70d297e0&cb=1676381431361&jobListingId=1007651948249&jrtk=3-1-1gp81t9g0jm5m801-1go9ho02sjigg800-6d7365b44e3e07cc-", "description": "About Craft.io\n\nCraft.io is revolutionizing product management with an end-to-end platform for product professionals.\n\nWith Craft.io, product professionals enjoy a single source of product truth where they create their product strategy and roadmaps, collect and analyze valuable customer feedback, prioritize features and tasks, write specs, and monitor the work of the dev teams.\n\nThousands of product professionals from companies like SAP, Kimberly-Clark, Danone, Sysco, Novartis, and Marks & Spencer use Craft.io, and we are proud to provide them with everything they need to become better at what they love doing - building and shipping great digital products.\n\nAt Craft.io, we work hard but try not to take ourselves too seriously. We are highly adaptable and constantly evolving, passionate about our product, and live to bring value to our customers consistently. Our work environment is dynamic, innovative, and fun, backed by a solid product, strong leadership, and a well-funded future.\nAbout the Director of Content Marketing role\n\nWe’re looking for an experienced content writer, a veteran in creating content for B2B SaaS companies with proven success in creating great content and executing a marketing penetration strategy.\n\nOur ideal candidate is someone who can develop a content strategy, create a content plan and calendar, write great content for a wide variety of marketing materials, and manage freelance content writers.\n\nBottom line: if you’re a hard worker as well as a visionary, Craft.io may be the right place for you.\nWhat will you actually do?\n\nBecome an expert in the Product Management software space, know our competitors, and learn where we can beat them\nPlay a key role in the Craft.io branding process and positioning\nDevelop and implement a content strategy\nOwn and create all Craft.io content and marketing materials\nWrite a lot of content, both long-form and short-form, such as eBooks, guides, reports, case studies, website content, landing pages, blog posts, ad copy, emails, press releases, articles, and more\nManage content publication cycles, including graphic designers, writers, and web developers\nTake the initiative and remain flexible - this is a startup, after all :)\nNative-level English - must have\n2+ years experience as Content Marketing Manager working for B2B SaaS company - must have\nExperience with writing for enterprise software companies as a target audience - must have\n\nExperience with different types of writing: newsletters, customer stories, white papers, etc. - must have\nExtremely organized with high attention to detail and a love for being deep in the weeds - must have\nExperience communicating with freelance writers, internal stakeholders, and management - must haveShow more Report"}, {"company": "ServiceWise", "job": "Marketing Automation Junior", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "Job Description:\nThe position includes implementation and development in SSJS, AMPscript and integration as part of the marketing automation team\nQualifications:\n– Bachelor’s degree graduate and / or graduate of a full-stack or equivalent course\n\n– At least six months’ practical experience in CSS \\ HTML \\ JavaScript\n\n– High ability of self-learning and entry into new tools.\n\n– A desire to study Salesforce technologies and other integration technologies and develop in the field.\n\n– Diligence, striving for a goal, ability to promote several topics simultaneously.\n\n– Experience in writing SQL – an advantage\n\n– Experience with automatic tools (testing / sending emails) – an advantage\n\n– Knowledge in marketing cloud – an advantage\nתיאור תפקיד:\nהתפקיד כולל יישום ופיתוח בשפות SSJS , AMPscript והשתלבות כחלק מצוות ה-marketing automation\nדרישות תפקיד:\nבוגר תואר ראשון ו\\או בוגר קורס fullstack או מקביל\nניסיון מעשי של חצי שנה לפחות ב- CSS\\HTML\\JavaScript\nיכולת גבוהה של למידה עצמית וכניסה לכלים חדשים.\nרצון ללמוד טכנולוגיות Salesforce וטכנולוגיות אינטגרציה נוספות ולהתפתח בתחום.\nחריצות, חתירה למטרה, יכולת לקדם מספר נושאים במקביל.\nניסיון בכתיבת SQL– יתרון\nניסיון בכלים אוטומטיים (בדיקות \\ שליחת מיילים) – יתרון\nיתרון בmarketing cloud\nLocation:\nRamat Hachayal\nPosition:\nFull Time\nSuitable:\nInexperienced AcademicsShow more Report"}, {"company": "Marketing Envy", "job": "Digital Marketing Manager", "city": "Ramat Gan", "date": "8d", "rating": "4.7", "link": "", "description": "Digital Marketing Manager\nEnvy is looking for a Digital Marketing Manager to join our fast growing digital team.\nEnvy provides B2B tech companies and startups with the strategy, technology and operations they need to launch and scale their digital marketing and RevOpsactivities.\nWe build top notch marketing machines for our B2B clients, all the way from lead acquisition through to nurturing and qualification, to becoming business opportunities and finally, delighted customers. Our strategies and campaigns are founded on SEO, content, organic and paid social media channel promotions.\nOur years of experience in reaching targeted professionals mean we can humbly and confidently call ourselves the expert team! We’re also a HubSpot Diamond Partner :).\nWhat you will be doing\nWorking with the team to devise unique SEO-based content and social media strategies for customers\nManaging the content strategy implementation - from suggesting content to briefing writers and reviewing their work.\nEvaluating customers’ SEO posture and initiating ways to improve it\nManaging external and internal resources such as graphic designers, copywriters and web developers to get the job done\nManaging social media channels for customers, engaging potential customers and initiating discussions with influencers\nPlanning, executing and analyzing marketing campaigns using marketing automation\nRequirements:\nNative level English (written & spoken) – a must\n2-3 years experience in previous digital marketing role (agency experience is a significant advantage)\nPrevious experience with tech content or marketing for a tech company - advantage\nUniversity degree - an advantage\nUnderstanding of the Inbound methodology and best practices\nNatural born writer with strong editing skills\nStrong project management skills\nPower social media userShow more Report"}, {"company": "Balance", "job": "Director of Marketing - Tel Aviv/US", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.1", "link": "", "description": "We are seeking a creative, curious, independent Director of Marketing, with an exceptional track record of leading Marketing for a B2B product to lead our dynamic and fast-paced marketing team.\nThis role combines leadership and hands-on. You will design, implement, execute and monitor effective go-to-market strategies that align with our business goals. You will work closely with the management team\n#LI-Remote\nRequirements:\n\n5+ years of management experience in Marketing from fast growing B2B start-up companies\n2+ years of experience as Director of Marketing\nProven experience in designing, implementing, executing and measuring an effective marketing strategy\nProven experience driving a true ABM GTM motion, effectively targeting and winning specific strategic accounts\nExperience messaging and acquiring US based enterprises.\nExperience with handling large marketing performance budgets\nKnowledge of SEO, web analytics and online advertising tools\nStrong analytical and project management skills\nStrategic mindset, with the ability to make difficult decisions\nStrong written and verbal communication skills\nA self-motivated team player and ability to work in fast-paced environments with minimal oversight\nPayments / supply Chain / Fintech/ E-Commerce background is an advantage\nResponsibilities:\n\nOwn and manage awareness, acquisition and nurturing of our target audience\nDevelop and drive Balance’s products positioning, messaging, value proposition, and go-to-market strategy\nPromote and present our products in ways that will strengthen our brand and boost sales\nOversee all lead and demand generation processes – from community building to digital marketing, events and everything in between\nOwn a meaningful budget and execute a demand plan that match our growth goals\nBring a data-driven approach to all marketing efforts, modeling, and forecasting ROI, analyzing funnel metrics\nSet, monitor and report on department KPIs\nMonitor competition (acquisitions, pricing changes and new products and features)Show more Report"}, {"company": "Pulsenmore", "job": "Director of Marketing Communications", "city": "Ramat Gan", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "Eybna Technologies", "job": "Customer Success Manager - EU & APAC", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4417f866&cb=1676381438105&jobListingId=1008156930149&jrtk=3-1-1gp81tg2ikbkq801-1go9ho02sjigg800-68ab405e45d9822e-", "description": "Full-time\n\nResponsibilities:\n\nEstablish clear client retention goals\n\nProcess milestones for the clients and employees to work toward\n\nAssist customers with setting up and navigating programs or software\n\nPromote the value of the product\n\nUpsell services and products with the brand image\n\nPromote value through customer experience\n\nAssist in creating training courses and educational materials\n\nReview customer complaints and concerns and seek to improve the customer experience\n\n\nQualifications:\nProven work experience as a Customer Success Manager or similar role\n\nExperience working with brand image and promoting value through customer experience\n\nExceptional ability to communicate and foster positive business relationships\n\nTechnical skills are required as they relate to the use of the product or service\n\nAccountability and personal organization are essential\n\nExperience in managing a diverse group and training each according to company standards\n\nA communications or marketing degree is preferredShow more Report"}, {"company": "Checkmarx", "job": "Marketing Operations Manager", "city": "Ramat Gan", "date": "22d", "rating": "3.7", "link": "", "description": ""}, {"company": "ווין ג׳ובס", "job": "Marketing Manager 162796", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": ".A Finitech company is looking for a Marketing Manager.The company is located in Tel Aviv area.Availability to a full-time work, Sunday-Thursday, 8am-5pm:Job Requirements are.Bachelor's degree in marketing, finance, business administration, or similar.Experience as a marketing manager.Kowledge of marketing strategies, channels, and branding.Full social conditions.It is mandatory to specify salary expectations, inquiries without rate expectations will not be of interestJob Type: Full-timeShow more Report"}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "Media Content Executive", "city": "Jerusalem", "date": "2d", "rating": "", "link": "", "description": ""}, {"company": "InspHire", "job": "Customer Success Manager", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "A company that is building the future of audio advertising is looking for a Customer Success Manager. It's a startup focused on creating solutions for publishers to unlock the fastest-growing segment of marketing spend, and empowering advertisers to reach mobile audiences at scale.\nAs a Customer Success Manager, you’ll oversee existing publisher accounts. Through day-to-day communication, you’ll build strong relationships and establish growth and up-sell strategies tailored to your book of business. Additionally, you’ll be responsible for onboarding new publishers, while working with counterparts internally and externally to ensure that all technical and performance issues are resolved quickly and appropriately.\nSuccess in this role is achieved through building strong relationships, up-selling, performance analysis, technical support, and optimization. The strategic partnership manager is expected to actively contribute to the ongoing success of the business while working in close partnership with the sales, product, and R&D.\nJob Description:\nCommunicate and work closely with Advertisers and Publishers worldwide to manage relationships.\nGrowing revenue from existing accounts and clients.\nPerformance and technical focal point for product integration, best practices, and overall account operations.\nManage and optimize campaigns; analyze performance and recommend/implement improvements to meet customers’ monetization objectives.\nSupporting the sales team in pre and post-sale stages.\nRequirements :\nMinimum 1-year experience within a global advertising or gaming company.\n2 years experience in client management from global operating companies.\nEnglish at a native level.\nSales-oriented, strong ability to negotiate.\nStrong interpersonal skills to interact with clients, management, and peers.\nAbility to multitask and handle various priorities.\nDetails-oriented with an ability to see the bigger picture.\nPassionate for games and knowledge of the gaming industry.\nBachelor degree.Show more Report"}, {"company": "Abbott Laboratories", "job": "Marketing & Congresses Coordinator", "city": "Tel Aviv-Yafo", "date": "24d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_12e463b9&cb=1676381445161&jobListingId=1008394745505&jrtk=3-1-1gp81tmv42a81001-1go9ho02sjigg800-c5447617c9e67da7-", "description": "Marketing & congresses Coordinator\nJOB DESCRIPTION:\nMAIN PURPOSE\nResponsible for logistical and all administrative related tasks for PN & MN marketing teams including support, collaboration, and full assistance to meet the work plan.\nCORE JOB RESPONSIBILITIES\nResponsible for logistical and all administrative related tasks for PN & MN marketing and sales teams including the production of promotional materials, engage with suppliers, coordinate meetings, manage PO’s, full support with conferences administration etc.\nCoordinate the execution and produce promotional materials – bid offer from suppliers, working with graphic needs and manage the budget.\nFollow-up promotional materials stock and actively update product managers accordingly.\nLogistic coordination of conferences as per project managers’ needs.\nBudget administrative management (Full cycle – from PO to payment). Including Sap\nSupport and coordinate “cross department / division” projects.\nCoordinate meetings upon request.\nProvide full support to PN&MN sales force in terms of promotional materials, products samples, information on conferences / events, support with price offers, etc.\nBack-Up to the front desk upon need.\nUpload Veeva materials for PN\nSupport PN social activities\nSupport Congresses and lectures – PSA, Sponsorships\nDonation processes\nGENERAL RESPONSIBILITY\nResponsible for logistical and all administrative related tasks for PN & MN marketing teams.\nACCOUNTABILITY\nEnsure delivery of tasks on time in full.\nUnderstand and adhere to Abbott policies.\nAdequate and accurate reporting and administration.\nAchieving deadlines.\nQUALIFICATIONS\nService and results oriented.\nProactive and positive approach.\nResponsible.\nWell organized.\nGood listening and communication abilities.\nConfidential and trustworthy.\nEXPERIENCE\nB.A degree (preferably economics, marketing or business).\nGreat computer skills.\nAbility to communicate in English.\nPrevious administrative experience / Previous marketing experience / Previous customer support experience.Show more Report"}, {"company": "Videocites", "job": "Marketing Lead", "city": "Israel", "date": "20d", "rating": "2.9", "link": "", "description": ""}, {"company": "Seperia", "job": "Junior PPC Campaign Manager", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0e250b56&cb=1676381448141&jobListingId=1008135374664&jrtk=3-1-1gp81tpsikhq4801-1go9ho02sjigg800-51c24ece19cec719-", "description": "Seperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high intent traffic.\n\nWe’re looking for our next Junior PPC Campaign Manager.\n\nWhat You Will Do:\nAnalysis and optimization of paid search accounts in Google Ads, Yahoo and Bing\nWork to meet numerical CPA and acquisition volume targets\nKeyword discovery and taxonomy – Create comprehensive keyword lists and assign them into classes and categories for implementation in the ad systems\nWrite ad creatives for different channels and groups\nReporting\nWhat You Need:\nUp to 1-year of hands-on experience with Google Ads\nStrong analytical skills\nMust be highly organized and sharp individual\nHigh work ethics and focus on measurable results\nSelf-starter with excellent communication & collaboration skills\nHigh level of English\nWhat We Offer:\nGROWTH – we believe in growing our own talent, through learning workshops, professional sessions, team meetings, and work experience. Our company culture celebrates employee growth and development.\nFREEDOM- we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUPSIDE – as a performance marketing company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.This position offers a highly unique work environment and excellent career prospects.Show more Report"}, {"company": "Tailor Brands", "job": "Junior Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "About Us\nWith over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone – we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nAs a Junior Product Marketing Manager, you’ll be managing Tailor Brand’s email funnels, automation, pop-ups, and user journeys: from ideation, through configuration to analysis & optimization.\nYou’ll be Tailor Brand’s go-to person with everything related to email automation - collaborating with content, paid acquisition and product, orchestrating Tailor Brands’s automated communications aligned with business and brand goals.\nWe’re looking for an individual who’s a self-starter — someone who knows how to get things done but always seeks ways to innovate and test new ideas.\nManage email automation and email funnels, including content messaging strategy\nMonitor email performance, deliverability, analyze results, and enhance campaigns accordingly. Refine email marketing strategy to increase engagement, retention, and conversions\nManagement of triggered email campaigns throughout the customer lifecycle to maximize business KPIs\nInitiating, conducting and measuring A/B tests in emails\nPrioritize and manage multiple projects at once with exceptional attention to detail\nDrive competitive analysis and market research\nProvision of creative briefs for content & design teams to create assets for emails\nWork closely with Product Managers, Designers, Developers, and CS teams\nRequirements:\n\nPassion and knowledge about the Product Marketing field, especially Email Marketing experience, managing large scale global email campaigns\nAn analytical B.A./B.Sc. from a leading academic institution\nStrong analytical and project management skills\nTime management and attention to details\nExcellent interpersonal, communication and cross-group skills\nA passion for innovating and bringing new ideas to the table, and turning your approved ideas into actionable projects while seeing them through from start to finish\nFluency in spoken/written English\nNice-to-haves\nKnowledge & experience in HTML & CSS\nProven experience in the SaaS industry\nWe are located in Tel Aviv but Hybrid mode is on!\nOur team is currently working in hybrid mode. Those who prefer to work in our office can do so in a safe environment.Show more Report"}, {"company": "CyberInt", "job": "Marketing Manager", "city": "Petah Tikva", "date": "30d+", "rating": "4.4", "link": "", "description": ""}, {"company": "InspHire", "job": "Marketing Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a data analyst for the Marketing Analytics team of an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is in charge of all the analytical aspects of the game operations and strategic planning: From game design to user acquisition, player behavior, live-ops, and game optimization (such as monetization, retention, etc).\nThe scope of responsibility of this team includes budget optimization for user acquisition for the company's games at the scope of tens of million dollars per game, analysis of game profitability and long term potential, analysis of the players' behavior, player game funnel and reaction to new game features and offers, and many more. The goal is to make sure the company brings the best and most relevant players to its games in the most efficient and effective way.\n\nResponsibilities:\nBe an analytical focal point for anything related to UA, New user performance KPIs, monthly budget planning, tests and performance monitoring\nBe a focal point for anything related to new players' performance and KPIs across our range of games, strategic planning, user segmentation, tests and growth opportunities identification\nDaily support of ongoing analytical needs of the marketing department managers & teams\nEstablish and monitor success metrics that measure and explain the impact of the marketing activities\nAbility to work across multiple data sources in order to research and capture the full activity.\nDesign and initiate new features and reports to monitor & give insights on the marketing activity, using the marketing in-house BI system (for example, LTV, ROI forecasting, automatic rules)\nCollaborate with the game analysis team and the game studios to monitor and optimize the company's players experience, maximizing their retention in the games\nRequirements:\nAt least 2 years of previous experience as a data analyst; additional experience in marketing analytics- A must\nProven experience with measuring online success and identifying optimization opportunities\nExcellent understanding of online marketing metrics (user funnel, user acquisition KPI’s)\nExperience in researching large amounts of raw data and a technical orientation.\nSQL Server and Google big Query experience\nHigh level of proficiency in SQL & Excel (Python - an advantage)\nExperience with data visualization tools such as Tableau, Qlik Sense\nExcellent English communication and presentation skills\nPassion for Gaming – an advantage\nA/BSc in an analytical field such Statistics, Industrial Engineering or similar from a leading universityShow more Report"}, {"company": "Jifiti", "job": "Product Marketing Manager", "city": "Israel", "date": "14d", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_eb6d26b9&cb=1676381453948&jobListingId=1008416680766&jrtk=3-1-1gp81tvi3kcmo801-1go9ho02sjigg800-e0f7aca1608a1845-", "description": "About The Position\nJifiti is a cutting-edge fintech company that's driving the technology for leading banks and retailers worldwide. We’re growing quickly following an investment of over $20M by the company that owns IKEA. So we need people like you – smart, energetic, and with a passion for getting great things done for some of the most iconic brands in the world.\nWe are looking for a talented, experienced Product Marketing Manager to join our Product team. A motivated, innovative, and results-driven storyteller that combines a business perspective with a technical understanding.\nThis person will be in charge of driving our message across the company and beyond.\nResponsibilities\nProduce a variety of product content and sales collateral assets, including sales presentations, demos, product brochures, case studies, video content, white papers, webinars, and more.\nDevelop tools and training to support the sales and marketing teams, as well as materials directly facing our B2B clients - both business clients and developers/technical users.\nBuild and manage content tools and platforms to make the content easily accessible to its audience.\nWork closely with product managers, graphic designers, sales, and other stakeholders to identify needs and sharpen product offering and positioning in the market.\nBecome a subject matter expert in consumer financing with an in-depth understanding of the market and competition, in-depth knowledge of our products, value proposition, features and use cases.\nRequirements\nAt least 2 years of experience in Product Marketing/Content Writing/Sales Enablement for a B2B SaaS company.\nExperience creating materials for developers, and doing technical product marketing\nA talented storyteller with technical understanding who can build and deliver compelling company and product presentations.\nA good eye for detail, design, and UX.\nStrong writing skills with hands-on experience creating high-quality product content.\nMother tongue level English with exemplary communications skills.\nAbility to distil complex concepts into clear, concise language and business values.\nExperience in payments / Fintech domains and ecosystem - advantage.Show more Report"}, {"company": "Browzwear", "job": "Director of product", "city": "Hod HaSharon", "date": "30d", "rating": "4.1", "link": "", "description": "Browzwear’s mission is to revolutionize the fashion industry with our 3D end-to-end solutions.\nWe develop innovative, cutting-edge 3D garment simulation technology which enables digital workflow, creative design, faster time to market, less garment waste, and enriches the online shopping experience.\nThis is your chance to play a leading role at the forefront of the digital revolution in the apparel industry.\nWe are looking for a director of web products: someone who is a natural leader, manager, and people person, but who also understands the importance of quality in product development. You have the skill set to inspire your colleagues, carefully nurturing their development, while simultaneously ensuring smooth and near flawless product management leading to top quality projects being delivered on time.\nResponsibilities\nTogether with the management team, build the product strategy, communicate it throughout the company, and make sure everyone is aligned with it\nShape and lead the product group (PMs, design, UX, data) to define its structure, culture, and agenda\nHire, lead, and mentor exceptional people in your team so as to help them grow their capabilities\nWork closely with the business and marketing teams to develop growth strategies that will make an impact\nImplement product methodologies and nurture a product first culture across the company\nBuild and lead customer-centric processes, making sure that everything we do creates value to our customers and our business\nDo hands-on product work as the need arises\nBuild data-driven methods to increase utilization, drive retention, and trigger expansion\nRequirements:\n\nRequirements\nWell-rounded product management experience, preferably from several companies and different products\nProven experience in WEB/SAAS product companies\nStrong leadership abilities, proven experience in leading multi-disciplined teams (product, design, data)\nExcellent interpersonal skills, ability to manage, mentor, and motivate a team, as well as align a diverse set of stakeholders toward a common goal\nCombination of a creative mind, strategic thinking, and best practice methodologies to make the vision come to life\nA \"yes we can\" approach\nB2B/B2B2C experienceShow more Report"}, {"company": "SciPlay", "job": "Data Scientist", "city": "Ramat Gan", "date": "6d", "rating": "3.9", "link": "", "description": "SciPlay is a leading developer and publisher of digital games on mobile and webplatforms, providing highly entertaining free-to-play games that millions of people play every day.\nSciPlay are seeking a highly skilled and experienced Data Scientist to join our team. The successful candidate will be responsible for designing and implementing data science projects, analyzing and interpreting complex data sets, and creating data-driven solutions to support business decisions.\nRequirements:\n\nBachelor's or Master's degree in Statistics, Computer Science, Data Science, Economics or a related field\nStrong experience in data analysis, statistics, and machine learning – 3-5 years - MUST\nStrong programming skill in R - 3-5 years - MUST. Python – advantage\nExperience with SQL and NoSQL databases 3-5 years – MUST\nExperience with data visualization tools such as Tableau or Power BI/Excel\nStrong verbal and written communication skills\nExperience in a gaming industry is a plus\nKey Responsibilities:\n\nUnderstanding business problems, defining formal working frame for the problem and defining a proper solution\nDevelop and implement data science models end to end, algorithms, and statistical analysis\nClean, process, and analyze large and complex data sets\nCreate and maintain data pipelines, databases, and data visualization tools\nCommunicate findings and insights to stakeholders through clear and effective visualizations and presentations\nCollaborate with cross-functional teams, including product, economy, monetization, marketing and higher management, to drive the implementation of data-driven solutions\nStay up-to-date with the latest developments in data science and machine learningShow more Report"}, {"company": "Kaltura", "job": "Product Marketing Manager", "city": "Ramat Gan", "date": "8d", "rating": "4.0", "link": "", "description": "This is us\nKaltura’s (NYSE:KLTR) mission is to power any video experience for any organization – live, on-demand, or real-time. We not only want to make using video simpler, but we also want to better people’s lives through video. Founded in 2006, Kaltura is now a global leader in the video market with millions of people using our products daily to teach, learn, watch, connect, and collaborate. Among our customers, you’ll find more than 1000 global, well-known organizations.\n15+ years since starting the company, we continue to foster a diverse and collaborative work environment where everyone gets a say. Our team is currently 850+ people, and we’re still growing. We have offices in New York, London, Singapore, and Tel Aviv, but our technology is all in the cloud.\nKaltura has a fast-paced environment where initiative is always encouraged. Together with our hybrid work model and flexible state of mind, you get the right conditions for creative juices to flow freely. Thanks to our long line of products, cultivation of rich collaborative culture and care for each Kalturian, you’ll never run out of room to grow and evolve.\nIf you don't meet 100% of the requirements below - that's okay, nobody's perfect! We believe in hiring people, not just a list of skills. We encourage you to apply if you think this is a role that would make you excited about coming to work every day.\nRequirements:\n\nThe role:\nAs a Product Marketing Manager, you will shape Kaltura’s Go to Market strategy using deep product insights, industry knowledge, and market intelligence. Your deep understanding of the product features and the buying process will drive change in how we market and sell our products. You will dive deep into the data from every buying process step and optimize messaging and customer touchpoints to turn leads into life-long subscribers. You will partner with product managers, marketing, and sales to define Kaltura’s market position and further scale our business.\n﻿The day-to-day\nPlan products GTM and execute them\nCreate assets for the sales & CSM teams\nCommunicate and train customers, salespeople, and CSMs\nConduct market and competitive analysis, user research, focus groups, and surveys\nUse data to gain insights and optimize messaging, products, and marketing assets accordingly\nWork closely with product, marketing, sales, customer experience, and other departments\n﻿Ideally, we’re looking for:\nAt least one year of experience in product marketing in a Saas company\nExperience in a customer-facing role, supporting enterprise sales cycles\nAnalytical approach and willingness to dive deep into data\nExperience working cross-functionally internally to drive results\nSuperlative written, verbal, and visual communication skills in English\nThese would also be nice:\nSignificant advantage: worked with the EDU vertical (higher education)\nKnows all about video, RTC, VOD, live, etc.\nThe perks:\nHybrid, flexible work environment\nExtended private health (including mental) insurance\nPersonal and professional development programs\nOccasional Cross company long weekendsShow more Report"}], [{"company": "ServiceWise", "job": "Marketing Automation Junior", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=201&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_be29ab73&cb=1676381460898&jobListingId=1007627781903&jrtk=3-1-1gp81u6b3jrp9801-1go9hp4vgk61l800-f3a004efd7d16558-", "description": "Job Description:\nThe position includes implementation and development in SSJS, AMPscript and integration as part of the marketing automation team\nQualifications:\n– Bachelor’s degree graduate and / or graduate of a full-stack or equivalent course\n\n– At least six months’ practical experience in CSS \\ HTML \\ JavaScript\n\n– High ability of self-learning and entry into new tools.\n\n– A desire to study Salesforce technologies and other integration technologies and develop in the field.\n\n– Diligence, striving for a goal, ability to promote several topics simultaneously.\n\n– Experience in writing SQL – an advantage\n\n– Experience with automatic tools (testing / sending emails) – an advantage\n\n– Knowledge in marketing cloud – an advantage\nתיאור תפקיד:\nהתפקיד כולל יישום ופיתוח בשפות SSJS , AMPscript והשתלבות כחלק מצוות ה-marketing automation\nדרישות תפקיד:\nבוגר תואר ראשון ו\\או בוגר קורס fullstack או מקביל\nניסיון מעשי של חצי שנה לפחות ב- CSS\\HTML\\JavaScript\nיכולת גבוהה של למידה עצמית וכניסה לכלים חדשים.\nרצון ללמוד טכנולוגיות Salesforce וטכנולוגיות אינטגרציה נוספות ולהתפתח בתחום.\nחריצות, חתירה למטרה, יכולת לקדם מספר נושאים במקביל.\nניסיון בכתיבת SQL– יתרון\nניסיון בכלים אוטומטיים (בדיקות \\ שליחת מיילים) – יתרון\nיתרון בmarketing cloud\nLocation:\nRamat Hachayal\nPosition:\nFull Time\nSuitable:\nInexperienced AcademicsShow more Report"}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "Media Content Executive", "city": "Jerusalem", "date": "2d", "rating": "", "link": "", "description": ""}, {"company": "InspHire", "job": "Customer Success Manager", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "A company that is building the future of audio advertising is looking for a Customer Success Manager. It's a startup focused on creating solutions for publishers to unlock the fastest-growing segment of marketing spend, and empowering advertisers to reach mobile audiences at scale.\nAs a Customer Success Manager, you’ll oversee existing publisher accounts. Through day-to-day communication, you’ll build strong relationships and establish growth and up-sell strategies tailored to your book of business. Additionally, you’ll be responsible for onboarding new publishers, while working with counterparts internally and externally to ensure that all technical and performance issues are resolved quickly and appropriately.\nSuccess in this role is achieved through building strong relationships, up-selling, performance analysis, technical support, and optimization. The strategic partnership manager is expected to actively contribute to the ongoing success of the business while working in close partnership with the sales, product, and R&D.\nJob Description:\nCommunicate and work closely with Advertisers and Publishers worldwide to manage relationships.\nGrowing revenue from existing accounts and clients.\nPerformance and technical focal point for product integration, best practices, and overall account operations.\nManage and optimize campaigns; analyze performance and recommend/implement improvements to meet customers’ monetization objectives.\nSupporting the sales team in pre and post-sale stages.\nRequirements :\nMinimum 1-year experience within a global advertising or gaming company.\n2 years experience in client management from global operating companies.\nEnglish at a native level.\nSales-oriented, strong ability to negotiate.\nStrong interpersonal skills to interact with clients, management, and peers.\nAbility to multitask and handle various priorities.\nDetails-oriented with an ability to see the bigger picture.\nPassionate for games and knowledge of the gaming industry.\nBachelor degree.Show more Report"}, {"company": "Abbott Laboratories", "job": "Marketing & Congresses Coordinator", "city": "Tel Aviv-Yafo", "date": "24d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=204&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_16b60a20&cb=1676381464583&jobListingId=1008394745505&jrtk=3-1-1gp81u9u8h4dl801-1go9hp4vgk61l800-c5447617c9e67da7-", "description": "Marketing & congresses Coordinator\nJOB DESCRIPTION:\nMAIN PURPOSE\nResponsible for logistical and all administrative related tasks for PN & MN marketing teams including support, collaboration, and full assistance to meet the work plan.\nCORE JOB RESPONSIBILITIES\nResponsible for logistical and all administrative related tasks for PN & MN marketing and sales teams including the production of promotional materials, engage with suppliers, coordinate meetings, manage PO’s, full support with conferences administration etc.\nCoordinate the execution and produce promotional materials – bid offer from suppliers, working with graphic needs and manage the budget.\nFollow-up promotional materials stock and actively update product managers accordingly.\nLogistic coordination of conferences as per project managers’ needs.\nBudget administrative management (Full cycle – from PO to payment). Including Sap\nSupport and coordinate “cross department / division” projects.\nCoordinate meetings upon request.\nProvide full support to PN&MN sales force in terms of promotional materials, products samples, information on conferences / events, support with price offers, etc.\nBack-Up to the front desk upon need.\nUpload Veeva materials for PN\nSupport PN social activities\nSupport Congresses and lectures – PSA, Sponsorships\nDonation processes\nGENERAL RESPONSIBILITY\nResponsible for logistical and all administrative related tasks for PN & MN marketing teams.\nACCOUNTABILITY\nEnsure delivery of tasks on time in full.\nUnderstand and adhere to Abbott policies.\nAdequate and accurate reporting and administration.\nAchieving deadlines.\nQUALIFICATIONS\nService and results oriented.\nProactive and positive approach.\nResponsible.\nWell organized.\nGood listening and communication abilities.\nConfidential and trustworthy.\nEXPERIENCE\nB.A degree (preferably economics, marketing or business).\nGreat computer skills.\nAbility to communicate in English.\nPrevious administrative experience / Previous marketing experience / Previous customer support experience.Show more Report"}, {"company": "Videocites", "job": "Marketing Lead", "city": "Israel", "date": "20d", "rating": "2.9", "link": "", "description": ""}, {"company": "Seperia", "job": "Junior PPC Campaign Manager", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=206&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0a7762cf&cb=1676381467626&jobListingId=1008135374664&jrtk=3-1-1gp81ucrakcng801-1go9hp4vgk61l800-51c24ece19cec719-", "description": "Seperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high intent traffic.\n\nWe’re looking for our next Junior PPC Campaign Manager.\n\nWhat You Will Do:\nAnalysis and optimization of paid search accounts in Google Ads, Yahoo and Bing\nWork to meet numerical CPA and acquisition volume targets\nKeyword discovery and taxonomy – Create comprehensive keyword lists and assign them into classes and categories for implementation in the ad systems\nWrite ad creatives for different channels and groups\nReporting\nWhat You Need:\nUp to 1-year of hands-on experience with Google Ads\nStrong analytical skills\nMust be highly organized and sharp individual\nHigh work ethics and focus on measurable results\nSelf-starter with excellent communication & collaboration skills\nHigh level of English\nWhat We Offer:\nGROWTH – we believe in growing our own talent, through learning workshops, professional sessions, team meetings, and work experience. Our company culture celebrates employee growth and development.\nFREEDOM- we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUPSIDE – as a performance marketing company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.This position offers a highly unique work environment and excellent career prospects.Show more Report"}, {"company": "Tailor Brands", "job": "Junior Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "About Us\nWith over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone – we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nAs a Junior Product Marketing Manager, you’ll be managing Tailor Brand’s email funnels, automation, pop-ups, and user journeys: from ideation, through configuration to analysis & optimization.\nYou’ll be Tailor Brand’s go-to person with everything related to email automation - collaborating with content, paid acquisition and product, orchestrating Tailor Brands’s automated communications aligned with business and brand goals.\nWe’re looking for an individual who’s a self-starter — someone who knows how to get things done but always seeks ways to innovate and test new ideas.\nManage email automation and email funnels, including content messaging strategy\nMonitor email performance, deliverability, analyze results, and enhance campaigns accordingly. Refine email marketing strategy to increase engagement, retention, and conversions\nManagement of triggered email campaigns throughout the customer lifecycle to maximize business KPIs\nInitiating, conducting and measuring A/B tests in emails\nPrioritize and manage multiple projects at once with exceptional attention to detail\nDrive competitive analysis and market research\nProvision of creative briefs for content & design teams to create assets for emails\nWork closely with Product Managers, Designers, Developers, and CS teams\nRequirements:\n\nPassion and knowledge about the Product Marketing field, especially Email Marketing experience, managing large scale global email campaigns\nAn analytical B.A./B.Sc. from a leading academic institution\nStrong analytical and project management skills\nTime management and attention to details\nExcellent interpersonal, communication and cross-group skills\nA passion for innovating and bringing new ideas to the table, and turning your approved ideas into actionable projects while seeing them through from start to finish\nFluency in spoken/written English\nNice-to-haves\nKnowledge & experience in HTML & CSS\nProven experience in the SaaS industry\nWe are located in Tel Aviv but Hybrid mode is on!\nOur team is currently working in hybrid mode. Those who prefer to work in our office can do so in a safe environment.Show more Report"}, {"company": "CyberInt", "job": "Marketing Manager", "city": "Petah Tikva", "date": "30d+", "rating": "4.4", "link": "", "description": ""}, {"company": "InspHire", "job": "Marketing Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a data analyst for the Marketing Analytics team of an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is in charge of all the analytical aspects of the game operations and strategic planning: From game design to user acquisition, player behavior, live-ops, and game optimization (such as monetization, retention, etc).\nThe scope of responsibility of this team includes budget optimization for user acquisition for the company's games at the scope of tens of million dollars per game, analysis of game profitability and long term potential, analysis of the players' behavior, player game funnel and reaction to new game features and offers, and many more. The goal is to make sure the company brings the best and most relevant players to its games in the most efficient and effective way.\n\nResponsibilities:\nBe an analytical focal point for anything related to UA, New user performance KPIs, monthly budget planning, tests and performance monitoring\nBe a focal point for anything related to new players' performance and KPIs across our range of games, strategic planning, user segmentation, tests and growth opportunities identification\nDaily support of ongoing analytical needs of the marketing department managers & teams\nEstablish and monitor success metrics that measure and explain the impact of the marketing activities\nAbility to work across multiple data sources in order to research and capture the full activity.\nDesign and initiate new features and reports to monitor & give insights on the marketing activity, using the marketing in-house BI system (for example, LTV, ROI forecasting, automatic rules)\nCollaborate with the game analysis team and the game studios to monitor and optimize the company's players experience, maximizing their retention in the games\nRequirements:\nAt least 2 years of previous experience as a data analyst; additional experience in marketing analytics- A must\nProven experience with measuring online success and identifying optimization opportunities\nExcellent understanding of online marketing metrics (user funnel, user acquisition KPI’s)\nExperience in researching large amounts of raw data and a technical orientation.\nSQL Server and Google big Query experience\nHigh level of proficiency in SQL & Excel (Python - an advantage)\nExperience with data visualization tools such as Tableau, Qlik Sense\nExcellent English communication and presentation skills\nPassion for Gaming – an advantage\nA/BSc in an analytical field such Statistics, Industrial Engineering or similar from a leading universityShow more Report"}, {"company": "Jifiti", "job": "Product Marketing Manager", "city": "Israel", "date": "14d", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=210&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_50c140fc&cb=1676381473189&jobListingId=1008416680766&jrtk=3-1-1gp81uibdma4q801-1go9hp4vgk61l800-e0f7aca1608a1845-", "description": "About The Position\nJifiti is a cutting-edge fintech company that's driving the technology for leading banks and retailers worldwide. We’re growing quickly following an investment of over $20M by the company that owns IKEA. So we need people like you – smart, energetic, and with a passion for getting great things done for some of the most iconic brands in the world.\nWe are looking for a talented, experienced Product Marketing Manager to join our Product team. A motivated, innovative, and results-driven storyteller that combines a business perspective with a technical understanding.\nThis person will be in charge of driving our message across the company and beyond.\nResponsibilities\nProduce a variety of product content and sales collateral assets, including sales presentations, demos, product brochures, case studies, video content, white papers, webinars, and more.\nDevelop tools and training to support the sales and marketing teams, as well as materials directly facing our B2B clients - both business clients and developers/technical users.\nBuild and manage content tools and platforms to make the content easily accessible to its audience.\nWork closely with product managers, graphic designers, sales, and other stakeholders to identify needs and sharpen product offering and positioning in the market.\nBecome a subject matter expert in consumer financing with an in-depth understanding of the market and competition, in-depth knowledge of our products, value proposition, features and use cases.\nRequirements\nAt least 2 years of experience in Product Marketing/Content Writing/Sales Enablement for a B2B SaaS company.\nExperience creating materials for developers, and doing technical product marketing\nA talented storyteller with technical understanding who can build and deliver compelling company and product presentations.\nA good eye for detail, design, and UX.\nStrong writing skills with hands-on experience creating high-quality product content.\nMother tongue level English with exemplary communications skills.\nAbility to distil complex concepts into clear, concise language and business values.\nExperience in payments / Fintech domains and ecosystem - advantage.Show more Report"}, {"company": "Browzwear", "job": "Director of product", "city": "Hod HaSharon", "date": "30d", "rating": "4.1", "link": "", "description": "Browzwear’s mission is to revolutionize the fashion industry with our 3D end-to-end solutions.\nWe develop innovative, cutting-edge 3D garment simulation technology which enables digital workflow, creative design, faster time to market, less garment waste, and enriches the online shopping experience.\nThis is your chance to play a leading role at the forefront of the digital revolution in the apparel industry.\nWe are looking for a director of web products: someone who is a natural leader, manager, and people person, but who also understands the importance of quality in product development. You have the skill set to inspire your colleagues, carefully nurturing their development, while simultaneously ensuring smooth and near flawless product management leading to top quality projects being delivered on time.\nResponsibilities\nTogether with the management team, build the product strategy, communicate it throughout the company, and make sure everyone is aligned with it\nShape and lead the product group (PMs, design, UX, data) to define its structure, culture, and agenda\nHire, lead, and mentor exceptional people in your team so as to help them grow their capabilities\nWork closely with the business and marketing teams to develop growth strategies that will make an impact\nImplement product methodologies and nurture a product first culture across the company\nBuild and lead customer-centric processes, making sure that everything we do creates value to our customers and our business\nDo hands-on product work as the need arises\nBuild data-driven methods to increase utilization, drive retention, and trigger expansion\nRequirements:\n\nRequirements\nWell-rounded product management experience, preferably from several companies and different products\nProven experience in WEB/SAAS product companies\nStrong leadership abilities, proven experience in leading multi-disciplined teams (product, design, data)\nExcellent interpersonal skills, ability to manage, mentor, and motivate a team, as well as align a diverse set of stakeholders toward a common goal\nCombination of a creative mind, strategic thinking, and best practice methodologies to make the vision come to life\nA \"yes we can\" approach\nB2B/B2B2C experienceShow more Report"}, {"company": "SciPlay", "job": "Data Scientist", "city": "Ramat Gan", "date": "6d", "rating": "3.9", "link": "", "description": "SciPlay is a leading developer and publisher of digital games on mobile and webplatforms, providing highly entertaining free-to-play games that millions of people play every day.\nSciPlay are seeking a highly skilled and experienced Data Scientist to join our team. The successful candidate will be responsible for designing and implementing data science projects, analyzing and interpreting complex data sets, and creating data-driven solutions to support business decisions.\nRequirements:\n\nBachelor's or Master's degree in Statistics, Computer Science, Data Science, Economics or a related field\nStrong experience in data analysis, statistics, and machine learning – 3-5 years - MUST\nStrong programming skill in R - 3-5 years - MUST. Python – advantage\nExperience with SQL and NoSQL databases 3-5 years – MUST\nExperience with data visualization tools such as Tableau or Power BI/Excel\nStrong verbal and written communication skills\nExperience in a gaming industry is a plus\nKey Responsibilities:\n\nUnderstanding business problems, defining formal working frame for the problem and defining a proper solution\nDevelop and implement data science models end to end, algorithms, and statistical analysis\nClean, process, and analyze large and complex data sets\nCreate and maintain data pipelines, databases, and data visualization tools\nCommunicate findings and insights to stakeholders through clear and effective visualizations and presentations\nCollaborate with cross-functional teams, including product, economy, monetization, marketing and higher management, to drive the implementation of data-driven solutions\nStay up-to-date with the latest developments in data science and machine learningShow more Report"}, {"company": "Kaltura", "job": "Product Marketing Manager", "city": "Ramat Gan", "date": "8d", "rating": "4.0", "link": "", "description": "This is us\nKaltura’s (NYSE:KLTR) mission is to power any video experience for any organization – live, on-demand, or real-time. We not only want to make using video simpler, but we also want to better people’s lives through video. Founded in 2006, Kaltura is now a global leader in the video market with millions of people using our products daily to teach, learn, watch, connect, and collaborate. Among our customers, you’ll find more than 1000 global, well-known organizations.\n15+ years since starting the company, we continue to foster a diverse and collaborative work environment where everyone gets a say. Our team is currently 850+ people, and we’re still growing. We have offices in New York, London, Singapore, and Tel Aviv, but our technology is all in the cloud.\nKaltura has a fast-paced environment where initiative is always encouraged. Together with our hybrid work model and flexible state of mind, you get the right conditions for creative juices to flow freely. Thanks to our long line of products, cultivation of rich collaborative culture and care for each Kalturian, you’ll never run out of room to grow and evolve.\nIf you don't meet 100% of the requirements below - that's okay, nobody's perfect! We believe in hiring people, not just a list of skills. We encourage you to apply if you think this is a role that would make you excited about coming to work every day.\nRequirements:\n\nThe role:\nAs a Product Marketing Manager, you will shape Kaltura’s Go to Market strategy using deep product insights, industry knowledge, and market intelligence. Your deep understanding of the product features and the buying process will drive change in how we market and sell our products. You will dive deep into the data from every buying process step and optimize messaging and customer touchpoints to turn leads into life-long subscribers. You will partner with product managers, marketing, and sales to define Kaltura’s market position and further scale our business.\n﻿The day-to-day\nPlan products GTM and execute them\nCreate assets for the sales & CSM teams\nCommunicate and train customers, salespeople, and CSMs\nConduct market and competitive analysis, user research, focus groups, and surveys\nUse data to gain insights and optimize messaging, products, and marketing assets accordingly\nWork closely with product, marketing, sales, customer experience, and other departments\n﻿Ideally, we’re looking for:\nAt least one year of experience in product marketing in a Saas company\nExperience in a customer-facing role, supporting enterprise sales cycles\nAnalytical approach and willingness to dive deep into data\nExperience working cross-functionally internally to drive results\nSuperlative written, verbal, and visual communication skills in English\nThese would also be nice:\nSignificant advantage: worked with the EDU vertical (higher education)\nKnows all about video, RTC, VOD, live, etc.\nThe perks:\nHybrid, flexible work environment\nExtended private health (including mental) insurance\nPersonal and professional development programs\nOccasional Cross company long weekendsShow more Report"}, {"company": "Natural Intelligence", "job": "Communications Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "WalkMe", "job": "Head of Paid Acquisition", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.2", "link": "", "description": "WalkMe (NASDAQ: WKME) is growing and we want you to join us! Have you ever wanted to work in an industry leader? Well, how about an industry creator?! At WalkMe, we’re not just the leader in digital adoption, we started the digital adoption revolution - enabling organizations to measure, drive, and act to ultimately maximize the impact of their digital transformation and accelerate the return on their software investment. And with over 2,000 clients, including more than a third of Fortune 500 companies, working with us daily, we’re changing how enterprises interact with their technology.\n\nSo, if you’re looking for an opportunity to work, collaborate, and innovate with some of the most talented people out there, WalkMe is the place for you!\n\nWe’re looking for a rockstar Head of Paid Acquisition to help take digital adoption and WalkMe to the next level.\n\n\nWhat you should bring to the table?\nExperience in managing and executing demand generation programs for large-scale B2B companies (a specific experience with LinkedIn is a big advantage).\nProven track record of hitting highly-competitive growth targets by leveraging a diverse set of channels and tactics, as well as demonstrable expertise in end-to-end program development, execution and measurement.\nProven ability to employ data-driven, digital-first strategies for high-quality lead generation and opportunity acceleration through sales teams.\nExperience in CRM to pull reports on specific campaigns, understand lead funnel status and manage marketing-sales feedback loops (specific experience in Salesforce - a major advantage).\nProspect-centric and data driven—you understand the lead journey, the different stages and their impact on the prospect’s entire funnel.\nGreat at building cross-functional relationships. You've worked closely with data, sales, design, content and operations partners to build scalable collaborations\nA great communicator and team player with a contagious “can-do” attitude.\nA marketing strategist who can derive insights, recommendations, and action plans from qualitative market trends, consumer feedback, internal feedback, and large data sets.\n7+ years of experience in managing global paid campaigns on Google, LinkedIn, Facebook, and publications (including hands-on experience, min. $250K monthly)\nAt least 5 years of team management experience.\nExperience in managing ABM campaigns with a sophisticated granular approach\nNative level English\nStrong analytical skills\nWhat will you actually be doing?\nLead a team of campaign managers who plan and execute our paid acquisition programs\nLead the global digital marketing strategy, budget and creatives across paid acquisition channels\nWork with our global program management team on activating programs on our paid acquisition channels\nWork with our media partners representatives to increase scale & efficiency\nExperiment and drive optimization programs to improve efficiency and performance across our paid activity\nStrengthen and leverage alignment with the entire Demand Generation team: organic acquisition, field marketing, events, and outside the marketing department: Sales organization and the Customers organizations\nBuild customers journeys strategy that will lead our customers community to a lower churn and a higher retention rate\nWhy should you work for WalkMe?\nWe’re ranked by Dun & Bradstreet as one of the TOP 20 software companies to work for in Israel\nWe were recognized by Deloitte as the 6th fastest growing software company in the world\nWe’re publicly traded on the Nasdaq stock exchange\nWe provide you with the latest cutting edge tech to power your work while developing and advancing your career\nWe manage at eye-level, giving you the chance to work with anyone at the company. Want to pitch an idea to one of WalkMe’s founders or work on a project with our CEO? You’ve come to the right place\nWe recognize that you have a life outside the office. Whether it’s picking up the kids or taking some time off for yourself, we make sure you keep your work-life balance\nAs one of the world’s leading SaaS companies, WalkMe enables you to partner with some of the most creative, innovative, and dedicated people in the business. And when we’re not hard at work powering digital adoption, you’ll find us relaxing with a cup of coffee\nAnd that’s just the beginning! We could go on and on, but it would probably be easier to just apply and find out moreShow more Report"}, {"company": "Seperia", "job": "Product Marketing TL", "city": "Herzliya", "date": "30d", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=216&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_da55f2d9&cb=1676381482263&jobListingId=1008382429412&jrtk=3-1-1gp81ur5kkbnu801-1go9hp4vgk61l800-ec7278a1546ae2dc-", "description": "Who We Are:\n\nSeperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for an ambitious and talented Product Marketing Team Lead to join the team.\n\nWhat You Will Do:\n\nLeading a small team of Project Managers, including (but not limited to): hiring, training and responsibility for personal development.\nDrive the execution of our products (review sites) through their entire lifecycle: market research, competitive analysis, planning, positioning, roadmap development and ongoing product optimization.\nManage communication with international brands, evaluate their performance metrics, and drive product monetization.\nAnalyze users’ needs, web page performance, market trends and partnerships from an ROI perspective.\nEstablish project management processes, data-driven & measurability as a culture in your team.\nWork closely with external development teams to track progress and ensure timely and high-quality deliverables.\nWork closely with marketing teams, design and finance.\n\nWhat You Need:\n\nGreat written & verbal communication skills (Hebrew & English) – must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n2+ years of experience in web product management, marketing project management or global website management – must.\nManagerial experience – must.\nWeb-savvy individual.\nTechnical capabilities & experience working with developers.\n\nExtra beneficial skills:\n\nExperience in managing websites via WordPress.\nKnowledge in online advertising.\n\nWhat We Offer:\n\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance product company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}, {"company": "Procter & Gamble", "job": "Brand Manager P&G Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=217&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f4326239&cb=1676381484451&jobListingId=1008106611857&jrtk=3-1-1gp81utamkbl2801-1go9hp4vgk61l800-adf41c909c3f2027-", "description": "Are you looking for meaningful work? Come to P&G where Brand Management was born!\nDid you know P&G invented the concept of branding and data-driven brand management? Over the years, we have remained consistently among the top in marketing by finding new and exciting ways to reach consumers.\nAs a Brand Manager, you will be responsible for making sure we win with consumers' preferences in each of the following areas: When they learn about our product, When they choose to buy the product, When they use the product at home.\nWe are looking for the world's best marketing pros who follow one simple concept: \"Consumer is boss\".\nWorking in brand management at Procter & Gamble means being more than just a marketer, it means being a total business owner. We need someone who is dedicated and who can guide the vision and strategy behind a brand by developing marketing plans and driving innovation. Our Assistant Brand Managers need to work regularly across functions to identify consumer, shopper, and customer insights and execute marketing tactics that will continue to grow your brand profitably.\nTogether, we'll continue to create leading brand experiences and make a difference for nearly 5 billion consumers every single day. Pretty cool, right?\nWhat we offer you:\nResponsibilities from Day 1 – You will start of working on key brands from the beginning. Over time, as you expand your impact on the business, your responsibility and ownership of a brand will quickly grow.\nRecognized state of the art marketing skills – We will constantly help you improve your marketing knowledge and management abilities.\nContinuous coaching & mentorship– We are passionate about our work. We will make sure you receive both formal training and regular mentorship from your manager and others.\nDynamic and respectful work environment – We live our Purpose, Values, and Principles daily. We value every individual and encourage initiatives promoting agility and work/life balance.\nAs a Brand Manager, you will have opportunity to work on brands, driving the business results. You will engage with multi-disciplinary teams (including Sales, Finance, Product Supply, Advertising, and Media Agencies) to develop top strategies for your brand's success.\nYou will lead a mix of Marketing and Brand Management projects enabling you to show the breadth and depth of your leadership. You will need to derive insights from the data, which will enable brand leaders as they set the direction for brand growth. As your skills increase, you can expect to advance in roles with increased responsibilities. Overall, we want people who aren't afraid to take smart risks and innovate.\nQualifications\n\nWe want someone with:\nStrong academic background\nExcellent visionary, strategic and courageous leadership skills\nStrengths with strategic and analytical thinking\nAn ability to drive innovation and brand growth\nStrong ability to communicate and team capabilities\nUp to 5 years’ experience\nFluency in English\nJob locations:\n\nTel Aviv, Tel Aviv District, Israel Job Type: Full time Job categories: Brand Management/Marketing Req No: R000059810Show more Report"}, {"company": "Artlist", "job": "Junior User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.7", "link": "", "description": "Artlist is a fast-growing creative technology company providing video creators with high-quality music, sound effects, footage and digital assets for video, as well as powerful video and image editing software. With our revolutionary license and cutting-edge creative tools, we’re on the fast track to becoming the ultimate 360 degree solution for video creators.\nToday, Artlist is the go-to licensing provider for creators in over 160 countries. Among our 16M clients are Google, Apple, Nike, Coca-Cola, Ikea, Mercedes, Samsung, Wix, Netflix, Dior and many more.\nArtlist consists of 3 products:\nArtlist.io, a royalty-free music, stock footage platform and SFX platform\nMotionArray.com, an all-in-one marketplace for creators that offers video templates, presets, music, SFX, stock footage, motion graphics and stock photos\nFXhome, a cutting-edge video, VFX and image editing software\nWe’re seeking a full-time Junior User Acquisition Manager to join our Google Marketing Team.\nWake up for this\nManage and expand performance-based marketing campaigns.\nCreate smart ad targeting & compelling ad copy.\nCollect and analyze campaign data to identify optimization steps for future campaigns and new opportunities\nIdentify and respond to changes in market trends & competition.\nWork closely with other departments to optimize performance.\nRequirements:\n\nHighly skilled self-learner, eager to master new concepts independently, naturally analytical, and curious\nA people-person with strong interpersonal skills that can work as part of a team\nAble to manage several projects and interfaces across the marketing team and the company\nOutstanding Excel & data analysis skills (pivot tables, VLOOKUP, etc.)\nHigh level of English (written and spoken)\nFamiliar with Google Analytics and Google Tag Manager - Advantage\nFamiliar with online marketing channels, FB ads and Google Ads - AdvantageShow more Report"}, {"company": "InspHire", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a product data analyst to join an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is responsible for enhancing the business success of the company by ensuring excellence in the performance on all business aspects including marketing, games & product design, retention, monetization, etc. The department builds, operate, and optimize the processes across the entire company through the top of the art analytical capabilities & product understanding.\nResponsibilities\n• Leverage data to understand the company's products in depth, identify areas of opportunity, and execute projects to drive growth and engagement of the company's users\n• Work closely with the product teams to analyze existing features and ensure a successful implementation of new features.\n• Use data to fine-tune and balance the game’s economy, providing economy analysis and drive metrics for revenue optimization\n• Evaluating and measuring A/B testing results and trends among players\n• Build and maintain reports, dashboards, and metrics to monitor the performance of products\n• Be an expert on industry trends and the competitor landscape to evolve the company's thinking\nWhat we expect\n• 2+ years of experience in product analytics in the Online/Gaming industry\n• BA/B.Sc. in Statistics / Math / Engineering / Economics or other quantitative fields\n• Strong SQL with experience in querying large, complex data sets.\n• Strong Excel skill\n• Advanced knowledge in statistical tools and models- advantage\n• Proven experience leading data driven projects from definition\n• High level of analytical and problem-solving skills with strong attention to details\nDesired\n• Experience working with Qlikview – advantage\n• English: Advanced\n• Core competencies: Professionalism, Responsibility, Collaboration and Teamwork, Initiative and Creativity\nPersonal Requirements:\n• Ability to collaborate with colleagues across different disciplines and locations to achieve results\n• Passion for gaming\n• High level of verbal and written English.Show more Report"}, {"company": "8fig", "job": "Product Design", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking a highly experienced and talented Product Designer with at least 3 years of experience in user experience and interactive design. The ideal candidate possesses strategic thinking and a comprehensive understanding of the product development process, from research and prototyping to design and usability testing. Strong communication, organizational, and analytical skills are essential, as the candidate will be expected to continuously learn and focus on solving complex product problems.\nKey Responsibilities:\nConducting user research to understand the needs and pain points of the target audience.\nCreating user personas and journey maps to guide design decisions.\nDesigning wireframes, prototypes, and high-fidelity mockups.\nConducting usability testing to validate design solutions.\nCollaborating with cross-functional teams, including product management, engineering, and marketing.\nCommunicating design decisions and rationale effectively to stakeholders.\nStaying up-to-date with industry trends and best practices in UX design.\nProviding design guidance and mentorship to junior designers.\nParticipating in the entire product development process, from research to launch.\nContinuously iterating on designs based on user feedback and data analysis.\n\nRequirements:\n\n\n3+ years of experience working as a UX designer on SaaS products\nMaster of design tools such as Sketch and Figma\nStrong understanding of user-centered design principles and techniques\nStrong portfolio demonstrating a track record of creating intuitive and user-friendly software\nExcellent interpersonal skills\nExperience with A/B testing and working with data intensive products\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nInterest and background in fintech\nExperience selling products on Amazon, Shopify, BigCommerce…\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Show more Report"}, {"company": "PowerLink Software Ltd", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8baa500f&cb=1676381492453&jobListingId=1008270614038&jrtk=3-1-1gp81v55jjfko801-1go9hp4vgk61l800-53cebd94db61097c-", "description": "We are looking for a true leader who is passionate about people and technology. To be successful you should be curious and an excellent communicator who can earn employees' and clients' trust in order to succeed.\nLead the entire Customer Success department - account managers, professional services, and support teams.Create an environment that encourages and empowers team growth.Shaping and maintaining our customer relations strategy.Build long-term relationships with customers and identify revenue opportunities by maintaining a database of customers.Work in cooperation with sales, product, R&D, and other departments in defining end-to-end processes that align with the business goals.Set KPIs for the teams and provide performance feedback.\nAbout Us:\nPowerlink is an end-to-end business management platform tailored for your business-specific needs. From marketing to sales to customer service, and more, Powerlink makes it easy for your entire business to work together. Each department is powerful on its own, but together they can be explosive. Powerlink was built from the ground up by developers who already knew back in 2011 that there had to be a better way to improve customer relations and decided to develop a software for every need aimed to keep customers delighted. After conquering the local market with more than 2000 satisfied Israeli customers from various industries, we are ready to go global.\n\nOur Customer Success department includes:\nTechnical Support team - the first point of contact for customers.\n\n\nAccount managers team - developing long-term relationships with customers, building loyalty, and ensuring higher customer retention and satisfaction.\n\nTechnical product experts - sharing their extensive knowledge for designing solutions for strategic customers.\nWe are looking for a true leader who is passionate about people and technology to lead the CS department through this adventure.\n\nAre you up for the challenge?\n\nThe Role:\nYour Experience & Skills:\n5+ years of experience in the Customer success world.\n‍\n2+ years of experience in leading a customer-facing team or other managerial experience.\n‍\nProactive, service-minded and enjoy working with people.\n‍\nA technological degree and work experience within a technological environment.\n‍\nA business-oriented thinker with a problem-solving attitude, who can see the bigger picture.\nCapable of translating data into action and explaining how Customer Support is progressing according to KPIs.\nMotivational leader who knows how to deliver exceptional customer service.\nA down-to-earth approach, understanding that it's all about the people.\nExcellent written and verbal communication skills in both Hebrew and English.\nWe Appreciate Those With:\nSay what they think.\nIndependent and proactive in a fast-paced environment.\nFast learner.\nHas excellent interpersonal and presentation skills\nProven track record of building client relationships and being client facing.Show more Report"}, {"company": "Eybna Technologies", "job": "Sales Development Representative - EU", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=222&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8f24b43f&cb=1676381494538&jobListingId=1008156930211&jrtk=3-1-1gp81v74pjor3801-1go9hp4vgk61l800-88c5b3600253f325-", "description": "Full-time\n\nResponsibilities:\n\nQualify leads from marketing campaigns as sales opportunities\n\nContact potential clients through cold calls and emails\n\nPresent our company to potential clients\n\nIdentify client needs and suggest appropriate products/services\nCustomize product solutions to increase customer satisfaction\nBuild long-term trusting relationships with clients\nProactively seek new business opportunities in the market\nSet up meetings or calls between (prospective) clients and Account Executives\nReport to the Regional Sales Manager on (weekly/monthly/quarterly) sales results\nStay up-to-date with new products/services and new pricing/payment plans\n\nQualifications:\n\nProven work experience as a Business Development Representative or similar role\n\nHands-on experience with multiple sales techniques (including cold calls)\n\nTrack record of achieving sales quotas\n\nExperience with CRM software (e.g. Pipedrive or Salesforce)\n\nFamiliarity with MS Excel (analyzing spreadsheets and charts)\n\nUnderstanding of sales performance metrics\n\nExcellent communication and negotiation skills\n\nAbility to deliver engaging presentationsShow more Report"}, {"company": "Finonex", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "4.0", "link": "", "description": "We are growing and looking for a brilliant Data Analyst to join our fast-growing company and Data department.\nAs part of this position, you will work closely with multiple business units/products which are from Finonex's internal innovation home or post Acquisitions products.\nYou will support all analytical needs of these units, such as: defining the analytical layer, marketing & product analytics needs, and mostly on business questions.\nRequirements:\n\n3+ years of experience as a business analyst (online industry advantage)Vast knowledge and hands experience in SQL including complex queries from multiple data sources- MustExpert level with reporting platforms and data visualization - Must (Pyramid strong advantage)Excellent analytical skillsHigh presentation and communication skillsFluent in English communication, written and verbal.\n\nOn this role you will:\n\nSupport several different units and products by natureData analyst focal for Business units & engineering related teamsProactively provide insights that will lead the business growthAbility to module and simulate new features & opportunities estimated impactBuild and maintain reporting and dashboardsManage multiple tasks at a time in fast-pacedConduct deep dive analysis with actionable recommendations and conclusions\nWill be nice that you have:\n\nExpert level in working with Big data tools (advantage)Experience with GA and Product analytics tools (Mixpanel/ Amplitude/Heap)\nExperience in the online industryShow more Report"}, {"company": "Moburst", "job": "Marketing Director", "city": "Israel", "date": "18d", "rating": "4.4", "link": "", "description": "Moburst is a global mobile & digital marketing agency that helps companies grow their business. The most prestigious brands and startups in the world such as Google, Samsung, Discovery and Uber are leveraging our mobile & digital strategy, product, creative, organic and media services to enhance their product and maximize their KPIs.\nWe're looking for a talented Marketing Director to join our team Sales & Marketing team!\nResponsibilities:\nHelp us show why Moburst is the best growth agency in the world by achieving international awards and recognitions\nBuild and drive the marketing strategy of Moburst\nDevelop short, medium and long-term demand generation strategies\nManage the marketing budget and measure the success of marketing activities, with metrics such as ROI on campaigns and events, and production of marketing materials\nDevelop and deliver our marketing calendar that includes campaigns, events, (paid) social campaigns, and content materials\nManaging our Work efficiently and proficiently with marketing technology and tools, such as Hubspot\nManage PR and social media efforts\nManage our website and email marketing roadmap\nDeliver against agreed-upon timelines, schedules, and expectations\nAdditional duties as assigned to help ensure the office runs smoothly and efficiently with new client opportunities such as big RFPs\nRequirements:\n4-5 years of experience as a Marketing Manager in B2B marketing, and/or product marketing\nExperience working with the US market\nExcellent copywriting, editing, and proofreading skills\nProficiency with G-Suite apps\nExcellent command of English\nIndependent self-starter and team player who can hit the ground running\nA willingness to roll up the sleeves and deliver, passionate about building an effort from the ground up\nAbility to think tactically and strategically, as well as practically and operationally\nExperience with digital marketing tools, such as Google Analytics, Google Tag Manager, WordPress, etc\nWebmaster and desktop publishing skills, including familiarity with Adobe Creative Suite - advantage\nFamiliarity with digital and mobile marketing - advantageShow more Report"}, {"company": "Eybna Technologies", "job": "Marketing Intern", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=225&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_40160c18&cb=1676381498605&jobListingId=1008156930182&jrtk=3-1-1gp81vb5rp6dd801-1go9hp4vgk61l800-a8629c073121de32-", "description": "Full-time Internships\n\nResponsibilities:\n\nCollect quantitative and qualitative data from marketing campaigns\n\nPerform market analysis and research on the competition\n\nSupport the marketing team in daily administrative tasks\n\nAssist in marketing and advertising promotional activities (e.g. social media, direct mail, and web)\n\nPrepare promotional presentations\n\nHelp distribute marketing materials\n\nManage and update company database and customer relationship management systems (CRM)\n\nHelp organize marketing events\n\n\nQualifications:\n\nStrong desire to learn along with a professional drive\n\nSolid understanding of different marketing techniques\n\nExcellent verbal and written communication skills\n\nExcellent knowledge of MS Office\n\nFamiliarity with marketing computer software and online applications (e.g. CRM tools, Online analytics, and Google Adwords)\n\nPassion for the marketing industry and its best practices\n\nCurrent enrollment in a related BS or Master’s degreeShow more Report"}, {"company": "Fortinet", "job": "Field Marketing Specialist - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=226&ao=1136043&s=58&guid=00000186131c93749faae3fc412da50e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1738c711&cb=1676381500054&jobListingId=1008343684228&jrtk=3-1-1gp81vchrj45o801-1go9hp4vgk61l800-7c5d4b63d6ff8a8c-", "description": "Field Marketing Specialist – Israel\nFortinet (NASDAQ: FTNT) makes possible a digital world that we can always trust through its mission to protect people, devices, and data everywhere . This is why the world’s largest enterprises, service providers, and government organizations choose Fortinet to securely accelerate their digital journey. The Fortinet Security Fabric platform delivers broad, integrated, and automated protections across the entire digital attack surface, securing critical devices, data, applications, and connections from the data center to the cloud to the home office. Ranking #1 in the most security appliances shipped worldwide, more thank 595,000 customers trust Fortinet to protect their businesses. And the Fortinet NSE Training Institute, an initiative of Fortinet’s Training Advancement Agenda (TAA), provides one of the largest and broadest training programs in the industry to make cyber training and new career opportunities available to everyone. Learn more at https://www.fortinet.com , the Fortinet Blog , and FortiGuard Labs .\nTo accompany our exponential growth in the Israel region, Fortinet EMEA Marketing is seeking a Field Marketing Specialist in the IT Industry to help further expand our customer and market footprint in the Israeli market by focusing on brand awareness as well as lead and pipeline building activities. The right candidate for this role combines strategic thinking and tactical execution skills.\nBased in Herzliya office, this position will report to the Sr. Field Marketing Manager – Eastern Europe, Israel & Greece. The Field Marketing Specialist will be working closely with sales to understand their targets, priorities and key accounts and collaborate with various EMEA marketing departments. Will be also working with the channel team to lead and coordinate all channel marketing to and through Fortinet distributor and reseller base.\nResponsibilities\nDevelop and drive integrated marketing programs which consist of best practice marketing mix elements that generate quality prospects\nLeverage and localize a repeatable and systematic set of programs to drive demand with the right balance between in country and global campaigns\nManage key marketing activities like lead gen campaigns, events (virtual and physical), industry conferences and sponsorships\nProvide reporting and analysis on Field Marketing Activities\nGeneral coordination of events such as end customer days and industry conferences. This includes the preparation and follow up for each event\nWork closely with sales team on VLE & Enterprise patch to build “C” level connects\nSocial Media usage and PR knowledge in collaboration with the PR EMEA team\nWorking with Fortinet Automation and Creative team to create Invitations and approve branding when needed for events\nManaging and developing programs offered by Fortinet to distribution channel and customer facing partners (SIs, VARs, MSSPs, Telcos …) to increase revenues and brand preference\nAnalyze and measure results of channel partner related activities, in close cooperation with their respective account managers\nManaging and organizing Fortinet’s presence at partner conferences and events, supporting channel partners in organizing seminars and events, and leading the production of event materials\nCoordinating content creation for various purposes and tools as needed (eg. sales or marketing materials, advertorials, catalogues, channel and end user campaigns, websites)\nOther duties in assisting the marketing team\nProfile / Education / Experience\nAt least 8 years’ experience in IT Marketing/high-tech, preferably IT-Security\nComplete understanding and demonstrated track record across all tactics, with integrated marketing, communications, and PR tactics to drive the pipeline: digital campaigns, call out campaigns, event management, high-touch tactics, etc.\nDemonstrated success in driving marketing campaigns and promotions to meet the revenue goals of sales teams\nProven Channel Marketing experience including building marketing plans, follow-up and measurement with distributors and partners\nStrong business acumen\nAbility to work cross-functionally to plan and execute successful marketing programs\nAbility to manage the planning and execution of programs in a deadline-driven environment\nPositive attitude, strong work ethic, responsive, strong organization and communication skills\nKnowledge of CRM/sales/email automation systems and how to maximize them for efficient lead distribution and reporting (SFDC or any other automation tool experience a plus)\nGood English language communication skills, both written and oral\nProficient use of MS Office applicationsShow more Report"}, {"company": "Zota Technology Limited", "job": "Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": "Zotapay is a world-standard financial technology company connected to more than 1000 financial institutions and banks around the world, active in 150 countries globally and with 6 regional headquarters. We assist and support online companies with a wide range of Alternative Payment Methods that suit their specific needs and those of their customers, regardless of their location.\n\nWe are seeking an experienced, innovative and results driven Marketing Manager to join us in our Tel Aviv headquarters.\n\nAs Marketing Manager, you will apply your expert marketing skills with a talented team to grow our business, optimise marketing strategies and manage the departments budget and projects.\n\nWhat will you be doing?\nGenerate new business leads across multiple platforms.\nConceptualise and manage multichannel campaigns across the prospect lifecycle, ensuring clear alignment of communication and messaging across all channels.\nCreate, monitor, and optimise existing advertising PPC campaigns across different platforms.\nWork and monitor SEO and other marketing service providers.\nGather market insights to inform outreach strategies, increase conversions, and generate qualified leads for the Sales and Business Development teams.\nOngoing measurement and optimisation based on relevant business KPIs.\nUpdate and monitor company marketing material (sales decks, one-pagers, brochures, white-papers, banners, videos, etc.)\nWebsite maintenance: regular blog updates etc.\n3+ years of proven experience in a global B2B marketing position with hands on know-how executing multi-channel campaigns.\nYou have worked with various platforms, CRMs (Salesforce) and digital marketing platforms (e.g. Google Analytics, Google AdWords, Facebook Adverts Manager), blogging platforms (e.g. Wordpress etc.).\nStrategic mindset: ability to understand program goals and KPI's and craft marketing initiatives that deliver.\nFluent verbal and written English communication skills across all mediums.\nProject management skills with the capacity to manage competing priorities, maintain attention to detail and to meet deadlines.\nKnowledge of growth strategy and a goal orientated vision for the future.\nSuperb leadership and collaboration abilities, strong organisational skills.\nCreative eye, not afraid to bring new ideas to management.Show more Report"}, {"company": "Google", "job": "Product Manager, Data Movement, Google Cloud", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.5", "link": "", "description": ""}, {"company": "", "job": "Content Marketing Leader", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "ריבי גיוס והשמה", "job": "דרוש/ה Head of Creative Marketing | Gaming רמת גן 203203", "city": "Ramat Gan", "date": "30d+", "rating": "", "link": "", "description": "Head of Creative Marketingfor Gaming Company in Ramat-GanKey Responsibilities:New marketing channels DevelopmentExamining the feasibility and implementation of new marketing technologiesConducting competition analysesLead POCsRequired Qualifications:A dreamer, an evangelist who will be a driver for innovation and creativity.Experience in:Strategy, marketing insight, business needs, and marketing channels and technologies.Experience from:Digital marketing, preferably with casino experience but not only.Market analysis - nice to have.* משרה מס׳ #203203 מיועדת לגברים ונשים כאחדסוג המשרה: מלאהShow more Report"}], [{"company": "Seperia", "job": "Product Marketing TL", "city": "Herzliya", "date": "30d", "rating": "4.5", "link": "", "description": "Who We Are:\n\nSeperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for an ambitious and talented Product Marketing Team Lead to join the team.\n\nWhat You Will Do:\n\nLeading a small team of Project Managers, including (but not limited to): hiring, training and responsibility for personal development.\nDrive the execution of our products (review sites) through their entire lifecycle: market research, competitive analysis, planning, positioning, roadmap development and ongoing product optimization.\nManage communication with international brands, evaluate their performance metrics, and drive product monetization.\nAnalyze users’ needs, web page performance, market trends and partnerships from an ROI perspective.\nEstablish project management processes, data-driven & measurability as a culture in your team.\nWork closely with external development teams to track progress and ensure timely and high-quality deliverables.\nWork closely with marketing teams, design and finance.\n\nWhat You Need:\n\nGreat written & verbal communication skills (Hebrew & English) – must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n2+ years of experience in web product management, marketing project management or global website management – must.\nManagerial experience – must.\nWeb-savvy individual.\nTechnical capabilities & experience working with developers.\n\nExtra beneficial skills:\n\nExperience in managing websites via WordPress.\nKnowledge in online advertising.\n\nWhat We Offer:\n\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance product company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}, {"company": "InspHire", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a product data analyst to join an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is responsible for enhancing the business success of the company by ensuring excellence in the performance on all business aspects including marketing, games & product design, retention, monetization, etc. The department builds, operate, and optimize the processes across the entire company through the top of the art analytical capabilities & product understanding.\nResponsibilities\n• Leverage data to understand the company's products in depth, identify areas of opportunity, and execute projects to drive growth and engagement of the company's users\n• Work closely with the product teams to analyze existing features and ensure a successful implementation of new features.\n• Use data to fine-tune and balance the game’s economy, providing economy analysis and drive metrics for revenue optimization\n• Evaluating and measuring A/B testing results and trends among players\n• Build and maintain reports, dashboards, and metrics to monitor the performance of products\n• Be an expert on industry trends and the competitor landscape to evolve the company's thinking\nWhat we expect\n• 2+ years of experience in product analytics in the Online/Gaming industry\n• BA/B.Sc. in Statistics / Math / Engineering / Economics or other quantitative fields\n• Strong SQL with experience in querying large, complex data sets.\n• Strong Excel skill\n• Advanced knowledge in statistical tools and models- advantage\n• Proven experience leading data driven projects from definition\n• High level of analytical and problem-solving skills with strong attention to details\nDesired\n• Experience working with Qlikview – advantage\n• English: Advanced\n• Core competencies: Professionalism, Responsibility, Collaboration and Teamwork, Initiative and Creativity\nPersonal Requirements:\n• Ability to collaborate with colleagues across different disciplines and locations to achieve results\n• Passion for gaming\n• High level of verbal and written English.Show more Report"}, {"company": "8fig", "job": "Product Design", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking a highly experienced and talented Product Designer with at least 3 years of experience in user experience and interactive design. The ideal candidate possesses strategic thinking and a comprehensive understanding of the product development process, from research and prototyping to design and usability testing. Strong communication, organizational, and analytical skills are essential, as the candidate will be expected to continuously learn and focus on solving complex product problems.\nKey Responsibilities:\nConducting user research to understand the needs and pain points of the target audience.\nCreating user personas and journey maps to guide design decisions.\nDesigning wireframes, prototypes, and high-fidelity mockups.\nConducting usability testing to validate design solutions.\nCollaborating with cross-functional teams, including product management, engineering, and marketing.\nCommunicating design decisions and rationale effectively to stakeholders.\nStaying up-to-date with industry trends and best practices in UX design.\nProviding design guidance and mentorship to junior designers.\nParticipating in the entire product development process, from research to launch.\nContinuously iterating on designs based on user feedback and data analysis.\n\nRequirements:\n\n\n3+ years of experience working as a UX designer on SaaS products\nMaster of design tools such as Sketch and Figma\nStrong understanding of user-centered design principles and techniques\nStrong portfolio demonstrating a track record of creating intuitive and user-friendly software\nExcellent interpersonal skills\nExperience with A/B testing and working with data intensive products\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nInterest and background in fintech\nExperience selling products on Amazon, Shopify, BigCommerce…\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Show more Report"}, {"company": "PowerLink Software Ltd", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d4d94625&cb=1676381514829&jobListingId=1008270614038&jrtk=3-1-1gp81vr0lk60h801-1go9hps12gsqj800-53cebd94db61097c-", "description": "We are looking for a true leader who is passionate about people and technology. To be successful you should be curious and an excellent communicator who can earn employees' and clients' trust in order to succeed.\nLead the entire Customer Success department - account managers, professional services, and support teams.Create an environment that encourages and empowers team growth.Shaping and maintaining our customer relations strategy.Build long-term relationships with customers and identify revenue opportunities by maintaining a database of customers.Work in cooperation with sales, product, R&D, and other departments in defining end-to-end processes that align with the business goals.Set KPIs for the teams and provide performance feedback.\nAbout Us:\nPowerlink is an end-to-end business management platform tailored for your business-specific needs. From marketing to sales to customer service, and more, Powerlink makes it easy for your entire business to work together. Each department is powerful on its own, but together they can be explosive. Powerlink was built from the ground up by developers who already knew back in 2011 that there had to be a better way to improve customer relations and decided to develop a software for every need aimed to keep customers delighted. After conquering the local market with more than 2000 satisfied Israeli customers from various industries, we are ready to go global.\n\nOur Customer Success department includes:\nTechnical Support team - the first point of contact for customers.\n\n\nAccount managers team - developing long-term relationships with customers, building loyalty, and ensuring higher customer retention and satisfaction.\n\nTechnical product experts - sharing their extensive knowledge for designing solutions for strategic customers.\nWe are looking for a true leader who is passionate about people and technology to lead the CS department through this adventure.\n\nAre you up for the challenge?\n\nThe Role:\nYour Experience & Skills:\n5+ years of experience in the Customer success world.\n‍\n2+ years of experience in leading a customer-facing team or other managerial experience.\n‍\nProactive, service-minded and enjoy working with people.\n‍\nA technological degree and work experience within a technological environment.\n‍\nA business-oriented thinker with a problem-solving attitude, who can see the bigger picture.\nCapable of translating data into action and explaining how Customer Support is progressing according to KPIs.\nMotivational leader who knows how to deliver exceptional customer service.\nA down-to-earth approach, understanding that it's all about the people.\nExcellent written and verbal communication skills in both Hebrew and English.\nWe Appreciate Those With:\nSay what they think.\nIndependent and proactive in a fast-paced environment.\nFast learner.\nHas excellent interpersonal and presentation skills\nProven track record of building client relationships and being client facing.Show more Report"}, {"company": "Eybna Technologies", "job": "Sales Development Representative - EU", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=305&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1a4150c7&cb=1676381516320&jobListingId=1008156930211&jrtk=3-1-1gp81vsa3g2fb801-1go9hps12gsqj800-88c5b3600253f325-", "description": "Full-time\n\nResponsibilities:\n\nQualify leads from marketing campaigns as sales opportunities\n\nContact potential clients through cold calls and emails\n\nPresent our company to potential clients\n\nIdentify client needs and suggest appropriate products/services\nCustomize product solutions to increase customer satisfaction\nBuild long-term trusting relationships with clients\nProactively seek new business opportunities in the market\nSet up meetings or calls between (prospective) clients and Account Executives\nReport to the Regional Sales Manager on (weekly/monthly/quarterly) sales results\nStay up-to-date with new products/services and new pricing/payment plans\n\nQualifications:\n\nProven work experience as a Business Development Representative or similar role\n\nHands-on experience with multiple sales techniques (including cold calls)\n\nTrack record of achieving sales quotas\n\nExperience with CRM software (e.g. Pipedrive or Salesforce)\n\nFamiliarity with MS Excel (analyzing spreadsheets and charts)\n\nUnderstanding of sales performance metrics\n\nExcellent communication and negotiation skills\n\nAbility to deliver engaging presentationsShow more Report"}, {"company": "Finonex", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "4.0", "link": "", "description": "We are growing and looking for a brilliant Data Analyst to join our fast-growing company and Data department.\nAs part of this position, you will work closely with multiple business units/products which are from Finonex's internal innovation home or post Acquisitions products.\nYou will support all analytical needs of these units, such as: defining the analytical layer, marketing & product analytics needs, and mostly on business questions.\nRequirements:\n\n3+ years of experience as a business analyst (online industry advantage)Vast knowledge and hands experience in SQL including complex queries from multiple data sources- MustExpert level with reporting platforms and data visualization - Must (Pyramid strong advantage)Excellent analytical skillsHigh presentation and communication skillsFluent in English communication, written and verbal.\n\nOn this role you will:\n\nSupport several different units and products by natureData analyst focal for Business units & engineering related teamsProactively provide insights that will lead the business growthAbility to module and simulate new features & opportunities estimated impactBuild and maintain reporting and dashboardsManage multiple tasks at a time in fast-pacedConduct deep dive analysis with actionable recommendations and conclusions\nWill be nice that you have:\n\nExpert level in working with Big data tools (advantage)Experience with GA and Product analytics tools (Mixpanel/ Amplitude/Heap)\nExperience in the online industryShow more Report"}, {"company": "Moburst", "job": "Marketing Director", "city": "Israel", "date": "18d", "rating": "4.4", "link": "", "description": "Moburst is a global mobile & digital marketing agency that helps companies grow their business. The most prestigious brands and startups in the world such as Google, Samsung, Discovery and Uber are leveraging our mobile & digital strategy, product, creative, organic and media services to enhance their product and maximize their KPIs.\nWe're looking for a talented Marketing Director to join our team Sales & Marketing team!\nResponsibilities:\nHelp us show why Moburst is the best growth agency in the world by achieving international awards and recognitions\nBuild and drive the marketing strategy of Moburst\nDevelop short, medium and long-term demand generation strategies\nManage the marketing budget and measure the success of marketing activities, with metrics such as ROI on campaigns and events, and production of marketing materials\nDevelop and deliver our marketing calendar that includes campaigns, events, (paid) social campaigns, and content materials\nManaging our Work efficiently and proficiently with marketing technology and tools, such as Hubspot\nManage PR and social media efforts\nManage our website and email marketing roadmap\nDeliver against agreed-upon timelines, schedules, and expectations\nAdditional duties as assigned to help ensure the office runs smoothly and efficiently with new client opportunities such as big RFPs\nRequirements:\n4-5 years of experience as a Marketing Manager in B2B marketing, and/or product marketing\nExperience working with the US market\nExcellent copywriting, editing, and proofreading skills\nProficiency with G-Suite apps\nExcellent command of English\nIndependent self-starter and team player who can hit the ground running\nA willingness to roll up the sleeves and deliver, passionate about building an effort from the ground up\nAbility to think tactically and strategically, as well as practically and operationally\nExperience with digital marketing tools, such as Google Analytics, Google Tag Manager, WordPress, etc\nWebmaster and desktop publishing skills, including familiarity with Adobe Creative Suite - advantage\nFamiliarity with digital and mobile marketing - advantageShow more Report"}, {"company": "Eybna Technologies", "job": "Marketing Intern", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=308&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8ac95eac&cb=1676381520620&jobListingId=1008156930182&jrtk=3-1-1gp8200kakcng801-1go9hps12gsqj800-a8629c073121de32-", "description": "Full-time Internships\n\nResponsibilities:\n\nCollect quantitative and qualitative data from marketing campaigns\n\nPerform market analysis and research on the competition\n\nSupport the marketing team in daily administrative tasks\n\nAssist in marketing and advertising promotional activities (e.g. social media, direct mail, and web)\n\nPrepare promotional presentations\n\nHelp distribute marketing materials\n\nManage and update company database and customer relationship management systems (CRM)\n\nHelp organize marketing events\n\n\nQualifications:\n\nStrong desire to learn along with a professional drive\n\nSolid understanding of different marketing techniques\n\nExcellent verbal and written communication skills\n\nExcellent knowledge of MS Office\n\nFamiliarity with marketing computer software and online applications (e.g. CRM tools, Online analytics, and Google Adwords)\n\nPassion for the marketing industry and its best practices\n\nCurrent enrollment in a related BS or Master’s degreeShow more Report"}, {"company": "Fortinet", "job": "Field Marketing Specialist - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=309&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_17f16777&cb=1676381521830&jobListingId=1008343684228&jrtk=3-1-1gp8201qok6ep801-1go9hps12gsqj800-7c5d4b63d6ff8a8c-", "description": "Field Marketing Specialist – Israel\nFortinet (NASDAQ: FTNT) makes possible a digital world that we can always trust through its mission to protect people, devices, and data everywhere . This is why the world’s largest enterprises, service providers, and government organizations choose Fortinet to securely accelerate their digital journey. The Fortinet Security Fabric platform delivers broad, integrated, and automated protections across the entire digital attack surface, securing critical devices, data, applications, and connections from the data center to the cloud to the home office. Ranking #1 in the most security appliances shipped worldwide, more thank 595,000 customers trust Fortinet to protect their businesses. And the Fortinet NSE Training Institute, an initiative of Fortinet’s Training Advancement Agenda (TAA), provides one of the largest and broadest training programs in the industry to make cyber training and new career opportunities available to everyone. Learn more at https://www.fortinet.com , the Fortinet Blog , and FortiGuard Labs .\nTo accompany our exponential growth in the Israel region, Fortinet EMEA Marketing is seeking a Field Marketing Specialist in the IT Industry to help further expand our customer and market footprint in the Israeli market by focusing on brand awareness as well as lead and pipeline building activities. The right candidate for this role combines strategic thinking and tactical execution skills.\nBased in Herzliya office, this position will report to the Sr. Field Marketing Manager – Eastern Europe, Israel & Greece. The Field Marketing Specialist will be working closely with sales to understand their targets, priorities and key accounts and collaborate with various EMEA marketing departments. Will be also working with the channel team to lead and coordinate all channel marketing to and through Fortinet distributor and reseller base.\nResponsibilities\nDevelop and drive integrated marketing programs which consist of best practice marketing mix elements that generate quality prospects\nLeverage and localize a repeatable and systematic set of programs to drive demand with the right balance between in country and global campaigns\nManage key marketing activities like lead gen campaigns, events (virtual and physical), industry conferences and sponsorships\nProvide reporting and analysis on Field Marketing Activities\nGeneral coordination of events such as end customer days and industry conferences. This includes the preparation and follow up for each event\nWork closely with sales team on VLE & Enterprise patch to build “C” level connects\nSocial Media usage and PR knowledge in collaboration with the PR EMEA team\nWorking with Fortinet Automation and Creative team to create Invitations and approve branding when needed for events\nManaging and developing programs offered by Fortinet to distribution channel and customer facing partners (SIs, VARs, MSSPs, Telcos …) to increase revenues and brand preference\nAnalyze and measure results of channel partner related activities, in close cooperation with their respective account managers\nManaging and organizing Fortinet’s presence at partner conferences and events, supporting channel partners in organizing seminars and events, and leading the production of event materials\nCoordinating content creation for various purposes and tools as needed (eg. sales or marketing materials, advertorials, catalogues, channel and end user campaigns, websites)\nOther duties in assisting the marketing team\nProfile / Education / Experience\nAt least 8 years’ experience in IT Marketing/high-tech, preferably IT-Security\nComplete understanding and demonstrated track record across all tactics, with integrated marketing, communications, and PR tactics to drive the pipeline: digital campaigns, call out campaigns, event management, high-touch tactics, etc.\nDemonstrated success in driving marketing campaigns and promotions to meet the revenue goals of sales teams\nProven Channel Marketing experience including building marketing plans, follow-up and measurement with distributors and partners\nStrong business acumen\nAbility to work cross-functionally to plan and execute successful marketing programs\nAbility to manage the planning and execution of programs in a deadline-driven environment\nPositive attitude, strong work ethic, responsive, strong organization and communication skills\nKnowledge of CRM/sales/email automation systems and how to maximize them for efficient lead distribution and reporting (SFDC or any other automation tool experience a plus)\nGood English language communication skills, both written and oral\nProficient use of MS Office applicationsShow more Report"}, {"company": "Zota Technology Limited", "job": "Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": "Zotapay is a world-standard financial technology company connected to more than 1000 financial institutions and banks around the world, active in 150 countries globally and with 6 regional headquarters. We assist and support online companies with a wide range of Alternative Payment Methods that suit their specific needs and those of their customers, regardless of their location.\n\nWe are seeking an experienced, innovative and results driven Marketing Manager to join us in our Tel Aviv headquarters.\n\nAs Marketing Manager, you will apply your expert marketing skills with a talented team to grow our business, optimise marketing strategies and manage the departments budget and projects.\n\nWhat will you be doing?\nGenerate new business leads across multiple platforms.\nConceptualise and manage multichannel campaigns across the prospect lifecycle, ensuring clear alignment of communication and messaging across all channels.\nCreate, monitor, and optimise existing advertising PPC campaigns across different platforms.\nWork and monitor SEO and other marketing service providers.\nGather market insights to inform outreach strategies, increase conversions, and generate qualified leads for the Sales and Business Development teams.\nOngoing measurement and optimisation based on relevant business KPIs.\nUpdate and monitor company marketing material (sales decks, one-pagers, brochures, white-papers, banners, videos, etc.)\nWebsite maintenance: regular blog updates etc.\n3+ years of proven experience in a global B2B marketing position with hands on know-how executing multi-channel campaigns.\nYou have worked with various platforms, CRMs (Salesforce) and digital marketing platforms (e.g. Google Analytics, Google AdWords, Facebook Adverts Manager), blogging platforms (e.g. Wordpress etc.).\nStrategic mindset: ability to understand program goals and KPI's and craft marketing initiatives that deliver.\nFluent verbal and written English communication skills across all mediums.\nProject management skills with the capacity to manage competing priorities, maintain attention to detail and to meet deadlines.\nKnowledge of growth strategy and a goal orientated vision for the future.\nSuperb leadership and collaboration abilities, strong organisational skills.\nCreative eye, not afraid to bring new ideas to management.Show more Report"}, {"company": "Google", "job": "Product Manager, Data Movement, Google Cloud", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.5", "link": "", "description": ""}, {"company": "", "job": "Content Marketing Leader", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "ריבי גיוס והשמה", "job": "דרוש/ה Head of Creative Marketing | Gaming רמת גן 203203", "city": "Ramat Gan", "date": "30d+", "rating": "", "link": "", "description": "Head of Creative Marketingfor Gaming Company in Ramat-GanKey Responsibilities:New marketing channels DevelopmentExamining the feasibility and implementation of new marketing technologiesConducting competition analysesLead POCsRequired Qualifications:A dreamer, an evangelist who will be a driver for innovation and creativity.Experience in:Strategy, marketing insight, business needs, and marketing channels and technologies.Experience from:Digital marketing, preferably with casino experience but not only.Market analysis - nice to have.* משרה מס׳ #203203 מיועדת לגברים ונשים כאחדסוג המשרה: מלאהShow more Report"}, {"company": "SQream Technologies", "job": "MARKETING", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c591d250&cb=1676381529891&jobListingId=1008343248494&jrtk=3-1-1gp8209lkjorc801-1go9hps12gsqj800-ade5adec65071388-", "description": "DESCRIPTION\nSQream is looking for a highly motivated and experienced VP of Marketing to join the leadership team to lead and scale its global marketing activities with strong experience in brand strategy and ABM. As the VP of Marketing at SQream together with a team of marketers, you will work closely with the product team and sales and bus dev team to:\nDevelop the marketing strategy taking into account:\nFocus on key geographics\nFocus on targeted accounts\nDefine targeted personas\nDefine user journey\nDefine integrated marketing plan across the field and digital activities\nDevelop and maintain the SQream brand and messaging:\nConsistency across all channels\nInternal communication\nDefine demand gen plan to support sales:\nAnalysis across the user journey - (knowledge of automation systems, setting KPI, Scoring and defining MaL and MQL’s\nHas proven success generating ROI positive demand through a diverse set of both offline (partners, events, etc.) and digital channels (email, paid and organic search, display media, social, community, and distributed content marketing).\nProven success executing ABM campaigns in collaboration with Sales and Account Management.\nPlan and manage the execution of all digital campaigns across a variety of channels.\nKnow how to gain alignment among key stakeholders and then execute the brand vision by driving adoption throughout the organization at all levels\nContent Marketing\nManage the team to create engaging content for Tof, Mof , Bof activities.\nEvents:\nManage the company's global events plan including virtual, industry, and F2F meetups to support the strategic objectives set by the company\nPR:\nManage the communication\n cadence covering:\nThought leadership plan\nPartnerships\nProduct releases\nAR:\nManage AR activity plan for tier one, two, and three analysts as a “Salesperson Marketer”, acting as a leader to align Marketing and Sales teams toward common goals and KPIs.o\nREQUIREMENTS\nHigh energy, charismatic, innovative, creative individual.\n5+ years of experience in leading a highly skilled and diverse marketing department in a tech company\nExperience in Enterprise software\nExperience in the big data space is a big advantage\nExcellent English speaking and writing skills and experience with SAAS products\nHas worked on a global scale\nExperience with digital and traditional marketing and the use of marketing automation\nExperience with using marketing analytics to make the right decisions\nExperience with Customer Marketing (Up-Sell, Cross-Sell, Retention) is a plus\nChannel/Partner Marketing and Enablement Marketing Experience is a plus\nCollaborative leader, especially with product and sales\nTrack record building and leading great teams\nHQ of SQream is based in the heart of Tel AvivShow more Report"}, {"company": "Experis Perm", "job": "Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.7", "link": "", "description": ""}, {"company": "Fortinet", "job": "Business Development Manager Secops - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=316&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c098220&cb=1676381532812&jobListingId=1007733359363&jrtk=3-1-1gp820cigi14l801-1go9hps12gsqj800-337a1c555d1d01a1-", "description": "Business Development Manager SecOps – Israel\nLocation: Herzliya / Israel\nLanguage/s: Fluent English and Hebrew\nThe Business Development Manager is responsible for establishing relationships with large and medium sized businesses (customers/partners) on behalf of Fortinet as well as maintaining and growing business with install base partners/customers.\nThis role will sell the breadth of Fortinet’s capabilities, with specific focus network security, EDR, SIEM, SOAR and SecOPs in general. The role holder will manage the engagement and development of significant deals and have an outstanding track record of selling complex solutions and services in full collaboration with the in territory team of Major Account Managers, Channel Managers and Presales team.\nOver time, there will be more and more Fortinet partners/customers whom have legacy infrastructure to run their workloads, but want to transform into the new agile, digital world. To ensure there is a stronger “pull” towards new world over legacy (ensuring long term customer/journey and revenues), we would need a BDM whose primary focus is on the digital world but also has legacy world experience. From an outside perspective, this will look smooth and consistent to our partners/customers/prospects.\nOverall sales/technical expertise\nHas held various roles across numerous sectors and consultancy experience desirable\nSuccess track record in growing business in an international IT vendor\nWhilst big organization experience is desirable for our high growth ambition, we require other more important factors relating to a new BDM role: in our mind, a BDM whom specializes in Security and everything encapsulating the new, digital world must possess the following skills/experience/qualities because they will be engaging with our future partner/prospects/customers and selling the future digital vision:\nQualified and expertise in Security Operations solutions\nUnderstanding of modern methodologies and movements such as: design thinking, agile and lean business models as this is even more important to partners/customers and proposals;\nUnderstanding of current and in future technologies such as: AI such as machine learning, container security etc…;\nUnderstanding of SD-WAN and SASE is a plus.\nExperience in complex digital transformations\nPartners with Sales and other regional/global deal desk to structure highly complex transactions, with multi country deployments.\nTrain the sales teams on our process and tools, designed to make them successful in global engagements.\nWork cross-functionally with internal customers and stakeholders for input.\nInteract and manage sales engagement activities across pricing, deal review, legal/contracts\nWork with stakeholders who manage daily quote approval process, non-standard deal requirements, etc\nWork with channel partners to get quotes for international customer deployments, help standardize quotes\nSustain Field Sales accountability across deal life cycle requirements, help with expeditious deal approval, and assist the sales teams get over any internal hurdles to close the deal.\nDevelop subject matter expertise for the regions on how to execute global deployment effectively and guide sales reps accordingly, develop subject matter expertise for different country regulations and how to best create a consistent view for the end customer\nResponsibilities/Accountabilities\nLead the development of an effective portfolio business plan outlining the strategy for success and maximizing revenues.\nResponsible for ensuring partner/customer satisfaction is maintained at the highest levels.\nDevelop account plans that focus on client relationship development and account growth/retention within install base and net new customers/partners.\nFind and develop profitable new accounts and business opportunities within a channel driven mentality.\nManage and develop a long-term sustainable pipeline of new deals, into both install base and net new partners/customers.\nProvide support to the sales Team on EDR, SIEM, SOAR opportunities\nMaintain close knowledge of the client’s business and Fortinet’s’ service portfolio to ensure alignment of appropriate up selling and cross selling of Fortinet solutions.\nRecord and maintain all relevant information regarding partner/customers and contacts, prospects and suspects in Salesforce.\nEnsure full communication of Fortinet sales & marketing objectives to all partners/customers/accounts.\nDevelop and maintain partner/customer relationships at multiple levels including problem solving and formulation of response to immediate and future partner/customer requirements.\nWorks with third party advisory organizations and attends third party vendor meetings.\nPrepare and deliver sales presentations.\nPrepare partner/customer/ alliance or account planning documents for specific services and solutions.\nMust be motivated, flexible and a self-starter mentality\nHigh level of diligence in translating customer requirements and instructions into quotes\nSFDC/Salesforce.com knowledge would be an advantage\nExperience with Tableau or Clari would be an advantage\nCustomer engagement skills a plus\nExcellent written and verbal communications skills, Knowledge of English is a must\nGoal orientated and self-confident with the ability to work in a fast pace environment\nAble to work independently as well as part of a regional and global team\nAbility to hold peers accountable\nAbility to streamline, grow and manage a successful deal desk function\n#LI-PH1Show more Report"}, {"company": "GlassesUSA", "job": "Influencer Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "", "description": "GlassesUSA.com has been disrupting the traditional eyewear industry, becoming the fastest growing and leading online eyewear retailer in the world with millions of customers. Our cutting edge in-house technologies and data-driven philosophy constantly keep us on the frontline of the global eCommerce B2C industry.\n\n\nAs an Influencer Marketing Manager, you will be responsible for the full life cycle, from initiation to execution of high quality and large-scale partnerships with US-Based Influencers on all social platforms, celebrity activations and cross company projects. Your goal is to deliver creative campaigns at scale that drive traffic, sales, and brand recognition.\n\n\nAn ideal candidate has passion for social media, ecommerce, retail, and fashion, has worked for digital marketing departments of retail brands or content marketing firms, and is experienced with negotiating, executing media campaigns, and optimizing using web analysis and data.\n\n\nWhat You’ll do?\n\n\nResearch, identify, acquire, and maintain new influencer contacts throughout our social media platforms.\nOutreach influencers to expand our network and promote our program while proactively build strong relationships with past, current, and potential influencers.\nAbility to negotiate various pricing models based on data analysis (CPM/Flat/CPC/CPA/Rev Share) and provide strategic insights, set campaign KPIs and ensure they are met.\nExecute technical and operational aspects of campaigns (tracking, assets, follow-up, content review, results analysis).\nOptimize ongoing campaigns incl. analyzing click-stream reports, changes suggestions, etc.\n\n\nRequirements\n\n\n+2 years’ experience in digital department of a global brand.\nPrevious content/PR experience - An advantage.\nPerfect English – spoken and written - A Must\nWell organized & multi-tasking – The ability to self-manage tasks prioritization, weekly and call schedules.\nSales and negotiation skills [In English] are crucial to your success.\nExperience working with one of the following platforms is a plus: AspireIQ, Activate, Impact Radius, and Grin.\nExcellent interpersonal skills and a team player.\n\n\n Role Located in Ramat HaChayal, Tel Aviv, Israel.Show more Report"}, {"company": "PayEm", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "4.8", "link": "", "description": "PayEm is a global procurement and spend management platform that automates finance and procurement processes from request to reconciliation. By reducing friction and tedious tasks for finance and procurement teams, our clients increase productivity, reduce risk and lower operating costs to contribute to business growth. This is an exciting opportunity with a rapidly growing company.\nThe ideal candidate is a creative thinker by heart that is not afraid to work on multiple projects and channels.\nAs a Marketing Designer at PayEm, you will focus on creating disruptive assets that accelerate PayEm’s growth as part of our demand generation efforts. Projects include designing sponsored ads, branded content, social media assets, emails, landing pages, all kinds of online campaigns, branded internal needs, and much more.\nPrimary Responsibilities\nRequirements:\n\n3+ years of experience as a Creative/Marketing/Brand Graphic Designer\nA strong online design portfolio consisting of web-based marketing campaigns and strong graphic principles\nMastery of the Adobe Creative Suite (Photoshop, Illustrator, InDesign, AfterEffects), Figma\nAbility to work effectively under deadlines\nPlan /design projects and build marketing assets that engage our potential users (social media, email marketing, and internal branding)\nEnsure consistency with our brand voice, style, and tone.\nExperience collaborating with multidisciplinary product and marketing teams.\nImaginative, creative, and curious.\nStrong project management skills and the ability to manage multiple projects at once\nWork collaboratively within the marketing team to gather information, understand the end goals and strategize visual communication approaches with the business goals in mind\nAdvantages:\n\nSaaS B2B experience\nWeb / SVG animation experience a plus, using applications such as Adobe After Effect, Lottie positive\nAbout The Role:\n\nDesign and create creative concepts across media: including websites, social ads, email marketing, brand guidelines, etc.\nParticipate in campaign strategy meetings and campaign planning; testing concepts and exploring design and messaging solutions\nBuild upon and grow PayEm’s brand and personality while maintaining our brand style guide for all teams to utilize & reference\nCollaborate with cross-functional teams on project planning, marketing campaigns, sales enablement needs, and digital initiatives from start to finish\nCreate cohesive marketing experiences while developing high-quality assets that power successful campaigns and channel results\nContinuously research new creative campaigns, ad formats, design concepts, and graphic design trends\nIdentify best practices and data-driven insights for creative experimentation\nAct as a champion for high-caliber design throughout PayEm\nExpert knowledge of the creative process and project management\nHighly organized and able to work with a broad team of cross-functional stakeholders\nAbility to manage multiple projects, timelines, and resourcesShow more Report"}, {"company": "Agmatix", "job": "Sales Development Representative", "city": "Ramat Gan", "date": "1d", "rating": "4.0", "link": "", "description": "About Agmatix\nagmatix’s vision is to create best of class sustainable agriculture for the future by making high quality and standardized agronomic data freely available for ag professionals to translate into impact. To do that, agmatix is building a leading digital field trials technology that is revolutionizing data driven agriculture. Our technology disrupts a domain where lack of common language, connectivity and data curation methodologies are significant barriers for improvements. Implementing agmatix solutions will allow agricultural professionals around the world to increase crops yields while reducing environmental damage and improving crop quality over time.\n agmatix is built on a set of 6 core values, we are proud to say we stick to the following:\nCutting Edge- Constant state of mind to improve, grow and learn\nDaring- We strive to change the world with the best solutions, Reshaping the future of agriculture.\nData-Driven- We live and breathe data-driven decisions in everything we do.\nDetermination- We strive to change the world with the best solutions\nRooted- The fabric of our DNA is connected to the principles that matter to our clients, our people, and the planet\nTrustworthy- We are a source of confidence to our clients, our employees, partners, and colleagues\nWhat will you be doing?\nGrow prospect pipeline, generate leads, and identify opportunities.\nPerform daily cold calls and messaging to prospects generated by your research.\nRespond, engage, and qualify inbound leads and inquiries from marketing initiatives.\nPresent product pitches, value proposition, reports, and other valuable data to potential prospects, decision-makers, and influencers in a way that promotes Agmatix’s mission and vision.\nEnsure successful follow-through of the team by maintaining accurate activity and lead qualification information in CRM.\nEnsure the accuracy of management reports by regularly and promptly updating CRM information and pipeline data.\nDevelop and execute a strategic plan to meet monthly, quarterly and annual objectives.\nDevelop and implement comprehensive sales and business development strategies, processes, and best practices across the company.\nAbout you\nHas exceptional communication skills, both verbal and written.\nHas excellent listening skills and a positive and energetic presence.\nDemonstrates ability to explain complex issues clearly.\nYou are a Quick learner with an interest in technology and data solutions.\nYou are fearless - Hop on the phone/Zoom or whatever needed, with new people every single day to explain our value proposition as it relates to each individual you speak with.\nYou must be self-motivated, persistent, able to work independently and eager to learn.\nOwn highly analytical skills: hands-on experience in analyzing data, able to present high-level information from multiple data sources and tactical info.\nYou are a true team player.\nMust have written and spoken English at native level\nHas a desire to work in a fast-changing environment.\nNice to have\n1-2 years of successful experience as a SDR/BDR role.\nExperience working in SaaS B2B companies\nPrior experience with SDR tools (e.g., CRM, Zoominfo, LinkedIn, etc.)\nBachelor or equivalent degree in agronomy, economics, or in a technology-related field is an advantage.Show more Report"}, {"company": "Anyword", "job": "Customer Success Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": "Anyword is an AI text generation platform for marketers.\nMore than 1 billion marketing messages are created every day across digital channels. Most of them are bias-laden, expensive to create, and ineffective.\nAnyword’s artificial intelligence models are capable of analyzing text and understanding its intent and ideal audience. As a result, we can now generate original marketing language that drives action.\nWho we are\nWe’re a team of doers from all walks of life who share a passion for AI and innovation.\nWe firmly believe in personal growth, care deeply about our work, and aspire to be world-class in everything we do.\nThe opportunity\nWe’ve been fortunate to enjoy rapid growth and adoption by thousands of customers, and actually, we’re just getting started. As a Customer Success Manager, you will join a small team that moves fast.\nTogether with the team, you’ll be responsible for some of the most strategic initiatives at the company, provide top-notch service to our customers, and support the rollout of new products to the market.\nYou’ll be expected to execute fast but, more importantly, to solve problems and find long-term solutions that can be implemented as new processes, products, or features. You will also significantly shape the company’s future by creating value for our existing and new customers. And finally, you’ll join us at an exciting and challenging time of fast growth, with ample opportunities to learn and grow with us.\nResponsibilities (or what you’ll be doing):\nHelp customers succeed and provide support on all levels: technical, business, and product\nDeliver excellent support to customers, understand their needs, and ensure their success\nServe as the main point of contact while acting as a liaison between clients and the rest of the Anyword team\nProvide customer training\nMaintain a comprehensive and updated knowledge base\nIdentify customers with growth potential\nWork together with the marketing and product teams to push top customers toward success and high product engagement\nEducate new customers through marketing materials and product documentation\nProvide internal customer feedback\nIntroduce customers to new features\nLeverage data\nAnalyze customer usage data, gather insights and lessons, and establish new processes and product requirements\nRequirements:\n\nQualifications (or what we’re looking for):\nBA/BS degree\n1- 2 years in a SAAS company in a customer-facing role - a must\nExperience with Zendesk - an advantage\nExcellent verbal and written English communication skills\nStrong Excel skills (pivot tables, basic formulas, vlookup)\nAnalytical problem-solving skills\nAbility to quickly execute solutions resourcefully and independently\nHigh level of dedication and determination to succeed\nBasic experience with SQL querying - an advantage\nOutstanding capacity for multitasking\nExperience with Marketo (or equivalent) - an advantage\nPrevious data analysis experience - an advantageShow more Report"}, {"company": "ASM Global", "job": "Business Development Manager", "city": "Central", "date": "15d", "rating": "3.6", "link": "", "description": ""}, {"company": "Castor", "job": "VP Sales", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": ""}, {"company": "Landa", "job": "Content Manager", "city": "Rehovot", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=323&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22b80929&cb=1676381542956&jobListingId=1007956619179&jrtk=3-1-1gp820mejih5h801-1go9hps12gsqj800-95eac03c6cc0c23c-", "description": "DESCRIPTION\nLanda seeks a passionate Content Manager to join our Marketing team.\nIn this role, you will be responsible for writing and editing materials while working in tight collaboration with the sales teams, customers, and other stakeholders globally.\nRESPONSIBILITIES\nIntroduce an approachable, engaging tone that will help shape Landa’s technology brand.\nPlan and manage a content roadmap; support communications, public relations, demand generation, and social media activities.\nWork closely with subject matter experts and the product, sales and marketing teams to drive the development of a wide range of content, including blog posts, ebooks, research-based reports, newsletters, webinars, infographics, videos, case studies, white papers and more.\nREQUIREMENTS\nRelevant bachelor's degree, master's degree - an advantage.4+ years of relevant experience in technology marketing, as part of a global organizationExcellent storytelling skills in English (Hebrew – advantage)Proven experience developing various content to support relevant stakeholdersPrint industry background - an advantageProduct development, media or journalism experience (an advantage)\nATTRIBUTES\nAn innovative approach to content creation across a variety of media and channels\nAbility to work in a fast-paced environment with agility\nSelf-reliant with a strong sense of responsibility\nAbility to work independently\nA strong and high performing team member\nA critical thinker\nResourceful and creativeShow more Report"}, {"company": "HiredScore", "job": "Customer Success Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "HiredScore brings deeply integrated big data and AI solutions to the global Fortune 500. By leveraging data from companies' Human Resources data ecosystem, HiredScore automates and augments the hiring process, enriching recruiters' decisions with smart insights and candidate prioritization grades of A, B, C, or D using deep technology innovations in artificial intelligence and algorithms.\nHiredScore's Artificial Intelligence engine uses past company hiring data, global hiring data, and other data sources including labor market data, employee performance data, and CRM data, to revolutionize the end-to-end recruiting workflow as well as integrate seamlessly with other HR Systems such as chatbots, assessment tests, video interviews, and other automation tools.\nWe’re looking for a highly driven, results-oriented Customer Success Manager to join our growing Customer Success Team in Israel. Our Customer Success Team is the face of HiredScore to our customers and they reflect the “voice of the customer” internally to all cross-functional teams within the organization. They interact directly with our largest clients and stakeholders, facilitate product training for end-users, drive user engagement and adoption, and work with our Product, Marketing, Data Science, Engineering, and Delivery and Revenue teams to identify opportunities for innovation and bring to market new products and capabilities that deliver even more value for our clients. Our CS Team is tasked with ensuring our product remains the best in the industry and that its value and business impact are accurately reflected.\nRoles & Responsibilities:\n\nDevelop, maintain, and own relationships with existing clients to ensure success, satisfaction, and long-term retention.\nWork cross-functionally with Delivery, Product, Data Science, BI, and Engineering Teams + Customer Success Managers to identify opportunities and communicate insights and feedback from our customers to the rest of the company.\nDefine user engagement strategy and execution for your clients in order to grow customers’ adoption of our solution and continuous improvement of customer experience.\nOwn user onboarding, training, and feedback. Own coordination of feedback to drive product enhancements with both internal and external client stakeholders.\nUnderstand client KPIs and goals for product utilization and collaborate with clients to achieve these goals.\n\nWhat You Need:\n\n3+ years of work experience in a B2B SaaS Customer Success, Account Management, or technical account management role supporting enterprise customers.\nMust be fluent in English and able to work with high-level stakeholders in English.\nPassion for and ability to work in a fast-paced, highly entrepreneurial environment with multiple, concurrent priorities.\nExceptional collaboration and communication skills, and the ability to balance customer priorities while maintaining strong cross-functional relationships internally.\nResults-oriented with a strong track record for success in delivering business objectives with the ability to self-manage and execute projects from scratch.\nExcellent presentation and project management skills, ability to deliver impactful business reviews\nExcellent interpersonal skills with exceptional communication skills across all platforms\nExperience in end-user training: 1-on-1s and group training sessions\nStrong analytical experience working with business intelligence and data platforms for customer analysis.\nWillingness to work flexible hours, as needed, with a global team and customer base - later evenings are needed a few times a week to accommodate global clients.\nAdvantages:\n\nProficiency in additional languages\nExperience working with Fortune 500 and global enterprise accounts\nExperience in HR-TechShow more Report"}, {"company": "MatchMe solutions", "job": "Online Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=325&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1b7aa226&cb=1676381545285&jobListingId=1008358028183&jrtk=3-1-1gp820onnp6dn801-1go9hps12gsqj800-a6425893d2f3316e-", "description": "A leading, fast-growing online sales medical company is looking for a talented and creative online marketing team player to head the company's online and social marketing operations. To focus mainly on implementing the company's brand awareness across multiple platforms: online store, corporate website, social pages, email marketing, landing pages, and other marketing collateral, Both for organic and sponsored advertising throughout the net such as Google, LinkedIn, Facebook & Instagram. Job Responsibilities: - Building a strategy and actual implementation of sponsored campaigns on Google and social media. - Responsibility for email marketing and content creation on an ongoing basis.\n\n\nManaging the content and products on the company's websites, regularly uploading new information about new products and developments. - Organizing new leads that come through online marketing activities. Job Requirements: - At least three years of experience in a similar position in a company that works with the international market. - Demonstrated success in a product marketing role.\nExperience and familiarity with website and commerce platforms such as WordPress, Shopify, Joomla, etc. - Excellent written and verbal communication skills in English and Hebrew. - Ability to translate complex concepts into simple, clear and intuitive language. - Strong project management abilities to plan and execute marketing campaigns.\nAdvantage: Skilled in Photoshop, Indesign, Illustrator.\n\nShow more Report"}, {"company": "Ribbon Communications", "job": "Project Manager", "city": "Petah Tikva", "date": "30d+", "rating": "3.9", "link": "", "description": ""}, {"company": "TangoMe", "job": "VIP Account Manager (MENA)", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=327&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f9bba16d&cb=1676381548113&jobListingId=1008444254003&jrtk=3-1-1gp820rg5jc9s801-1go9hps12gsqj800-6de1be0da7c3b1b6-", "description": "DESCRIPTION\nTango is a successful, market leader, a live-streaming Platform with 450+ Million registered users, in an industry projected to reach $240 BILLION in the next couple of years.\nThe B2C platform, based on the best-quality global video technology, allows millions of talented people around the world to create their own live content, engage with their fans and monetize their talents.\nTango live stream was founded in 2018 and is powered by 350+ global employees operating in a culture of growth, learning, and success!\nThe Tango team is a vigorous cocktail of hard workers, creative brains, energizers, geeks, overachievers, athletes, and more. We push the limits to bring our app from “one of the top” to “the leader”.\nThe best way to describe Tango's work style is not to use the word “impossible”. And we believe that success is a thorny path that runs on sleepless nights, corporate parties, tough releases, and of course our users' smiles (and as we are a LIVE app, we truly get to see our users all around the world smiling right in front of us in real-time!).\nDo you want to join the party?\nRESPONSIBILITIES\nManage on a daily basis close relationships and support with our VIP users\nKeep track and monitor the VIP users activity on a daily basis including sales and up-sale promotions\nBuild personal relationships and create a personalized experience for them\nTrack and monitor the VIP players activity on a daily basis\nProvide customer care through various channels and handles\nGather feedback and propose improvements to customer experience\nCross-teamwork with all aspects of marketing, monetization, features, and products\nBuild and deliver ongoing content, promotions, and activities – where the KPI is to bring players to their next level\nREQUIREMENTS\nVIP ACCOUNT Previous experience in B2C gaming, e-commerce, and Live Streaming Industry\nPrevious position in sales or customer support roles\nStrong communicator, customer-centric, proactive, and target driven\nEnglish and Arabic (professional or native) - MUST!\nNice to have:\nPassion for social apps\nKnowledge of additional languages (Indian, Turkish) is an advantage. Ability to travel in the MENA.\nPrior experience with support tools (Zendesk, Intercom, etc)Show more Report"}, {"company": "", "job": "We Are looking for a B2B Account Manager that will be responsible for the following", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=328&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f051a54&cb=1676381549383&jobListingId=1008421959602&jrtk=3-1-1gp820sofkhqv801-1go9hps12gsqj800-5a2095fac8a26517-", "description": "Groove is an established but dynamic company, growing and hiring employees for our groundbreaking, game-changing technology for the online world. This is a great opportunity to develop your skills and grow professionally. * Develop business relationships with company clients/ customers/ providers * Present new opportunities and solutions based on customer feedback and needs * Contribute to the company’s ongoing development in various functions including product development, marketing, operations, support, partnerships, and more * Handle customer complaints, find solutions to their issues, and maintain a positive relationship between both parties for future business ventures. * Build a strong communicator to manage their accounts properly.\n\n\nBe knowledgeable about their company’s products and services to provide customers with the most effective solutions. * Identify and pursue opportunities, prioritize accounts, handle objections, and evaluate campaign effectiveness. * Communicating with clients to ensure that all their needs are understood and addressed * Building strong client relationships to maintain old business and acquire new customers * Collaborating with various internal departments to ensure that they fulfill all customer requests The role requires you to be a creative, self-starter, and with a “can-do” approach. Additional requirement: * Previous experience (In the gaming industry is a bonus) * Strong interpersonal and communication skills * Fluent in English - a must * Working with multiple platforms * Strong organization and time management skills * You must have the ability to multitask while remaining detail-oriented * You are a self-motivated, proactive individual with the ability to manage a large, diverse workload * Positive attitude.\n\nWilling to do what it takes to move the business forward Scope Full-time position @ Ashkelon office. Benefits We offer a friendly work environment, and the chance to work with industry experts and with cutting-edge technologies, building state-of-the-art systems and more. If you love challenges and are thrilled by innovation, we will be happy to welcome you to our growing Groove family. ***Please send cv's in english only***Show more Report"}, {"company": "WalkMe", "job": "Director of Product Marketing", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=329&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8a6fc999&cb=1676381551212&jobListingId=1008403035062&jrtk=3-1-1gp820uhvkbmr801-1go9hps12gsqj800-7da38b22d0ddd95c-", "description": "WalkMe (NASDAQ: WKME) is growing and we want you to join us! Have you ever wanted to work with an industry leader? Well, how about an industry creator?! At WalkMe, we’re not just the leader in digital adoption, we started the digital adoption revolution - enabling organizations to measure, drive, and act to ultimately maximize the impact of their digital transformation and accelerate the return on their software investment. And with over 2,000 clients, including more than a third of Fortune 500 companies, working with us on a daily basis, we’re changing how enterprises interact with their technology.\nSo, if you’re an expert in your field, and looking for an opportunity to work, collaborate, and innovate with some of the most talented people out there, WalkMe is the place for you!\nWe are hiring a Director of Product Marketing to lead and own the product messaging and positioning for the WalkMe Platform. This role will work cross-functionally between Product Management, Marketing, and Sales and will lead a team of product marketers to ensure that we effectively communicate the current and future value of WalkMe’s industry leading Digital Adoption Platform.\n\nWhat will you actually be doing?\nLead a team of product marketers, owning positioning and messaging for the product.\nWork closely with the product management and R&D teams to shape the product roadmap and go-to-market strategy.\nEvangelize the Digital Adoption Platform (DAP) category and product vision in speaking opportunities and conferences and in briefings with prospects, customers, partners, media and industry analysts.\nOwn and manage platform product releases, including product launches and all collateral to support internal education and customer adoption.\nResearch and understand our buyer personas to ensure your product is designed and delivered to create value for them.\nTranslate product functionality and technical details into user benefit and value.\nMeet with customers and drive activities to increase adoption.\nConduct ongoing competitive analysis along with market and customer research.\n\n\nWhat should you bring to the table?\nBachelor's degree required\n7-10 years of experience in a similar product related position at a B2B SaaS company\nExperience managing a team\nPast experience in working closely with executive teams from Product Management, R&D, sales, and marketing\nAbility to work self sufficiently, and excel in a high-paced, always changing environment\nExcellent English written and verbal communication skills no matter the audience or context\n\n\nWhy should you work for WalkMe?\nWe’re ranked by Dun & Bradstreet as one of the TOP 20 software companies to work for in Israel.\nWe were recognized by Deloitte as the 6th fastest growing software company in the world.\nWe’re publicly traded on the Nasdaq stock exchange.\nWe provide you with the latest cutting edge tech to power your work while developing and advancing your career\nWe manage at eye-level, giving you the chance to work with anyone at the company. Want to pitch an idea to one of WalkMe’s founders or work on a project with our CEO? You’ve come to the right place.\nWe recognize that you have a life outside the office. Whether it’s picking up the kids or taking some time off for yourself, we make sure you keep your work-life balance.\n\n\nAs one of the world’s leading SaaS companies, WalkMe enables you to partner with some of the most creative, innovative, and dedicated people in the business. And when we’re not hard at work powering digital adoption, you’ll find us relaxing with a cup of coffee.\n\nAnd that’s just the beginning! We could go on and on, but it would probably be easier to just apply and find out more.\nLearn more about Digital Adoption Platform (DAP)\nTake a look at our company culture\nCheck out the latest WalkMe updatesShow more Report"}, {"company": "Deloitte", "job": "Data Product Manager", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=330&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_94e7da4a&cb=1676381553920&jobListingId=1008421958414&jrtk=3-1-1gp82115ujrp9801-1go9hps12gsqj800-b9f56e11a783a3d9-", "description": "Description\n\nDeloitte Analytics is part of Deloitte Israel consulting practice, and we are looking for a Data Product Manager to join our team.\n\nAs a Data Product Manager, you'll focus on finding ways to leverage data flow throughout an entire product lifecycle, and how to use that data to build and perfect a feature or product.\n\nWhat you Will do:\n\nDefine the business as well as technical requirements for new products and features; write clear and concise product specs, features cards, and other product documentation.\nGuide and work closely with engineering teams throughout the end-to-end development process.\nTranslate requirements of large data initiatives into smaller actionable items.\nEnsure product meets the specified requirements and create success metrics.\nPerform A/B testing, set OKRs and KPIs, track usage to identify opportunities for improvement.\nCommunicate product value to internal and external customers.\nWork with Data Engineering, BI Developers, and cross-functional Product teams to maximize the impact of data use on the project's KPIs.\nLead discovery work around MVP for any new data tools.\nRequirements\nBachelor's degree in a relevant field\n2-4 years of experience as a DATA Product Manager or DATA Product owner\nExperience in DATA analytics\nPassion for solving complex technical issues and understand how great products work behind the scenes\nAbility to drive collaboration across multiple disciplines – data, marketing, operations, and sales.\nA strong understanding of all aspects of DATA product development lifecycle\nFluent English\nExperience working with UX/UI – big advantage\n\nFull time Job\n\nLocation: Tel Aviv, Hybrid\nWe at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.Show more Report"}]]