[[{"company": "Lightricks", "job": "Senior Marketing Data Analyst", "city": "Jerusalem", "date": "6d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=201&ao=1136043&s=58&guid=00000186131ea5d9b61c4e51c31735ff&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_81102356&cb=1676381677537&jobListingId=1008431076985&jrtk=3-1-1gp824pt7k60o801-1go9ht9h92ff8000-bbe7e8fc71d6b067-", "description": "Data: BIJerusalem\nWho we are\n\nLightricks is a pioneer in innovative technology that leads to breakthrough moments throughout the creation process. With a mission to push the limits of technology to reimagine the way creators express themselves, we bring a unique blend of cutting-edge academic research and design to every user experience. Our photo and video editing tools, including Facetune, Videoleap, and Photoleap, offer endless possibilities and inspiration, while our creator services, Popular Pays, provides content creators the ability to partner with brands to monetize their work and talents. We focus on putting creators in the center and empowering them from the moment inspiration strikes.\n\nLightricks’ Marketing team motivates users into action and leads activities such as acquisition, retention, and social media campaigns. We collaborate with influencers and content creators to tell Lightricks’ story, while making sure we connect with our users and potential users wherever they may be.\n\nWe are hiring a Marketing Data analyst to join our marketing analytics team, which is responsible for providing data infrastructure and insights for the entire marketing department. Your recommendations will have a direct impact on all our marketing activities, reaching millions of potential and active users. You will play a key part in the success of our marketing team and Lightricks as a whole.\nWhat you will be doing\nAnalyze large datasets and provide useful actionable recommendations to support the marketing teams goals.\nDevelop data processes and build data infrastructure for the relevant stakeholders.\nBuild and maintain reports, Tableau dashboards, and KPIs to monitor performance.\nTransform abstract questions into quantifiable metrics.\nPlan and analyze effective retention A/B tests in order to improve marketing KPIs.\nUnderstanding marketing requirements and creating useful and planned solutions to address data needs.\nYour skills and experience\nAt least 3+ years of experience as a data analyst in the online industry.\nStrong SQL skills with experience writing complex queries - a must\nExperience with data visualization tools (Tableau, Looker, etc.).\nAbility to analyze data and transform it into insights.\nHigh level of English.\nExperience with data processes and data modeling.\nExperience in a SAAS company - a plus.\nAn academic degree in a quantitative discipline - a plus.Show more Report"}, {"company": "Videocites", "job": "Marketing Lead", "city": "Israel", "date": "20d", "rating": "2.9", "link": "", "description": ""}, {"company": "Natural Intelligence", "job": "Communications Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Fiverr", "job": "Associate Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "4.3", "link": "", "description": "Fiverr is looking for an Associate Product Marketing Manager to join our Growth Team.\nWe're looking for someone who can plan, develop and implement marketing and user experience initiatives, aimed to create better experiences in order to increase retention and conversion rates, and influence uplifts in customer value and engagement.\nThe Associate Product Marketing Manager will be responsible for various plans and activities, from ideation through execution to post analysis, utilizing the available channels and initiating new ones, and monitoring and optimizing our customer performance.\nWe are looking for a motivated, innovative, and results-driven person, with a passion for marketing, user experience, and optimization.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\n1 year of experience as a Product Marketing Manager - a must\nFamiliar with creating GTM strategies for new products and features and experienced in the execution of relevant marketing campaigns and activities.\nStrong analytical skills, highly capable of interpreting data, performing qualitative research, and translating results into actionable key takeaways\nFamiliarity with data system concepts, databases, BI, Usability tests and market research.\nExperience in working with multiple internal partners, including product, design, content, customer success, and support.\nExcellent written and verbal communication skills\nEnglish – Advanced, proficient at a high level\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nBe the voice of (existing and potential) customers; aggregate and synthesize feedback and product ideas from user research, market insights, and extensive product understanding, to assess business impact and influence product development.\nCollaborate with product managers and cross-company partners to develop and launch successful products.\nBe responsible for product’s GTM plans and implementations; manage all aspects of product launches such as messaging, internal communication, collateral, and rollout strategy.\nCollaborate in coordination of testing of new features and products for relevant target audiences. Track product launches and measure their success.\nOrganize and deliver relevant training to ensure internal teams are effectively educated, aligned, and informed on the product perspective messaging.\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Similarweb", "job": "Senior Product Marketing Manager - Shopper Intelligence", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=205&ao=1136043&s=58&guid=00000186131ea5d9b61c4e51c31735ff&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d7ea9f4a&cb=1676381682692&jobListingId=1008421793957&jrtk=3-1-1gp824uskgsq5801-1go9ht9h92ff8000-2ca2965a9562e1aa-", "description": "Similarweb is the leading digital intelligence platform used by over 3500 global customers. Our wide range of solutions power the digital strategies of companies like Google, eBay, and Adidas.\n\nWe help our customers succeed in today's digital world by giving them access to data-driven insights, competitive benchmarks, strategic analysis, and more.\n\nIn 2021, we went public on the New York Stock Exchange, and we haven't stopped growing since!\n\nWe believe in balancing between the flexibility of working from home, and the fun of working together and face to face personal connections. That is why, at Similarweb we have implemented a Hybrid model, in which you work from the office 3 days, and can decide to work from home two days a week. Enjoying the best of both worlds\n\nWhat does the Similarweb Product Marketing Team in Shopper Intelligence do?\n\nYour job will be to demonstrate how Similarweb Shopper Intelligence solves eCommerce professionals' most critical business questions. From the optimization of user acquisition to the epic transformation of your eCommerce strategy - Shopper Intelligence helps you monitor consumer demand, analyze shopper behavior and optimize their onsite search strategies to win in the eCommerce world. We approach product marketing as a mission-critical opportunity to disrupt the market research category, make our customers data-driven superheros, and ultimately let Similarweb's actionable insights speak for themselves.\n\nAs if You will shape the voice and tell the story of Shopper Intelligence's value for SMB brands selling on Amazon.com. You will ensure the entire company speaks the same language when it comes to your product's messaging and positioning. You will lead product launches from alpha to general release, ensure customer-facing teams are trained and ready to sell, and effectively communicate to customers. You will closely collaborate with our product, solutions, marketing and sales teams to define, develop and execute product marketing strategies & plans. You will drive new sales and post purchase engagement and retention initiatives for your products and help educate and grow a healthy user base.\nAs a Senior Product Marketing Manager at Similarweb:\n\nYou will be expected to think and act both strategically and tactically: from the creation of plans, to hands on execution. You must be a self-starter, comfortable with ambiguity in an ever-changing environment, and pay careful attention to detail. You must have the ability to quickly formulate strategies and plans that are backed by data & storytelling and execute across many work functions simultaneously.\n\nBuild a deep understanding of our customers & their use cases, Shopper Intelligence's value proposition, the market, the competition as well as the Amazon ecosystem to help drive customer engagement.\nDevelop and implement lead-generation campaigns and programs that drive customer acquisition while building brand awareness.\nCreate feature positioning, messaging and marketing strategy (based on market factbase and data analysis) and produce content that communicates the value of the Shopper Intelligence platform in our customers' language.\nIdentify marketing strategies and partnerships to accelerate revenue growth and drive traffic to our website in order to activate, onboard, educate, engage, up-sell, and retain customers.\nWork closely with a cross-functional team of product managers, engineers, marketers, business managers, and salespeople to launch features globally.\nPartner with Product on strategy, positioning, differentiation and product launch; Marketing on content & campaigns; Enablement on training; GTM on customer feedback and education\nWork with our Product Education team to create relevant content that successfully educates customers how to onboard and get value from the product.\nThink creatively and analyze data to strategically direct next steps for A/B testing and continually improve performance through optimized messaging and targeting.\n\nWhat will I bring to the team?\n\nAt least 1+ years of experience in product marketing\nExperience in a fast paced B2B SaaS or DaaS company, Ad Tech, or relevant marketing/industry experience (i.e. CPG and Retail or prior experience with Amazon ecommerce a must)\nMust be fluent in digital and social media channels as well as have an understanding of integrated marketing and communications strategies Experience in customer journey mapping a plus, but not required\nCaptivating storytelling, superb communication, & presentation skills\nAble to work independently & autonomously, focusing on key outcomes amidst competing priorities & tight deadlines\nTeam player, strong at facilitating alignment & building relationships across an organization\nAnalytical thinker, excellent problem solving, planning and execution skills\nMotivated & hard working\nAbility to be flexible and adapt to change\n\nWhy choose Similarweb?\n\nWe believe that building a great product and a great company starts with finding amazing people and helping them grow and develop professionally and personally. At Similarweb, you'll be surrounded by curious, witty and passionate people that are hungry to drive real impact. We are proud to have over 800 creative and talented professionals, and we strongly believe in winning together as a way of driving a successful business!\n\nOur Values:\n\nData Driven: We believe data driven decisions are the key to success and we are evangelists for the power of digital insights\nPassionate: We care deeply about what we do, are accountable for our actions and are committed to helping each other\nExcellence: We believe in excellence as a mindset. It's in our nature; and we work hard to make a difference\nWinning Together: We know what it takes to build a great company and a great product and it begins with valuing each and every member of our team and working together to reach new heights.\n\nSimilarweb is a global company that strives to create a workplace reflective of the communities we serve, where individuals are empowered to bring their full, authentic selves to work. We are committed to inclusivity across race, gender, ethnicity, culture, sexual orientation, age, religion, spirituality, identity and experience. We believe our culture of equality and mutual respect also helps us better understand and serve our customers in a world that is becoming more global, more diverse, and more digital every day.\n\nAbout Similarweb:\n\nSimilarweb is the most trusted platform for understanding online behavior. Millions of people rely on Similarweb insights daily as the ground truth for their knowledge of the digital world. We empower anyone — from the curious individual to the enterprise business leader — to make smarter decisions by understanding why things happen across the digital ecosystem. Learn more at WWW.SIMILARWEB.COM.Show more Report"}, {"company": "Rimini Street, Inc.", "job": "Sr Client Success Manager, Israel", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=206&ao=1136043&s=58&guid=00000186131ea5d9b61c4e51c31735ff&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_52b50cf2&cb=1676381684091&jobListingId=1008431765967&jrtk=3-1-1gp825094jm5m801-1go9ht9h92ff8000-f2fbf06098d51b86-", "description": "Job Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nThe company is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs.\nWe have an exciting opportunity available right now to join us as a Sr Client Success Manager, responsible for a subset of clients within the EMEA region, based in Israel.\nPosition Summary\nWe are seeking an experienced Sr Client Success Manager who will be responsible for managing and expanding the partnership with our clients. The right candidate will have an entrepreneurial spirit, a proven track record of Client Management or Business Development & Executive Relationships excellence with the ability to provide solutions and guidance to meet business objectives and taking business to the next level. You must have a passion for clients. We need someone that can be very hands-on, do whatever it takes to deliver value, develop relationships, and be a strategic thinker with the ability to create long-term relationships with our clients\nAs a Sr Client Success Manager with Rimini Street, Inc., you’ll be managing a portfolio of named clients – driving client lifecycle – leading to adoption, cross-sell, advocacy and client satisfaction across your portfolio.\nEssential Duties and Responsibilities:\nDeliver and communicate ROI throughout the client lifecycle\nBuild C-level and executive relationships, establishing trusted advisor status\nDrive growth, value, retention and partnerships for our important clients to ensure active engagement and full recognition of ROI\nDevelop key account plans including; retention strategies, cross-sell opportunities, powermaps, client advocacy\nMeet/Exceed quarterly quota targets (renewals/cross-sell/advocacy)\nCreate awareness and demand for Rimini Street products and services\nIdentify, cultivate and engage on cross-sell opportunities within your portfolio for services and/or strategic solutions\nEnsure client retention through actively driving retention strategy, retention content including ROI models and proposals, and assisting with retention sales execution\nProvide ongoing proactive client management through executive business reviews, client onsite visits, executive relationships and overall client communications\nBuild and foster our Client Champion Community. Secure client sales and marketing advocates, ensuring client referenceability and driving client participation in select client marketing programs, events, interviews, etc.\nImplement and utilize current Social and Digital selling strategies to maximize opportunities via Social Networking platforms\nQuarterback the team and coordinate across executive leadership, sales, service delivery, marketing, etc.\nAdditional Duties & Responsibilities\nMonitor client consumption of Rimini Street services with the support of standard dashboards\nMaintain up-to-date client information in Salesforce.com and other systems\nProvide detailed and timely status reporting to all management as requested\nAssure client communications and escalations are performed on time, sufficiently and accurately\nOther job-related duties and responsibilities may be assigned from time-to-time\nQualifications/Skills/Experience:\n\nEducation\nBA/BS (MBA/Master preferred)\nLocation\nIsrael\nEssential Language Skills: English and Hebrew\nExperience\nGood knowledge of the enterprise software industry\nSpecific experience with Oracle and/or SAP preferable\nExperience dealing with CXO’s\nSignificant experience in Consultative Sales, Account Management, or Business Development\nExperience in managing a portfolio of clients in different industries\nExperience in cross-selling – identifying opportunities through trusted advisor partnership with clients and ability to coordinate and lead cross-functional team to drive better results for cross-sell and retention, etc.\nExperience in renewing and/or negotiating client support contracts\nExperience in working with complex, multi-divisional, multi-geographical customers\nExperience working with cross-functional teams (e.g. Sales, Renewals, Marketing, Services, etc.)\nSkills\nImpressive executive presence and communication abilities\nDemonstrated ability to provide proactive account management to a large portfolio of clients\nExceptional leadership, time management, facilitation, and organizational skills\nBias for action\nPassion for technology and for being a part of a fast-growing technology company\nProven analytical and problem-solving abilities\nProven experience with Social and Digital selling techniques\nAbility to create structure and prioritize tasks to best manage different situations\nStrong documentation skills MS Office Suite (Word, Visio, Excel, and PowerPoint); Salesforce CRM, Smartsheet, etc.\nRimini Street views all employees as partners, and is committed to providing an exciting, participatory and team-oriented work environment. In addition to our very competitive compensation packages, be prepared for challenging professional growth and fun along the way in our work-hard, play-hard corporate environment.\n#LI-DNI\nCompany Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nRimini Street is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs. According to Gartner, the third-party support market will grow to $1.05 billion by 2023, a 200% increase. With tight IT budgets and flat global economic growth, IT and procurement professionals are actively looking for proven methods to cut costs while improving service. Rimini Street enables organizations to free up budget for strategic business initiatives by delivering savings of up to 90 percent on total maintenance and support costs, and to date, the company has saved organizations over $5 billion in total maintenance costs since its inception.\nWe’re building something special at Rimini Street. A company where people care about each other and trust each other to do the right thing. A company where highly intelligent and talented people come together to do challenging and meaningful work that makes a real difference to our clients, ending each day with a sense of achievement and balance in their lives.\nBe Treated Like the Best\nRimini Street hires only the best – and provides the compensation, bonus and benefit programs appropriate for proven top-performing professionals. We want our employees to have an opportunity to share in the financial success that results from our dedication to service excellence, high-quality deliverables and an unparalleled client experience\nNo bureaucracy, thousand-page rule books or politics — just everyone working together to build a great company through service excellence and client success\nWork hard, play hard environment – Rimini Street is a group of hard-working professionals who are passionate about achieving success, but we also enjoy opportunities to meet up at fun company events\nWe are also passionate about giving back to our communities around the world, with plenty of opportunities for volunteering and charity through the Rimini Street Foundation\nAll Rimini Street professionals are encouraged to grow and learn new skills\nAccelerating Company Growth\nTrading on Nasdaq under ticker symbol RMNI since October 2017\nAdded to the US Russell 2000® Index in 2018\nOver 4,000 clients, to date including 100 of the Fortune 500 and Global 100\nAnnual 2021 financial results of $326.8 million, up 16.3% year over year\nFiscal year operating cash flow of $42.1 million, up 107% year over year\nAnnounced the new patent pending Rimini Street Artificial Intelligence Support Applications, a result of the Company’s continued investment in optimizing support processes and ensuring global service delivery outcomes at scale. Using the AI Applications, Rimini Street has been able to deliver a better client experience and reduce software issue resolution times by 23%.\nCelebrated the 15th anniversary of the Company’s founding in 2005 to redefine the enterprise software support market and bring choice and value to software licensees around the world.\nRecent Industry Recognition\nReceived 33 awards in 2020, including 15 awards for excellence in customer service from awards companies such as the International Stevie Awards, the American Stevie Awards, and the Stevie Awards for Sales & Customer Service\nHonored with four Gold awards for Company of the Year in 2020.\nThe Rimini Street Foundation recognized with two awards in 2020 for Corporate Social Responsibility Program of the Year\nIn addition, in 2020 the Company supported more than 120 charities around the world through the Rimini Street Foundation, providing financial contributions, volunteer hours and in-kind donations including personal protective equipment to healthcare workers, senior centers, food banks and youth organizations globally. The Foundation also extended its charitable work in 2020 to Hong Kong, Malaysia, Mozambique, Sweden and the UAE.\nTo learn more about how Rimini Street is redefining the enterprise software support industry, visit http://www.riministreet.com\nRimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, national origin, sexual orientation, gender or gender identity, disability and protected veterans status or any other characteristic protected by law.\nPlease Note: Rimini Street does not accept resumes submitted by recruiting/staffing firms unless specifically requested by Human Resources. Unsolicited resumes will be ineligible for referral fees.Show more Report"}, {"company": "", "job": "Content Marketing Leader", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "IVC Research Center", "job": "Sales Development Representative (SDR) / Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=208&ao=1136043&s=58&guid=00000186131ea5d9b61c4e51c31735ff&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22670ca2&cb=1676381686550&jobListingId=1008371867078&jrtk=3-1-1gp8252mujca7801-1go9ht9h92ff8000-311832bbee8b9197-", "description": "Responsibilities\nDevelop new business leads\nExpand the portfolio by handling up-sales and potential new accounts, including cold calls\nManage all account-related processes and projects - from lead generation, pre to post sale, consulting, support, and back-office management\nHandle an existing account portfolio to preserve the customer base\nAttend industry conferences and meet-ups to represent the company, network and gather leads\nRequirements\n2-5 years’ experience as an account manager in a business-oriented market OR equivalent sales track record in successful B2B sales - a must\nAbility to withstand tight deadlines and ambitious goals\nBA degree – a must.\nBA in business, finance, marketing, economics, communications, technology, or related field – an advantage.\nStrong negotiation and presentation skills.\nExperience working with CRM Systems and Marketing automation systems.\nExcellent spoken and written skills in Hebrew and English. Other languages – an advantage.\nFamiliarity with technology, high-tech or investments markets - definite advantage\nReferences will be requiredShow more Report"}, {"company": "TripActions", "job": "Manager, Marketing (Growth Marketing Manager)", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.5", "link": "", "description": ""}, {"company": "Papaya Global", "job": "User Acquisition Manager", "city": "Herzliya", "date": "24h", "rating": "3.6", "link": "", "description": "Papaya Global is reinventing global payroll and payments. Our automated platform helps companies hire, onboard, manage, and pay employees in more than 160 countries.\nWe are looking for a qualified and experienced User Acquisition Manager to join our team. You will be responsible for user acquisition traffic including the development of overall creative, strategy, optimization, KPIs and ROI analysis.\nOur ideal candidate is an experienced professional with demonstrable performance marketing skills.\nYou’ll join our Marketing team based in our headquarters, Herzliya, Israel.\nYou Will:\nManage high budget and large-scale Search and Social PPC campaigns\nAnalyze and optimize campaigns constantly to maximize revenue\nInitiate and implement improvements and creative solutions to increase campaigns activity\nRespond quickly to changes in online marketing and adapt to capitalize on new opportunities\nRequirements:\n\nProven experience in managing Google search campaigns at large scale\nNumber oriented with analytical skills, comfortable with large sets of data and numbers.\nExcellent interpersonal skills, positive attitude.\nAbility to work independently and in a team environment.\nProficient in Microsoft Excel and large data analysis.\nFluent English - Verbal and written.\nExperience working with HubSpot/Salesforce or equivalent CRM tools -advantageShow more Report"}, {"company": "Marcomit", "job": "Senior Brand & Marketing Manager", "city": "Israel", "date": "30d+", "rating": "", "link": "", "description": "Are you a seasoned project and client manager? Are you the type of person who immediately starts dissecting a massive project down to workable and manageable components? Are you client-oriented, friendly, patient, but also stand firm when needed? If so, you might just be the person we’re looking for!\n\nMarcomit is seeking a Senior Brand & Marketing Manager to join its ever-growing team of designers, content writers, video producers, project managers, and an occasional puppy.\n\nFirst thing first- the job\n\nAs Senior Brand & Marketing Manager, you will:\n\nEstablish and maintain strong working relations with multiple clients. You’ll be the face of Marcomit in both the good and the more challenging times.\nObtain detailed briefs from clients, assess their scope and budget, and delegate the corresponding tasks to relevant team members for execution.\nTrack project performance and ensure that it follows the projected timeline and budget.\n\n And now- You\n\nBesides the obvious qualifications- organizational and multitasking skills, detail-oriented, etc.- you’ll need to:\n\nBe Hebrew-English bilingual, both writing and speaking. Additional languages are an asset!\nHave some major communication skills, both client-facing and internally.\nPossess a Bachelor’s degree; any additional educational credentials are an asset.\nHave an impeccable ability to keep track of projects and timelines.\nBe resourceful, especially when things don’t go quite as planned.\n\n What you can expect working at Marcomit\n\nAn amazing, multilingual, multicultural team that (usually) loves working together.\nFresh oranges. We’re located in an orange grove- literally.\nFascinating clients from a wide range of fields. From drones to vegan protein, from space-industry freezers to smart lighting systems, you’ll become a bit of an expert in disciplines you didn’t even know were a thing.\nOpportunities to grow and develop, to take initiative and to devise new ways of working.Show more Report"}, {"company": "Natural Intelligence", "job": "Marketing Automation Manager", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.1", "link": "", "description": "Founded in 2009 and 100% self-funded to this day, Natural Intelligence is a leader in online multi-vertical marketplaces. Our global brands, Top10.com and BestMoney.com, help millions worldwide make informed decisions every day. Our proprietary platform, xMatch, harnesses AI and ML technologies in order to help consumers make easier choices, and find the right products and services tailored to their needs.\nWe are seeking a talented & motivated Marketing Automation Manager to join our Growth Department. This is an exciting opportunity for an innovative and creative person who comes from a background of engagement and performance-oriented content.\nResponsibilities:\nHands-on responsibility for implementing and monitoring email marketing campaigns, seeking to maximize performance KPIs, improving conversion and retention rates\nDefine the technical and creative requirements for marketing campaigns, including software setup, domain reputation, warm-up, and integrations\nManage and own all aspects of the CRM execution, including email marketing, push, in-app, SMS, and surveys\nWork closely with content writers, designers, product, and business departments to build campaign strategies and execute them accordingly\nOptimize campaign workflows, alerts, sequences, A/B, etc\nRequirements:\n\n2-5 years of hands-on email marketing and CRM\nGood HTML technical skills\nAbility to collaborate and communicate well with team members and stakeholders\nVery organized and well-structured individual (attention to detail is a must)\nPrevious experience in analyzing data with the ability to turn this data into actionable insights\nAbility to work in a fast-paced environment\nEnglish at a high professional level - a must\nPrevious experience with Salesforce - a must\nOnly suitable CVs will be considered.Show more Report"}, {"company": "Fiverr", "job": "Marketing Automation Manager, Stoke Talent", "city": "Tel Aviv-Yafo", "date": "18d", "rating": "4.3", "link": "", "description": "We're looking for a highly talented marketing automation manager who can plan, develop and implement automated marketing campaigns to increase user retention, engagement, and conversion rates with a focus on the company’s revenue.\nYou’ll be owning the user-journey set-up and optimization, creating and maintaining landing pages, data implementation, KPI reports, and monitoring.\nAbout Stoke (acquired by Fiverr)\n1 in 3 Americans works on a freelance basis today. By 2025, only 40% of the workforce will be salaried employees. The world is changing, but companies are finding it hard to keep up.\nStoke offers a SaaS platform that makes it easy for companies to work with freelancers from all aspects (sourcing, onboarding, tracking, payments, and compliance), so your teams can focus on getting things done.\nWe help tech companies and agencies increase their productivity by enabling them to tap into the world's most flexible workforce - the booming freelance economy - without the hassle and headaches that come with it.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\nMinimum 2 years of hands-on work experience with HubSpot - MUST\nMinimum 5 years of B2B marketing experience\nHigh level of English - a must\nUnderstanding of email best practices for email marketing creatives, templates, metrics and associated KPIs, segmentation, dynamic content, and testing methodologies.\nAnalytical mind, with the ability to make data-driven recommendations.\nSelf-motivated, creative thinker with a “can-do” attitude\nExperience in setting ABM infrastructure - Advantage\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nManage end-to-end automated marketing campaigns: from ideation, through set up & segment and ends with analysis & optimization.\nContinuously experiment: execute A/B tests on email concepts, subject lines, content, CTAs, sending times, layouts, and more.\nCollaborate with designers and copywriters, identify target audience segments and capture feedback from multiple stakeholders.\nOperating an admin system, analyzing & reporting, testing, project management and HTML coding.\nCreate and manage lists, workflows, drip campaigns, landing pages, email templates, forms, pop-ups, calls-to-actions, webinars, and more\nDevelop and own the user journeys to increase revenue\n\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Dealhub.io", "job": "Senior Business Development Representative", "city": "Holon", "date": "30d+", "rating": "4.2", "link": "", "description": "As a leading Sales solution company, DealHub's team consist of the best sales people, and are currently hiring a driven, hungry, rockstar Sales Development Representative!Our Sales Development team responsible for developing new business opportunities through outbound prospecting, cold calling, and email campaigns, while working closely with Marketing and Sales teams.As an SDR you will:Generate new business pipeline through outbound prospecting activities and inbound lead follow-upBooking demos with Account ExecutivesManage all data fields inputs to our CRM systemCollaborate with Marketing and Sales teams to grow the business opportunitiesUtilize various tools to help target relevant contactsMeet and exceed established objectivesWorking days: Monday to FridayREQUIREMENTSAt least 2 years experience as a BDR/SDR in a SaaS company - MandatoryNative written and verbal communicator in EnglishHighly motivated and \"hungry\" to succeedExcellent communication and interpersonal skillsCan multi-task well and work in a fast-paced teamWilling to work in a young and dynamic atmosphereHas a strong desire to grow within the role and companyJob Type: Full-timeExperience:SDR/BDR in a SaaS company: 2 years (Required)Show more Report"}, {"company": "Tel Aviv University", "job": "Senior Content Writer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Wanted: Content EditorStarting immediatelyThe Development and Public Affairs Division of Tel Aviv University is looking for a dynamic writer and editor to join its team. The role involves conceptualizing, writing and editing diverse materials in English for the purposes of fund-raising and PR. This is full-time, in-house position with excellent conditions.Job description:Writing content for the University’s website, print publications, and social networksEditing the University magazine, web articles, and other publicationsLeading the University’s social media strategyGiving input into other PR and marketing materials such as brochures and videosSupervising a small content teamRequirements:Relevant Undergraduate degreeEnglish at mother-tongue level a must (reading, writing and speaking)Fluent Hebrew a mustMinimum 3 years’ writing experienceProven editing experience of high-level publicationsAbility to translate diverse and complex activities into succinct and appealing proseStrong understanding of social media strategy and production, specifically Twitter and LinkedInProficiency in standard software such as PowerPoint, Excel and MS Word, etc.Experience working with graphic designers and graphic software - advantageAbility to work both independently and as part of a teamGo-getter, detail-oriented and creativeCover letter on why you think you are a qualified candidateResume in English2 relevant writing samplesOnly qualified applicants who have a proven writing background, and who submit all the requested material, will receive a reply.Job Type: Full-timeAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Lemonade", "job": "User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "", "description": "We're looking for a highly analytical, detail-oriented User Acquisition Manager to join our Paid Acquisition team. You'll play an important role in leveraging cutting-edge technology and data science models to aid sophisticated optimization efforts and proper budget allocation.\n\n\nIn this role, you'll\nManage and optimize global campaigns with a large budget, end-to-end\nBuild strategic and tactical action plans\nCollaborate closely with the Creative, Analytics, Product, and Data teams\nOwn measurement and reporting for your campaigns\nConstantly be looking for new growth opportunities\nWork both independently and as a part of a team\nWhat you'll need\n3+ years of experience in PPC, managing global, large-scale B2C campaigns focused on the Google ecosystem (with budgets of $500K+/mo)\nExperience with social / video platforms is an advantage\nMultitasking abilities under strict deadlines and within an ever-changing environment\nProven track record delivering results consistently\nAdept at using various marketing analytics tools\nAbility to think strategically about complex issuesShow more Report"}, {"company": "Nayax", "job": "Marketing Automation Manager", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Mitsubishi Motors (Thailand) Co., Ltd", "job": "P&A PROJECT PLANNING & MARKETING - SENIOR ENGINEER", "city": "Central", "date": "19d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=218&ao=1136043&s=58&guid=00000186131ea5d9b61c4e51c31735ff&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4f0874c8&cb=1676381706569&jobListingId=1008406011193&jrtk=3-1-1gp825m7qj4j1801-1go9ht9h92ff8000-2d0c62a02b24d0e2-", "description": "Job Summary In charge of manage smooth supply and distribution of service parts and accessories including Railliart merchandise goods to Thai domestic market as well as overseas market Job Description • Assisting in implementation of new product / process development for accessories and reliant products.\n\nLiaise directly with supplier to follow up all aspect in new product development process and company’s expectation.\nMaintain project schedule by monitoring project progress, coordinating activities and resolving problems.\nProvide continued support to suppliers to ensure their performance meet the company quality.\nCoordinate with marketing team for activities arrangement to promote or products, Especially, Ralliart Product.\nWork with agency to complete the market material for new product being launched including big event such as Motor Show / Motor Expo.\nControl stock or Ralliart Product to support sale and clearing stock after the end of collection.\nSupport product information for both domestic and export sales.\nOther administration job to support team.\n\nJob Specification • Male/Female, age between 25 - 35 years old.\n\nBachelor degree in Marketing or Business Management.\nAt least 3 years’ experience in product development function especially fashionable product or accessory in automotive industry.\nGood understanding of inventory Control and follow up.\nCreative thinking and Good Human Relation and able to work individually.\nGood command of both written and spoken in English.\nAble to drive a car and have driving license.\n\nShow more Report"}, {"company": "Novartis", "job": "Essential Brand Lead", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=219&ao=1136043&s=58&guid=00000186131ea5d9b61c4e51c31735ff&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fb08fe15&cb=1676381707749&jobListingId=1008439918428&jrtk=3-1-1gp825ndlkbl2801-1go9ht9h92ff8000-e45dc89283bc50a3-", "description": "110,000 professionals working together to improve patients' lives.\n\nThe role of the Essential Brand Lead will focus on developing and testing novel ways of promoting and driving the sales of our essential brands – thus setting the future ways of working for the new cross-functional working of the Israel business unit – Squad teams. Acting as a de-facto Essential brands Lab Head, the purpose of the role is to reinvent the driving growth of established brands.\n\nYour Key Responsibilities:\nYour responsibilities include, but not limited to:\n\nAccountable for delivering the therapeutic area brand performance with respect to sales, market share and profitability to meet or exceed budget targets. Increase Customer Life Time value of essential brands.As lab-head, use rapid-design process and feedback loop leveraging agile methodology. Provide out-of-the-box solutions using Design Thinking.Drive the growth of the Essential brands TA by establishing growth plans for existing products, effectively handling their life cycle, establishing and managing effective strategic partnerships.Entrepreneurial approach to portfolio management to optimize ROI across a diverse range of brands through the lifecycle by actively investing across brands with shared/pooled services and flexibly budgeting according to prioritized outcomes.Using targeted strategies and innovative, cost-effective GTM models to efficiently commercialize non-priority diverse set of brands. Use digital engagement channels, innovative access models & cross-portfolio reimbursement deals / discounts to improve value across the lifecycle, including Business-to-business selling, account management and contracting focus, “non-personal promotion” to HCPs.Incorporate opportunities to maximize lifecycle value and differentiate beyond efficacy to address non-clinical barriers and product enhancements (e.g., devices, digital services).Develop cross-TA solutions and implement a customer feedback loop to share and inspire other TAs. Drive, test and implement with agility new innovative operating model.Customer facing (at least 50%) to validate external competition benchmark for solutions either by interacting with customers or other industries and sectors.\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\n\nEducation: High level academic education in Life Sciences (Advanced degree in bioscience, medicine, business, and/or management)Proficient Hebrew and English, both written and spoken.Min. 5 years of experience in engaging various collaborators within the health sector.Experience as a Product Specialist in RX.\nExperience in cross functional teamwork and working on multiple projects.Strong leadership skills and ability to set a clear vision, handle multifunctional extended teams and network effectively.Experience in working with large data sets from various functions / backgrounds, commercial projects, digital transformation and governance projects.\n\nDesirable Requirements:\n\nBrand Manager experience\n\nWhy Novartis?\n\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\n\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do here at Novartis!\nDivision\nPHARMA\nBusiness Unit\nREGION EUROPE PHARMA\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nMarketing\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "AppsFlyer", "job": "Regional Marketing Manager- Temporary", "city": "Herzliya", "date": "15d", "rating": "4.4", "link": "", "description": "Are you a passionate B2B marketer with experience in hyper-growth SaaS and mobile businesses? If you are, read on!\n\nOur mission at AppsFlyer is to give digital marketers the very best tools and insights to help them be as successful as they can be. With a highly talented, global team of over 1,500 people, and growing, we're only just getting started.\n\nWe're looking for a hungry, passionate, tech-savvy B2B marketer to join our vibrant, friendly office in Herzliya and lead our field marketing programs and customer lifecycle activities in SANI region (South Europe, Africa, Nordics, Israel). You'll be taking a market-leading, mission critical SaaS offering out to digital marketers and brands in the region.\n\nIn your B2B toolkit, you'll be highly analytical, independent, a competent storyteller, a first class project manager and have a flair for putting together exceptional events and experiences.\n\nWorking closely with your local colleagues in Sales, Customer Success and Partnership Development, as well as a large, cross-functional team of marketing experts in our Global HQ. You'll be responsible for planning, coordinating, executing and reporting all revenue-focused marketing programs for each individual market to deliver new customer leads, existing customer engagement and partnership development goals.\n\nThe role reports to the Managing Director of EMEA-SANI, and to the Head of Marketing for those respective markets\n\nThis position is temporary for one year\n\nWhat you'll do:\n\nEvents - You're passionate and hands-on about events and will work with Sales, Customer Success, Partnership Development and third party partners, such as trade associations and conference organizers, to create a pipeline of events across all markets that help raise AppsFlyer's brand awareness, position the business as the domain authority for mobile measurement and drive new demand and upsell opportunities.\n\nContent, thought leadership & PR - You enjoy creative copywriting and are responsible for positioning AppsFlyer as the market leader in your local markets. You'll be working closely with the Global Content & Mobile Insights + Comms teams, as well as local PR partners, you'll create thought leadership campaigns to promote AppsFlyer's portfolio or cross-device measurement and fraud protection services. These could be anything from blogs and white papers, to major PR campaigns or event content\n\nData - You're all about the numbers. As the lead for the individual country growth squads, you'll be responsible for managing ongoing growth initiatives, reporting the results of our time and financial investments and optimizing our activities on an ongoing basis. You'll have the support of our Global Marketing Operations team to do so, as well as numerous BI tools\n\nTeam player - You're a go getter and problem solver with a great team spirit. You're happy being part of a close knit team that works hard and plays hard and you're not afraid to roll your sleeves up and do what's right for the team\n\nWhat you have:\n\n3-5 years of experience in B2B marketing roles ideally within the technology, SaaS or mobile software sectors\nProven track record of planning and executing on field marketing campaigns, generating pipeline and strengthening customer relationships.\nExceptional project management skills, writing, communication, and presentation in English.\nPassionate about technology and the latest trends and best practice in B2B marketing\n\nBonus Points:\n\nA degree in Marketing or related subject area\nExperience in CRM and events systems (Salesforce, Splash & Marketo as advantage).\nCompetitive analysis and account mapping experience - an advantage\nAbility to speak an additional relevant language other than English is highly desirable, but not a must have\nKnowledge of the E-commerce, gaming or finance mobile marketing world an advantage\n\nAs a global company operating from 20 offices worldwide, we reflect the human mosaic of the diverse and multicultural world in which we live. We ensure equal opportunities for all of our employees and promote the recruitment of diverse talents to our global teams without consideration of race, gender, culture, or sexual orientation. We value and encourage curiosity, diversity, and innovation from all our employees, customers, and partners.\n\n\"As a Customer Obsessed company, we must first be Employee Obsessed. We need to make sure that we provide the team with the tools and resources they need to go All-In.\" Oren Kaniel, CEOShow more Report"}, {"company": "Broadway Gaming", "job": "SEO Account Manager", "city": "Herzliya", "date": "30d", "rating": "5.0", "link": "", "description": "Broadway Gaming is a dynamic and expanding online gaming company operating mainly in the UK gaming market. We offer Bingo, Casino and Slot products across multiple brands. We have office locations in Dublin, London, Tel Aviv, and Romania.\nWith a wide variety of backgrounds comes a wealth of experience, ideas and personalities and we use these to help us create a great service and a great place to work and learn. Because collaboration is fun and benefits us all and ultimately it benefits our customers!\nResponsibilities\nManage on-page optimization efforts and lead content initiatives\nWork on off-site link building initiatives\nPerform keyword research for new pages and improve existing content to maximize search engine performance\nConduct SEO audits and continuously improve upon previous SEO efforts\nWork on technical SEO initiatives using tools like Screaming Frog and Ahrefs\nExperiment with new SEO tactics and strategies, continuously testing and problem solving\nPlan, develop, execute and measure SEO projects, including improving keyword rankings, organic traffic, and content generation\nBlog management\n\nRequirements\nBA Degree in Marketing, Business administration or related field desirable\n2 years+ of experience in SEO (international market preferably)\nExperience working within a regulated industry is highly advantageous\nStrong understanding of the gambling industry including ongoing changes in regulations and guidelines\nAbility to prioritize & managing multiple projects simultaneously and efficiently\nKnowledge of SEO tools, such as Ahrefs, Screaming Frog, Google Search Console, SEMRush, Moz, Majestic, Google Analytics, Google Speed Insights, and more\nPHP, CSS, HTML, and coding background a plus\nExcellent verbal and written communication skills and the ability to interact professionally with a diverse group of internal and external stakeholders\nThe ability to adapt to a rapidly changing regulatory and business environment.Show more Report"}, {"company": "Swimm", "job": "Marketing Automation Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "", "description": ""}, {"company": "Elementor", "job": "Senior Product Analyst", "city": "Ramat Gan", "date": "24h", "rating": "4.2", "link": "", "description": "We are looking for a sharp and highly analytical Product Analyst to join our fast-growing company and help us make data-driven decisions for performance optimization.\nAs a Product Analyst, you will play a key role in shaping Elementor's product and business strategy, defining our KPIs, and identifying business opportunities.\nAs a member of the Analytics team in our Data department, you will work across the organization and provide key insights to multiple departments (Marketing, Product, Finance, Business Strategy, CX, and more), helping them focus on what’s important.\nThis position is located in Israel only.\nRequirements:\n\n4+ years of experience in quantitative analysis, preferably at an internet company\nExcellent communication skills with the ability to deliver results of analyses clearly and effectively\nExcellent SQL skills - a must\nExperience with at least one of the following visualization tools: QlikView, Qlik Sense, Power BI, Tableau - a must\nStrong Python capabilities - a major advantage\nExperience working with big data tools: Redshift, BigQuery, Databricks, etc. - a must\nA highly independent and creative team player who works well with others\nHands-on technical experience with Google Analytics, Google Ads, and Facebook Ads - an advantage\nWork Environment:\n\nWhat do we do?\nElementor is the leading website building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 12M websites powered by Elementor. More than 8% of all websites around the world are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe believe in empowering both our employees and our users.\nElementor is a place where you can truly grow professionally and personally.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey. We take great pride in Elementor's constant scaling.\nResponsibilities:\n\nWork with various managers to learn their business insight needs, including tracking metrics, dashboards, and reports\nAct as a bridge between units’ business needs and the BI department, ensuring high-quality execution quality, data integrity of analyzed insights, and reporting deliverables\nEstablish reporting methodologies and cross-department standards\nGo beyond the numbers to communicate, influence, support, and execute business decisionsShow more Report"}, {"company": "MOONEE", "job": "Data Analyst (UA & Monetization Manager)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=224&ao=1136043&s=58&guid=00000186131ea5d9b61c4e51c31735ff&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_122b5c08&cb=1676381715022&jobListingId=1008232767743&jrtk=3-1-1gp825ueujorc801-1go9ht9h92ff8000-2d4a39673bcd79eb-", "description": "Location Tel-Aviv, Israel\nDate posted August 3, 2022\nEmployment Type Full-time\n\nAt Moonee, we’re working hard to redesign the way mobile games are published today.\nWe’re seeking a qualified user acquisition specialist to extend our global reach through expert buying methods and analytical skills. Our ideal candidate will be trusted to dive right in, take the lead, use initiative, and help global studios to expose their work to the world. Highly skilled at media buying and optimization, this person will join and inspire a team of like-minded go-getters to achieve our company vision.\n‍\nResponsibilities\nOptimize demand waterfalls based on results.\nPlanning and hands-on management of social and networks campaigns to drive app installs and specific KPIs.\nAnalyze campaign performance and optimize accordingly.\nTest and experiment with new online marketing strategies and tactics.\nAdminister reports, and key reporting tools on a daily/monthly basis.\nQualifications\n1 years of proven experience in managing mobile apps campaigns - plus\nExperience in waterfalls optimization.\nAn excellent English.\nMotivated and Organised.\nCreativity, out of the box thinking and good writing skills.\nA quantitative mind and love for numbers, exceptional analysis skills.\nExperience working in mobile gaming companies - plus.\nBA in analytical degree - plus.Show more Report"}, {"company": "ControlUp", "job": "Senior Technical Writer", "city": "Rishon LeẔiyyon", "date": "21d", "rating": "4.1", "link": "", "description": ""}, {"company": "Publicis Media", "job": "Global Clients Lead", "city": "Bnei Brak", "date": "30d+", "rating": "4.0", "link": "", "description": "Company Description\nPublicis Media creates value for clients through global media agency brands and scaled capabilities across investment, strategy, insights and analytics, data and technology, commerce, performance marketing, and content by harnessing the power of the modern media landscape to drive one-to-one consumer engagement at scale.\nThe Global Clients Lead is expected to be a business partner across multiple global clients, using their deep knowledge and understanding of the client's business in order to create the best conditions for the right work to thrive, leading to the success and growth of both our partners and our agency.\n\nJob Description\n\nManage day-to-day deliverables and work closely with all departments\nBuild strong relationships with the client at all levels through a superior understanding of the client's business issues, marketing communications, and competition.\nProvide vision, inspiration, and strategic leadership to both the agency team and the clients. Ensure a collaborative approach internally and across agency partners to ensure happy and productive relationships.\nDrive Growth of scope of work ensuring the account is positively contributing to the agency’s revenue growth and profitability.\nDevelop and mentor team members; provide feedback and opportunities for growth.\nDevelop Brand, competitive, and audience analyses, strategic brand frameworks, and campaign and product launch strategies.\nWork across the Publicis Network & drive change for the client at a global level\n\nQualifications\n\n5+ years of related industry experience; preferably consulting, interactive, agency, or direct marketing experience\n2+ years of proven track record in developing senior-level client relationships\nStrong knowledge or experience in marketing and media,\nAn exceptional grasp of media planning, negotiation, and performance analysis and an impressive understanding of the digital\n Apply analytical problem-solving skills to deliver results\nStrong communication skills and impressive attention to detail\nDemonstrate exceptional interpersonal and communication skills to build client rapport\nStrong project management and performance management skills – you are crystal clear when it comes to delegating and providing feedback\nAbility to collaborate effectively at all levels and functions of an organization\nStrong client-service orientation\nProven ability to manage projects to successful completion, multi-task, and work within tight deadlines\nAbility to lead a team effectively and provide direction through coaching and mentorship\nEnglish- verbal and written- high levelShow more Report"}, {"company": "Moon Active", "job": "Mobile User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "Moon Active is one of the world's fastest-growing mobile game companies, providing entertainment to millions of active users across the universe. The company is headquartered in the heart of Tel Aviv.\nAs we expand, we're looking for a Mobile User Acquisition Manager to join our amazing Marketing team.\nResponsibilities\nHands-on campaign management on various mobile ad networks\nBuild and maintain strategic relationships with key acquisition partners\nManage fast-paced and dynamic projects in a highly organized manner on schedule and on budget\nCollaborate with different teams members within the marketing department to deliver and execute successful mobile marketing campaigns\nData Analysis (Identifying trends, opportunities, discrepancies)\nRequirements\n3 + years in mobile user acquisition and ad buying analysis experience at scale\nCampaign management on self-served platforms - a Must\nHighly analytical and technical: Understands components of ad calls across various channels\nAbility to manipulate and analyze large quantities of data and present it in reports\nDeep understanding of mobile attribution\nWillingness to learn and use third party ad systems such as ad servers, DSPs, and analytics tools\nAbility to take on multiple projects at the same time\nStrong organizational, analytical, presentation and problem solving skills\nProfound knowledge of MS-Office Products (Excel in particular)\nFluent English - verbal and written\n#LI-HybridShow more Report"}, {"company": "Cisco Systems", "job": "Open Source Software Engineering Lead", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "4.3", "link": "", "description": "Open Source Software Engineering Lead\nWho We Are\nWe are Emerging Technologies and Incubations (ET&I) at Cisco. We are chartered to build the next new business for Cisco. To take Cisco into new markets, and especially towards new personas -\nBoth buyer and user. And like building a startup from the ground up, it’s all about having an entrepreneurial approach. Taking an idea from an astonishing thought to a product that solves a critical need, to an experience that delights users and customers.\nIt’s about innovation. From 12 months out to 5 years in the future, wearing multiple hats, failing and learning fast, challenging assumptions and finding new ways of solving problems. Driving form from ambiguity. It’s about creativity. We are looking for entrepreneurs, Problem solvers, Designers & Marketers. Product Led Growth experts. Business Development, SDRs, Customer Success. Product Managers, SWEs, SREs. Data Scientists and ML engineers.\nYes, we are building the next set of startups with the support of a trusted name like Cisco. Where else will you get to do this? We are Cisco ET&I. We run bold, we run agile, and we run ambitious. Come create with us.\nLearn more about us at https://eti.cisco.com.\nWhat You’ll Do\nThe Portshift team, now part of Cisco's Emerging Technologies and Incubation group, is building open-source toolset, Cisco OpenClarity, that will help developers and DevOps teams to secure modern application development infrastructure (CI/CD, containers, k8s, APIs, etc). You will build and lead engineering advocacy as a critical bridge between our Product, Engineering and Marketing groups, and our open-source community.\nPrimary responsibilities of this role include:\nCreate and nurture a community where people can learn about the impact that cloud native security can have on their teams, on our product, and how they can influence it.\nIdentify the best channels and engage with our users (e.g., Github, discussion forums, technical demos, events, social media or direct feedback sessions) to build a positive and strong relationship between the developers community and our product & engineering teams, enabling us to build the best solution.\nBuild and publish engaging content : construct helpful examples and guides, ensure documentation meets the community needs, create engaging and educating blog posts, and share excellent community-created content alongside curated case studies.\nParticipate in discussions with the technical staff, at all levels (from individual contributors to executives), to foster user adoption and viral growth, and feed our product roadmap with community feedback.\nDevelop and execute holistic launch plans for major releases and updates to our product : understand the scope of changes, work with developers to assess impact, construct a timeline for rollout, and develop a process to guide the community through changes.\nWho You Are\nRequired Qualifications\nSolid technical background, with previous experience in cloud native security solutions.\nStrong presence in the developer community.\nExceptional external communicator, adept at interfacing with partners and large audiences.\nExperience in rallying internal partners and project managing on a deadline. In particular, you've partnered with engineering teams to deliver anticipated products.\nCreative, with an informed curiosity about marketing and business opportunities that the Open-Source Product Office will build for Cisco.\nSkilled community leader, at your best when advising and engaging with large communities, so they can gain members and momentum over time.\nReady to own a program end-to-end and build an organization that will grow as a pillar of the company.\nExperience working on Open-Source products.\nIt will be great if you have\nExperience owning and editing technical documentation.\nExperience developing tutorial materials (e.g., self-guided tutorials, videos, knowledge bases) to onboard and educate users.\nProfessional experience working as a software engineer.\nWhy Cisco\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\nWe adopt digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do –you can’t put us in a box!\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us.\nWe recognize that diverse teams make the strongest teams, and we encourage people from all backgrounds to apply.\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "Fiverr", "job": "Product Marketing Lead, Stoke Talent", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "What's the job?\nWe are looking for a Product Marketing Lead to lead and own the product messaging and positioning for Stoke Talent. This role will work cross-functionally between Product Management, Marketing, and Sales to ensure that we effectively communicate the current and future value of Stoke’s unique value proposition.\nAbout Stoke (acquired by Fiverr)\n1 in 3 Americans works on a freelance basis today. By 2025, only 40% of the workforce will be salaried employees. The world is changing, but companies are finding it hard to keep up.\nStoke offers a SaaS platform that makes it easy for companies to work with freelancers from all aspects (sourcing, onboarding, tracking, payments, and compliance), so your teams can focus on getting things done.\nWe help tech companies and agencies increase their productivity by enabling them to tap into the world's most flexible workforce - the booming freelance economy - without the hassle and headaches that come with it.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\n3+ years of experience as a product marketing manager - a must\n5+ years of experience in a similar product related position at a B2B SaaS company - a must\nExperience in creating GTM strategies for new products and features and execution of relevant marketing campaigns and activities\nAbility to research marketing trends and other related topics\nPast experience in working closely with Product Management teams, with the ability to translate technical concept into successful product and marketing material\nAbility to work self sufficiently, and excel in a high-paced, changing environment\nExperience creating brochures, demos, slide decks, videos and running webinars\nExcellent English written and verbal communication skills no matter the audience or context\nEvangelize the freelancers management category and product vision in speaking opportunities and conferences and in briefings with prospects, customers, partners, media and industry analysts.\nBachelor's degree required\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nThe Product Marketing Manager will own the positioning and messaging for Stoke Talent translating product functionality and technical details into user benefit and value\nYou will develop product positioning and messaging informed by user research, market insights, and product understanding\nResearch and understand our buyer personas to ensure our product is designed and delivered to create value for them, acting as a partner and strategic advisor to product managers\nBe the voice of product releases, owning and developing all relevant collateral (emails, release notes, brochures, videos, webinars, sales decks in-product solutions, demos)\nMeet with customers and drive activities to increase adoption\nConduct ongoing competitive analysis along with market, and customer research\nPartner with Sales and customer success teams to regularly educate on the latest products and how to position and sell them\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Databricks", "job": "Manager, Field Engineering", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.5", "link": "", "description": "The Solutions Architect Manager will lead a team of pre-sales Solutions Architects. As you will help to lead our Israel expansion, you will build technical pre-sales teams. Your experience partnering with the sales organisation will help close revenue with the right approach whilst coaching new sales and pre-sales teams to work together. You will guide and get involved to enhance your team's effectiveness; be an expert at communicating complex, business value-focused solutions; support complex sales cycles, and build relationships with important partners in large corporations.\nThe impact you will have:\n\nManage hiring and building the Solutions Architect team, scaling the designated field engineering segment organization without sacrificing quality\nBuild a motivated collaborative culture within a hyper-growth team. To embody and promote Databrick's customer-obsessed, teamwork and diverse culture\nSupport increase Return on investment of SA involvement in sales cycles by 2-3x over 18 months\nEnsure a solution and value-based selling field-engineering organization\nDisplay an understanding of needs and revenue potential for accounts in the assigned region\nBuild Databricks' brand in Israel in partnership with the Marketing and Sales team\nWhat we look for:\n\nFamiliar with building a team of successful Big Data, Cloud, or SaaS professionals\nHave experience scaling and mentoring field or technical teams from scratch at hyper-growth speed\nKnowledgeable in and passionate about data-driven decisions, AI, and Cloud software models\nGreat at instituting processes for technical field members to lead efficiency\nTechnical background either in Data Engineering / Database technologies or Data Science\nFluent in Hebrew\n\nBenefits\n\nBenefits allowance\nManager's Insurance or Pension Fund\nEquity awards\nPaid parental leave\nGym reimbursement\nAnnual personal development fund\nWork headphones reimbursement\nBusiness travel insurance\nAbout Databricks\n\nDatabricks is the lakehouse company. More than 7,000 organizations worldwide — including Comcast, Condé Nast, H&M and over 50% of the Fortune 500 — rely on the Databricks Lakehouse Platform to unify their data, analytics and AI. Databricks is headquartered in San Francisco, with offices around the globe. Founded by the original creators of Apache Spark™, Delta Lake and MLflow, Databricks is on a mission to help data teams solve the world's toughest problems. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.\n\nOur Commitment to Diversity and Inclusion\n\nAt Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.Show more Report"}], [{"company": "Similarweb", "job": "Senior Product Marketing Manager - Shopper Intelligence", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "3.6", "link": "", "description": "Similarweb is the leading digital intelligence platform used by over 3500 global customers. Our wide range of solutions power the digital strategies of companies like Google, eBay, and Adidas.\n\nWe help our customers succeed in today's digital world by giving them access to data-driven insights, competitive benchmarks, strategic analysis, and more.\n\nIn 2021, we went public on the New York Stock Exchange, and we haven't stopped growing since!\n\nWe believe in balancing between the flexibility of working from home, and the fun of working together and face to face personal connections. That is why, at Similarweb we have implemented a Hybrid model, in which you work from the office 3 days, and can decide to work from home two days a week. Enjoying the best of both worlds\n\nWhat does the Similarweb Product Marketing Team in Shopper Intelligence do?\n\nYour job will be to demonstrate how Similarweb Shopper Intelligence solves eCommerce professionals' most critical business questions. From the optimization of user acquisition to the epic transformation of your eCommerce strategy - Shopper Intelligence helps you monitor consumer demand, analyze shopper behavior and optimize their onsite search strategies to win in the eCommerce world. We approach product marketing as a mission-critical opportunity to disrupt the market research category, make our customers data-driven superheros, and ultimately let Similarweb's actionable insights speak for themselves.\n\nAs if You will shape the voice and tell the story of Shopper Intelligence's value for SMB brands selling on Amazon.com. You will ensure the entire company speaks the same language when it comes to your product's messaging and positioning. You will lead product launches from alpha to general release, ensure customer-facing teams are trained and ready to sell, and effectively communicate to customers. You will closely collaborate with our product, solutions, marketing and sales teams to define, develop and execute product marketing strategies & plans. You will drive new sales and post purchase engagement and retention initiatives for your products and help educate and grow a healthy user base.\nAs a Senior Product Marketing Manager at Similarweb:\n\nYou will be expected to think and act both strategically and tactically: from the creation of plans, to hands on execution. You must be a self-starter, comfortable with ambiguity in an ever-changing environment, and pay careful attention to detail. You must have the ability to quickly formulate strategies and plans that are backed by data & storytelling and execute across many work functions simultaneously.\n\nBuild a deep understanding of our customers & their use cases, Shopper Intelligence's value proposition, the market, the competition as well as the Amazon ecosystem to help drive customer engagement.\nDevelop and implement lead-generation campaigns and programs that drive customer acquisition while building brand awareness.\nCreate feature positioning, messaging and marketing strategy (based on market factbase and data analysis) and produce content that communicates the value of the Shopper Intelligence platform in our customers' language.\nIdentify marketing strategies and partnerships to accelerate revenue growth and drive traffic to our website in order to activate, onboard, educate, engage, up-sell, and retain customers.\nWork closely with a cross-functional team of product managers, engineers, marketers, business managers, and salespeople to launch features globally.\nPartner with Product on strategy, positioning, differentiation and product launch; Marketing on content & campaigns; Enablement on training; GTM on customer feedback and education\nWork with our Product Education team to create relevant content that successfully educates customers how to onboard and get value from the product.\nThink creatively and analyze data to strategically direct next steps for A/B testing and continually improve performance through optimized messaging and targeting.\n\nWhat will I bring to the team?\n\nAt least 1+ years of experience in product marketing\nExperience in a fast paced B2B SaaS or DaaS company, Ad Tech, or relevant marketing/industry experience (i.e. CPG and Retail or prior experience with Amazon ecommerce a must)\nMust be fluent in digital and social media channels as well as have an understanding of integrated marketing and communications strategies Experience in customer journey mapping a plus, but not required\nCaptivating storytelling, superb communication, & presentation skills\nAble to work independently & autonomously, focusing on key outcomes amidst competing priorities & tight deadlines\nTeam player, strong at facilitating alignment & building relationships across an organization\nAnalytical thinker, excellent problem solving, planning and execution skills\nMotivated & hard working\nAbility to be flexible and adapt to change\n\nWhy choose Similarweb?\n\nWe believe that building a great product and a great company starts with finding amazing people and helping them grow and develop professionally and personally. At Similarweb, you'll be surrounded by curious, witty and passionate people that are hungry to drive real impact. We are proud to have over 800 creative and talented professionals, and we strongly believe in winning together as a way of driving a successful business!\n\nOur Values:\n\nData Driven: We believe data driven decisions are the key to success and we are evangelists for the power of digital insights\nPassionate: We care deeply about what we do, are accountable for our actions and are committed to helping each other\nExcellence: We believe in excellence as a mindset. It's in our nature; and we work hard to make a difference\nWinning Together: We know what it takes to build a great company and a great product and it begins with valuing each and every member of our team and working together to reach new heights.\n\nSimilarweb is a global company that strives to create a workplace reflective of the communities we serve, where individuals are empowered to bring their full, authentic selves to work. We are committed to inclusivity across race, gender, ethnicity, culture, sexual orientation, age, religion, spirituality, identity and experience. We believe our culture of equality and mutual respect also helps us better understand and serve our customers in a world that is becoming more global, more diverse, and more digital every day.\n\nAbout Similarweb:\n\nSimilarweb is the most trusted platform for understanding online behavior. Millions of people rely on Similarweb insights daily as the ground truth for their knowledge of the digital world. We empower anyone — from the curious individual to the enterprise business leader — to make smarter decisions by understanding why things happen across the digital ecosystem. Learn more at WWW.SIMILARWEB.COM.Show more Report"}, {"company": "Rimini Street, Inc.", "job": "Sr Client Success Manager, Israel", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=302&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ef4f14e0&cb=1676381726843&jobListingId=1008431765967&jrtk=3-1-1gp826a1tkbmr801-1go9htl1gk622800-f2fbf06098d51b86-", "description": "Job Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nThe company is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs.\nWe have an exciting opportunity available right now to join us as a Sr Client Success Manager, responsible for a subset of clients within the EMEA region, based in Israel.\nPosition Summary\nWe are seeking an experienced Sr Client Success Manager who will be responsible for managing and expanding the partnership with our clients. The right candidate will have an entrepreneurial spirit, a proven track record of Client Management or Business Development & Executive Relationships excellence with the ability to provide solutions and guidance to meet business objectives and taking business to the next level. You must have a passion for clients. We need someone that can be very hands-on, do whatever it takes to deliver value, develop relationships, and be a strategic thinker with the ability to create long-term relationships with our clients\nAs a Sr Client Success Manager with Rimini Street, Inc., you’ll be managing a portfolio of named clients – driving client lifecycle – leading to adoption, cross-sell, advocacy and client satisfaction across your portfolio.\nEssential Duties and Responsibilities:\nDeliver and communicate ROI throughout the client lifecycle\nBuild C-level and executive relationships, establishing trusted advisor status\nDrive growth, value, retention and partnerships for our important clients to ensure active engagement and full recognition of ROI\nDevelop key account plans including; retention strategies, cross-sell opportunities, powermaps, client advocacy\nMeet/Exceed quarterly quota targets (renewals/cross-sell/advocacy)\nCreate awareness and demand for Rimini Street products and services\nIdentify, cultivate and engage on cross-sell opportunities within your portfolio for services and/or strategic solutions\nEnsure client retention through actively driving retention strategy, retention content including ROI models and proposals, and assisting with retention sales execution\nProvide ongoing proactive client management through executive business reviews, client onsite visits, executive relationships and overall client communications\nBuild and foster our Client Champion Community. Secure client sales and marketing advocates, ensuring client referenceability and driving client participation in select client marketing programs, events, interviews, etc.\nImplement and utilize current Social and Digital selling strategies to maximize opportunities via Social Networking platforms\nQuarterback the team and coordinate across executive leadership, sales, service delivery, marketing, etc.\nAdditional Duties & Responsibilities\nMonitor client consumption of Rimini Street services with the support of standard dashboards\nMaintain up-to-date client information in Salesforce.com and other systems\nProvide detailed and timely status reporting to all management as requested\nAssure client communications and escalations are performed on time, sufficiently and accurately\nOther job-related duties and responsibilities may be assigned from time-to-time\nQualifications/Skills/Experience:\n\nEducation\nBA/BS (MBA/Master preferred)\nLocation\nIsrael\nEssential Language Skills: English and Hebrew\nExperience\nGood knowledge of the enterprise software industry\nSpecific experience with Oracle and/or SAP preferable\nExperience dealing with CXO’s\nSignificant experience in Consultative Sales, Account Management, or Business Development\nExperience in managing a portfolio of clients in different industries\nExperience in cross-selling – identifying opportunities through trusted advisor partnership with clients and ability to coordinate and lead cross-functional team to drive better results for cross-sell and retention, etc.\nExperience in renewing and/or negotiating client support contracts\nExperience in working with complex, multi-divisional, multi-geographical customers\nExperience working with cross-functional teams (e.g. Sales, Renewals, Marketing, Services, etc.)\nSkills\nImpressive executive presence and communication abilities\nDemonstrated ability to provide proactive account management to a large portfolio of clients\nExceptional leadership, time management, facilitation, and organizational skills\nBias for action\nPassion for technology and for being a part of a fast-growing technology company\nProven analytical and problem-solving abilities\nProven experience with Social and Digital selling techniques\nAbility to create structure and prioritize tasks to best manage different situations\nStrong documentation skills MS Office Suite (Word, Visio, Excel, and PowerPoint); Salesforce CRM, Smartsheet, etc.\nRimini Street views all employees as partners, and is committed to providing an exciting, participatory and team-oriented work environment. In addition to our very competitive compensation packages, be prepared for challenging professional growth and fun along the way in our work-hard, play-hard corporate environment.\n#LI-DNI\nCompany Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nRimini Street is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs. According to Gartner, the third-party support market will grow to $1.05 billion by 2023, a 200% increase. With tight IT budgets and flat global economic growth, IT and procurement professionals are actively looking for proven methods to cut costs while improving service. Rimini Street enables organizations to free up budget for strategic business initiatives by delivering savings of up to 90 percent on total maintenance and support costs, and to date, the company has saved organizations over $5 billion in total maintenance costs since its inception.\nWe’re building something special at Rimini Street. A company where people care about each other and trust each other to do the right thing. A company where highly intelligent and talented people come together to do challenging and meaningful work that makes a real difference to our clients, ending each day with a sense of achievement and balance in their lives.\nBe Treated Like the Best\nRimini Street hires only the best – and provides the compensation, bonus and benefit programs appropriate for proven top-performing professionals. We want our employees to have an opportunity to share in the financial success that results from our dedication to service excellence, high-quality deliverables and an unparalleled client experience\nNo bureaucracy, thousand-page rule books or politics — just everyone working together to build a great company through service excellence and client success\nWork hard, play hard environment – Rimini Street is a group of hard-working professionals who are passionate about achieving success, but we also enjoy opportunities to meet up at fun company events\nWe are also passionate about giving back to our communities around the world, with plenty of opportunities for volunteering and charity through the Rimini Street Foundation\nAll Rimini Street professionals are encouraged to grow and learn new skills\nAccelerating Company Growth\nTrading on Nasdaq under ticker symbol RMNI since October 2017\nAdded to the US Russell 2000® Index in 2018\nOver 4,000 clients, to date including 100 of the Fortune 500 and Global 100\nAnnual 2021 financial results of $326.8 million, up 16.3% year over year\nFiscal year operating cash flow of $42.1 million, up 107% year over year\nAnnounced the new patent pending Rimini Street Artificial Intelligence Support Applications, a result of the Company’s continued investment in optimizing support processes and ensuring global service delivery outcomes at scale. Using the AI Applications, Rimini Street has been able to deliver a better client experience and reduce software issue resolution times by 23%.\nCelebrated the 15th anniversary of the Company’s founding in 2005 to redefine the enterprise software support market and bring choice and value to software licensees around the world.\nRecent Industry Recognition\nReceived 33 awards in 2020, including 15 awards for excellence in customer service from awards companies such as the International Stevie Awards, the American Stevie Awards, and the Stevie Awards for Sales & Customer Service\nHonored with four Gold awards for Company of the Year in 2020.\nThe Rimini Street Foundation recognized with two awards in 2020 for Corporate Social Responsibility Program of the Year\nIn addition, in 2020 the Company supported more than 120 charities around the world through the Rimini Street Foundation, providing financial contributions, volunteer hours and in-kind donations including personal protective equipment to healthcare workers, senior centers, food banks and youth organizations globally. The Foundation also extended its charitable work in 2020 to Hong Kong, Malaysia, Mozambique, Sweden and the UAE.\nTo learn more about how Rimini Street is redefining the enterprise software support industry, visit http://www.riministreet.com\nRimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, national origin, sexual orientation, gender or gender identity, disability and protected veterans status or any other characteristic protected by law.\nPlease Note: Rimini Street does not accept resumes submitted by recruiting/staffing firms unless specifically requested by Human Resources. Unsolicited resumes will be ineligible for referral fees.Show more Report"}, {"company": "", "job": "Content Marketing Leader", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "IVC Research Center", "job": "Sales Development Representative (SDR) / Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9f9d14b0&cb=1676381729601&jobListingId=1008371867078&jrtk=3-1-1gp826co5ma4i801-1go9htl1gk622800-311832bbee8b9197-", "description": "Responsibilities\nDevelop new business leads\nExpand the portfolio by handling up-sales and potential new accounts, including cold calls\nManage all account-related processes and projects - from lead generation, pre to post sale, consulting, support, and back-office management\nHandle an existing account portfolio to preserve the customer base\nAttend industry conferences and meet-ups to represent the company, network and gather leads\nRequirements\n2-5 years’ experience as an account manager in a business-oriented market OR equivalent sales track record in successful B2B sales - a must\nAbility to withstand tight deadlines and ambitious goals\nBA degree – a must.\nBA in business, finance, marketing, economics, communications, technology, or related field – an advantage.\nStrong negotiation and presentation skills.\nExperience working with CRM Systems and Marketing automation systems.\nExcellent spoken and written skills in Hebrew and English. Other languages – an advantage.\nFamiliarity with technology, high-tech or investments markets - definite advantage\nReferences will be requiredShow more Report"}, {"company": "TripActions", "job": "Manager, Marketing (Growth Marketing Manager)", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.5", "link": "", "description": ""}, {"company": "Papaya Global", "job": "User Acquisition Manager", "city": "Herzliya", "date": "24h", "rating": "3.6", "link": "", "description": "Papaya Global is reinventing global payroll and payments. Our automated platform helps companies hire, onboard, manage, and pay employees in more than 160 countries.\nWe are looking for a qualified and experienced User Acquisition Manager to join our team. You will be responsible for user acquisition traffic including the development of overall creative, strategy, optimization, KPIs and ROI analysis.\nOur ideal candidate is an experienced professional with demonstrable performance marketing skills.\nYou’ll join our Marketing team based in our headquarters, Herzliya, Israel.\nYou Will:\nManage high budget and large-scale Search and Social PPC campaigns\nAnalyze and optimize campaigns constantly to maximize revenue\nInitiate and implement improvements and creative solutions to increase campaigns activity\nRespond quickly to changes in online marketing and adapt to capitalize on new opportunities\nRequirements:\n\nProven experience in managing Google search campaigns at large scale\nNumber oriented with analytical skills, comfortable with large sets of data and numbers.\nExcellent interpersonal skills, positive attitude.\nAbility to work independently and in a team environment.\nProficient in Microsoft Excel and large data analysis.\nFluent English - Verbal and written.\nExperience working with HubSpot/Salesforce or equivalent CRM tools -advantageShow more Report"}, {"company": "Marcomit", "job": "Senior Brand & Marketing Manager", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=307&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_78b77b1e&cb=1676381734342&jobListingId=1007945108233&jrtk=3-1-1gp826hau2ing001-1go9htl1gk622800-2c0f38eb50f0df4c-", "description": "Are you a seasoned project and client manager? Are you the type of person who immediately starts dissecting a massive project down to workable and manageable components? Are you client-oriented, friendly, patient, but also stand firm when needed? If so, you might just be the person we’re looking for!\n\nMarcomit is seeking a Senior Brand & Marketing Manager to join its ever-growing team of designers, content writers, video producers, project managers, and an occasional puppy.\n\nFirst thing first- the job\n\nAs Senior Brand & Marketing Manager, you will:\n\nEstablish and maintain strong working relations with multiple clients. You’ll be the face of Marcomit in both the good and the more challenging times.\nObtain detailed briefs from clients, assess their scope and budget, and delegate the corresponding tasks to relevant team members for execution.\nTrack project performance and ensure that it follows the projected timeline and budget.\n\n And now- You\n\nBesides the obvious qualifications- organizational and multitasking skills, detail-oriented, etc.- you’ll need to:\n\nBe Hebrew-English bilingual, both writing and speaking. Additional languages are an asset!\nHave some major communication skills, both client-facing and internally.\nPossess a Bachelor’s degree; any additional educational credentials are an asset.\nHave an impeccable ability to keep track of projects and timelines.\nBe resourceful, especially when things don’t go quite as planned.\n\n What you can expect working at Marcomit\n\nAn amazing, multilingual, multicultural team that (usually) loves working together.\nFresh oranges. We’re located in an orange grove- literally.\nFascinating clients from a wide range of fields. From drones to vegan protein, from space-industry freezers to smart lighting systems, you’ll become a bit of an expert in disciplines you didn’t even know were a thing.\nOpportunities to grow and develop, to take initiative and to devise new ways of working.Show more Report"}, {"company": "Natural Intelligence", "job": "Marketing Automation Manager", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.1", "link": "", "description": "Founded in 2009 and 100% self-funded to this day, Natural Intelligence is a leader in online multi-vertical marketplaces. Our global brands, Top10.com and BestMoney.com, help millions worldwide make informed decisions every day. Our proprietary platform, xMatch, harnesses AI and ML technologies in order to help consumers make easier choices, and find the right products and services tailored to their needs.\nWe are seeking a talented & motivated Marketing Automation Manager to join our Growth Department. This is an exciting opportunity for an innovative and creative person who comes from a background of engagement and performance-oriented content.\nResponsibilities:\nHands-on responsibility for implementing and monitoring email marketing campaigns, seeking to maximize performance KPIs, improving conversion and retention rates\nDefine the technical and creative requirements for marketing campaigns, including software setup, domain reputation, warm-up, and integrations\nManage and own all aspects of the CRM execution, including email marketing, push, in-app, SMS, and surveys\nWork closely with content writers, designers, product, and business departments to build campaign strategies and execute them accordingly\nOptimize campaign workflows, alerts, sequences, A/B, etc\nRequirements:\n\n2-5 years of hands-on email marketing and CRM\nGood HTML technical skills\nAbility to collaborate and communicate well with team members and stakeholders\nVery organized and well-structured individual (attention to detail is a must)\nPrevious experience in analyzing data with the ability to turn this data into actionable insights\nAbility to work in a fast-paced environment\nEnglish at a high professional level - a must\nPrevious experience with Salesforce - a must\nOnly suitable CVs will be considered.Show more Report"}, {"company": "Fiverr", "job": "Marketing Automation Manager, Stoke Talent", "city": "Tel Aviv-Yafo", "date": "18d", "rating": "4.3", "link": "", "description": "We're looking for a highly talented marketing automation manager who can plan, develop and implement automated marketing campaigns to increase user retention, engagement, and conversion rates with a focus on the company’s revenue.\nYou’ll be owning the user-journey set-up and optimization, creating and maintaining landing pages, data implementation, KPI reports, and monitoring.\nAbout Stoke (acquired by Fiverr)\n1 in 3 Americans works on a freelance basis today. By 2025, only 40% of the workforce will be salaried employees. The world is changing, but companies are finding it hard to keep up.\nStoke offers a SaaS platform that makes it easy for companies to work with freelancers from all aspects (sourcing, onboarding, tracking, payments, and compliance), so your teams can focus on getting things done.\nWe help tech companies and agencies increase their productivity by enabling them to tap into the world's most flexible workforce - the booming freelance economy - without the hassle and headaches that come with it.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\nMinimum 2 years of hands-on work experience with HubSpot - MUST\nMinimum 5 years of B2B marketing experience\nHigh level of English - a must\nUnderstanding of email best practices for email marketing creatives, templates, metrics and associated KPIs, segmentation, dynamic content, and testing methodologies.\nAnalytical mind, with the ability to make data-driven recommendations.\nSelf-motivated, creative thinker with a “can-do” attitude\nExperience in setting ABM infrastructure - Advantage\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nManage end-to-end automated marketing campaigns: from ideation, through set up & segment and ends with analysis & optimization.\nContinuously experiment: execute A/B tests on email concepts, subject lines, content, CTAs, sending times, layouts, and more.\nCollaborate with designers and copywriters, identify target audience segments and capture feedback from multiple stakeholders.\nOperating an admin system, analyzing & reporting, testing, project management and HTML coding.\nCreate and manage lists, workflows, drip campaigns, landing pages, email templates, forms, pop-ups, calls-to-actions, webinars, and more\nDevelop and own the user journeys to increase revenue\n\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Dealhub.io", "job": "Senior Business Development Representative", "city": "Holon", "date": "30d+", "rating": "4.2", "link": "", "description": "As a leading Sales solution company, DealHub's team consist of the best sales people, and are currently hiring a driven, hungry, rockstar Sales Development Representative!Our Sales Development team responsible for developing new business opportunities through outbound prospecting, cold calling, and email campaigns, while working closely with Marketing and Sales teams.As an SDR you will:Generate new business pipeline through outbound prospecting activities and inbound lead follow-upBooking demos with Account ExecutivesManage all data fields inputs to our CRM systemCollaborate with Marketing and Sales teams to grow the business opportunitiesUtilize various tools to help target relevant contactsMeet and exceed established objectivesWorking days: Monday to FridayREQUIREMENTSAt least 2 years experience as a BDR/SDR in a SaaS company - MandatoryNative written and verbal communicator in EnglishHighly motivated and \"hungry\" to succeedExcellent communication and interpersonal skillsCan multi-task well and work in a fast-paced teamWilling to work in a young and dynamic atmosphereHas a strong desire to grow within the role and companyJob Type: Full-timeExperience:SDR/BDR in a SaaS company: 2 years (Required)Show more Report"}, {"company": "Tel Aviv University", "job": "Senior Content Writer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Wanted: Content EditorStarting immediatelyThe Development and Public Affairs Division of Tel Aviv University is looking for a dynamic writer and editor to join its team. The role involves conceptualizing, writing and editing diverse materials in English for the purposes of fund-raising and PR. This is full-time, in-house position with excellent conditions.Job description:Writing content for the University’s website, print publications, and social networksEditing the University magazine, web articles, and other publicationsLeading the University’s social media strategyGiving input into other PR and marketing materials such as brochures and videosSupervising a small content teamRequirements:Relevant Undergraduate degreeEnglish at mother-tongue level a must (reading, writing and speaking)Fluent Hebrew a mustMinimum 3 years’ writing experienceProven editing experience of high-level publicationsAbility to translate diverse and complex activities into succinct and appealing proseStrong understanding of social media strategy and production, specifically Twitter and LinkedInProficiency in standard software such as PowerPoint, Excel and MS Word, etc.Experience working with graphic designers and graphic software - advantageAbility to work both independently and as part of a teamGo-getter, detail-oriented and creativeCover letter on why you think you are a qualified candidateResume in English2 relevant writing samplesOnly qualified applicants who have a proven writing background, and who submit all the requested material, will receive a reply.Job Type: Full-timeAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Lemonade", "job": "User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "", "description": "We're looking for a highly analytical, detail-oriented User Acquisition Manager to join our Paid Acquisition team. You'll play an important role in leveraging cutting-edge technology and data science models to aid sophisticated optimization efforts and proper budget allocation.\n\n\nIn this role, you'll\nManage and optimize global campaigns with a large budget, end-to-end\nBuild strategic and tactical action plans\nCollaborate closely with the Creative, Analytics, Product, and Data teams\nOwn measurement and reporting for your campaigns\nConstantly be looking for new growth opportunities\nWork both independently and as a part of a team\nWhat you'll need\n3+ years of experience in PPC, managing global, large-scale B2C campaigns focused on the Google ecosystem (with budgets of $500K+/mo)\nExperience with social / video platforms is an advantage\nMultitasking abilities under strict deadlines and within an ever-changing environment\nProven track record delivering results consistently\nAdept at using various marketing analytics tools\nAbility to think strategically about complex issuesShow more Report"}, {"company": "Nayax", "job": "Marketing Automation Manager", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Mitsubishi Motors (Thailand) Co., Ltd", "job": "P&A PROJECT PLANNING & MARKETING - SENIOR ENGINEER", "city": "Central", "date": "19d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f2f26cda&cb=1676381744534&jobListingId=1008406011193&jrtk=3-1-1gp826rakk60o801-1go9htl1gk622800-2d0c62a02b24d0e2-", "description": "Job Summary In charge of manage smooth supply and distribution of service parts and accessories including Railliart merchandise goods to Thai domestic market as well as overseas market Job Description • Assisting in implementation of new product / process development for accessories and reliant products.\n\nLiaise directly with supplier to follow up all aspect in new product development process and company’s expectation.\nMaintain project schedule by monitoring project progress, coordinating activities and resolving problems.\nProvide continued support to suppliers to ensure their performance meet the company quality.\nCoordinate with marketing team for activities arrangement to promote or products, Especially, Ralliart Product.\nWork with agency to complete the market material for new product being launched including big event such as Motor Show / Motor Expo.\nControl stock or Ralliart Product to support sale and clearing stock after the end of collection.\nSupport product information for both domestic and export sales.\nOther administration job to support team.\n\nJob Specification • Male/Female, age between 25 - 35 years old.\n\nBachelor degree in Marketing or Business Management.\nAt least 3 years’ experience in product development function especially fashionable product or accessory in automotive industry.\nGood understanding of inventory Control and follow up.\nCreative thinking and Good Human Relation and able to work individually.\nGood command of both written and spoken in English.\nAble to drive a car and have driving license.\n\nShow more Report"}, {"company": "Novartis", "job": "Essential Brand Lead", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=315&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_46f2e607&cb=1676381746075&jobListingId=1008439918428&jrtk=3-1-1gp826sq3kuhv801-1go9htl1gk622800-e45dc89283bc50a3-", "description": "110,000 professionals working together to improve patients' lives.\n\nThe role of the Essential Brand Lead will focus on developing and testing novel ways of promoting and driving the sales of our essential brands – thus setting the future ways of working for the new cross-functional working of the Israel business unit – Squad teams. Acting as a de-facto Essential brands Lab Head, the purpose of the role is to reinvent the driving growth of established brands.\n\nYour Key Responsibilities:\nYour responsibilities include, but not limited to:\n\nAccountable for delivering the therapeutic area brand performance with respect to sales, market share and profitability to meet or exceed budget targets. Increase Customer Life Time value of essential brands.As lab-head, use rapid-design process and feedback loop leveraging agile methodology. Provide out-of-the-box solutions using Design Thinking.Drive the growth of the Essential brands TA by establishing growth plans for existing products, effectively handling their life cycle, establishing and managing effective strategic partnerships.Entrepreneurial approach to portfolio management to optimize ROI across a diverse range of brands through the lifecycle by actively investing across brands with shared/pooled services and flexibly budgeting according to prioritized outcomes.Using targeted strategies and innovative, cost-effective GTM models to efficiently commercialize non-priority diverse set of brands. Use digital engagement channels, innovative access models & cross-portfolio reimbursement deals / discounts to improve value across the lifecycle, including Business-to-business selling, account management and contracting focus, “non-personal promotion” to HCPs.Incorporate opportunities to maximize lifecycle value and differentiate beyond efficacy to address non-clinical barriers and product enhancements (e.g., devices, digital services).Develop cross-TA solutions and implement a customer feedback loop to share and inspire other TAs. Drive, test and implement with agility new innovative operating model.Customer facing (at least 50%) to validate external competition benchmark for solutions either by interacting with customers or other industries and sectors.\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\n\nEducation: High level academic education in Life Sciences (Advanced degree in bioscience, medicine, business, and/or management)Proficient Hebrew and English, both written and spoken.Min. 5 years of experience in engaging various collaborators within the health sector.Experience as a Product Specialist in RX.\nExperience in cross functional teamwork and working on multiple projects.Strong leadership skills and ability to set a clear vision, handle multifunctional extended teams and network effectively.Experience in working with large data sets from various functions / backgrounds, commercial projects, digital transformation and governance projects.\n\nDesirable Requirements:\n\nBrand Manager experience\n\nWhy Novartis?\n\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\n\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do here at Novartis!\nDivision\nPHARMA\nBusiness Unit\nREGION EUROPE PHARMA\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nMarketing\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "AppsFlyer", "job": "Regional Marketing Manager- Temporary", "city": "Herzliya", "date": "15d", "rating": "4.4", "link": "", "description": "Are you a passionate B2B marketer with experience in hyper-growth SaaS and mobile businesses? If you are, read on!\n\nOur mission at AppsFlyer is to give digital marketers the very best tools and insights to help them be as successful as they can be. With a highly talented, global team of over 1,500 people, and growing, we're only just getting started.\n\nWe're looking for a hungry, passionate, tech-savvy B2B marketer to join our vibrant, friendly office in Herzliya and lead our field marketing programs and customer lifecycle activities in SANI region (South Europe, Africa, Nordics, Israel). You'll be taking a market-leading, mission critical SaaS offering out to digital marketers and brands in the region.\n\nIn your B2B toolkit, you'll be highly analytical, independent, a competent storyteller, a first class project manager and have a flair for putting together exceptional events and experiences.\n\nWorking closely with your local colleagues in Sales, Customer Success and Partnership Development, as well as a large, cross-functional team of marketing experts in our Global HQ. You'll be responsible for planning, coordinating, executing and reporting all revenue-focused marketing programs for each individual market to deliver new customer leads, existing customer engagement and partnership development goals.\n\nThe role reports to the Managing Director of EMEA-SANI, and to the Head of Marketing for those respective markets\n\nThis position is temporary for one year\n\nWhat you'll do:\n\nEvents - You're passionate and hands-on about events and will work with Sales, Customer Success, Partnership Development and third party partners, such as trade associations and conference organizers, to create a pipeline of events across all markets that help raise AppsFlyer's brand awareness, position the business as the domain authority for mobile measurement and drive new demand and upsell opportunities.\n\nContent, thought leadership & PR - You enjoy creative copywriting and are responsible for positioning AppsFlyer as the market leader in your local markets. You'll be working closely with the Global Content & Mobile Insights + Comms teams, as well as local PR partners, you'll create thought leadership campaigns to promote AppsFlyer's portfolio or cross-device measurement and fraud protection services. These could be anything from blogs and white papers, to major PR campaigns or event content\n\nData - You're all about the numbers. As the lead for the individual country growth squads, you'll be responsible for managing ongoing growth initiatives, reporting the results of our time and financial investments and optimizing our activities on an ongoing basis. You'll have the support of our Global Marketing Operations team to do so, as well as numerous BI tools\n\nTeam player - You're a go getter and problem solver with a great team spirit. You're happy being part of a close knit team that works hard and plays hard and you're not afraid to roll your sleeves up and do what's right for the team\n\nWhat you have:\n\n3-5 years of experience in B2B marketing roles ideally within the technology, SaaS or mobile software sectors\nProven track record of planning and executing on field marketing campaigns, generating pipeline and strengthening customer relationships.\nExceptional project management skills, writing, communication, and presentation in English.\nPassionate about technology and the latest trends and best practice in B2B marketing\n\nBonus Points:\n\nA degree in Marketing or related subject area\nExperience in CRM and events systems (Salesforce, Splash & Marketo as advantage).\nCompetitive analysis and account mapping experience - an advantage\nAbility to speak an additional relevant language other than English is highly desirable, but not a must have\nKnowledge of the E-commerce, gaming or finance mobile marketing world an advantage\n\nAs a global company operating from 20 offices worldwide, we reflect the human mosaic of the diverse and multicultural world in which we live. We ensure equal opportunities for all of our employees and promote the recruitment of diverse talents to our global teams without consideration of race, gender, culture, or sexual orientation. We value and encourage curiosity, diversity, and innovation from all our employees, customers, and partners.\n\n\"As a Customer Obsessed company, we must first be Employee Obsessed. We need to make sure that we provide the team with the tools and resources they need to go All-In.\" Oren Kaniel, CEOShow more Report"}, {"company": "Broadway Gaming", "job": "SEO Account Manager", "city": "Herzliya", "date": "30d", "rating": "5.0", "link": "", "description": "Broadway Gaming is a dynamic and expanding online gaming company operating mainly in the UK gaming market. We offer Bingo, Casino and Slot products across multiple brands. We have office locations in Dublin, London, Tel Aviv, and Romania.\nWith a wide variety of backgrounds comes a wealth of experience, ideas and personalities and we use these to help us create a great service and a great place to work and learn. Because collaboration is fun and benefits us all and ultimately it benefits our customers!\nResponsibilities\nManage on-page optimization efforts and lead content initiatives\nWork on off-site link building initiatives\nPerform keyword research for new pages and improve existing content to maximize search engine performance\nConduct SEO audits and continuously improve upon previous SEO efforts\nWork on technical SEO initiatives using tools like Screaming Frog and Ahrefs\nExperiment with new SEO tactics and strategies, continuously testing and problem solving\nPlan, develop, execute and measure SEO projects, including improving keyword rankings, organic traffic, and content generation\nBlog management\n\nRequirements\nBA Degree in Marketing, Business administration or related field desirable\n2 years+ of experience in SEO (international market preferably)\nExperience working within a regulated industry is highly advantageous\nStrong understanding of the gambling industry including ongoing changes in regulations and guidelines\nAbility to prioritize & managing multiple projects simultaneously and efficiently\nKnowledge of SEO tools, such as Ahrefs, Screaming Frog, Google Search Console, SEMRush, Moz, Majestic, Google Analytics, Google Speed Insights, and more\nPHP, CSS, HTML, and coding background a plus\nExcellent verbal and written communication skills and the ability to interact professionally with a diverse group of internal and external stakeholders\nThe ability to adapt to a rapidly changing regulatory and business environment.Show more Report"}, {"company": "Swimm", "job": "Marketing Automation Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "", "description": ""}, {"company": "Elementor", "job": "Senior Product Analyst", "city": "Ramat Gan", "date": "24h", "rating": "4.2", "link": "", "description": "We are looking for a sharp and highly analytical Product Analyst to join our fast-growing company and help us make data-driven decisions for performance optimization.\nAs a Product Analyst, you will play a key role in shaping Elementor's product and business strategy, defining our KPIs, and identifying business opportunities.\nAs a member of the Analytics team in our Data department, you will work across the organization and provide key insights to multiple departments (Marketing, Product, Finance, Business Strategy, CX, and more), helping them focus on what’s important.\nThis position is located in Israel only.\nRequirements:\n\n4+ years of experience in quantitative analysis, preferably at an internet company\nExcellent communication skills with the ability to deliver results of analyses clearly and effectively\nExcellent SQL skills - a must\nExperience with at least one of the following visualization tools: QlikView, Qlik Sense, Power BI, Tableau - a must\nStrong Python capabilities - a major advantage\nExperience working with big data tools: Redshift, BigQuery, Databricks, etc. - a must\nA highly independent and creative team player who works well with others\nHands-on technical experience with Google Analytics, Google Ads, and Facebook Ads - an advantage\nWork Environment:\n\nWhat do we do?\nElementor is the leading website building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 12M websites powered by Elementor. More than 8% of all websites around the world are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe believe in empowering both our employees and our users.\nElementor is a place where you can truly grow professionally and personally.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey. We take great pride in Elementor's constant scaling.\nResponsibilities:\n\nWork with various managers to learn their business insight needs, including tracking metrics, dashboards, and reports\nAct as a bridge between units’ business needs and the BI department, ensuring high-quality execution quality, data integrity of analyzed insights, and reporting deliverables\nEstablish reporting methodologies and cross-department standards\nGo beyond the numbers to communicate, influence, support, and execute business decisionsShow more Report"}, {"company": "MOONEE", "job": "Data Analyst (UA & Monetization Manager)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=320&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fb75d29e&cb=1676381752769&jobListingId=1008232767743&jrtk=3-1-1gp8273c9nccp801-1go9htl1gk622800-2d4a39673bcd79eb-", "description": "Location Tel-Aviv, Israel\nDate posted August 3, 2022\nEmployment Type Full-time\n\nAt Moonee, we’re working hard to redesign the way mobile games are published today.\nWe’re seeking a qualified user acquisition specialist to extend our global reach through expert buying methods and analytical skills. Our ideal candidate will be trusted to dive right in, take the lead, use initiative, and help global studios to expose their work to the world. Highly skilled at media buying and optimization, this person will join and inspire a team of like-minded go-getters to achieve our company vision.\n‍\nResponsibilities\nOptimize demand waterfalls based on results.\nPlanning and hands-on management of social and networks campaigns to drive app installs and specific KPIs.\nAnalyze campaign performance and optimize accordingly.\nTest and experiment with new online marketing strategies and tactics.\nAdminister reports, and key reporting tools on a daily/monthly basis.\nQualifications\n1 years of proven experience in managing mobile apps campaigns - plus\nExperience in waterfalls optimization.\nAn excellent English.\nMotivated and Organised.\nCreativity, out of the box thinking and good writing skills.\nA quantitative mind and love for numbers, exceptional analysis skills.\nExperience working in mobile gaming companies - plus.\nBA in analytical degree - plus.Show more Report"}, {"company": "ControlUp", "job": "Senior Technical Writer", "city": "Rishon LeẔiyyon", "date": "21d", "rating": "4.1", "link": "", "description": ""}, {"company": "Publicis Media", "job": "Global Clients Lead", "city": "Bnei Brak", "date": "30d+", "rating": "4.0", "link": "", "description": "Company Description\nPublicis Media creates value for clients through global media agency brands and scaled capabilities across investment, strategy, insights and analytics, data and technology, commerce, performance marketing, and content by harnessing the power of the modern media landscape to drive one-to-one consumer engagement at scale.\nThe Global Clients Lead is expected to be a business partner across multiple global clients, using their deep knowledge and understanding of the client's business in order to create the best conditions for the right work to thrive, leading to the success and growth of both our partners and our agency.\n\nJob Description\n\nManage day-to-day deliverables and work closely with all departments\nBuild strong relationships with the client at all levels through a superior understanding of the client's business issues, marketing communications, and competition.\nProvide vision, inspiration, and strategic leadership to both the agency team and the clients. Ensure a collaborative approach internally and across agency partners to ensure happy and productive relationships.\nDrive Growth of scope of work ensuring the account is positively contributing to the agency’s revenue growth and profitability.\nDevelop and mentor team members; provide feedback and opportunities for growth.\nDevelop Brand, competitive, and audience analyses, strategic brand frameworks, and campaign and product launch strategies.\nWork across the Publicis Network & drive change for the client at a global level\n\nQualifications\n\n5+ years of related industry experience; preferably consulting, interactive, agency, or direct marketing experience\n2+ years of proven track record in developing senior-level client relationships\nStrong knowledge or experience in marketing and media,\nAn exceptional grasp of media planning, negotiation, and performance analysis and an impressive understanding of the digital\n Apply analytical problem-solving skills to deliver results\nStrong communication skills and impressive attention to detail\nDemonstrate exceptional interpersonal and communication skills to build client rapport\nStrong project management and performance management skills – you are crystal clear when it comes to delegating and providing feedback\nAbility to collaborate effectively at all levels and functions of an organization\nStrong client-service orientation\nProven ability to manage projects to successful completion, multi-task, and work within tight deadlines\nAbility to lead a team effectively and provide direction through coaching and mentorship\nEnglish- verbal and written- high levelShow more Report"}, {"company": "Moon Active", "job": "Mobile User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=323&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ffceb7e5&cb=1676381756934&jobListingId=1008248121839&jrtk=3-1-1gp8277dli3b6801-1go9htl1gk622800-320200a0639ba50f-", "description": "Moon Active is one of the world's fastest-growing mobile game companies, providing entertainment to millions of active users across the universe. The company is headquartered in the heart of Tel Aviv.\nAs we expand, we're looking for a Mobile User Acquisition Manager to join our amazing Marketing team.\nResponsibilities\nHands-on campaign management on various mobile ad networks\nBuild and maintain strategic relationships with key acquisition partners\nManage fast-paced and dynamic projects in a highly organized manner on schedule and on budget\nCollaborate with different teams members within the marketing department to deliver and execute successful mobile marketing campaigns\nData Analysis (Identifying trends, opportunities, discrepancies)\nRequirements\n3 + years in mobile user acquisition and ad buying analysis experience at scale\nCampaign management on self-served platforms - a Must\nHighly analytical and technical: Understands components of ad calls across various channels\nAbility to manipulate and analyze large quantities of data and present it in reports\nDeep understanding of mobile attribution\nWillingness to learn and use third party ad systems such as ad servers, DSPs, and analytics tools\nAbility to take on multiple projects at the same time\nStrong organizational, analytical, presentation and problem solving skills\nProfound knowledge of MS-Office Products (Excel in particular)\nFluent English - verbal and written\n#LI-HybridShow more Report"}, {"company": "Cisco Systems", "job": "Open Source Software Engineering Lead", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=324&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_695339cf&cb=1676381758315&jobListingId=1008430508102&jrtk=3-1-1gp8278pei3be801-1go9htl1gk622800-5028f7599acd9bc2-", "description": "Open Source Software Engineering Lead\nWho We Are\nWe are Emerging Technologies and Incubations (ET&I) at Cisco. We are chartered to build the next new business for Cisco. To take Cisco into new markets, and especially towards new personas -\nBoth buyer and user. And like building a startup from the ground up, it’s all about having an entrepreneurial approach. Taking an idea from an astonishing thought to a product that solves a critical need, to an experience that delights users and customers.\nIt’s about innovation. From 12 months out to 5 years in the future, wearing multiple hats, failing and learning fast, challenging assumptions and finding new ways of solving problems. Driving form from ambiguity. It’s about creativity. We are looking for entrepreneurs, Problem solvers, Designers & Marketers. Product Led Growth experts. Business Development, SDRs, Customer Success. Product Managers, SWEs, SREs. Data Scientists and ML engineers.\nYes, we are building the next set of startups with the support of a trusted name like Cisco. Where else will you get to do this? We are Cisco ET&I. We run bold, we run agile, and we run ambitious. Come create with us.\nLearn more about us at https://eti.cisco.com.\nWhat You’ll Do\nThe Portshift team, now part of Cisco's Emerging Technologies and Incubation group, is building open-source toolset, Cisco OpenClarity, that will help developers and DevOps teams to secure modern application development infrastructure (CI/CD, containers, k8s, APIs, etc). You will build and lead engineering advocacy as a critical bridge between our Product, Engineering and Marketing groups, and our open-source community.\nPrimary responsibilities of this role include:\nCreate and nurture a community where people can learn about the impact that cloud native security can have on their teams, on our product, and how they can influence it.\nIdentify the best channels and engage with our users (e.g., Github, discussion forums, technical demos, events, social media or direct feedback sessions) to build a positive and strong relationship between the developers community and our product & engineering teams, enabling us to build the best solution.\nBuild and publish engaging content : construct helpful examples and guides, ensure documentation meets the community needs, create engaging and educating blog posts, and share excellent community-created content alongside curated case studies.\nParticipate in discussions with the technical staff, at all levels (from individual contributors to executives), to foster user adoption and viral growth, and feed our product roadmap with community feedback.\nDevelop and execute holistic launch plans for major releases and updates to our product : understand the scope of changes, work with developers to assess impact, construct a timeline for rollout, and develop a process to guide the community through changes.\nWho You Are\nRequired Qualifications\nSolid technical background, with previous experience in cloud native security solutions.\nStrong presence in the developer community.\nExceptional external communicator, adept at interfacing with partners and large audiences.\nExperience in rallying internal partners and project managing on a deadline. In particular, you've partnered with engineering teams to deliver anticipated products.\nCreative, with an informed curiosity about marketing and business opportunities that the Open-Source Product Office will build for Cisco.\nSkilled community leader, at your best when advising and engaging with large communities, so they can gain members and momentum over time.\nReady to own a program end-to-end and build an organization that will grow as a pillar of the company.\nExperience working on Open-Source products.\nIt will be great if you have\nExperience owning and editing technical documentation.\nExperience developing tutorial materials (e.g., self-guided tutorials, videos, knowledge bases) to onboard and educate users.\nProfessional experience working as a software engineer.\nWhy Cisco\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\nWe adopt digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do –you can’t put us in a box!\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us.\nWe recognize that diverse teams make the strongest teams, and we encourage people from all backgrounds to apply.\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "Fiverr", "job": "Product Marketing Lead, Stoke Talent", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "What's the job?\nWe are looking for a Product Marketing Lead to lead and own the product messaging and positioning for Stoke Talent. This role will work cross-functionally between Product Management, Marketing, and Sales to ensure that we effectively communicate the current and future value of Stoke’s unique value proposition.\nAbout Stoke (acquired by Fiverr)\n1 in 3 Americans works on a freelance basis today. By 2025, only 40% of the workforce will be salaried employees. The world is changing, but companies are finding it hard to keep up.\nStoke offers a SaaS platform that makes it easy for companies to work with freelancers from all aspects (sourcing, onboarding, tracking, payments, and compliance), so your teams can focus on getting things done.\nWe help tech companies and agencies increase their productivity by enabling them to tap into the world's most flexible workforce - the booming freelance economy - without the hassle and headaches that come with it.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\n3+ years of experience as a product marketing manager - a must\n5+ years of experience in a similar product related position at a B2B SaaS company - a must\nExperience in creating GTM strategies for new products and features and execution of relevant marketing campaigns and activities\nAbility to research marketing trends and other related topics\nPast experience in working closely with Product Management teams, with the ability to translate technical concept into successful product and marketing material\nAbility to work self sufficiently, and excel in a high-paced, changing environment\nExperience creating brochures, demos, slide decks, videos and running webinars\nExcellent English written and verbal communication skills no matter the audience or context\nEvangelize the freelancers management category and product vision in speaking opportunities and conferences and in briefings with prospects, customers, partners, media and industry analysts.\nBachelor's degree required\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nThe Product Marketing Manager will own the positioning and messaging for Stoke Talent translating product functionality and technical details into user benefit and value\nYou will develop product positioning and messaging informed by user research, market insights, and product understanding\nResearch and understand our buyer personas to ensure our product is designed and delivered to create value for them, acting as a partner and strategic advisor to product managers\nBe the voice of product releases, owning and developing all relevant collateral (emails, release notes, brochures, videos, webinars, sales decks in-product solutions, demos)\nMeet with customers and drive activities to increase adoption\nConduct ongoing competitive analysis along with market, and customer research\nPartner with Sales and customer success teams to regularly educate on the latest products and how to position and sell them\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Databricks", "job": "Manager, Field Engineering", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.5", "link": "", "description": "The Solutions Architect Manager will lead a team of pre-sales Solutions Architects. As you will help to lead our Israel expansion, you will build technical pre-sales teams. Your experience partnering with the sales organisation will help close revenue with the right approach whilst coaching new sales and pre-sales teams to work together. You will guide and get involved to enhance your team's effectiveness; be an expert at communicating complex, business value-focused solutions; support complex sales cycles, and build relationships with important partners in large corporations.\nThe impact you will have:\n\nManage hiring and building the Solutions Architect team, scaling the designated field engineering segment organization without sacrificing quality\nBuild a motivated collaborative culture within a hyper-growth team. To embody and promote Databrick's customer-obsessed, teamwork and diverse culture\nSupport increase Return on investment of SA involvement in sales cycles by 2-3x over 18 months\nEnsure a solution and value-based selling field-engineering organization\nDisplay an understanding of needs and revenue potential for accounts in the assigned region\nBuild Databricks' brand in Israel in partnership with the Marketing and Sales team\nWhat we look for:\n\nFamiliar with building a team of successful Big Data, Cloud, or SaaS professionals\nHave experience scaling and mentoring field or technical teams from scratch at hyper-growth speed\nKnowledgeable in and passionate about data-driven decisions, AI, and Cloud software models\nGreat at instituting processes for technical field members to lead efficiency\nTechnical background either in Data Engineering / Database technologies or Data Science\nFluent in Hebrew\n\nBenefits\n\nBenefits allowance\nManager's Insurance or Pension Fund\nEquity awards\nPaid parental leave\nGym reimbursement\nAnnual personal development fund\nWork headphones reimbursement\nBusiness travel insurance\nAbout Databricks\n\nDatabricks is the lakehouse company. More than 7,000 organizations worldwide — including Comcast, Condé Nast, H&M and over 50% of the Fortune 500 — rely on the Databricks Lakehouse Platform to unify their data, analytics and AI. Databricks is headquartered in San Francisco, with offices around the globe. Founded by the original creators of Apache Spark™, Delta Lake and MLflow, Databricks is on a mission to help data teams solve the world's toughest problems. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.\n\nOur Commitment to Diversity and Inclusion\n\nAt Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.Show more Report"}, {"company": "Joonko", "job": "Senior Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": "*In order to consider your application, PLEASE INCLUDE a link to YOUR PORTFOLIO*\nJoonko is looking for a Creative Senior Marketing Designer with outstanding conceptual and visual design skills as well as a strong understanding of digital marketing across multiple channels. You will be responsible for strategically thinking through our seasonal campaigns and executing with great attention to detail in a way that aligns with our overall style guidelines and resonates emotionally with our customers.\nAs a Senior Marketing Designer, YOU will have the opportunity to take part in turning big ideas into simple features and dealing with the continuous challenge of making the complicated simple by working with the various company departments.\nYou'll join our Marketing team based in our headquarters, in Tel Aviv, Israel, and work closely with our NYC-based marketing team.\nIn your role you will be responsible to:\nOwn and design marketing assets and visual materials for our website, produce infographics, one pager, print assets, company swag, internal branding, conferences, social media, and more.\nPlay a significant role in implementing, incorporating, and end-to-end adoption of Joonko's new brand, Develop our brand identity, standards, and brand management tools as needed.\nCommunicate ideas and concepts clearly.\nWork collaboratively with marketing, Developers, PR, video, design, and other stakeholders to gather information, understand the end goals and strategize communication approaches.\nTo be successful in this role, you'll need to be:\nImaginative, creative, and curious.\nThoughtful and fun to work with.\n3+ years of relevant multidisciplinary design experience (experience from a SaaS company - Must).\nBachelor's degree in a related field or equivalent practical experience.\nExperience collaborating with multidisciplinary product and marketing teams.\nExpertise with design tools such as Sketch, XD, Photoshop, Illustrator, Figma, InDesign, but skilled in creating lo-fi prototypes and sketches (whiteboards, post-it's, etc).\nYou know how to give and receive constructive criticism, and are willing to apply it to improve your work.\nPresent a portfolio highlighting multiple projects and your direct contributions.\nHigh level of English, and comfortable with extensive communication - verbally and written.\nAbout Joonko\nJoonko is a venture capital-funded Software as a Service company focused on taking fairness in the workplace to the next level. Using Artificial Intelligence and machine learning, Joonko is enabling companies to achieve diversity, inclusion, and belonging throughout the employee's lifecycle. We do this by bringing real-time insights to the attention of decision-makers.\nWe're a hardworking, collaborative, cross-cultural team that believes in transparency, honesty, and (most importantly) having fun! We drop our egos at the door, embrace the humbling humanity of #startuplife, and fuel ourselves with a relentless passion for making the world a slightly better place each and every day. We're geeks, foodies, athletes, millennials, feminists, activists, allies, musicians, and more. We know it's tough, but we're in it together.\n*** If you are not sure that you're 100% qualified, but up for the challenge - we want you to apply. ***Show more Report"}, {"company": "riverside.fm", "job": "Marketing Design, Team Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Riverside empowers creators and businesses to create high-quality audio and video content. Since launching,\nwe have experienced rapid growth and are trusted by customers such as Spotify, NY Times, NBC, CNN, and iHeartMedia.\nWe are looking for a marketing design lead to join our Marketing team. This role combines strategy, management, and hands-on execution for various projects.\nWhat you’ll do:\nLead all design processes and projects while guiding other designers to success\nOwn and evolve Riverside’s visual brand through various projects and channels, including online campaigns, ads, branded content, social media assets, emails, landing pages, internal needs, and more.\nElevate the design of our website and landing pages – evolve the visual language, design new pages, update old pages, and develop scalable processes to improve efficiency.\nWork closely with the paid, organic, and product marketing team to optimize design toward the business KPIs\nSupport product releases through various visual assets and collaborate with other departments to support their needs.\n\nRequirements:\n\nWho you are:\n4+ years experience in hands-on design, with 2+ years working in the Marketing Design field at a SaaS company\nStrong design portfolio with a deep UI/UX & online marketing understanding\nHave the ability to lead a project from the concept stage to the last details\nExcellent organizational skills and ability to prioritize and meet deadlines\nAdvanced knowledge of design tools - Figma, Photoshop, Indesign, Illustrator.\nGood verbal and written communication skills in English\nBonus:\nIllustration skills\nUp to date with the latest trends in the design world and passionate about learning new things\nUnderstanding of KPIs, testing, and optimization\nAfter Effects & Premiere pro workflow understanding\n\nValues that help you succeed at Riverside:\nAn investigator by nature who is not afraid of encountering obstacles\nFlexibility to work on various projects with diverse audiences and formats\nSelf-motivated with the ability to work both independently and as a real team playerShow more Report"}, {"company": "Artlist", "job": "Senior Creative Marketing Designer", "city": "Tel Aviv-Yafo", "date": "4d", "rating": "4.7", "link": "", "description": "Artlist is a fast-growing creative technology company providing video creators with high-quality music, sound effects, footage and digital assets for video, as well as powerful video and image editing software. With our revolutionary license and cutting-edge creative tools, we’re on the fast track to becoming the ultimate 360 degree solution for video creators.\nToday, Artlist is the go-to licensing provider for creators in over 160 countries. Among our 16M clients are Google, Apple, Nike, Coca-Cola, Ikea, Mercedes, Samsung, Wix, Netflix, Dior and many more.\nArtlist consists of 3 products:\nArtlist.io, a royalty-free music, stock footage platform and SFX platform\nMotionArray.com, an all-in-one marketplace for creators that offers video templates, presets, music, SFX, stock footage, motion graphics and stock photos\nFXhome, a cutting-edge video, VFX and image editing software\nAbout the role:\nOur team is looking for a Senior Marketing and Branding Designer with a strong background in conceptual design, visual design, and digital design. As part of this position, Artlist’s style will be defined in collaboration with the production and content teams. In addition, we are seeking a candidate who is capable of thinking strategically about our campaigns, expanding our design language, and executing highly detailed projects. Become part of a supportive, creative team of experienced and talented professionals, where you will be able to learn, grow, contribute, and develop.\nWake up for this:\nBe a key contributor to the development of the company’s brand, tone of voice, and look & feel\nOwn and design our website’s marketing assets and visual materials.\nInfluence, develop and update our brand identity and infrastructure, utilize cutting-edge tools to improve the quality of our creative work\nGather information, clarify goals, and develop creative strategies for the company by collaborating with marketing, content, product, product-marketing, production experts, developers, and other stakeholders.\nBuild a data-driven approach for sharing with other teams to determine improvements based on the experiences of users\nRequirements:\n\n+5 years’ experience working in B2C companies and a strong understanding of the design process, focusing on digital and creative design.\nA bachelor’s degree in art or design or an equivalent degree\nExpertise in Figma (Must)\nExcellent knowledge of Adobe Suite (Photoshop, Illustrator) and After Effects - a big advantage.\nExceptional portfolio of creative and digital marketing projects, including creative branding projects, website and mobile design, brandbook guidelines, illustrations, and infographics.\nA team player with excellent organizational skills and a positive attitude with excellent social and personality skills\nExtensive experience in senior management\nSelf-driven, independent, and capable of leading end-to-end projects.\nExceptional thinker with the ability to think outside the box.\nExperienced in working with design systems\nA high level of proficiency in written and spoken English\nAbility to manage multiple projects simultaneously and possess strong project management skills\nExpertise in user data processes, including A/B testing, user interviews, and user testing (creating funnels, metrics, insights dashboards, and segmentation), as well as data analytics tools. Fullstory and UserTesting.com - A big advantage\n Please provide a link to your portfolioShow more Report"}, {"company": "RYB Technologies", "job": "Regional Marketing Manager – Israel", "city": "Rosh Ha`Ayin", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=330&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ac78433f&cb=1676381767608&jobListingId=1006986489934&jrtk=3-1-1gp827hrsjm5i801-1go9htl1gk622800-ac1e171a9c8b39dc-", "description": "The Regional Marketing Manager in Israel will be responsible for leading software company’s market strategy planning and execution in the country. The Regional Marketing Manager is a key position in the marketing department. The position deals with marketing of all business lines and business segments both to business partners and to customers. The day-to-day work involves a very diverse range of activities in both marketing strategy and hands on marketing communications.\n\nResponsibilities:\n\nStrategy and marketing plan:\n\nUpdate and tune company’s marketing messages\nResearch and understand market dynamics and trends\nAnalyze and track competitors’ activities and offering and make sure company’s position as the number 1 player remains\nBuild and monitor an annual marketing plan\n\nSales and Lead Generation\n\nWork with the sales department to initiate and execute marketing campaigns to both existing and new customers.\nWork with the digital department on implementing lead generation strategies and lead nurturing programs\n\nMarcom & PR:\n\nWrite and produce marketing materials and collaterals\nWork with customers to case studies\nInitiate, orchestrate and manage company’s customers and partners events, including our customer events with more than 1000 attendees\nWork with the PR agency to maximize and optimize media exposure\nEnsure proper implementation of our visual identity and brand guidelines across all marketing channels\nManage vendors in the areas of graphic design, branding, PR, productions and more\n\nRequired Skills & Expertise:\n\nAt least 5 years of experience in B2B marketing, preferably in the Software & Technology industry\nGood understanding of content marketing and digital\nProven track record in branding and event production\nPassion for technology products\nA multi-tasking star\nPerfect English and Hebrew, including writing\nPosition is based in Rosh Ha’ayin\nSend CV to jobs@rybtech.com\n\nThis position is closedShow more Report"}], [{"company": "Similarweb", "job": "Senior Product Marketing Manager - Shopper Intelligence", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=301&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6a108758&cb=1676381769767&jobListingId=1008421793957&jrtk=3-1-1gp827jqpkbn6801-1go9htl1gk622800-2ca2965a9562e1aa-", "description": "Similarweb is the leading digital intelligence platform used by over 3500 global customers. Our wide range of solutions power the digital strategies of companies like Google, eBay, and Adidas.\n\nWe help our customers succeed in today's digital world by giving them access to data-driven insights, competitive benchmarks, strategic analysis, and more.\n\nIn 2021, we went public on the New York Stock Exchange, and we haven't stopped growing since!\n\nWe believe in balancing between the flexibility of working from home, and the fun of working together and face to face personal connections. That is why, at Similarweb we have implemented a Hybrid model, in which you work from the office 3 days, and can decide to work from home two days a week. Enjoying the best of both worlds\n\nWhat does the Similarweb Product Marketing Team in Shopper Intelligence do?\n\nYour job will be to demonstrate how Similarweb Shopper Intelligence solves eCommerce professionals' most critical business questions. From the optimization of user acquisition to the epic transformation of your eCommerce strategy - Shopper Intelligence helps you monitor consumer demand, analyze shopper behavior and optimize their onsite search strategies to win in the eCommerce world. We approach product marketing as a mission-critical opportunity to disrupt the market research category, make our customers data-driven superheros, and ultimately let Similarweb's actionable insights speak for themselves.\n\nAs if You will shape the voice and tell the story of Shopper Intelligence's value for SMB brands selling on Amazon.com. You will ensure the entire company speaks the same language when it comes to your product's messaging and positioning. You will lead product launches from alpha to general release, ensure customer-facing teams are trained and ready to sell, and effectively communicate to customers. You will closely collaborate with our product, solutions, marketing and sales teams to define, develop and execute product marketing strategies & plans. You will drive new sales and post purchase engagement and retention initiatives for your products and help educate and grow a healthy user base.\nAs a Senior Product Marketing Manager at Similarweb:\n\nYou will be expected to think and act both strategically and tactically: from the creation of plans, to hands on execution. You must be a self-starter, comfortable with ambiguity in an ever-changing environment, and pay careful attention to detail. You must have the ability to quickly formulate strategies and plans that are backed by data & storytelling and execute across many work functions simultaneously.\n\nBuild a deep understanding of our customers & their use cases, Shopper Intelligence's value proposition, the market, the competition as well as the Amazon ecosystem to help drive customer engagement.\nDevelop and implement lead-generation campaigns and programs that drive customer acquisition while building brand awareness.\nCreate feature positioning, messaging and marketing strategy (based on market factbase and data analysis) and produce content that communicates the value of the Shopper Intelligence platform in our customers' language.\nIdentify marketing strategies and partnerships to accelerate revenue growth and drive traffic to our website in order to activate, onboard, educate, engage, up-sell, and retain customers.\nWork closely with a cross-functional team of product managers, engineers, marketers, business managers, and salespeople to launch features globally.\nPartner with Product on strategy, positioning, differentiation and product launch; Marketing on content & campaigns; Enablement on training; GTM on customer feedback and education\nWork with our Product Education team to create relevant content that successfully educates customers how to onboard and get value from the product.\nThink creatively and analyze data to strategically direct next steps for A/B testing and continually improve performance through optimized messaging and targeting.\n\nWhat will I bring to the team?\n\nAt least 1+ years of experience in product marketing\nExperience in a fast paced B2B SaaS or DaaS company, Ad Tech, or relevant marketing/industry experience (i.e. CPG and Retail or prior experience with Amazon ecommerce a must)\nMust be fluent in digital and social media channels as well as have an understanding of integrated marketing and communications strategies Experience in customer journey mapping a plus, but not required\nCaptivating storytelling, superb communication, & presentation skills\nAble to work independently & autonomously, focusing on key outcomes amidst competing priorities & tight deadlines\nTeam player, strong at facilitating alignment & building relationships across an organization\nAnalytical thinker, excellent problem solving, planning and execution skills\nMotivated & hard working\nAbility to be flexible and adapt to change\n\nWhy choose Similarweb?\n\nWe believe that building a great product and a great company starts with finding amazing people and helping them grow and develop professionally and personally. At Similarweb, you'll be surrounded by curious, witty and passionate people that are hungry to drive real impact. We are proud to have over 800 creative and talented professionals, and we strongly believe in winning together as a way of driving a successful business!\n\nOur Values:\n\nData Driven: We believe data driven decisions are the key to success and we are evangelists for the power of digital insights\nPassionate: We care deeply about what we do, are accountable for our actions and are committed to helping each other\nExcellence: We believe in excellence as a mindset. It's in our nature; and we work hard to make a difference\nWinning Together: We know what it takes to build a great company and a great product and it begins with valuing each and every member of our team and working together to reach new heights.\n\nSimilarweb is a global company that strives to create a workplace reflective of the communities we serve, where individuals are empowered to bring their full, authentic selves to work. We are committed to inclusivity across race, gender, ethnicity, culture, sexual orientation, age, religion, spirituality, identity and experience. We believe our culture of equality and mutual respect also helps us better understand and serve our customers in a world that is becoming more global, more diverse, and more digital every day.\n\nAbout Similarweb:\n\nSimilarweb is the most trusted platform for understanding online behavior. Millions of people rely on Similarweb insights daily as the ground truth for their knowledge of the digital world. We empower anyone — from the curious individual to the enterprise business leader — to make smarter decisions by understanding why things happen across the digital ecosystem. Learn more at WWW.SIMILARWEB.COM.Show more Report"}, {"company": "Rimini Street, Inc.", "job": "Sr Client Success Manager, Israel", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=302&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ef4f14e0&cb=1676381771297&jobListingId=1008431765967&jrtk=3-1-1gp827leqnccp801-1go9htl1gk622800-f2fbf06098d51b86-", "description": "Job Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nThe company is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs.\nWe have an exciting opportunity available right now to join us as a Sr Client Success Manager, responsible for a subset of clients within the EMEA region, based in Israel.\nPosition Summary\nWe are seeking an experienced Sr Client Success Manager who will be responsible for managing and expanding the partnership with our clients. The right candidate will have an entrepreneurial spirit, a proven track record of Client Management or Business Development & Executive Relationships excellence with the ability to provide solutions and guidance to meet business objectives and taking business to the next level. You must have a passion for clients. We need someone that can be very hands-on, do whatever it takes to deliver value, develop relationships, and be a strategic thinker with the ability to create long-term relationships with our clients\nAs a Sr Client Success Manager with Rimini Street, Inc., you’ll be managing a portfolio of named clients – driving client lifecycle – leading to adoption, cross-sell, advocacy and client satisfaction across your portfolio.\nEssential Duties and Responsibilities:\nDeliver and communicate ROI throughout the client lifecycle\nBuild C-level and executive relationships, establishing trusted advisor status\nDrive growth, value, retention and partnerships for our important clients to ensure active engagement and full recognition of ROI\nDevelop key account plans including; retention strategies, cross-sell opportunities, powermaps, client advocacy\nMeet/Exceed quarterly quota targets (renewals/cross-sell/advocacy)\nCreate awareness and demand for Rimini Street products and services\nIdentify, cultivate and engage on cross-sell opportunities within your portfolio for services and/or strategic solutions\nEnsure client retention through actively driving retention strategy, retention content including ROI models and proposals, and assisting with retention sales execution\nProvide ongoing proactive client management through executive business reviews, client onsite visits, executive relationships and overall client communications\nBuild and foster our Client Champion Community. Secure client sales and marketing advocates, ensuring client referenceability and driving client participation in select client marketing programs, events, interviews, etc.\nImplement and utilize current Social and Digital selling strategies to maximize opportunities via Social Networking platforms\nQuarterback the team and coordinate across executive leadership, sales, service delivery, marketing, etc.\nAdditional Duties & Responsibilities\nMonitor client consumption of Rimini Street services with the support of standard dashboards\nMaintain up-to-date client information in Salesforce.com and other systems\nProvide detailed and timely status reporting to all management as requested\nAssure client communications and escalations are performed on time, sufficiently and accurately\nOther job-related duties and responsibilities may be assigned from time-to-time\nQualifications/Skills/Experience:\n\nEducation\nBA/BS (MBA/Master preferred)\nLocation\nIsrael\nEssential Language Skills: English and Hebrew\nExperience\nGood knowledge of the enterprise software industry\nSpecific experience with Oracle and/or SAP preferable\nExperience dealing with CXO’s\nSignificant experience in Consultative Sales, Account Management, or Business Development\nExperience in managing a portfolio of clients in different industries\nExperience in cross-selling – identifying opportunities through trusted advisor partnership with clients and ability to coordinate and lead cross-functional team to drive better results for cross-sell and retention, etc.\nExperience in renewing and/or negotiating client support contracts\nExperience in working with complex, multi-divisional, multi-geographical customers\nExperience working with cross-functional teams (e.g. Sales, Renewals, Marketing, Services, etc.)\nSkills\nImpressive executive presence and communication abilities\nDemonstrated ability to provide proactive account management to a large portfolio of clients\nExceptional leadership, time management, facilitation, and organizational skills\nBias for action\nPassion for technology and for being a part of a fast-growing technology company\nProven analytical and problem-solving abilities\nProven experience with Social and Digital selling techniques\nAbility to create structure and prioritize tasks to best manage different situations\nStrong documentation skills MS Office Suite (Word, Visio, Excel, and PowerPoint); Salesforce CRM, Smartsheet, etc.\nRimini Street views all employees as partners, and is committed to providing an exciting, participatory and team-oriented work environment. In addition to our very competitive compensation packages, be prepared for challenging professional growth and fun along the way in our work-hard, play-hard corporate environment.\n#LI-DNI\nCompany Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nRimini Street is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs. According to Gartner, the third-party support market will grow to $1.05 billion by 2023, a 200% increase. With tight IT budgets and flat global economic growth, IT and procurement professionals are actively looking for proven methods to cut costs while improving service. Rimini Street enables organizations to free up budget for strategic business initiatives by delivering savings of up to 90 percent on total maintenance and support costs, and to date, the company has saved organizations over $5 billion in total maintenance costs since its inception.\nWe’re building something special at Rimini Street. A company where people care about each other and trust each other to do the right thing. A company where highly intelligent and talented people come together to do challenging and meaningful work that makes a real difference to our clients, ending each day with a sense of achievement and balance in their lives.\nBe Treated Like the Best\nRimini Street hires only the best – and provides the compensation, bonus and benefit programs appropriate for proven top-performing professionals. We want our employees to have an opportunity to share in the financial success that results from our dedication to service excellence, high-quality deliverables and an unparalleled client experience\nNo bureaucracy, thousand-page rule books or politics — just everyone working together to build a great company through service excellence and client success\nWork hard, play hard environment – Rimini Street is a group of hard-working professionals who are passionate about achieving success, but we also enjoy opportunities to meet up at fun company events\nWe are also passionate about giving back to our communities around the world, with plenty of opportunities for volunteering and charity through the Rimini Street Foundation\nAll Rimini Street professionals are encouraged to grow and learn new skills\nAccelerating Company Growth\nTrading on Nasdaq under ticker symbol RMNI since October 2017\nAdded to the US Russell 2000® Index in 2018\nOver 4,000 clients, to date including 100 of the Fortune 500 and Global 100\nAnnual 2021 financial results of $326.8 million, up 16.3% year over year\nFiscal year operating cash flow of $42.1 million, up 107% year over year\nAnnounced the new patent pending Rimini Street Artificial Intelligence Support Applications, a result of the Company’s continued investment in optimizing support processes and ensuring global service delivery outcomes at scale. Using the AI Applications, Rimini Street has been able to deliver a better client experience and reduce software issue resolution times by 23%.\nCelebrated the 15th anniversary of the Company’s founding in 2005 to redefine the enterprise software support market and bring choice and value to software licensees around the world.\nRecent Industry Recognition\nReceived 33 awards in 2020, including 15 awards for excellence in customer service from awards companies such as the International Stevie Awards, the American Stevie Awards, and the Stevie Awards for Sales & Customer Service\nHonored with four Gold awards for Company of the Year in 2020.\nThe Rimini Street Foundation recognized with two awards in 2020 for Corporate Social Responsibility Program of the Year\nIn addition, in 2020 the Company supported more than 120 charities around the world through the Rimini Street Foundation, providing financial contributions, volunteer hours and in-kind donations including personal protective equipment to healthcare workers, senior centers, food banks and youth organizations globally. The Foundation also extended its charitable work in 2020 to Hong Kong, Malaysia, Mozambique, Sweden and the UAE.\nTo learn more about how Rimini Street is redefining the enterprise software support industry, visit http://www.riministreet.com\nRimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, national origin, sexual orientation, gender or gender identity, disability and protected veterans status or any other characteristic protected by law.\nPlease Note: Rimini Street does not accept resumes submitted by recruiting/staffing firms unless specifically requested by Human Resources. Unsolicited resumes will be ineligible for referral fees.Show more Report"}, {"company": "", "job": "Content Marketing Leader", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "IVC Research Center", "job": "Sales Development Representative (SDR) / Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9f9d14b0&cb=1676381773642&jobListingId=1008371867078&jrtk=3-1-1gp827nodkuhv801-1go9htl1gk622800-311832bbee8b9197-", "description": "Responsibilities\nDevelop new business leads\nExpand the portfolio by handling up-sales and potential new accounts, including cold calls\nManage all account-related processes and projects - from lead generation, pre to post sale, consulting, support, and back-office management\nHandle an existing account portfolio to preserve the customer base\nAttend industry conferences and meet-ups to represent the company, network and gather leads\nRequirements\n2-5 years’ experience as an account manager in a business-oriented market OR equivalent sales track record in successful B2B sales - a must\nAbility to withstand tight deadlines and ambitious goals\nBA degree – a must.\nBA in business, finance, marketing, economics, communications, technology, or related field – an advantage.\nStrong negotiation and presentation skills.\nExperience working with CRM Systems and Marketing automation systems.\nExcellent spoken and written skills in Hebrew and English. Other languages – an advantage.\nFamiliarity with technology, high-tech or investments markets - definite advantage\nReferences will be requiredShow more Report"}, {"company": "TripActions", "job": "Manager, Marketing (Growth Marketing Manager)", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.5", "link": "", "description": ""}, {"company": "Papaya Global", "job": "User Acquisition Manager", "city": "Herzliya", "date": "24h", "rating": "3.6", "link": "", "description": "Papaya Global is reinventing global payroll and payments. Our automated platform helps companies hire, onboard, manage, and pay employees in more than 160 countries.\nWe are looking for a qualified and experienced User Acquisition Manager to join our team. You will be responsible for user acquisition traffic including the development of overall creative, strategy, optimization, KPIs and ROI analysis.\nOur ideal candidate is an experienced professional with demonstrable performance marketing skills.\nYou’ll join our Marketing team based in our headquarters, Herzliya, Israel.\nYou Will:\nManage high budget and large-scale Search and Social PPC campaigns\nAnalyze and optimize campaigns constantly to maximize revenue\nInitiate and implement improvements and creative solutions to increase campaigns activity\nRespond quickly to changes in online marketing and adapt to capitalize on new opportunities\nRequirements:\n\nProven experience in managing Google search campaigns at large scale\nNumber oriented with analytical skills, comfortable with large sets of data and numbers.\nExcellent interpersonal skills, positive attitude.\nAbility to work independently and in a team environment.\nProficient in Microsoft Excel and large data analysis.\nFluent English - Verbal and written.\nExperience working with HubSpot/Salesforce or equivalent CRM tools -advantageShow more Report"}, {"company": "Marcomit", "job": "Senior Brand & Marketing Manager", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=307&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_78b77b1e&cb=1676381777469&jobListingId=1007945108233&jrtk=3-1-1gp827rfujor3801-1go9htl1gk622800-2c0f38eb50f0df4c-", "description": "Are you a seasoned project and client manager? Are you the type of person who immediately starts dissecting a massive project down to workable and manageable components? Are you client-oriented, friendly, patient, but also stand firm when needed? If so, you might just be the person we’re looking for!\n\nMarcomit is seeking a Senior Brand & Marketing Manager to join its ever-growing team of designers, content writers, video producers, project managers, and an occasional puppy.\n\nFirst thing first- the job\n\nAs Senior Brand & Marketing Manager, you will:\n\nEstablish and maintain strong working relations with multiple clients. You’ll be the face of Marcomit in both the good and the more challenging times.\nObtain detailed briefs from clients, assess their scope and budget, and delegate the corresponding tasks to relevant team members for execution.\nTrack project performance and ensure that it follows the projected timeline and budget.\n\n And now- You\n\nBesides the obvious qualifications- organizational and multitasking skills, detail-oriented, etc.- you’ll need to:\n\nBe Hebrew-English bilingual, both writing and speaking. Additional languages are an asset!\nHave some major communication skills, both client-facing and internally.\nPossess a Bachelor’s degree; any additional educational credentials are an asset.\nHave an impeccable ability to keep track of projects and timelines.\nBe resourceful, especially when things don’t go quite as planned.\n\n What you can expect working at Marcomit\n\nAn amazing, multilingual, multicultural team that (usually) loves working together.\nFresh oranges. We’re located in an orange grove- literally.\nFascinating clients from a wide range of fields. From drones to vegan protein, from space-industry freezers to smart lighting systems, you’ll become a bit of an expert in disciplines you didn’t even know were a thing.\nOpportunities to grow and develop, to take initiative and to devise new ways of working.Show more Report"}, {"company": "Natural Intelligence", "job": "Marketing Automation Manager", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.1", "link": "", "description": "Founded in 2009 and 100% self-funded to this day, Natural Intelligence is a leader in online multi-vertical marketplaces. Our global brands, Top10.com and BestMoney.com, help millions worldwide make informed decisions every day. Our proprietary platform, xMatch, harnesses AI and ML technologies in order to help consumers make easier choices, and find the right products and services tailored to their needs.\nWe are seeking a talented & motivated Marketing Automation Manager to join our Growth Department. This is an exciting opportunity for an innovative and creative person who comes from a background of engagement and performance-oriented content.\nResponsibilities:\nHands-on responsibility for implementing and monitoring email marketing campaigns, seeking to maximize performance KPIs, improving conversion and retention rates\nDefine the technical and creative requirements for marketing campaigns, including software setup, domain reputation, warm-up, and integrations\nManage and own all aspects of the CRM execution, including email marketing, push, in-app, SMS, and surveys\nWork closely with content writers, designers, product, and business departments to build campaign strategies and execute them accordingly\nOptimize campaign workflows, alerts, sequences, A/B, etc\nRequirements:\n\n2-5 years of hands-on email marketing and CRM\nGood HTML technical skills\nAbility to collaborate and communicate well with team members and stakeholders\nVery organized and well-structured individual (attention to detail is a must)\nPrevious experience in analyzing data with the ability to turn this data into actionable insights\nAbility to work in a fast-paced environment\nEnglish at a high professional level - a must\nPrevious experience with Salesforce - a must\nOnly suitable CVs will be considered.Show more Report"}, {"company": "Fiverr", "job": "Marketing Automation Manager, Stoke Talent", "city": "Tel Aviv-Yafo", "date": "18d", "rating": "4.3", "link": "", "description": "We're looking for a highly talented marketing automation manager who can plan, develop and implement automated marketing campaigns to increase user retention, engagement, and conversion rates with a focus on the company’s revenue.\nYou’ll be owning the user-journey set-up and optimization, creating and maintaining landing pages, data implementation, KPI reports, and monitoring.\nAbout Stoke (acquired by Fiverr)\n1 in 3 Americans works on a freelance basis today. By 2025, only 40% of the workforce will be salaried employees. The world is changing, but companies are finding it hard to keep up.\nStoke offers a SaaS platform that makes it easy for companies to work with freelancers from all aspects (sourcing, onboarding, tracking, payments, and compliance), so your teams can focus on getting things done.\nWe help tech companies and agencies increase their productivity by enabling them to tap into the world's most flexible workforce - the booming freelance economy - without the hassle and headaches that come with it.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\nMinimum 2 years of hands-on work experience with HubSpot - MUST\nMinimum 5 years of B2B marketing experience\nHigh level of English - a must\nUnderstanding of email best practices for email marketing creatives, templates, metrics and associated KPIs, segmentation, dynamic content, and testing methodologies.\nAnalytical mind, with the ability to make data-driven recommendations.\nSelf-motivated, creative thinker with a “can-do” attitude\nExperience in setting ABM infrastructure - Advantage\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nManage end-to-end automated marketing campaigns: from ideation, through set up & segment and ends with analysis & optimization.\nContinuously experiment: execute A/B tests on email concepts, subject lines, content, CTAs, sending times, layouts, and more.\nCollaborate with designers and copywriters, identify target audience segments and capture feedback from multiple stakeholders.\nOperating an admin system, analyzing & reporting, testing, project management and HTML coding.\nCreate and manage lists, workflows, drip campaigns, landing pages, email templates, forms, pop-ups, calls-to-actions, webinars, and more\nDevelop and own the user journeys to increase revenue\n\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Dealhub.io", "job": "Senior Business Development Representative", "city": "Holon", "date": "30d+", "rating": "4.2", "link": "", "description": "As a leading Sales solution company, DealHub's team consist of the best sales people, and are currently hiring a driven, hungry, rockstar Sales Development Representative!Our Sales Development team responsible for developing new business opportunities through outbound prospecting, cold calling, and email campaigns, while working closely with Marketing and Sales teams.As an SDR you will:Generate new business pipeline through outbound prospecting activities and inbound lead follow-upBooking demos with Account ExecutivesManage all data fields inputs to our CRM systemCollaborate with Marketing and Sales teams to grow the business opportunitiesUtilize various tools to help target relevant contactsMeet and exceed established objectivesWorking days: Monday to FridayREQUIREMENTSAt least 2 years experience as a BDR/SDR in a SaaS company - MandatoryNative written and verbal communicator in EnglishHighly motivated and \"hungry\" to succeedExcellent communication and interpersonal skillsCan multi-task well and work in a fast-paced teamWilling to work in a young and dynamic atmosphereHas a strong desire to grow within the role and companyJob Type: Full-timeExperience:SDR/BDR in a SaaS company: 2 years (Required)Show more Report"}, {"company": "Tel Aviv University", "job": "Senior Content Writer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Wanted: Content EditorStarting immediatelyThe Development and Public Affairs Division of Tel Aviv University is looking for a dynamic writer and editor to join its team. The role involves conceptualizing, writing and editing diverse materials in English for the purposes of fund-raising and PR. This is full-time, in-house position with excellent conditions.Job description:Writing content for the University’s website, print publications, and social networksEditing the University magazine, web articles, and other publicationsLeading the University’s social media strategyGiving input into other PR and marketing materials such as brochures and videosSupervising a small content teamRequirements:Relevant Undergraduate degreeEnglish at mother-tongue level a must (reading, writing and speaking)Fluent Hebrew a mustMinimum 3 years’ writing experienceProven editing experience of high-level publicationsAbility to translate diverse and complex activities into succinct and appealing proseStrong understanding of social media strategy and production, specifically Twitter and LinkedInProficiency in standard software such as PowerPoint, Excel and MS Word, etc.Experience working with graphic designers and graphic software - advantageAbility to work both independently and as part of a teamGo-getter, detail-oriented and creativeCover letter on why you think you are a qualified candidateResume in English2 relevant writing samplesOnly qualified applicants who have a proven writing background, and who submit all the requested material, will receive a reply.Job Type: Full-timeAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Lemonade", "job": "User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "", "description": "We're looking for a highly analytical, detail-oriented User Acquisition Manager to join our Paid Acquisition team. You'll play an important role in leveraging cutting-edge technology and data science models to aid sophisticated optimization efforts and proper budget allocation.\n\n\nIn this role, you'll\nManage and optimize global campaigns with a large budget, end-to-end\nBuild strategic and tactical action plans\nCollaborate closely with the Creative, Analytics, Product, and Data teams\nOwn measurement and reporting for your campaigns\nConstantly be looking for new growth opportunities\nWork both independently and as a part of a team\nWhat you'll need\n3+ years of experience in PPC, managing global, large-scale B2C campaigns focused on the Google ecosystem (with budgets of $500K+/mo)\nExperience with social / video platforms is an advantage\nMultitasking abilities under strict deadlines and within an ever-changing environment\nProven track record delivering results consistently\nAdept at using various marketing analytics tools\nAbility to think strategically about complex issuesShow more Report"}, {"company": "Nayax", "job": "Marketing Automation Manager", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "", "description": ""}, {"company": "Mitsubishi Motors (Thailand) Co., Ltd", "job": "P&A PROJECT PLANNING & MARKETING - SENIOR ENGINEER", "city": "Central", "date": "19d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f2f26cda&cb=1676381786866&jobListingId=1008406011193&jrtk=3-1-1gp8284lakbns801-1go9htl1gk622800-2d0c62a02b24d0e2-", "description": "Job Summary In charge of manage smooth supply and distribution of service parts and accessories including Railliart merchandise goods to Thai domestic market as well as overseas market Job Description • Assisting in implementation of new product / process development for accessories and reliant products.\n\nLiaise directly with supplier to follow up all aspect in new product development process and company’s expectation.\nMaintain project schedule by monitoring project progress, coordinating activities and resolving problems.\nProvide continued support to suppliers to ensure their performance meet the company quality.\nCoordinate with marketing team for activities arrangement to promote or products, Especially, Ralliart Product.\nWork with agency to complete the market material for new product being launched including big event such as Motor Show / Motor Expo.\nControl stock or Ralliart Product to support sale and clearing stock after the end of collection.\nSupport product information for both domestic and export sales.\nOther administration job to support team.\n\nJob Specification • Male/Female, age between 25 - 35 years old.\n\nBachelor degree in Marketing or Business Management.\nAt least 3 years’ experience in product development function especially fashionable product or accessory in automotive industry.\nGood understanding of inventory Control and follow up.\nCreative thinking and Good Human Relation and able to work individually.\nGood command of both written and spoken in English.\nAble to drive a car and have driving license.\n\nShow more Report"}, {"company": "Novartis", "job": "Essential Brand Lead", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=315&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_46f2e607&cb=1676381788082&jobListingId=1008439918428&jrtk=3-1-1gp8285r8kbm3801-1go9htl1gk622800-e45dc89283bc50a3-", "description": "110,000 professionals working together to improve patients' lives.\n\nThe role of the Essential Brand Lead will focus on developing and testing novel ways of promoting and driving the sales of our essential brands – thus setting the future ways of working for the new cross-functional working of the Israel business unit – Squad teams. Acting as a de-facto Essential brands Lab Head, the purpose of the role is to reinvent the driving growth of established brands.\n\nYour Key Responsibilities:\nYour responsibilities include, but not limited to:\n\nAccountable for delivering the therapeutic area brand performance with respect to sales, market share and profitability to meet or exceed budget targets. Increase Customer Life Time value of essential brands.As lab-head, use rapid-design process and feedback loop leveraging agile methodology. Provide out-of-the-box solutions using Design Thinking.Drive the growth of the Essential brands TA by establishing growth plans for existing products, effectively handling their life cycle, establishing and managing effective strategic partnerships.Entrepreneurial approach to portfolio management to optimize ROI across a diverse range of brands through the lifecycle by actively investing across brands with shared/pooled services and flexibly budgeting according to prioritized outcomes.Using targeted strategies and innovative, cost-effective GTM models to efficiently commercialize non-priority diverse set of brands. Use digital engagement channels, innovative access models & cross-portfolio reimbursement deals / discounts to improve value across the lifecycle, including Business-to-business selling, account management and contracting focus, “non-personal promotion” to HCPs.Incorporate opportunities to maximize lifecycle value and differentiate beyond efficacy to address non-clinical barriers and product enhancements (e.g., devices, digital services).Develop cross-TA solutions and implement a customer feedback loop to share and inspire other TAs. Drive, test and implement with agility new innovative operating model.Customer facing (at least 50%) to validate external competition benchmark for solutions either by interacting with customers or other industries and sectors.\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\n\nEducation: High level academic education in Life Sciences (Advanced degree in bioscience, medicine, business, and/or management)Proficient Hebrew and English, both written and spoken.Min. 5 years of experience in engaging various collaborators within the health sector.Experience as a Product Specialist in RX.\nExperience in cross functional teamwork and working on multiple projects.Strong leadership skills and ability to set a clear vision, handle multifunctional extended teams and network effectively.Experience in working with large data sets from various functions / backgrounds, commercial projects, digital transformation and governance projects.\n\nDesirable Requirements:\n\nBrand Manager experience\n\nWhy Novartis?\n\n766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.\n\nWe believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do here at Novartis!\nDivision\nPHARMA\nBusiness Unit\nREGION EUROPE PHARMA\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nMarketing\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "AppsFlyer", "job": "Regional Marketing Manager- Temporary", "city": "Herzliya", "date": "15d", "rating": "4.4", "link": "", "description": "Are you a passionate B2B marketer with experience in hyper-growth SaaS and mobile businesses? If you are, read on!\n\nOur mission at AppsFlyer is to give digital marketers the very best tools and insights to help them be as successful as they can be. With a highly talented, global team of over 1,500 people, and growing, we're only just getting started.\n\nWe're looking for a hungry, passionate, tech-savvy B2B marketer to join our vibrant, friendly office in Herzliya and lead our field marketing programs and customer lifecycle activities in SANI region (South Europe, Africa, Nordics, Israel). You'll be taking a market-leading, mission critical SaaS offering out to digital marketers and brands in the region.\n\nIn your B2B toolkit, you'll be highly analytical, independent, a competent storyteller, a first class project manager and have a flair for putting together exceptional events and experiences.\n\nWorking closely with your local colleagues in Sales, Customer Success and Partnership Development, as well as a large, cross-functional team of marketing experts in our Global HQ. You'll be responsible for planning, coordinating, executing and reporting all revenue-focused marketing programs for each individual market to deliver new customer leads, existing customer engagement and partnership development goals.\n\nThe role reports to the Managing Director of EMEA-SANI, and to the Head of Marketing for those respective markets\n\nThis position is temporary for one year\n\nWhat you'll do:\n\nEvents - You're passionate and hands-on about events and will work with Sales, Customer Success, Partnership Development and third party partners, such as trade associations and conference organizers, to create a pipeline of events across all markets that help raise AppsFlyer's brand awareness, position the business as the domain authority for mobile measurement and drive new demand and upsell opportunities.\n\nContent, thought leadership & PR - You enjoy creative copywriting and are responsible for positioning AppsFlyer as the market leader in your local markets. You'll be working closely with the Global Content & Mobile Insights + Comms teams, as well as local PR partners, you'll create thought leadership campaigns to promote AppsFlyer's portfolio or cross-device measurement and fraud protection services. These could be anything from blogs and white papers, to major PR campaigns or event content\n\nData - You're all about the numbers. As the lead for the individual country growth squads, you'll be responsible for managing ongoing growth initiatives, reporting the results of our time and financial investments and optimizing our activities on an ongoing basis. You'll have the support of our Global Marketing Operations team to do so, as well as numerous BI tools\n\nTeam player - You're a go getter and problem solver with a great team spirit. You're happy being part of a close knit team that works hard and plays hard and you're not afraid to roll your sleeves up and do what's right for the team\n\nWhat you have:\n\n3-5 years of experience in B2B marketing roles ideally within the technology, SaaS or mobile software sectors\nProven track record of planning and executing on field marketing campaigns, generating pipeline and strengthening customer relationships.\nExceptional project management skills, writing, communication, and presentation in English.\nPassionate about technology and the latest trends and best practice in B2B marketing\n\nBonus Points:\n\nA degree in Marketing or related subject area\nExperience in CRM and events systems (Salesforce, Splash & Marketo as advantage).\nCompetitive analysis and account mapping experience - an advantage\nAbility to speak an additional relevant language other than English is highly desirable, but not a must have\nKnowledge of the E-commerce, gaming or finance mobile marketing world an advantage\n\nAs a global company operating from 20 offices worldwide, we reflect the human mosaic of the diverse and multicultural world in which we live. We ensure equal opportunities for all of our employees and promote the recruitment of diverse talents to our global teams without consideration of race, gender, culture, or sexual orientation. We value and encourage curiosity, diversity, and innovation from all our employees, customers, and partners.\n\n\"As a Customer Obsessed company, we must first be Employee Obsessed. We need to make sure that we provide the team with the tools and resources they need to go All-In.\" Oren Kaniel, CEOShow more Report"}, {"company": "Broadway Gaming", "job": "SEO Account Manager", "city": "Herzliya", "date": "30d", "rating": "5.0", "link": "", "description": "Broadway Gaming is a dynamic and expanding online gaming company operating mainly in the UK gaming market. We offer Bingo, Casino and Slot products across multiple brands. We have office locations in Dublin, London, Tel Aviv, and Romania.\nWith a wide variety of backgrounds comes a wealth of experience, ideas and personalities and we use these to help us create a great service and a great place to work and learn. Because collaboration is fun and benefits us all and ultimately it benefits our customers!\nResponsibilities\nManage on-page optimization efforts and lead content initiatives\nWork on off-site link building initiatives\nPerform keyword research for new pages and improve existing content to maximize search engine performance\nConduct SEO audits and continuously improve upon previous SEO efforts\nWork on technical SEO initiatives using tools like Screaming Frog and Ahrefs\nExperiment with new SEO tactics and strategies, continuously testing and problem solving\nPlan, develop, execute and measure SEO projects, including improving keyword rankings, organic traffic, and content generation\nBlog management\n\nRequirements\nBA Degree in Marketing, Business administration or related field desirable\n2 years+ of experience in SEO (international market preferably)\nExperience working within a regulated industry is highly advantageous\nStrong understanding of the gambling industry including ongoing changes in regulations and guidelines\nAbility to prioritize & managing multiple projects simultaneously and efficiently\nKnowledge of SEO tools, such as Ahrefs, Screaming Frog, Google Search Console, SEMRush, Moz, Majestic, Google Analytics, Google Speed Insights, and more\nPHP, CSS, HTML, and coding background a plus\nExcellent verbal and written communication skills and the ability to interact professionally with a diverse group of internal and external stakeholders\nThe ability to adapt to a rapidly changing regulatory and business environment.Show more Report"}, {"company": "Swimm", "job": "Marketing Automation Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "", "description": ""}, {"company": "Elementor", "job": "Senior Product Analyst", "city": "Ramat Gan", "date": "24h", "rating": "4.2", "link": "", "description": "We are looking for a sharp and highly analytical Product Analyst to join our fast-growing company and help us make data-driven decisions for performance optimization.\nAs a Product Analyst, you will play a key role in shaping Elementor's product and business strategy, defining our KPIs, and identifying business opportunities.\nAs a member of the Analytics team in our Data department, you will work across the organization and provide key insights to multiple departments (Marketing, Product, Finance, Business Strategy, CX, and more), helping them focus on what’s important.\nThis position is located in Israel only.\nRequirements:\n\n4+ years of experience in quantitative analysis, preferably at an internet company\nExcellent communication skills with the ability to deliver results of analyses clearly and effectively\nExcellent SQL skills - a must\nExperience with at least one of the following visualization tools: QlikView, Qlik Sense, Power BI, Tableau - a must\nStrong Python capabilities - a major advantage\nExperience working with big data tools: Redshift, BigQuery, Databricks, etc. - a must\nA highly independent and creative team player who works well with others\nHands-on technical experience with Google Analytics, Google Ads, and Facebook Ads - an advantage\nWork Environment:\n\nWhat do we do?\nElementor is the leading website building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 12M websites powered by Elementor. More than 8% of all websites around the world are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe believe in empowering both our employees and our users.\nElementor is a place where you can truly grow professionally and personally.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey. We take great pride in Elementor's constant scaling.\nResponsibilities:\n\nWork with various managers to learn their business insight needs, including tracking metrics, dashboards, and reports\nAct as a bridge between units’ business needs and the BI department, ensuring high-quality execution quality, data integrity of analyzed insights, and reporting deliverables\nEstablish reporting methodologies and cross-department standards\nGo beyond the numbers to communicate, influence, support, and execute business decisionsShow more Report"}, {"company": "MOONEE", "job": "Data Analyst (UA & Monetization Manager)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=320&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fb75d29e&cb=1676381795943&jobListingId=1008232767743&jrtk=3-1-1gp828dh4i6gs801-1go9htl1gk622800-2d4a39673bcd79eb-", "description": "Location Tel-Aviv, Israel\nDate posted August 3, 2022\nEmployment Type Full-time\n\nAt Moonee, we’re working hard to redesign the way mobile games are published today.\nWe’re seeking a qualified user acquisition specialist to extend our global reach through expert buying methods and analytical skills. Our ideal candidate will be trusted to dive right in, take the lead, use initiative, and help global studios to expose their work to the world. Highly skilled at media buying and optimization, this person will join and inspire a team of like-minded go-getters to achieve our company vision.\n‍\nResponsibilities\nOptimize demand waterfalls based on results.\nPlanning and hands-on management of social and networks campaigns to drive app installs and specific KPIs.\nAnalyze campaign performance and optimize accordingly.\nTest and experiment with new online marketing strategies and tactics.\nAdminister reports, and key reporting tools on a daily/monthly basis.\nQualifications\n1 years of proven experience in managing mobile apps campaigns - plus\nExperience in waterfalls optimization.\nAn excellent English.\nMotivated and Organised.\nCreativity, out of the box thinking and good writing skills.\nA quantitative mind and love for numbers, exceptional analysis skills.\nExperience working in mobile gaming companies - plus.\nBA in analytical degree - plus.Show more Report"}, {"company": "ControlUp", "job": "Senior Technical Writer", "city": "Rishon LeẔiyyon", "date": "21d", "rating": "4.1", "link": "", "description": ""}, {"company": "Publicis Media", "job": "Global Clients Lead", "city": "Bnei Brak", "date": "30d+", "rating": "4.0", "link": "", "description": "Company Description\nPublicis Media creates value for clients through global media agency brands and scaled capabilities across investment, strategy, insights and analytics, data and technology, commerce, performance marketing, and content by harnessing the power of the modern media landscape to drive one-to-one consumer engagement at scale.\nThe Global Clients Lead is expected to be a business partner across multiple global clients, using their deep knowledge and understanding of the client's business in order to create the best conditions for the right work to thrive, leading to the success and growth of both our partners and our agency.\n\nJob Description\n\nManage day-to-day deliverables and work closely with all departments\nBuild strong relationships with the client at all levels through a superior understanding of the client's business issues, marketing communications, and competition.\nProvide vision, inspiration, and strategic leadership to both the agency team and the clients. Ensure a collaborative approach internally and across agency partners to ensure happy and productive relationships.\nDrive Growth of scope of work ensuring the account is positively contributing to the agency’s revenue growth and profitability.\nDevelop and mentor team members; provide feedback and opportunities for growth.\nDevelop Brand, competitive, and audience analyses, strategic brand frameworks, and campaign and product launch strategies.\nWork across the Publicis Network & drive change for the client at a global level\n\nQualifications\n\n5+ years of related industry experience; preferably consulting, interactive, agency, or direct marketing experience\n2+ years of proven track record in developing senior-level client relationships\nStrong knowledge or experience in marketing and media,\nAn exceptional grasp of media planning, negotiation, and performance analysis and an impressive understanding of the digital\n Apply analytical problem-solving skills to deliver results\nStrong communication skills and impressive attention to detail\nDemonstrate exceptional interpersonal and communication skills to build client rapport\nStrong project management and performance management skills – you are crystal clear when it comes to delegating and providing feedback\nAbility to collaborate effectively at all levels and functions of an organization\nStrong client-service orientation\nProven ability to manage projects to successful completion, multi-task, and work within tight deadlines\nAbility to lead a team effectively and provide direction through coaching and mentorship\nEnglish- verbal and written- high levelShow more Report"}, {"company": "Moon Active", "job": "Mobile User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "Moon Active is one of the world's fastest-growing mobile game companies, providing entertainment to millions of active users across the universe. The company is headquartered in the heart of Tel Aviv.\nAs we expand, we're looking for a Mobile User Acquisition Manager to join our amazing Marketing team.\nResponsibilities\nHands-on campaign management on various mobile ad networks\nBuild and maintain strategic relationships with key acquisition partners\nManage fast-paced and dynamic projects in a highly organized manner on schedule and on budget\nCollaborate with different teams members within the marketing department to deliver and execute successful mobile marketing campaigns\nData Analysis (Identifying trends, opportunities, discrepancies)\nRequirements\n3 + years in mobile user acquisition and ad buying analysis experience at scale\nCampaign management on self-served platforms - a Must\nHighly analytical and technical: Understands components of ad calls across various channels\nAbility to manipulate and analyze large quantities of data and present it in reports\nDeep understanding of mobile attribution\nWillingness to learn and use third party ad systems such as ad servers, DSPs, and analytics tools\nAbility to take on multiple projects at the same time\nStrong organizational, analytical, presentation and problem solving skills\nProfound knowledge of MS-Office Products (Excel in particular)\nFluent English - verbal and written\n#LI-HybridShow more Report"}, {"company": "Cisco Systems", "job": "Open Source Software Engineering Lead", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=324&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_695339cf&cb=1676381801489&jobListingId=1008430508102&jrtk=3-1-1gp828iuoitm9801-1go9htl1gk622800-5028f7599acd9bc2-", "description": "Open Source Software Engineering Lead\nWho We Are\nWe are Emerging Technologies and Incubations (ET&I) at Cisco. We are chartered to build the next new business for Cisco. To take Cisco into new markets, and especially towards new personas -\nBoth buyer and user. And like building a startup from the ground up, it’s all about having an entrepreneurial approach. Taking an idea from an astonishing thought to a product that solves a critical need, to an experience that delights users and customers.\nIt’s about innovation. From 12 months out to 5 years in the future, wearing multiple hats, failing and learning fast, challenging assumptions and finding new ways of solving problems. Driving form from ambiguity. It’s about creativity. We are looking for entrepreneurs, Problem solvers, Designers & Marketers. Product Led Growth experts. Business Development, SDRs, Customer Success. Product Managers, SWEs, SREs. Data Scientists and ML engineers.\nYes, we are building the next set of startups with the support of a trusted name like Cisco. Where else will you get to do this? We are Cisco ET&I. We run bold, we run agile, and we run ambitious. Come create with us.\nLearn more about us at https://eti.cisco.com.\nWhat You’ll Do\nThe Portshift team, now part of Cisco's Emerging Technologies and Incubation group, is building open-source toolset, Cisco OpenClarity, that will help developers and DevOps teams to secure modern application development infrastructure (CI/CD, containers, k8s, APIs, etc). You will build and lead engineering advocacy as a critical bridge between our Product, Engineering and Marketing groups, and our open-source community.\nPrimary responsibilities of this role include:\nCreate and nurture a community where people can learn about the impact that cloud native security can have on their teams, on our product, and how they can influence it.\nIdentify the best channels and engage with our users (e.g., Github, discussion forums, technical demos, events, social media or direct feedback sessions) to build a positive and strong relationship between the developers community and our product & engineering teams, enabling us to build the best solution.\nBuild and publish engaging content : construct helpful examples and guides, ensure documentation meets the community needs, create engaging and educating blog posts, and share excellent community-created content alongside curated case studies.\nParticipate in discussions with the technical staff, at all levels (from individual contributors to executives), to foster user adoption and viral growth, and feed our product roadmap with community feedback.\nDevelop and execute holistic launch plans for major releases and updates to our product : understand the scope of changes, work with developers to assess impact, construct a timeline for rollout, and develop a process to guide the community through changes.\nWho You Are\nRequired Qualifications\nSolid technical background, with previous experience in cloud native security solutions.\nStrong presence in the developer community.\nExceptional external communicator, adept at interfacing with partners and large audiences.\nExperience in rallying internal partners and project managing on a deadline. In particular, you've partnered with engineering teams to deliver anticipated products.\nCreative, with an informed curiosity about marketing and business opportunities that the Open-Source Product Office will build for Cisco.\nSkilled community leader, at your best when advising and engaging with large communities, so they can gain members and momentum over time.\nReady to own a program end-to-end and build an organization that will grow as a pillar of the company.\nExperience working on Open-Source products.\nIt will be great if you have\nExperience owning and editing technical documentation.\nExperience developing tutorial materials (e.g., self-guided tutorials, videos, knowledge bases) to onboard and educate users.\nProfessional experience working as a software engineer.\nWhy Cisco\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\nWe adopt digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do –you can’t put us in a box!\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us.\nWe recognize that diverse teams make the strongest teams, and we encourage people from all backgrounds to apply.\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire salaries in U.S. locations. For non-sales roles, the hiring ranges reflect base salary and do not include bonuses, equity, or benefits. Hiring ranges for sales positions include base and incentive target, and do not include equity or benefits. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.Show more Report"}, {"company": "Fiverr", "job": "Product Marketing Lead, Stoke Talent", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "What's the job?\nWe are looking for a Product Marketing Lead to lead and own the product messaging and positioning for Stoke Talent. This role will work cross-functionally between Product Management, Marketing, and Sales to ensure that we effectively communicate the current and future value of Stoke’s unique value proposition.\nAbout Stoke (acquired by Fiverr)\n1 in 3 Americans works on a freelance basis today. By 2025, only 40% of the workforce will be salaried employees. The world is changing, but companies are finding it hard to keep up.\nStoke offers a SaaS platform that makes it easy for companies to work with freelancers from all aspects (sourcing, onboarding, tracking, payments, and compliance), so your teams can focus on getting things done.\nWe help tech companies and agencies increase their productivity by enabling them to tap into the world's most flexible workforce - the booming freelance economy - without the hassle and headaches that come with it.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\n3+ years of experience as a product marketing manager - a must\n5+ years of experience in a similar product related position at a B2B SaaS company - a must\nExperience in creating GTM strategies for new products and features and execution of relevant marketing campaigns and activities\nAbility to research marketing trends and other related topics\nPast experience in working closely with Product Management teams, with the ability to translate technical concept into successful product and marketing material\nAbility to work self sufficiently, and excel in a high-paced, changing environment\nExperience creating brochures, demos, slide decks, videos and running webinars\nExcellent English written and verbal communication skills no matter the audience or context\nEvangelize the freelancers management category and product vision in speaking opportunities and conferences and in briefings with prospects, customers, partners, media and industry analysts.\nBachelor's degree required\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nThe Product Marketing Manager will own the positioning and messaging for Stoke Talent translating product functionality and technical details into user benefit and value\nYou will develop product positioning and messaging informed by user research, market insights, and product understanding\nResearch and understand our buyer personas to ensure our product is designed and delivered to create value for them, acting as a partner and strategic advisor to product managers\nBe the voice of product releases, owning and developing all relevant collateral (emails, release notes, brochures, videos, webinars, sales decks in-product solutions, demos)\nMeet with customers and drive activities to increase adoption\nConduct ongoing competitive analysis along with market, and customer research\nPartner with Sales and customer success teams to regularly educate on the latest products and how to position and sell them\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Databricks", "job": "Manager, Field Engineering", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.5", "link": "", "description": "The Solutions Architect Manager will lead a team of pre-sales Solutions Architects. As you will help to lead our Israel expansion, you will build technical pre-sales teams. Your experience partnering with the sales organisation will help close revenue with the right approach whilst coaching new sales and pre-sales teams to work together. You will guide and get involved to enhance your team's effectiveness; be an expert at communicating complex, business value-focused solutions; support complex sales cycles, and build relationships with important partners in large corporations.\nThe impact you will have:\n\nManage hiring and building the Solutions Architect team, scaling the designated field engineering segment organization without sacrificing quality\nBuild a motivated collaborative culture within a hyper-growth team. To embody and promote Databrick's customer-obsessed, teamwork and diverse culture\nSupport increase Return on investment of SA involvement in sales cycles by 2-3x over 18 months\nEnsure a solution and value-based selling field-engineering organization\nDisplay an understanding of needs and revenue potential for accounts in the assigned region\nBuild Databricks' brand in Israel in partnership with the Marketing and Sales team\nWhat we look for:\n\nFamiliar with building a team of successful Big Data, Cloud, or SaaS professionals\nHave experience scaling and mentoring field or technical teams from scratch at hyper-growth speed\nKnowledgeable in and passionate about data-driven decisions, AI, and Cloud software models\nGreat at instituting processes for technical field members to lead efficiency\nTechnical background either in Data Engineering / Database technologies or Data Science\nFluent in Hebrew\n\nBenefits\n\nBenefits allowance\nManager's Insurance or Pension Fund\nEquity awards\nPaid parental leave\nGym reimbursement\nAnnual personal development fund\nWork headphones reimbursement\nBusiness travel insurance\nAbout Databricks\n\nDatabricks is the lakehouse company. More than 7,000 organizations worldwide — including Comcast, Condé Nast, H&M and over 50% of the Fortune 500 — rely on the Databricks Lakehouse Platform to unify their data, analytics and AI. Databricks is headquartered in San Francisco, with offices around the globe. Founded by the original creators of Apache Spark™, Delta Lake and MLflow, Databricks is on a mission to help data teams solve the world's toughest problems. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.\n\nOur Commitment to Diversity and Inclusion\n\nAt Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.Show more Report"}, {"company": "Joonko", "job": "Senior Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": "*In order to consider your application, PLEASE INCLUDE a link to YOUR PORTFOLIO*\nJoonko is looking for a Creative Senior Marketing Designer with outstanding conceptual and visual design skills as well as a strong understanding of digital marketing across multiple channels. You will be responsible for strategically thinking through our seasonal campaigns and executing with great attention to detail in a way that aligns with our overall style guidelines and resonates emotionally with our customers.\nAs a Senior Marketing Designer, YOU will have the opportunity to take part in turning big ideas into simple features and dealing with the continuous challenge of making the complicated simple by working with the various company departments.\nYou'll join our Marketing team based in our headquarters, in Tel Aviv, Israel, and work closely with our NYC-based marketing team.\nIn your role you will be responsible to:\nOwn and design marketing assets and visual materials for our website, produce infographics, one pager, print assets, company swag, internal branding, conferences, social media, and more.\nPlay a significant role in implementing, incorporating, and end-to-end adoption of Joonko's new brand, Develop our brand identity, standards, and brand management tools as needed.\nCommunicate ideas and concepts clearly.\nWork collaboratively with marketing, Developers, PR, video, design, and other stakeholders to gather information, understand the end goals and strategize communication approaches.\nTo be successful in this role, you'll need to be:\nImaginative, creative, and curious.\nThoughtful and fun to work with.\n3+ years of relevant multidisciplinary design experience (experience from a SaaS company - Must).\nBachelor's degree in a related field or equivalent practical experience.\nExperience collaborating with multidisciplinary product and marketing teams.\nExpertise with design tools such as Sketch, XD, Photoshop, Illustrator, Figma, InDesign, but skilled in creating lo-fi prototypes and sketches (whiteboards, post-it's, etc).\nYou know how to give and receive constructive criticism, and are willing to apply it to improve your work.\nPresent a portfolio highlighting multiple projects and your direct contributions.\nHigh level of English, and comfortable with extensive communication - verbally and written.\nAbout Joonko\nJoonko is a venture capital-funded Software as a Service company focused on taking fairness in the workplace to the next level. Using Artificial Intelligence and machine learning, Joonko is enabling companies to achieve diversity, inclusion, and belonging throughout the employee's lifecycle. We do this by bringing real-time insights to the attention of decision-makers.\nWe're a hardworking, collaborative, cross-cultural team that believes in transparency, honesty, and (most importantly) having fun! We drop our egos at the door, embrace the humbling humanity of #startuplife, and fuel ourselves with a relentless passion for making the world a slightly better place each and every day. We're geeks, foodies, athletes, millennials, feminists, activists, allies, musicians, and more. We know it's tough, but we're in it together.\n*** If you are not sure that you're 100% qualified, but up for the challenge - we want you to apply. ***Show more Report"}, {"company": "riverside.fm", "job": "Marketing Design, Team Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Riverside empowers creators and businesses to create high-quality audio and video content. Since launching,\nwe have experienced rapid growth and are trusted by customers such as Spotify, NY Times, NBC, CNN, and iHeartMedia.\nWe are looking for a marketing design lead to join our Marketing team. This role combines strategy, management, and hands-on execution for various projects.\nWhat you’ll do:\nLead all design processes and projects while guiding other designers to success\nOwn and evolve Riverside’s visual brand through various projects and channels, including online campaigns, ads, branded content, social media assets, emails, landing pages, internal needs, and more.\nElevate the design of our website and landing pages – evolve the visual language, design new pages, update old pages, and develop scalable processes to improve efficiency.\nWork closely with the paid, organic, and product marketing team to optimize design toward the business KPIs\nSupport product releases through various visual assets and collaborate with other departments to support their needs.\n\nRequirements:\n\nWho you are:\n4+ years experience in hands-on design, with 2+ years working in the Marketing Design field at a SaaS company\nStrong design portfolio with a deep UI/UX & online marketing understanding\nHave the ability to lead a project from the concept stage to the last details\nExcellent organizational skills and ability to prioritize and meet deadlines\nAdvanced knowledge of design tools - Figma, Photoshop, Indesign, Illustrator.\nGood verbal and written communication skills in English\nBonus:\nIllustration skills\nUp to date with the latest trends in the design world and passionate about learning new things\nUnderstanding of KPIs, testing, and optimization\nAfter Effects & Premiere pro workflow understanding\n\nValues that help you succeed at Riverside:\nAn investigator by nature who is not afraid of encountering obstacles\nFlexibility to work on various projects with diverse audiences and formats\nSelf-motivated with the ability to work both independently and as a real team playerShow more Report"}, {"company": "Artlist", "job": "Senior Creative Marketing Designer", "city": "Tel Aviv-Yafo", "date": "4d", "rating": "4.7", "link": "", "description": "Artlist is a fast-growing creative technology company providing video creators with high-quality music, sound effects, footage and digital assets for video, as well as powerful video and image editing software. With our revolutionary license and cutting-edge creative tools, we’re on the fast track to becoming the ultimate 360 degree solution for video creators.\nToday, Artlist is the go-to licensing provider for creators in over 160 countries. Among our 16M clients are Google, Apple, Nike, Coca-Cola, Ikea, Mercedes, Samsung, Wix, Netflix, Dior and many more.\nArtlist consists of 3 products:\nArtlist.io, a royalty-free music, stock footage platform and SFX platform\nMotionArray.com, an all-in-one marketplace for creators that offers video templates, presets, music, SFX, stock footage, motion graphics and stock photos\nFXhome, a cutting-edge video, VFX and image editing software\nAbout the role:\nOur team is looking for a Senior Marketing and Branding Designer with a strong background in conceptual design, visual design, and digital design. As part of this position, Artlist’s style will be defined in collaboration with the production and content teams. In addition, we are seeking a candidate who is capable of thinking strategically about our campaigns, expanding our design language, and executing highly detailed projects. Become part of a supportive, creative team of experienced and talented professionals, where you will be able to learn, grow, contribute, and develop.\nWake up for this:\nBe a key contributor to the development of the company’s brand, tone of voice, and look & feel\nOwn and design our website’s marketing assets and visual materials.\nInfluence, develop and update our brand identity and infrastructure, utilize cutting-edge tools to improve the quality of our creative work\nGather information, clarify goals, and develop creative strategies for the company by collaborating with marketing, content, product, product-marketing, production experts, developers, and other stakeholders.\nBuild a data-driven approach for sharing with other teams to determine improvements based on the experiences of users\nRequirements:\n\n+5 years’ experience working in B2C companies and a strong understanding of the design process, focusing on digital and creative design.\nA bachelor’s degree in art or design or an equivalent degree\nExpertise in Figma (Must)\nExcellent knowledge of Adobe Suite (Photoshop, Illustrator) and After Effects - a big advantage.\nExceptional portfolio of creative and digital marketing projects, including creative branding projects, website and mobile design, brandbook guidelines, illustrations, and infographics.\nA team player with excellent organizational skills and a positive attitude with excellent social and personality skills\nExtensive experience in senior management\nSelf-driven, independent, and capable of leading end-to-end projects.\nExceptional thinker with the ability to think outside the box.\nExperienced in working with design systems\nA high level of proficiency in written and spoken English\nAbility to manage multiple projects simultaneously and possess strong project management skills\nExpertise in user data processes, including A/B testing, user interviews, and user testing (creating funnels, metrics, insights dashboards, and segmentation), as well as data analytics tools. Fullstory and UserTesting.com - A big advantage\n Please provide a link to your portfolioShow more Report"}, {"company": "RYB Technologies", "job": "Regional Marketing Manager – Israel", "city": "Rosh Ha`Ayin", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=330&ao=1136043&s=58&guid=00000186131ed3eab272b4f3f68ce46e&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ac78433f&cb=1676381809900&jobListingId=1006986489934&jrtk=3-1-1gp828r57jigt801-1go9htl1gk622800-ac1e171a9c8b39dc-", "description": "The Regional Marketing Manager in Israel will be responsible for leading software company’s market strategy planning and execution in the country. The Regional Marketing Manager is a key position in the marketing department. The position deals with marketing of all business lines and business segments both to business partners and to customers. The day-to-day work involves a very diverse range of activities in both marketing strategy and hands on marketing communications.\n\nResponsibilities:\n\nStrategy and marketing plan:\n\nUpdate and tune company’s marketing messages\nResearch and understand market dynamics and trends\nAnalyze and track competitors’ activities and offering and make sure company’s position as the number 1 player remains\nBuild and monitor an annual marketing plan\n\nSales and Lead Generation\n\nWork with the sales department to initiate and execute marketing campaigns to both existing and new customers.\nWork with the digital department on implementing lead generation strategies and lead nurturing programs\n\nMarcom & PR:\n\nWrite and produce marketing materials and collaterals\nWork with customers to case studies\nInitiate, orchestrate and manage company’s customers and partners events, including our customer events with more than 1000 attendees\nWork with the PR agency to maximize and optimize media exposure\nEnsure proper implementation of our visual identity and brand guidelines across all marketing channels\nManage vendors in the areas of graphic design, branding, PR, productions and more\n\nRequired Skills & Expertise:\n\nAt least 5 years of experience in B2B marketing, preferably in the Software & Technology industry\nGood understanding of content marketing and digital\nProven track record in branding and event production\nPassion for technology products\nA multi-tasking star\nPerfect English and Hebrew, including writing\nPosition is based in Rosh Ha’ayin\nSend CV to jobs@rybtech.com\n\nThis position is closedShow more Report"}]]