[{"company": "NetHR", "job": "איש/אשת מרקום (תקשורת שיווקית)", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "", "link": "", "description": ""}, {"company": "OGC Global", "job": "Junior Editor and Designer", "city": "Tel Aviv-Yafo", "date": "28d", "rating": "5.0", "link": "", "description": ""}, {"company": "Tectu", "job": "Data & BI Analyst", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f421bea5&cb=1676381558188&jobListingId=1008401770511&jrtk=3-1-1gp8215bokhq4801-1go9hqd71i14u800-9521be01e6a16bea-", "description": "Tel Aviv, Israel\n\nJob Type:\n\nPart Time\n\nAbout the Company\nAt Tectu, you can make a real impact! As a Data & BI Analyst you will play a lead role in delivering data and business strategies, solutions and processes to support the data oriented projects. The ideal candidate is passionate about delivering cutting edge solutions to support the changing business needs and technology landscape. You will be working closely with others on our Product and Engineering teams to define and deliver these solutions.\nIf you are data obsessed, passionate about technology, self-motivated and a disciplined freelancer, we would love to speak with you. The ideal candidate has both a willingness and desire to work in a dynamic environment, is able to apply Agile methodologies in day-to-day activities, and who enjoys working both independently with little oversight and in a team environment.\nAbout the Role\nAt Tectu, we work with various customers, providing advanced tech solutions to solve different problems and needs. As a Data & BI analyst at Tectu, your day will most likely vary according to which projects you’re involved in, but generally you’ll be performing the following activities:\nIdentifying or diagnosing a problem to analyze\nCollecting appropriate data from various sources\nCleaning and preparing the data for analysis\nAnalyzing the data for insights, patterns, or trends\nInterpreting the results of the analysis with reports and dashboards\nCollaborating with stakeholders and presenting key findings\nResponsibilities:\nBe an integral part of the team defining data strategy and capabilities roadmap for various customers\nWork closely with data engineers to effectively plan and build data engineering tools, data warehouses and data lakes\nProvide core contributions to multiple products, projects, solutions and processes through all stages of the development lifecycle\nPerform analysis to assess quality and meaning of data\nUse statistical tools to identify, analyze, and interpret patterns and trends in complex data sets that could be helpful for the diagnosis and prediction\nUse data visualization tools (e.g. Tableau, PowerBI, Looker, Qlik) to build dashboards and drive insights\nAnalyze local, national, and global trends that impact both the organization and the industry\nPrepare reports for the management stating trends, patterns, and predictions using relevant data\nQualifications\nRequirements:\n5+ years of experience as a Business Intelligence Analyst and Data Analyst\n2+ years of experience in advanced analytic related multivariate and A/B testing, digital revenue attribution, cohort analysis, lifetime value analysis, media mix optimization, customer segmentation, and marketing effectiveness\n3+ years of experience working with data visualization tools, such as Tableau, PowerBI, Looker, QlikSense, etc\nStrong mathematical skills to help collect, measure, organize and analyze data\nStrong analytical skills and SQL proficiency\nTechnical proficiency regarding database / DWH design development, data models, techniques for data mining, and segmentation.\nProficiency in statistics and statistical packages to be used for data set analysis\nAdept at using data processing platforms like Spark & Presto\nKnowledge of how to create and apply the most accurate algorithms to datasets in order to find solutions\nAccuracy and attention to detail\nAdept at queries, writing reports, and data visualization\nSoft Skills:\nStrong work ethic and strong core values (honesty, integrity, creativity)\nSense of urgency, ownership mindset, and customer focus\nInnovative problem solver who takes initiative never stops thinking about ways to improve\nAbility to self-learn new skills and technologies\nAdvantage:\nBSc in highly-quantitative field (Analytics, Computer Science, Industrial Eng, Mathematics, EE) is preferred\nData driven mindset\nAble to create and communicate the 'big picture' in a clear way.\nFamiliar with best practices of the data and software engineering lifecycle\nKnowledge of programming languages like Python, R, MATLAB, or otherShow more Report"}, {"company": "INTEL", "job": "Supply chain technical analyst", "city": "Haifa", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a0aacd62&cb=1676381559413&jobListingId=1008432576164&jrtk=3-1-1gp8216hekbns801-1go9hqd71i14u800-ad133f56bb86c656-", "description": "Job Description\nWe are looking for Supply chain technical analyst.\nThe New Product planner (NPP) ensure NPI samples are correctly forecasted, built to specifications, and delivered in the most timely manner to support internal & external customers’ CPU validation efforts.\nAs part of your job, you will be responsible to:\nCoordination and startup activities for a product line from engineering to high volume manufacturing.\nCollect and scrub engineering and/or marketing sample demand by product forecast.\nAnalyze risks, capacity utilization, inventory levels, engineering requirements and customer demand, and/or delivery expectations from product start-up through product stabilization.\nDrive new product marketing and manufacturing naming and routing requirements through product planning systems setup activities.\nManage products in growing complex environment that introduce new supply chain challenges.\nInteract and manage cross-functional stakeholders.\nUnderstand both supply chain strategies and technical details of product engineering programs.\nDrive root cause solutions and improvements based on thorough understanding of the business processes and supply chain dependencies.\nCommunicate, explain and clarify complex issues with the customer business groups and divisions.\nCollaborate to develop processes and tools for new manufacturing flow and/or new product configurations.\nApply, analyze and interpret data to recommend optimized procedures and processes, identify areas of opportunity to further optimize Intel's supply chain from Wafer Starts through Assembly and Test.\nQualifications\nStudent to Bachelor's degree in Supply Chain, Industrial Engineering, Business Administration or related field.\nAt least 3 semesters until graduation.\nAnalytical skills,.\nWillingness to work in a diverse team environment.\nWork well in an ambiguous environment.\nStrong communication skills.\nAttention to details, well organized, efficiency and quality oriented.\nAbility to manage modular product (that includes several die elements such as : external die, internal die, GT, IO, etc.)\nAbility to influence business Unit decision making.\nInside this Business Group\nIntel's Sales and Marketing (SMG) organization works with global customers and partners to solve critical business problems with Intel based technology solutions. SMG works across business units to amplify the customer voice and deliver solutions that accelerate their business. We work across numerous industries, including retail, enterprise and government, cloud services and healthcare as examples. The operations team focuses on forecasting, driving alignment with factory production and delivering efficiency tools and our marketing capability drives demand and localized marketing in locations around the globe. Our sales force navigates a complex partner and customer ecosystem while shaping product roadmaps, driving value for our customers, and collaborating to harness emerging technology trends to deliver comprehensive solutions.\n\nPosting Statement\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\n\nBenefits\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://www.intel.com/content/www/us/en/jobs/benefits.html\n\nWorking Model\nThis role will be eligible for our hybrid work model which allows employees to split their time between working on-site at their assigned Intel site and off-site. In certain circumstances the work model may change to accommodate business needs.\nJobType\nHybridShow more Report"}, {"company": "Optimove", "job": "Operational Support Engineer-Student Position", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "4.5", "link": "", "description": ""}, {"company": "PowerLink Software Ltd", "job": "Support Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "", "description": "Powerlink is an end-to-end business management platform tailored for your business-specific needs.\n\nFrom marketing to sales to customer service, and more, Powerlink makes it easy for your entire business to work together.\nEach department is powerful on its own, but together they can be explosive.\nPowerlink was built from the ground up by developers who already knew back in 2011 that there had to be a better way to improve customer relations and decided to develop a software for every need aimed to keep customers delighted.\nAfter conquering the local market with more than 2000 satisfied Israeli customers from various industries, we are ready to go global.\n\nOur Customer Success department includes:\nTechnical Support team - the first point of contact for customers.\nAccount managers team - developing long-term relationships with customers, building loyalty, and ensuring higher customer retention and satisfaction.\nTechnical product experts - sharing their extensive knowledge for designing solutions for strategic customers.\nWe are looking for a true leader who is passionate about people and technology to lead\nthe CS department through this adventure.\nAre you up for the challenge?\n\nThe Role:\nPowerlink's support team is dedicated to providing outstanding service to its customers by answering their needs.\n\nDifferent issues are raised by customers through the website, email, chat, and contact form.\n\nThe support engineer registers the issue in our ticketing system, and a new ticket is generated.\n\nA new ticket is routed to the appropriate rep and team (Support, CS, PS), and the rep has to take the necessary steps to resolve it.\n\nYour Experience & Skills:\n2nd or 3rd year student in Industrial Engineering/ Information systems/ Computer Science.\n‍\nAvailable to work 3 days a week.\n‍\nIndependent worker and a team player.\n‍\nHigh learning capabilities, willing to dig in and explore.\n‍\nHigh service awareness.\nExperience in working with customers - advantage.\nThrive in a fast-paced environment.\nStrong attention to details.\nTech oriented with ability to learn new technologies quickly.\n‍\nStrong sense of ownership and responsibility.\nCapable of training and supporting users throughout all system processes.\nGood communication and interpersonal skills.\nHigh English Level.\nWe Appreciate Those With:\nSay what they think.\nIndependent and proactive in a fast-paced environment.\nFast learner.\nHas excellent interpersonal and presentation skills.\nProven track record of building client relationships and being client facing.Show more Report"}, {"company": "Quantum Machines", "job": "Product Marketing - Student (Master physics)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": "Quantum Machines is the global leader in control systems for quantum computing, providing the hardware and software tools researchers and businesses need in order to build quantum computers from the ground up. We are pushing the envelope in a field on the verge of exponential growth, bringing about opportunities like those made possible with the invention of classical computing 50 years ago.\nWe are assembling the strongest team of professionals in the world with the goal of revolutionizing how quantum computers are built and controlled, while accelerating their arrival. Come join a multi-disciplinary world-class team and work on a new class of problems at the cutting-edge of technology, science, and business.\nQuantum Machines is backed by top tier investors such as Battery Ventures, Red Dot Capital Partners, TLV Partners, and Avigdor Willenz’ investment group.\nWe are looking for one physics student (BSc or MSc) with a passion for communication and for writing technical-marketing content. The ideal candidates have taken quantum mechanics courses and are eager to learn about the challenges of the scientific and industrial community around quantum computing and control. You will be guided in learning about the key players of today’s quantum ecosystem and keeping up to date with research and industry efforts.\nResponsibilities:\nDevelop a deep understanding of the technology, ecosystem, customer challenges and industry trends, in order to create related content such as social media posts, white papers, web pages, brochures, presentation and more\nCreate sales tools as product brochures, case studies, product videos and product presentations\nProduce and review technical notes and product marketing material for QM - a thriving international quantum control company.\nWork closely with internal peers such as Product, R&D and CTO Teams to summarize into text that convey our value to customers in the best way.\nRequirements:\nBasic quantum mechanics university course (must)\nExcellent writing skills (must)\nAble to study independently and eager to learn\nAdvanced or technology-oriented quantum mechanics courses (plus)\nFluent in English (spoken and written) – Danish NOT required (plus)\nSome experience with scientific and technical writing (plus)\nExpecting 40%-60% as a part-time positionShow more Report"}, {"company": "OGC Global", "job": "Design and Communication Associate", "city": "Tel Aviv-Yafo", "date": "28d", "rating": "5.0", "link": "", "description": ""}, {"company": "Indian River State College", "job": "Adjunct - School of Business", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8dbb658f&cb=1676381566832&jobListingId=1007990864031&jrtk=3-1-1gp821dl1jm4l801-1go9hqd71i14u800-e5118f69fb61d629-", "description": "Job Description\nESSENTIAL JOB FUNCTIONS AND RESPONSIBILITIES:\nDelivering high quality instruction in introductory and advanced business, management and leadership courses;\nDelivering training courses in a wide range of settings in the four county area;\nMaintaining effective records of student success;\nCoaching students in a co-curricular occupational student organization;\nContributing to the recruitment and retention of program students.\nQUALIFICATIONS, KNOWLEDGE AND SKILL REQUIREMENTS:\nMaster’s Degree with a minimum of eighteen (18) graduate semester hours in business administration from an accredited institution;\nAbility to deliver high quality instruction in a range of business courses with specific need in the areas of:\nOrganizational Management\nLeadership\nFinance/Corporate Finance\nMarketing\nBusiness Law (JD or Master’s with 18 credits in Business Law)\nHuman Resource\nWillingness to make students active partners in the teaching/learning process;\nStrong student-orientation, and the ability to work effectively with a diverse student population;\nComputer literacy and experience using Learning Management Systems (LMS) and computers in the classroom;\nWillingness to apply technology and innovative approaches to teaching;\nAll instructors must meet the appropriate credentialing requirements for the Southern Association of Colleges and Schools (SACS).\nPreference shall be given to the following:\nMinimum of two (2) years of teaching experience in a college or other post-secondary institution setting;\nPrior experience teaching at the baccalaureate level;\nTeaching experience with diverse adult populations;\nRecent industry experience working with contemporary strategies;\nExperience in distance learning instruction.\nSPECIFIC DUTIES AND RESPONSIBILITIES:\nDelivering effective instruction in a wide range of management courses, using contemporary teaching methods;\nMaintaining and developing skills necessary to integrate and use technology effectively in the classroom and through various modes of delivery;\nServing as the member of an effective team in achieving the overall department and college goals;\nAiding students in overcoming obstacles to successful completion of instructional programs;\nPerforming other duties and responsibilities as assigned;\nFlexibility to work some evenings and weekends.\nPHYSICAL REQUIREMENTS:\nThis position requires an ability to sit and stand for extended periods of time and to present verbal lectures/demonstrations, walk, bend, lift, reach up, stoop, and carry items occasionally in excess of twenty-five (25) pounds. It also requires manual dexterity to operate standard office machines, such as, copier, fax, calculator, telephone, and other equipment as necessary. IRSC expects its employees to follow proper safety standards while employed by the College.\nClassification\nAdjunct\nSupervisory\nNo\nFLSA Exempt\nYes\nEmployment Type\nTemporary (Fixed Term)\nCompensation and Application Deadline\nCommensurate with Degree/Experience Level | Adjunct positions at IRSC are filled on an as needed basis and are permanently posted. You will be contacted for an interview only if the related department has positions to fill.Show more Report"}, {"company": "Indian River State College", "job": "Adjunct - Fire Academy", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_129101b0&cb=1676381568161&jobListingId=1006768515126&jrtk=3-1-1gp821f2uih5h801-1go9hqd71i14u800-b6b7bbaf3cbdecfb-", "description": "Job Description\n ESSENTIAL JOB FUNCTIONS AND RESPONSIBILITIES:\nPreparing, instructing and grading of class coursework;\nAssigning final grades.\nQUALIFICATIONS, KNOWLEDGE AND SKILL REQUIREMENTS:\nApplicants must be compliance with Chapter 69A-37.058 Firefighters Standards and Training\nMinimum of 6 years of experience as a regular member of an organized Fire department\nA minimum of Fire Service Instructor I Certification\nA minimum of Live Fire Training Instructor I Certification (within one year)\nApplicant must have a letter of recommendation from a current Fire Academy Instructor who has a minimum of three (3) years of service at the IRSC Fire Academy\nApplicant must have a letter of recommendation from his/her immediate supervisor\nApplicant must submit a resume detailing his/her job and educational history\nApplicant should also submit any additional documentation to support his/her qualifications as an instructor\nSPECIFIC DUTIES AND RESPONSIBILITIES:\nInstructing in the Basic Recruit Firefighting Academy;\nServing as a liaison and resource to the fire service community and public school systems of the service district;\nServing on college committees as assigned, marketing the program; serving as an advisor to a vocational advisory committee; academic advisement to students;\nReviewing and revising curriculum to meet mandated changes or industry needs;\nAppropriately integrating computer software and technology-based instruction;\nMaintaining a safe and effective classroom environment;\nParticipating in department, division, and adjunct faculty meetings;\nPerforming other duties and responsibilities as assigned.\nPHYSICAL REQUIREMENTS:\nThis position requires an ability to sit, stand, walk, bend, reach up, stoop ability to participate in physical activities related to firefighting, the ability to lift an object of fifty (50) pounds or less, and carry items in excess of fifty (50) pounds. It also requires manual dexterity to operate Firefighting equipment, standard office machines, such as, copier, fax, calculator, telephone, and other equipment as necessary. IRSC expects its employees to follow proper safety standards while employed by the College.\nClassification\nAdjunct\nSupervisory\nNo\nFLSA Exempt\nNo\nEmployment Type\nTemporary (Fixed Term)\nCompensation and Application Deadline\nCommensurate with Degree/Experience Level | Adjunct positions at IRSC are filled on an as needed basis and are permanently posted. You will be contacted for an interview only if the related department has positions to fill.Show more Report"}, {"company": "", "job": "Customer Service Rep Part-time Position (No Sales, Work Remotely", "city": "Jerusalem", "date": "21d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_755239d3&cb=1676381569296&jobListingId=1008400361466&jrtk=3-1-1gp821g6fkbnc801-1go9hqd71i14u800-4e9a7abc5340ae86-", "description": "We are an established online business in Canada. We are seeking a responsible individual for phone and email support to fill a position that is opening due to the upcoming retirement of a team member.\n\nThe candidate must be comfortable with speaking to customers over the phone to address customer concerns and questions, and resolve issues regarding personal accounts.\n\nThe position requires work during Canadian business hours, 3-4 hours per day, 4-5 days per week.\n\nThe job does not require technical knowledge except for basic computer skills.\n\nJob duties:\n\nRespond to customers needing help understanding how to navigate the site.\n\nHelp answer customer questions, troubleshoot, and investigate customer inquiries to provide the best solution.\n\nCompose thoughtful, personalized responses for a variety of customer requests via email and phone.\n\nProvide customers with excellent customer service.\n\nWork with other team members to provide and receive mutual support.\n\nOur requirements:\n\nEnglish mother tongue-MUST\n\nGood problem-solving/reasoning skills-MUST\n\nExcellent verbal, written communication, and editing skills - MUST\n\nAdditional qualifications:\n\nCustomer service, retail, or marketing experience is an asset\n\nBilingualism (English/French) is preferred\n\nAvailable to commit to work during Canadian business hours\n\nShort weekend hours are available in addition to regular hours and are optional.\nImportant: Please indicate your desired salary.\n\nApply now: rachelca1975@gmail.comShow more Report"}, {"company": "Indian River State College", "job": "Adjunct - Fire Science", "city": "Central", "date": "30d+", "rating": "4.1", "link": "", "description": "Job Description\nESSENTIAL JOB FUNCTIONS AND RESPONSIBILITIES:\nPreparing, instructing and grading all class coursework;\nAssigning final grades;\nMaintaining regularly scheduled office hours to meet with students.\nQUALIFICATIONS, KNOWLEDGE, AND SKILL REQUIREMENTS:\nMaster’s degree with a minimum of 18 graduate level credits in the discipline of Fire Science from an accredited institution;\nCertification as a Florida Firefighter or eligibility for certification;\nFlorida Fire Standard Certification to instruct certifiable classes or eligibility to receive certification;\nFive (5) years of proven work experience as a firefighter;\nA proven track record of effective instruction in Fire Science with the ability to utilize contemporary technology;\nThe ability to function in an occupationally-oriented program requiring regular interfacing with students, secondary schools, and fire service agencies;\nDocumentation of successful on-the-job experiences in the contemporary workplace;\nA willingness to apply technology and innovative approaches to the teaching of Fire Science is essential;\nAll instructors must meet the appropriate credentialing requirements for the Southern Association of Colleges and Schools (SACS).\nSPECIFIC DUTIES AND RESPONSIBILITIES:\nInstructing fire science courses leading to the Associate in Science Degree;\nInstructing in the Basic Recruit Firefighting Academy;\nServing as a liaison and resource to the fire service community and public school systems of the service district;\nServing on college committees as assigned, marketing the program; serving as an advisor to a vocational advisory committee; academic advisement to students;\nReviewing and revising curriculum to meet mandated changes or industry needs;\nAppropriately integrating computer software and technology-based instruction;\nMaintaining a safe and effective classroom environment;\nParticipating in department, division, and adjunct faculty meetings;\nPerforming other duties and responsibilities as assigned.\nPHYSICAL REQUIREMENTS:\nThis position requires an ability to sit, stand, walk, bend, reach up, stoop, ability to participate in physical activities related to firefighting, the ability to lift an object of fifty (50) pounds or less, and carry items occasionally in excess of fifty (50) pounds. It also requires manual dexterity to operate standard office machines, such as, copier, fax, calculator, telephone, and other equipment as necessary. IRSC expects its employees to follow proper safety standards while employed by the College.\nClassification\nAdjunct\nSupervisory\nNo\nFLSA Exempt\nYes\nEmployment Type\nTemporary (Fixed Term)\nCompensation and Application Deadline\nCommensurate with Degree/Experience Level | Adjunct positions at IRSC are filled on an as needed basis and are permanently posted. You will be contacted for an interview only if the related department has positions to fill.Show more Report"}, {"company": "", "job": "Part time Admin and finances for non-profit", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ade98d0d&cb=1676381571610&jobListingId=1006990916527&jrtk=3-1-1gp821ievjca7801-1go9hqd71i14u800-3d1785c70bc70c4c-", "description": "A small non-profit organization, that promotes and works for a united Jerusalem through tours, education, advocacy, and land reclamation, is looking for a fully bilingual secretary to work in admin, basic bookkeeping, and finances, marketing support and PA to the President\nThe position is part time, flexible hours in Ramot B office.\nEssential requirements:\nAt least 3 years experience working in an office in admin and basic bookkeeping\nFluency in English and Hebrew (at least 10 years in Israel or grew up here)\nOrganized with attention to detail, works well with numbers and spreadsheets\nExcellent command of Word, especially Excel, Internet, and E-mail , (quick-books an advantage) Please send your CV to chaim@keepjerusalem.orgShow more Report"}, {"company": "Cardo Systems", "job": "Sales Operations Admin – Part-time", "city": "Raanana", "date": "17d", "rating": "4.0", "link": "", "description": "Cardo Systems, the global market leader in the field of wireless communication systems for motorcycle & ski helmets, is looking for an Italian speaker Sales Operations Admin to join its sales department.\nPart-time position (50%) in a hybrid model (from the company's offices at Raanana/from home), reporting directly to Sales Operation Manager and dotted line to the Country Manager in Italy.\nJob Description:\nIn this role, you will join our sales team and become the focal point for Cardo’s channel partners in Italy. You will support sales leadership in enabling revenue growth and increasing sales productivity by providing effective assistance with the day-to-day administration of the sales team and front/back-office tasks.\nRoles & Responsibilities:\nServing as the main focal point for the sales managers and customers regarding product availability, answering queries, reports, etc.\nAct as an internal focal point for sales order-related issues, including order processing, modifications, shipments, etc.\nTracking the automated sales order system and providing backup when needed.\nMaintaining & tracking sales data in Priority ERP/Salesforce CRM, including reports and sales analysis\nFinancial support: budget control, commission follow-up, collecting payments, and more.\nMarketing support by booking Events/Locations.\nSell Thru reports\nRequirements:\n\nRequirements:\nOur ideal candidate is goal-oriented with customer service experience. If you have exceptional organizational and communication skills and draw energy from being part of a team, we would like to meet you!\nGood Italian language skills, written and oral - a must.\n0-2 years of relevant professional experience (in sales or costumers support/ front/back-office or other); preferably from a global company with a technological environment.\nService-oriented personality with a can-do attitude.\nExcellent communication and problem-solving skills.\nWell organized, multi-tasking abilities, working well under pressure.\nQuick perception and good self-learning ability.\nAvailability for 50% position.Show more Report"}, {"company": "NVIDIA", "job": "Physical Layer Architecture Student", "city": "Israel", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0f8f4cf6&cb=1676381574077&jobListingId=1008343602521&jrtk=3-1-1gp821krbj4j1801-1go9hqd71i14u800-47fde910b63664cb-", "description": "With the growing demand for traffic bandwidth in datacenters, efficient physical high-speed communication becomes a crucial part of the development of silicon ASC’s that serve networking infrastructures. We are looking for a PHY (Physical Layer) Architecture student for our Architecture team. We are positioning you to a key role to face this challenge and become part of our team, so we can continue developing the best devices in the industry.\nNVIDIA's networking architecture group is seeking for a highly motivated, eager to learn and open minded student to explore, and define the Physical layer of our products. As a leading engineer, you'll be responsible to define and drive features and have responsibility on the Physical layer architecture. The role will include definition of both the hardware circuitry and the firmware/software that is involved in operating the physical layer communication. We are searching for hardworking, enthusiastic, student, which has both high grades as well as good personal skills, in order to be able to lead cross groups activities.\nWhat you will be doing:\nLead projects across team, starting from processing requirements and definitions from customers and translating those into detailed technical specification for hardware architecture, system embedded software, user interface and high-level design.\nDefine the architecture of implementing physical layer standards into NVIDIA’s ASIC devices.\nInvolved in standard bodies activities and definition of next generation protocols.\nDefine features for the phy layer, to exploit interoperability between different generations of communication.\nBe involved in product definition and the high-speed protocols that the NVIDIA networking devices will support.\nWork closely with multi-functional teams - design, backend, system, marketing, firmware, driver, etc. Provide architecture definitions and as a result converge on key design decisions.\nBecome focal point for NVIDIA’s physical layer networking communication devices.\nWhat we need to see:\nB.Sc. student in Electrical Engineering.\nExcellent problem solving, teamwork, and interpersonal skills.\nCommunication skills, analytical abilities, technically hands-on.\nWays to stand out from the crowd:\nExperience in the following fields: Physical layer communication / System / Signal Integrity / high-speed communication protocols.\nExperience in embedded software.Show more Report"}, {"company": "", "job": "מנהל/ת תוכן ל-C digital marketing שיווק רופאים", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_37a9d02d&cb=1676381575334&jobListingId=1007603289897&jrtk=3-1-1gp821m30j4gi801-1go9hqd71i14u800-ecef301e255012fb-", "description": "הגש מועמדות\n\nתל אביב -יפו, רמת גן\nמשרה חלקית\nמעל שנה ניסיון\nתיאור\n\nאנחנו מגייסים מנהל/ת תוכן!\n\n\nמי אנחנו?\nסוכנות C digital marketing המתמחה בשיווק בעולמות הרפואה.\n\nמה אנחנו מחפשים?\nמנהלת או מנהל תוכן שיצטרפו אלינו, וימשיכו לצמוח ביחד איתנו.\n\nמה נדרש?\nניסיון מקצועי בכתיבת תוכן (שיווק/עיתונות/יח״צ) - חובה\nניסיון בתחום הסושיאל - יתרון\n\nעבודה מהבית, כשכיר/ה.\n\nדרישות\n\nניסיון מקצועי בכתיבת תוכן (שיווק/עיתונות/יח״צ) - חובה\nניסיון בתחום הסושיאל - יתרון\n\nדרושים בתחום\nשיווק - כתיבה שיווקיתשיווק - מנהל תחום דיגיטלשיווק - ניהול מדיה\nמאפייני משרה\nמעל שנה ניסיוןעבודה מהביתמשרה חלקיתעבודת משמרותעבודה לפי שעות\nשמור משרה\n\nשתף\n\nשלח מודעה לחבר\n\nעודShow more Report"}, {"company": "", "job": "Part time executive assistant", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e665976a&cb=1676381576615&jobListingId=1006603502902&jrtk=3-1-1gp821nbi2ths001-1go9hqd71i14u800-78606eeb5a1746b5-", "description": "Hello,\n\nWe are looking for a part-time assistant to help us with all of our back office logistics. They would be working directly with the owner as well as working with employees.\n\nDuties Include Marketing, Customer Care, Scheduling, Research for potential clients, and maintenance of the back office.\n\nHebrew/ English a must. Minimum 2 yrs experience. Motivated and hardworking individuals only. Working from home with potential for office position as the company grows.\n\nContact Yoseph Tugenberg email cover letter and resume to EaglePropertiesIsrael@gmail.comShow more Report"}, {"company": "Oski Technology", "job": "Physical Layer Architecture Student", "city": "Israel", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_58910e8b&cb=1676381578073&jobListingId=1008343785682&jrtk=3-1-1gp821ooep6eb801-1go9hqd71i14u800-b365de4bad478502-", "description": "With the growing demand for traffic bandwidth in datacenters, efficient physical high-speed communication becomes a crucial part of the development of silicon ASC’s that serve networking infrastructures. We are looking for a PHY (Physical Layer) Architecture student for our Architecture team. We are positioning you to a key role to face this challenge and become part of our team, so we can continue developing the best devices in the industry.\nNVIDIA's networking architecture group is seeking for a highly motivated, eager to learn and open minded student to explore, and define the Physical layer of our products. As a leading engineer, you'll be responsible to define and drive features and have responsibility on the Physical layer architecture. The role will include definition of both the hardware circuitry and the firmware/software that is involved in operating the physical layer communication. We are searching for hardworking, enthusiastic, student, which has both high grades as well as good personal skills, in order to be able to lead cross groups activities.\nWhat you will be doing:\nLead projects across team, starting from processing requirements and definitions from customers and translating those into detailed technical specification for hardware architecture, system embedded software, user interface and high-level design.\nDefine the architecture of implementing physical layer standards into NVIDIA’s ASIC devices.\nInvolved in standard bodies activities and definition of next generation protocols.\nDefine features for the phy layer, to exploit interoperability between different generations of communication.\nBe involved in product definition and the high-speed protocols that the NVIDIA networking devices will support.\nWork closely with multi-functional teams - design, backend, system, marketing, firmware, driver, etc. Provide architecture definitions and as a result converge on key design decisions.\nBecome focal point for NVIDIA’s physical layer networking communication devices.\nWhat we need to see:\nB.Sc. student in Electrical Engineering.\nExcellent problem solving, teamwork, and interpersonal skills.\nCommunication skills, analytical abilities, technically hands-on.\nWays to stand out from the crowd:\nExperience in the following fields: Physical layer communication / System / Signal Integrity / high-speed communication protocols.\nExperience in embedded software.Show more Report"}, {"company": "", "job": "Job Opp Part-time Marketing Assistant", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186131d34a3b487550ab03f39d3&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a7d500d2&cb=1676381579708&jobListingId=1006601229025&jrtk=3-1-1gp821qbokltb801-1go9hqd71i14u800-4ee97956af7e73d3-", "description": "Rank Ranger, a leading SEO & digital marketing platform provider, is looking for a part-time marketing assistant to join its team.\nWe’re looking for a marketing assistant to help us expedite our marketing process. The marketing assistant will help support the CMO and the marketing team to better implement the company’s marketing strategy.\nThe position is perfect for anyone looking to get started in digital marketing.\nResponsibilities:\n\nAssist in the creation of marketing materials\n\nEdit a variety of marketing content\n\nCreate social media posts as needed\n\nWork to help support SEO and paid advertising campaigns\n\nSupport the customer service team as needed\n\n\nRequirements:\n\nHigh-level professional English\n\nStrong writing & editing skills\n\nComfort working with technology\n\nQuick learner\n\nTeam player\n\n\nEmail your CV and cover letter to jobs@rankranger.comShow more Report"}]