[{"company": "Seperia", "job": "Product Marketing TL", "city": "Herzliya", "date": "30d", "rating": "4.5", "link": "", "description": "Who We Are:\n\nSeperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for an ambitious and talented Product Marketing Team Lead to join the team.\n\nWhat You Will Do:\n\nLeading a small team of Project Managers, including (but not limited to): hiring, training and responsibility for personal development.\nDrive the execution of our products (review sites) through their entire lifecycle: market research, competitive analysis, planning, positioning, roadmap development and ongoing product optimization.\nManage communication with international brands, evaluate their performance metrics, and drive product monetization.\nAnalyze users’ needs, web page performance, market trends and partnerships from an ROI perspective.\nEstablish project management processes, data-driven & measurability as a culture in your team.\nWork closely with external development teams to track progress and ensure timely and high-quality deliverables.\nWork closely with marketing teams, design and finance.\n\nWhat You Need:\n\nGreat written & verbal communication skills (Hebrew & English) – must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n2+ years of experience in web product management, marketing project management or global website management – must.\nManagerial experience – must.\nWeb-savvy individual.\nTechnical capabilities & experience working with developers.\n\nExtra beneficial skills:\n\nExperience in managing websites via WordPress.\nKnowledge in online advertising.\n\nWhat We Offer:\n\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance product company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}, {"company": "InspHire", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a product data analyst to join an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is responsible for enhancing the business success of the company by ensuring excellence in the performance on all business aspects including marketing, games & product design, retention, monetization, etc. The department builds, operate, and optimize the processes across the entire company through the top of the art analytical capabilities & product understanding.\nResponsibilities\n• Leverage data to understand the company's products in depth, identify areas of opportunity, and execute projects to drive growth and engagement of the company's users\n• Work closely with the product teams to analyze existing features and ensure a successful implementation of new features.\n• Use data to fine-tune and balance the game’s economy, providing economy analysis and drive metrics for revenue optimization\n• Evaluating and measuring A/B testing results and trends among players\n• Build and maintain reports, dashboards, and metrics to monitor the performance of products\n• Be an expert on industry trends and the competitor landscape to evolve the company's thinking\nWhat we expect\n• 2+ years of experience in product analytics in the Online/Gaming industry\n• BA/B.Sc. in Statistics / Math / Engineering / Economics or other quantitative fields\n• Strong SQL with experience in querying large, complex data sets.\n• Strong Excel skill\n• Advanced knowledge in statistical tools and models- advantage\n• Proven experience leading data driven projects from definition\n• High level of analytical and problem-solving skills with strong attention to details\nDesired\n• Experience working with Qlikview – advantage\n• English: Advanced\n• Core competencies: Professionalism, Responsibility, Collaboration and Teamwork, Initiative and Creativity\nPersonal Requirements:\n• Ability to collaborate with colleagues across different disciplines and locations to achieve results\n• Passion for gaming\n• High level of verbal and written English.Show more Report"}, {"company": "8fig", "job": "Product Design", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking a highly experienced and talented Product Designer with at least 3 years of experience in user experience and interactive design. The ideal candidate possesses strategic thinking and a comprehensive understanding of the product development process, from research and prototyping to design and usability testing. Strong communication, organizational, and analytical skills are essential, as the candidate will be expected to continuously learn and focus on solving complex product problems.\nKey Responsibilities:\nConducting user research to understand the needs and pain points of the target audience.\nCreating user personas and journey maps to guide design decisions.\nDesigning wireframes, prototypes, and high-fidelity mockups.\nConducting usability testing to validate design solutions.\nCollaborating with cross-functional teams, including product management, engineering, and marketing.\nCommunicating design decisions and rationale effectively to stakeholders.\nStaying up-to-date with industry trends and best practices in UX design.\nProviding design guidance and mentorship to junior designers.\nParticipating in the entire product development process, from research to launch.\nContinuously iterating on designs based on user feedback and data analysis.\n\nRequirements:\n\n\n3+ years of experience working as a UX designer on SaaS products\nMaster of design tools such as Sketch and Figma\nStrong understanding of user-centered design principles and techniques\nStrong portfolio demonstrating a track record of creating intuitive and user-friendly software\nExcellent interpersonal skills\nExperience with A/B testing and working with data intensive products\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nInterest and background in fintech\nExperience selling products on Amazon, Shopify, BigCommerce…\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Show more Report"}, {"company": "PowerLink Software Ltd", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d4d94625&cb=1676381514829&jobListingId=1008270614038&jrtk=3-1-1gp81vr0lk60h801-1go9hps12gsqj800-53cebd94db61097c-", "description": "We are looking for a true leader who is passionate about people and technology. To be successful you should be curious and an excellent communicator who can earn employees' and clients' trust in order to succeed.\nLead the entire Customer Success department - account managers, professional services, and support teams.Create an environment that encourages and empowers team growth.Shaping and maintaining our customer relations strategy.Build long-term relationships with customers and identify revenue opportunities by maintaining a database of customers.Work in cooperation with sales, product, R&D, and other departments in defining end-to-end processes that align with the business goals.Set KPIs for the teams and provide performance feedback.\nAbout Us:\nPowerlink is an end-to-end business management platform tailored for your business-specific needs. From marketing to sales to customer service, and more, Powerlink makes it easy for your entire business to work together. Each department is powerful on its own, but together they can be explosive. Powerlink was built from the ground up by developers who already knew back in 2011 that there had to be a better way to improve customer relations and decided to develop a software for every need aimed to keep customers delighted. After conquering the local market with more than 2000 satisfied Israeli customers from various industries, we are ready to go global.\n\nOur Customer Success department includes:\nTechnical Support team - the first point of contact for customers.\n\n\nAccount managers team - developing long-term relationships with customers, building loyalty, and ensuring higher customer retention and satisfaction.\n\nTechnical product experts - sharing their extensive knowledge for designing solutions for strategic customers.\nWe are looking for a true leader who is passionate about people and technology to lead the CS department through this adventure.\n\nAre you up for the challenge?\n\nThe Role:\nYour Experience & Skills:\n5+ years of experience in the Customer success world.\n‍\n2+ years of experience in leading a customer-facing team or other managerial experience.\n‍\nProactive, service-minded and enjoy working with people.\n‍\nA technological degree and work experience within a technological environment.\n‍\nA business-oriented thinker with a problem-solving attitude, who can see the bigger picture.\nCapable of translating data into action and explaining how Customer Support is progressing according to KPIs.\nMotivational leader who knows how to deliver exceptional customer service.\nA down-to-earth approach, understanding that it's all about the people.\nExcellent written and verbal communication skills in both Hebrew and English.\nWe Appreciate Those With:\nSay what they think.\nIndependent and proactive in a fast-paced environment.\nFast learner.\nHas excellent interpersonal and presentation skills\nProven track record of building client relationships and being client facing.Show more Report"}, {"company": "Eybna Technologies", "job": "Sales Development Representative - EU", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=305&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1a4150c7&cb=1676381516320&jobListingId=1008156930211&jrtk=3-1-1gp81vsa3g2fb801-1go9hps12gsqj800-88c5b3600253f325-", "description": "Full-time\n\nResponsibilities:\n\nQualify leads from marketing campaigns as sales opportunities\n\nContact potential clients through cold calls and emails\n\nPresent our company to potential clients\n\nIdentify client needs and suggest appropriate products/services\nCustomize product solutions to increase customer satisfaction\nBuild long-term trusting relationships with clients\nProactively seek new business opportunities in the market\nSet up meetings or calls between (prospective) clients and Account Executives\nReport to the Regional Sales Manager on (weekly/monthly/quarterly) sales results\nStay up-to-date with new products/services and new pricing/payment plans\n\nQualifications:\n\nProven work experience as a Business Development Representative or similar role\n\nHands-on experience with multiple sales techniques (including cold calls)\n\nTrack record of achieving sales quotas\n\nExperience with CRM software (e.g. Pipedrive or Salesforce)\n\nFamiliarity with MS Excel (analyzing spreadsheets and charts)\n\nUnderstanding of sales performance metrics\n\nExcellent communication and negotiation skills\n\nAbility to deliver engaging presentationsShow more Report"}, {"company": "Finonex", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "4.0", "link": "", "description": "We are growing and looking for a brilliant Data Analyst to join our fast-growing company and Data department.\nAs part of this position, you will work closely with multiple business units/products which are from Finonex's internal innovation home or post Acquisitions products.\nYou will support all analytical needs of these units, such as: defining the analytical layer, marketing & product analytics needs, and mostly on business questions.\nRequirements:\n\n3+ years of experience as a business analyst (online industry advantage)Vast knowledge and hands experience in SQL including complex queries from multiple data sources- MustExpert level with reporting platforms and data visualization - Must (Pyramid strong advantage)Excellent analytical skillsHigh presentation and communication skillsFluent in English communication, written and verbal.\n\nOn this role you will:\n\nSupport several different units and products by natureData analyst focal for Business units & engineering related teamsProactively provide insights that will lead the business growthAbility to module and simulate new features & opportunities estimated impactBuild and maintain reporting and dashboardsManage multiple tasks at a time in fast-pacedConduct deep dive analysis with actionable recommendations and conclusions\nWill be nice that you have:\n\nExpert level in working with Big data tools (advantage)Experience with GA and Product analytics tools (Mixpanel/ Amplitude/Heap)\nExperience in the online industryShow more Report"}, {"company": "Moburst", "job": "Marketing Director", "city": "Israel", "date": "18d", "rating": "4.4", "link": "", "description": "Moburst is a global mobile & digital marketing agency that helps companies grow their business. The most prestigious brands and startups in the world such as Google, Samsung, Discovery and Uber are leveraging our mobile & digital strategy, product, creative, organic and media services to enhance their product and maximize their KPIs.\nWe're looking for a talented Marketing Director to join our team Sales & Marketing team!\nResponsibilities:\nHelp us show why Moburst is the best growth agency in the world by achieving international awards and recognitions\nBuild and drive the marketing strategy of Moburst\nDevelop short, medium and long-term demand generation strategies\nManage the marketing budget and measure the success of marketing activities, with metrics such as ROI on campaigns and events, and production of marketing materials\nDevelop and deliver our marketing calendar that includes campaigns, events, (paid) social campaigns, and content materials\nManaging our Work efficiently and proficiently with marketing technology and tools, such as Hubspot\nManage PR and social media efforts\nManage our website and email marketing roadmap\nDeliver against agreed-upon timelines, schedules, and expectations\nAdditional duties as assigned to help ensure the office runs smoothly and efficiently with new client opportunities such as big RFPs\nRequirements:\n4-5 years of experience as a Marketing Manager in B2B marketing, and/or product marketing\nExperience working with the US market\nExcellent copywriting, editing, and proofreading skills\nProficiency with G-Suite apps\nExcellent command of English\nIndependent self-starter and team player who can hit the ground running\nA willingness to roll up the sleeves and deliver, passionate about building an effort from the ground up\nAbility to think tactically and strategically, as well as practically and operationally\nExperience with digital marketing tools, such as Google Analytics, Google Tag Manager, WordPress, etc\nWebmaster and desktop publishing skills, including familiarity with Adobe Creative Suite - advantage\nFamiliarity with digital and mobile marketing - advantageShow more Report"}, {"company": "Eybna Technologies", "job": "Marketing Intern", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=308&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8ac95eac&cb=1676381520620&jobListingId=1008156930182&jrtk=3-1-1gp8200kakcng801-1go9hps12gsqj800-a8629c073121de32-", "description": "Full-time Internships\n\nResponsibilities:\n\nCollect quantitative and qualitative data from marketing campaigns\n\nPerform market analysis and research on the competition\n\nSupport the marketing team in daily administrative tasks\n\nAssist in marketing and advertising promotional activities (e.g. social media, direct mail, and web)\n\nPrepare promotional presentations\n\nHelp distribute marketing materials\n\nManage and update company database and customer relationship management systems (CRM)\n\nHelp organize marketing events\n\n\nQualifications:\n\nStrong desire to learn along with a professional drive\n\nSolid understanding of different marketing techniques\n\nExcellent verbal and written communication skills\n\nExcellent knowledge of MS Office\n\nFamiliarity with marketing computer software and online applications (e.g. CRM tools, Online analytics, and Google Adwords)\n\nPassion for the marketing industry and its best practices\n\nCurrent enrollment in a related BS or Master’s degreeShow more Report"}, {"company": "Fortinet", "job": "Field Marketing Specialist - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=309&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_17f16777&cb=1676381521830&jobListingId=1008343684228&jrtk=3-1-1gp8201qok6ep801-1go9hps12gsqj800-7c5d4b63d6ff8a8c-", "description": "Field Marketing Specialist – Israel\nFortinet (NASDAQ: FTNT) makes possible a digital world that we can always trust through its mission to protect people, devices, and data everywhere . This is why the world’s largest enterprises, service providers, and government organizations choose Fortinet to securely accelerate their digital journey. The Fortinet Security Fabric platform delivers broad, integrated, and automated protections across the entire digital attack surface, securing critical devices, data, applications, and connections from the data center to the cloud to the home office. Ranking #1 in the most security appliances shipped worldwide, more thank 595,000 customers trust Fortinet to protect their businesses. And the Fortinet NSE Training Institute, an initiative of Fortinet’s Training Advancement Agenda (TAA), provides one of the largest and broadest training programs in the industry to make cyber training and new career opportunities available to everyone. Learn more at https://www.fortinet.com , the Fortinet Blog , and FortiGuard Labs .\nTo accompany our exponential growth in the Israel region, Fortinet EMEA Marketing is seeking a Field Marketing Specialist in the IT Industry to help further expand our customer and market footprint in the Israeli market by focusing on brand awareness as well as lead and pipeline building activities. The right candidate for this role combines strategic thinking and tactical execution skills.\nBased in Herzliya office, this position will report to the Sr. Field Marketing Manager – Eastern Europe, Israel & Greece. The Field Marketing Specialist will be working closely with sales to understand their targets, priorities and key accounts and collaborate with various EMEA marketing departments. Will be also working with the channel team to lead and coordinate all channel marketing to and through Fortinet distributor and reseller base.\nResponsibilities\nDevelop and drive integrated marketing programs which consist of best practice marketing mix elements that generate quality prospects\nLeverage and localize a repeatable and systematic set of programs to drive demand with the right balance between in country and global campaigns\nManage key marketing activities like lead gen campaigns, events (virtual and physical), industry conferences and sponsorships\nProvide reporting and analysis on Field Marketing Activities\nGeneral coordination of events such as end customer days and industry conferences. This includes the preparation and follow up for each event\nWork closely with sales team on VLE & Enterprise patch to build “C” level connects\nSocial Media usage and PR knowledge in collaboration with the PR EMEA team\nWorking with Fortinet Automation and Creative team to create Invitations and approve branding when needed for events\nManaging and developing programs offered by Fortinet to distribution channel and customer facing partners (SIs, VARs, MSSPs, Telcos …) to increase revenues and brand preference\nAnalyze and measure results of channel partner related activities, in close cooperation with their respective account managers\nManaging and organizing Fortinet’s presence at partner conferences and events, supporting channel partners in organizing seminars and events, and leading the production of event materials\nCoordinating content creation for various purposes and tools as needed (eg. sales or marketing materials, advertorials, catalogues, channel and end user campaigns, websites)\nOther duties in assisting the marketing team\nProfile / Education / Experience\nAt least 8 years’ experience in IT Marketing/high-tech, preferably IT-Security\nComplete understanding and demonstrated track record across all tactics, with integrated marketing, communications, and PR tactics to drive the pipeline: digital campaigns, call out campaigns, event management, high-touch tactics, etc.\nDemonstrated success in driving marketing campaigns and promotions to meet the revenue goals of sales teams\nProven Channel Marketing experience including building marketing plans, follow-up and measurement with distributors and partners\nStrong business acumen\nAbility to work cross-functionally to plan and execute successful marketing programs\nAbility to manage the planning and execution of programs in a deadline-driven environment\nPositive attitude, strong work ethic, responsive, strong organization and communication skills\nKnowledge of CRM/sales/email automation systems and how to maximize them for efficient lead distribution and reporting (SFDC or any other automation tool experience a plus)\nGood English language communication skills, both written and oral\nProficient use of MS Office applicationsShow more Report"}, {"company": "Zota Technology Limited", "job": "Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": "Zotapay is a world-standard financial technology company connected to more than 1000 financial institutions and banks around the world, active in 150 countries globally and with 6 regional headquarters. We assist and support online companies with a wide range of Alternative Payment Methods that suit their specific needs and those of their customers, regardless of their location.\n\nWe are seeking an experienced, innovative and results driven Marketing Manager to join us in our Tel Aviv headquarters.\n\nAs Marketing Manager, you will apply your expert marketing skills with a talented team to grow our business, optimise marketing strategies and manage the departments budget and projects.\n\nWhat will you be doing?\nGenerate new business leads across multiple platforms.\nConceptualise and manage multichannel campaigns across the prospect lifecycle, ensuring clear alignment of communication and messaging across all channels.\nCreate, monitor, and optimise existing advertising PPC campaigns across different platforms.\nWork and monitor SEO and other marketing service providers.\nGather market insights to inform outreach strategies, increase conversions, and generate qualified leads for the Sales and Business Development teams.\nOngoing measurement and optimisation based on relevant business KPIs.\nUpdate and monitor company marketing material (sales decks, one-pagers, brochures, white-papers, banners, videos, etc.)\nWebsite maintenance: regular blog updates etc.\n3+ years of proven experience in a global B2B marketing position with hands on know-how executing multi-channel campaigns.\nYou have worked with various platforms, CRMs (Salesforce) and digital marketing platforms (e.g. Google Analytics, Google AdWords, Facebook Adverts Manager), blogging platforms (e.g. Wordpress etc.).\nStrategic mindset: ability to understand program goals and KPI's and craft marketing initiatives that deliver.\nFluent verbal and written English communication skills across all mediums.\nProject management skills with the capacity to manage competing priorities, maintain attention to detail and to meet deadlines.\nKnowledge of growth strategy and a goal orientated vision for the future.\nSuperb leadership and collaboration abilities, strong organisational skills.\nCreative eye, not afraid to bring new ideas to management.Show more Report"}, {"company": "Google", "job": "Product Manager, Data Movement, Google Cloud", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.5", "link": "", "description": ""}, {"company": "", "job": "Content Marketing Leader", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "ריבי גיוס והשמה", "job": "דרוש/ה Head of Creative Marketing | Gaming רמת גן 203203", "city": "Ramat Gan", "date": "30d+", "rating": "", "link": "", "description": "Head of Creative Marketingfor Gaming Company in Ramat-GanKey Responsibilities:New marketing channels DevelopmentExamining the feasibility and implementation of new marketing technologiesConducting competition analysesLead POCsRequired Qualifications:A dreamer, an evangelist who will be a driver for innovation and creativity.Experience in:Strategy, marketing insight, business needs, and marketing channels and technologies.Experience from:Digital marketing, preferably with casino experience but not only.Market analysis - nice to have.* משרה מס׳ #203203 מיועדת לגברים ונשים כאחדסוג המשרה: מלאהShow more Report"}, {"company": "SQream Technologies", "job": "MARKETING", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c591d250&cb=1676381529891&jobListingId=1008343248494&jrtk=3-1-1gp8209lkjorc801-1go9hps12gsqj800-ade5adec65071388-", "description": "DESCRIPTION\nSQream is looking for a highly motivated and experienced VP of Marketing to join the leadership team to lead and scale its global marketing activities with strong experience in brand strategy and ABM. As the VP of Marketing at SQream together with a team of marketers, you will work closely with the product team and sales and bus dev team to:\nDevelop the marketing strategy taking into account:\nFocus on key geographics\nFocus on targeted accounts\nDefine targeted personas\nDefine user journey\nDefine integrated marketing plan across the field and digital activities\nDevelop and maintain the SQream brand and messaging:\nConsistency across all channels\nInternal communication\nDefine demand gen plan to support sales:\nAnalysis across the user journey - (knowledge of automation systems, setting KPI, Scoring and defining MaL and MQL’s\nHas proven success generating ROI positive demand through a diverse set of both offline (partners, events, etc.) and digital channels (email, paid and organic search, display media, social, community, and distributed content marketing).\nProven success executing ABM campaigns in collaboration with Sales and Account Management.\nPlan and manage the execution of all digital campaigns across a variety of channels.\nKnow how to gain alignment among key stakeholders and then execute the brand vision by driving adoption throughout the organization at all levels\nContent Marketing\nManage the team to create engaging content for Tof, Mof , Bof activities.\nEvents:\nManage the company's global events plan including virtual, industry, and F2F meetups to support the strategic objectives set by the company\nPR:\nManage the communication\n cadence covering:\nThought leadership plan\nPartnerships\nProduct releases\nAR:\nManage AR activity plan for tier one, two, and three analysts as a “Salesperson Marketer”, acting as a leader to align Marketing and Sales teams toward common goals and KPIs.o\nREQUIREMENTS\nHigh energy, charismatic, innovative, creative individual.\n5+ years of experience in leading a highly skilled and diverse marketing department in a tech company\nExperience in Enterprise software\nExperience in the big data space is a big advantage\nExcellent English speaking and writing skills and experience with SAAS products\nHas worked on a global scale\nExperience with digital and traditional marketing and the use of marketing automation\nExperience with using marketing analytics to make the right decisions\nExperience with Customer Marketing (Up-Sell, Cross-Sell, Retention) is a plus\nChannel/Partner Marketing and Enablement Marketing Experience is a plus\nCollaborative leader, especially with product and sales\nTrack record building and leading great teams\nHQ of SQream is based in the heart of Tel AvivShow more Report"}, {"company": "Experis Perm", "job": "Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.7", "link": "", "description": ""}, {"company": "Fortinet", "job": "Business Development Manager Secops - Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=316&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c098220&cb=1676381532812&jobListingId=1007733359363&jrtk=3-1-1gp820cigi14l801-1go9hps12gsqj800-337a1c555d1d01a1-", "description": "Business Development Manager SecOps – Israel\nLocation: Herzliya / Israel\nLanguage/s: Fluent English and Hebrew\nThe Business Development Manager is responsible for establishing relationships with large and medium sized businesses (customers/partners) on behalf of Fortinet as well as maintaining and growing business with install base partners/customers.\nThis role will sell the breadth of Fortinet’s capabilities, with specific focus network security, EDR, SIEM, SOAR and SecOPs in general. The role holder will manage the engagement and development of significant deals and have an outstanding track record of selling complex solutions and services in full collaboration with the in territory team of Major Account Managers, Channel Managers and Presales team.\nOver time, there will be more and more Fortinet partners/customers whom have legacy infrastructure to run their workloads, but want to transform into the new agile, digital world. To ensure there is a stronger “pull” towards new world over legacy (ensuring long term customer/journey and revenues), we would need a BDM whose primary focus is on the digital world but also has legacy world experience. From an outside perspective, this will look smooth and consistent to our partners/customers/prospects.\nOverall sales/technical expertise\nHas held various roles across numerous sectors and consultancy experience desirable\nSuccess track record in growing business in an international IT vendor\nWhilst big organization experience is desirable for our high growth ambition, we require other more important factors relating to a new BDM role: in our mind, a BDM whom specializes in Security and everything encapsulating the new, digital world must possess the following skills/experience/qualities because they will be engaging with our future partner/prospects/customers and selling the future digital vision:\nQualified and expertise in Security Operations solutions\nUnderstanding of modern methodologies and movements such as: design thinking, agile and lean business models as this is even more important to partners/customers and proposals;\nUnderstanding of current and in future technologies such as: AI such as machine learning, container security etc…;\nUnderstanding of SD-WAN and SASE is a plus.\nExperience in complex digital transformations\nPartners with Sales and other regional/global deal desk to structure highly complex transactions, with multi country deployments.\nTrain the sales teams on our process and tools, designed to make them successful in global engagements.\nWork cross-functionally with internal customers and stakeholders for input.\nInteract and manage sales engagement activities across pricing, deal review, legal/contracts\nWork with stakeholders who manage daily quote approval process, non-standard deal requirements, etc\nWork with channel partners to get quotes for international customer deployments, help standardize quotes\nSustain Field Sales accountability across deal life cycle requirements, help with expeditious deal approval, and assist the sales teams get over any internal hurdles to close the deal.\nDevelop subject matter expertise for the regions on how to execute global deployment effectively and guide sales reps accordingly, develop subject matter expertise for different country regulations and how to best create a consistent view for the end customer\nResponsibilities/Accountabilities\nLead the development of an effective portfolio business plan outlining the strategy for success and maximizing revenues.\nResponsible for ensuring partner/customer satisfaction is maintained at the highest levels.\nDevelop account plans that focus on client relationship development and account growth/retention within install base and net new customers/partners.\nFind and develop profitable new accounts and business opportunities within a channel driven mentality.\nManage and develop a long-term sustainable pipeline of new deals, into both install base and net new partners/customers.\nProvide support to the sales Team on EDR, SIEM, SOAR opportunities\nMaintain close knowledge of the client’s business and Fortinet’s’ service portfolio to ensure alignment of appropriate up selling and cross selling of Fortinet solutions.\nRecord and maintain all relevant information regarding partner/customers and contacts, prospects and suspects in Salesforce.\nEnsure full communication of Fortinet sales & marketing objectives to all partners/customers/accounts.\nDevelop and maintain partner/customer relationships at multiple levels including problem solving and formulation of response to immediate and future partner/customer requirements.\nWorks with third party advisory organizations and attends third party vendor meetings.\nPrepare and deliver sales presentations.\nPrepare partner/customer/ alliance or account planning documents for specific services and solutions.\nMust be motivated, flexible and a self-starter mentality\nHigh level of diligence in translating customer requirements and instructions into quotes\nSFDC/Salesforce.com knowledge would be an advantage\nExperience with Tableau or Clari would be an advantage\nCustomer engagement skills a plus\nExcellent written and verbal communications skills, Knowledge of English is a must\nGoal orientated and self-confident with the ability to work in a fast pace environment\nAble to work independently as well as part of a regional and global team\nAbility to hold peers accountable\nAbility to streamline, grow and manage a successful deal desk function\n#LI-PH1Show more Report"}, {"company": "GlassesUSA", "job": "Influencer Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "", "description": "GlassesUSA.com has been disrupting the traditional eyewear industry, becoming the fastest growing and leading online eyewear retailer in the world with millions of customers. Our cutting edge in-house technologies and data-driven philosophy constantly keep us on the frontline of the global eCommerce B2C industry.\n\n\nAs an Influencer Marketing Manager, you will be responsible for the full life cycle, from initiation to execution of high quality and large-scale partnerships with US-Based Influencers on all social platforms, celebrity activations and cross company projects. Your goal is to deliver creative campaigns at scale that drive traffic, sales, and brand recognition.\n\n\nAn ideal candidate has passion for social media, ecommerce, retail, and fashion, has worked for digital marketing departments of retail brands or content marketing firms, and is experienced with negotiating, executing media campaigns, and optimizing using web analysis and data.\n\n\nWhat You’ll do?\n\n\nResearch, identify, acquire, and maintain new influencer contacts throughout our social media platforms.\nOutreach influencers to expand our network and promote our program while proactively build strong relationships with past, current, and potential influencers.\nAbility to negotiate various pricing models based on data analysis (CPM/Flat/CPC/CPA/Rev Share) and provide strategic insights, set campaign KPIs and ensure they are met.\nExecute technical and operational aspects of campaigns (tracking, assets, follow-up, content review, results analysis).\nOptimize ongoing campaigns incl. analyzing click-stream reports, changes suggestions, etc.\n\n\nRequirements\n\n\n+2 years’ experience in digital department of a global brand.\nPrevious content/PR experience - An advantage.\nPerfect English – spoken and written - A Must\nWell organized & multi-tasking – The ability to self-manage tasks prioritization, weekly and call schedules.\nSales and negotiation skills [In English] are crucial to your success.\nExperience working with one of the following platforms is a plus: AspireIQ, Activate, Impact Radius, and Grin.\nExcellent interpersonal skills and a team player.\n\n\n Role Located in Ramat HaChayal, Tel Aviv, Israel.Show more Report"}, {"company": "PayEm", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "4.8", "link": "", "description": "PayEm is a global procurement and spend management platform that automates finance and procurement processes from request to reconciliation. By reducing friction and tedious tasks for finance and procurement teams, our clients increase productivity, reduce risk and lower operating costs to contribute to business growth. This is an exciting opportunity with a rapidly growing company.\nThe ideal candidate is a creative thinker by heart that is not afraid to work on multiple projects and channels.\nAs a Marketing Designer at PayEm, you will focus on creating disruptive assets that accelerate PayEm’s growth as part of our demand generation efforts. Projects include designing sponsored ads, branded content, social media assets, emails, landing pages, all kinds of online campaigns, branded internal needs, and much more.\nPrimary Responsibilities\nRequirements:\n\n3+ years of experience as a Creative/Marketing/Brand Graphic Designer\nA strong online design portfolio consisting of web-based marketing campaigns and strong graphic principles\nMastery of the Adobe Creative Suite (Photoshop, Illustrator, InDesign, AfterEffects), Figma\nAbility to work effectively under deadlines\nPlan /design projects and build marketing assets that engage our potential users (social media, email marketing, and internal branding)\nEnsure consistency with our brand voice, style, and tone.\nExperience collaborating with multidisciplinary product and marketing teams.\nImaginative, creative, and curious.\nStrong project management skills and the ability to manage multiple projects at once\nWork collaboratively within the marketing team to gather information, understand the end goals and strategize visual communication approaches with the business goals in mind\nAdvantages:\n\nSaaS B2B experience\nWeb / SVG animation experience a plus, using applications such as Adobe After Effect, Lottie positive\nAbout The Role:\n\nDesign and create creative concepts across media: including websites, social ads, email marketing, brand guidelines, etc.\nParticipate in campaign strategy meetings and campaign planning; testing concepts and exploring design and messaging solutions\nBuild upon and grow PayEm’s brand and personality while maintaining our brand style guide for all teams to utilize & reference\nCollaborate with cross-functional teams on project planning, marketing campaigns, sales enablement needs, and digital initiatives from start to finish\nCreate cohesive marketing experiences while developing high-quality assets that power successful campaigns and channel results\nContinuously research new creative campaigns, ad formats, design concepts, and graphic design trends\nIdentify best practices and data-driven insights for creative experimentation\nAct as a champion for high-caliber design throughout PayEm\nExpert knowledge of the creative process and project management\nHighly organized and able to work with a broad team of cross-functional stakeholders\nAbility to manage multiple projects, timelines, and resourcesShow more Report"}, {"company": "Agmatix", "job": "Sales Development Representative", "city": "Ramat Gan", "date": "1d", "rating": "4.0", "link": "", "description": "About Agmatix\nagmatix’s vision is to create best of class sustainable agriculture for the future by making high quality and standardized agronomic data freely available for ag professionals to translate into impact. To do that, agmatix is building a leading digital field trials technology that is revolutionizing data driven agriculture. Our technology disrupts a domain where lack of common language, connectivity and data curation methodologies are significant barriers for improvements. Implementing agmatix solutions will allow agricultural professionals around the world to increase crops yields while reducing environmental damage and improving crop quality over time.\n agmatix is built on a set of 6 core values, we are proud to say we stick to the following:\nCutting Edge- Constant state of mind to improve, grow and learn\nDaring- We strive to change the world with the best solutions, Reshaping the future of agriculture.\nData-Driven- We live and breathe data-driven decisions in everything we do.\nDetermination- We strive to change the world with the best solutions\nRooted- The fabric of our DNA is connected to the principles that matter to our clients, our people, and the planet\nTrustworthy- We are a source of confidence to our clients, our employees, partners, and colleagues\nWhat will you be doing?\nGrow prospect pipeline, generate leads, and identify opportunities.\nPerform daily cold calls and messaging to prospects generated by your research.\nRespond, engage, and qualify inbound leads and inquiries from marketing initiatives.\nPresent product pitches, value proposition, reports, and other valuable data to potential prospects, decision-makers, and influencers in a way that promotes Agmatix’s mission and vision.\nEnsure successful follow-through of the team by maintaining accurate activity and lead qualification information in CRM.\nEnsure the accuracy of management reports by regularly and promptly updating CRM information and pipeline data.\nDevelop and execute a strategic plan to meet monthly, quarterly and annual objectives.\nDevelop and implement comprehensive sales and business development strategies, processes, and best practices across the company.\nAbout you\nHas exceptional communication skills, both verbal and written.\nHas excellent listening skills and a positive and energetic presence.\nDemonstrates ability to explain complex issues clearly.\nYou are a Quick learner with an interest in technology and data solutions.\nYou are fearless - Hop on the phone/Zoom or whatever needed, with new people every single day to explain our value proposition as it relates to each individual you speak with.\nYou must be self-motivated, persistent, able to work independently and eager to learn.\nOwn highly analytical skills: hands-on experience in analyzing data, able to present high-level information from multiple data sources and tactical info.\nYou are a true team player.\nMust have written and spoken English at native level\nHas a desire to work in a fast-changing environment.\nNice to have\n1-2 years of successful experience as a SDR/BDR role.\nExperience working in SaaS B2B companies\nPrior experience with SDR tools (e.g., CRM, Zoominfo, LinkedIn, etc.)\nBachelor or equivalent degree in agronomy, economics, or in a technology-related field is an advantage.Show more Report"}, {"company": "Anyword", "job": "Customer Success Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": "Anyword is an AI text generation platform for marketers.\nMore than 1 billion marketing messages are created every day across digital channels. Most of them are bias-laden, expensive to create, and ineffective.\nAnyword’s artificial intelligence models are capable of analyzing text and understanding its intent and ideal audience. As a result, we can now generate original marketing language that drives action.\nWho we are\nWe’re a team of doers from all walks of life who share a passion for AI and innovation.\nWe firmly believe in personal growth, care deeply about our work, and aspire to be world-class in everything we do.\nThe opportunity\nWe’ve been fortunate to enjoy rapid growth and adoption by thousands of customers, and actually, we’re just getting started. As a Customer Success Manager, you will join a small team that moves fast.\nTogether with the team, you’ll be responsible for some of the most strategic initiatives at the company, provide top-notch service to our customers, and support the rollout of new products to the market.\nYou’ll be expected to execute fast but, more importantly, to solve problems and find long-term solutions that can be implemented as new processes, products, or features. You will also significantly shape the company’s future by creating value for our existing and new customers. And finally, you’ll join us at an exciting and challenging time of fast growth, with ample opportunities to learn and grow with us.\nResponsibilities (or what you’ll be doing):\nHelp customers succeed and provide support on all levels: technical, business, and product\nDeliver excellent support to customers, understand their needs, and ensure their success\nServe as the main point of contact while acting as a liaison between clients and the rest of the Anyword team\nProvide customer training\nMaintain a comprehensive and updated knowledge base\nIdentify customers with growth potential\nWork together with the marketing and product teams to push top customers toward success and high product engagement\nEducate new customers through marketing materials and product documentation\nProvide internal customer feedback\nIntroduce customers to new features\nLeverage data\nAnalyze customer usage data, gather insights and lessons, and establish new processes and product requirements\nRequirements:\n\nQualifications (or what we’re looking for):\nBA/BS degree\n1- 2 years in a SAAS company in a customer-facing role - a must\nExperience with Zendesk - an advantage\nExcellent verbal and written English communication skills\nStrong Excel skills (pivot tables, basic formulas, vlookup)\nAnalytical problem-solving skills\nAbility to quickly execute solutions resourcefully and independently\nHigh level of dedication and determination to succeed\nBasic experience with SQL querying - an advantage\nOutstanding capacity for multitasking\nExperience with Marketo (or equivalent) - an advantage\nPrevious data analysis experience - an advantageShow more Report"}, {"company": "ASM Global", "job": "Business Development Manager", "city": "Central", "date": "15d", "rating": "3.6", "link": "", "description": ""}, {"company": "Castor", "job": "VP Sales", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": ""}, {"company": "Landa", "job": "Content Manager", "city": "Rehovot", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=323&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22b80929&cb=1676381542956&jobListingId=1007956619179&jrtk=3-1-1gp820mejih5h801-1go9hps12gsqj800-95eac03c6cc0c23c-", "description": "DESCRIPTION\nLanda seeks a passionate Content Manager to join our Marketing team.\nIn this role, you will be responsible for writing and editing materials while working in tight collaboration with the sales teams, customers, and other stakeholders globally.\nRESPONSIBILITIES\nIntroduce an approachable, engaging tone that will help shape Landa’s technology brand.\nPlan and manage a content roadmap; support communications, public relations, demand generation, and social media activities.\nWork closely with subject matter experts and the product, sales and marketing teams to drive the development of a wide range of content, including blog posts, ebooks, research-based reports, newsletters, webinars, infographics, videos, case studies, white papers and more.\nREQUIREMENTS\nRelevant bachelor's degree, master's degree - an advantage.4+ years of relevant experience in technology marketing, as part of a global organizationExcellent storytelling skills in English (Hebrew – advantage)Proven experience developing various content to support relevant stakeholdersPrint industry background - an advantageProduct development, media or journalism experience (an advantage)\nATTRIBUTES\nAn innovative approach to content creation across a variety of media and channels\nAbility to work in a fast-paced environment with agility\nSelf-reliant with a strong sense of responsibility\nAbility to work independently\nA strong and high performing team member\nA critical thinker\nResourceful and creativeShow more Report"}, {"company": "HiredScore", "job": "Customer Success Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "HiredScore brings deeply integrated big data and AI solutions to the global Fortune 500. By leveraging data from companies' Human Resources data ecosystem, HiredScore automates and augments the hiring process, enriching recruiters' decisions with smart insights and candidate prioritization grades of A, B, C, or D using deep technology innovations in artificial intelligence and algorithms.\nHiredScore's Artificial Intelligence engine uses past company hiring data, global hiring data, and other data sources including labor market data, employee performance data, and CRM data, to revolutionize the end-to-end recruiting workflow as well as integrate seamlessly with other HR Systems such as chatbots, assessment tests, video interviews, and other automation tools.\nWe’re looking for a highly driven, results-oriented Customer Success Manager to join our growing Customer Success Team in Israel. Our Customer Success Team is the face of HiredScore to our customers and they reflect the “voice of the customer” internally to all cross-functional teams within the organization. They interact directly with our largest clients and stakeholders, facilitate product training for end-users, drive user engagement and adoption, and work with our Product, Marketing, Data Science, Engineering, and Delivery and Revenue teams to identify opportunities for innovation and bring to market new products and capabilities that deliver even more value for our clients. Our CS Team is tasked with ensuring our product remains the best in the industry and that its value and business impact are accurately reflected.\nRoles & Responsibilities:\n\nDevelop, maintain, and own relationships with existing clients to ensure success, satisfaction, and long-term retention.\nWork cross-functionally with Delivery, Product, Data Science, BI, and Engineering Teams + Customer Success Managers to identify opportunities and communicate insights and feedback from our customers to the rest of the company.\nDefine user engagement strategy and execution for your clients in order to grow customers’ adoption of our solution and continuous improvement of customer experience.\nOwn user onboarding, training, and feedback. Own coordination of feedback to drive product enhancements with both internal and external client stakeholders.\nUnderstand client KPIs and goals for product utilization and collaborate with clients to achieve these goals.\n\nWhat You Need:\n\n3+ years of work experience in a B2B SaaS Customer Success, Account Management, or technical account management role supporting enterprise customers.\nMust be fluent in English and able to work with high-level stakeholders in English.\nPassion for and ability to work in a fast-paced, highly entrepreneurial environment with multiple, concurrent priorities.\nExceptional collaboration and communication skills, and the ability to balance customer priorities while maintaining strong cross-functional relationships internally.\nResults-oriented with a strong track record for success in delivering business objectives with the ability to self-manage and execute projects from scratch.\nExcellent presentation and project management skills, ability to deliver impactful business reviews\nExcellent interpersonal skills with exceptional communication skills across all platforms\nExperience in end-user training: 1-on-1s and group training sessions\nStrong analytical experience working with business intelligence and data platforms for customer analysis.\nWillingness to work flexible hours, as needed, with a global team and customer base - later evenings are needed a few times a week to accommodate global clients.\nAdvantages:\n\nProficiency in additional languages\nExperience working with Fortune 500 and global enterprise accounts\nExperience in HR-TechShow more Report"}, {"company": "MatchMe solutions", "job": "Online Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=325&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1b7aa226&cb=1676381545285&jobListingId=1008358028183&jrtk=3-1-1gp820onnp6dn801-1go9hps12gsqj800-a6425893d2f3316e-", "description": "A leading, fast-growing online sales medical company is looking for a talented and creative online marketing team player to head the company's online and social marketing operations. To focus mainly on implementing the company's brand awareness across multiple platforms: online store, corporate website, social pages, email marketing, landing pages, and other marketing collateral, Both for organic and sponsored advertising throughout the net such as Google, LinkedIn, Facebook & Instagram. Job Responsibilities: - Building a strategy and actual implementation of sponsored campaigns on Google and social media. - Responsibility for email marketing and content creation on an ongoing basis.\n\n\nManaging the content and products on the company's websites, regularly uploading new information about new products and developments. - Organizing new leads that come through online marketing activities. Job Requirements: - At least three years of experience in a similar position in a company that works with the international market. - Demonstrated success in a product marketing role.\nExperience and familiarity with website and commerce platforms such as WordPress, Shopify, Joomla, etc. - Excellent written and verbal communication skills in English and Hebrew. - Ability to translate complex concepts into simple, clear and intuitive language. - Strong project management abilities to plan and execute marketing campaigns.\nAdvantage: Skilled in Photoshop, Indesign, Illustrator.\n\nShow more Report"}, {"company": "Ribbon Communications", "job": "Project Manager", "city": "Petah Tikva", "date": "30d+", "rating": "3.9", "link": "", "description": ""}, {"company": "TangoMe", "job": "VIP Account Manager (MENA)", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=327&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f9bba16d&cb=1676381548113&jobListingId=1008444254003&jrtk=3-1-1gp820rg5jc9s801-1go9hps12gsqj800-6de1be0da7c3b1b6-", "description": "DESCRIPTION\nTango is a successful, market leader, a live-streaming Platform with 450+ Million registered users, in an industry projected to reach $240 BILLION in the next couple of years.\nThe B2C platform, based on the best-quality global video technology, allows millions of talented people around the world to create their own live content, engage with their fans and monetize their talents.\nTango live stream was founded in 2018 and is powered by 350+ global employees operating in a culture of growth, learning, and success!\nThe Tango team is a vigorous cocktail of hard workers, creative brains, energizers, geeks, overachievers, athletes, and more. We push the limits to bring our app from “one of the top” to “the leader”.\nThe best way to describe Tango's work style is not to use the word “impossible”. And we believe that success is a thorny path that runs on sleepless nights, corporate parties, tough releases, and of course our users' smiles (and as we are a LIVE app, we truly get to see our users all around the world smiling right in front of us in real-time!).\nDo you want to join the party?\nRESPONSIBILITIES\nManage on a daily basis close relationships and support with our VIP users\nKeep track and monitor the VIP users activity on a daily basis including sales and up-sale promotions\nBuild personal relationships and create a personalized experience for them\nTrack and monitor the VIP players activity on a daily basis\nProvide customer care through various channels and handles\nGather feedback and propose improvements to customer experience\nCross-teamwork with all aspects of marketing, monetization, features, and products\nBuild and deliver ongoing content, promotions, and activities – where the KPI is to bring players to their next level\nREQUIREMENTS\nVIP ACCOUNT Previous experience in B2C gaming, e-commerce, and Live Streaming Industry\nPrevious position in sales or customer support roles\nStrong communicator, customer-centric, proactive, and target driven\nEnglish and Arabic (professional or native) - MUST!\nNice to have:\nPassion for social apps\nKnowledge of additional languages (Indian, Turkish) is an advantage. Ability to travel in the MENA.\nPrior experience with support tools (Zendesk, Intercom, etc)Show more Report"}, {"company": "", "job": "We Are looking for a B2B Account Manager that will be responsible for the following", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=328&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f051a54&cb=1676381549383&jobListingId=1008421959602&jrtk=3-1-1gp820sofkhqv801-1go9hps12gsqj800-5a2095fac8a26517-", "description": "Groove is an established but dynamic company, growing and hiring employees for our groundbreaking, game-changing technology for the online world. This is a great opportunity to develop your skills and grow professionally. * Develop business relationships with company clients/ customers/ providers * Present new opportunities and solutions based on customer feedback and needs * Contribute to the company’s ongoing development in various functions including product development, marketing, operations, support, partnerships, and more * Handle customer complaints, find solutions to their issues, and maintain a positive relationship between both parties for future business ventures. * Build a strong communicator to manage their accounts properly.\n\n\nBe knowledgeable about their company’s products and services to provide customers with the most effective solutions. * Identify and pursue opportunities, prioritize accounts, handle objections, and evaluate campaign effectiveness. * Communicating with clients to ensure that all their needs are understood and addressed * Building strong client relationships to maintain old business and acquire new customers * Collaborating with various internal departments to ensure that they fulfill all customer requests The role requires you to be a creative, self-starter, and with a “can-do” approach. Additional requirement: * Previous experience (In the gaming industry is a bonus) * Strong interpersonal and communication skills * Fluent in English - a must * Working with multiple platforms * Strong organization and time management skills * You must have the ability to multitask while remaining detail-oriented * You are a self-motivated, proactive individual with the ability to manage a large, diverse workload * Positive attitude.\n\nWilling to do what it takes to move the business forward Scope Full-time position @ Ashkelon office. Benefits We offer a friendly work environment, and the chance to work with industry experts and with cutting-edge technologies, building state-of-the-art systems and more. If you love challenges and are thrilled by innovation, we will be happy to welcome you to our growing Groove family. ***Please send cv's in english only***Show more Report"}, {"company": "WalkMe", "job": "Director of Product Marketing", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=329&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8a6fc999&cb=1676381551212&jobListingId=1008403035062&jrtk=3-1-1gp820uhvkbmr801-1go9hps12gsqj800-7da38b22d0ddd95c-", "description": "WalkMe (NASDAQ: WKME) is growing and we want you to join us! Have you ever wanted to work with an industry leader? Well, how about an industry creator?! At WalkMe, we’re not just the leader in digital adoption, we started the digital adoption revolution - enabling organizations to measure, drive, and act to ultimately maximize the impact of their digital transformation and accelerate the return on their software investment. And with over 2,000 clients, including more than a third of Fortune 500 companies, working with us on a daily basis, we’re changing how enterprises interact with their technology.\nSo, if you’re an expert in your field, and looking for an opportunity to work, collaborate, and innovate with some of the most talented people out there, WalkMe is the place for you!\nWe are hiring a Director of Product Marketing to lead and own the product messaging and positioning for the WalkMe Platform. This role will work cross-functionally between Product Management, Marketing, and Sales and will lead a team of product marketers to ensure that we effectively communicate the current and future value of WalkMe’s industry leading Digital Adoption Platform.\n\nWhat will you actually be doing?\nLead a team of product marketers, owning positioning and messaging for the product.\nWork closely with the product management and R&D teams to shape the product roadmap and go-to-market strategy.\nEvangelize the Digital Adoption Platform (DAP) category and product vision in speaking opportunities and conferences and in briefings with prospects, customers, partners, media and industry analysts.\nOwn and manage platform product releases, including product launches and all collateral to support internal education and customer adoption.\nResearch and understand our buyer personas to ensure your product is designed and delivered to create value for them.\nTranslate product functionality and technical details into user benefit and value.\nMeet with customers and drive activities to increase adoption.\nConduct ongoing competitive analysis along with market and customer research.\n\n\nWhat should you bring to the table?\nBachelor's degree required\n7-10 years of experience in a similar product related position at a B2B SaaS company\nExperience managing a team\nPast experience in working closely with executive teams from Product Management, R&D, sales, and marketing\nAbility to work self sufficiently, and excel in a high-paced, always changing environment\nExcellent English written and verbal communication skills no matter the audience or context\n\n\nWhy should you work for WalkMe?\nWe’re ranked by Dun & Bradstreet as one of the TOP 20 software companies to work for in Israel.\nWe were recognized by Deloitte as the 6th fastest growing software company in the world.\nWe’re publicly traded on the Nasdaq stock exchange.\nWe provide you with the latest cutting edge tech to power your work while developing and advancing your career\nWe manage at eye-level, giving you the chance to work with anyone at the company. Want to pitch an idea to one of WalkMe’s founders or work on a project with our CEO? You’ve come to the right place.\nWe recognize that you have a life outside the office. Whether it’s picking up the kids or taking some time off for yourself, we make sure you keep your work-life balance.\n\n\nAs one of the world’s leading SaaS companies, WalkMe enables you to partner with some of the most creative, innovative, and dedicated people in the business. And when we’re not hard at work powering digital adoption, you’ll find us relaxing with a cup of coffee.\n\nAnd that’s just the beginning! We could go on and on, but it would probably be easier to just apply and find out more.\nLearn more about Digital Adoption Platform (DAP)\nTake a look at our company culture\nCheck out the latest WalkMe updatesShow more Report"}, {"company": "Deloitte", "job": "Data Product Manager", "city": "Tel Aviv-Yafo", "date": "11d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=330&ao=1136043&s=58&guid=00000186131cefd3809593b8b7c9ff52&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_94e7da4a&cb=1676381553920&jobListingId=1008421958414&jrtk=3-1-1gp82115ujrp9801-1go9hps12gsqj800-b9f56e11a783a3d9-", "description": "Description\n\nDeloitte Analytics is part of Deloitte Israel consulting practice, and we are looking for a Data Product Manager to join our team.\n\nAs a Data Product Manager, you'll focus on finding ways to leverage data flow throughout an entire product lifecycle, and how to use that data to build and perfect a feature or product.\n\nWhat you Will do:\n\nDefine the business as well as technical requirements for new products and features; write clear and concise product specs, features cards, and other product documentation.\nGuide and work closely with engineering teams throughout the end-to-end development process.\nTranslate requirements of large data initiatives into smaller actionable items.\nEnsure product meets the specified requirements and create success metrics.\nPerform A/B testing, set OKRs and KPIs, track usage to identify opportunities for improvement.\nCommunicate product value to internal and external customers.\nWork with Data Engineering, BI Developers, and cross-functional Product teams to maximize the impact of data use on the project's KPIs.\nLead discovery work around MVP for any new data tools.\nRequirements\nBachelor's degree in a relevant field\n2-4 years of experience as a DATA Product Manager or DATA Product owner\nExperience in DATA analytics\nPassion for solving complex technical issues and understand how great products work behind the scenes\nAbility to drive collaboration across multiple disciplines – data, marketing, operations, and sales.\nA strong understanding of all aspects of DATA product development lifecycle\nFluent English\nExperience working with UX/UI – big advantage\n\nFull time Job\n\nLocation: Tel Aviv, Hybrid\nWe at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.Show more Report"}]