[{"company": "Investing", "job": "Junior Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "Investing.com, the leading global financial news & data platform, is on the lookout for a Junior Marketing Analyst to join our team and create, analyze, and optimize large-scale campaigns.\nWhat you’ll be doing:\nHands-on campaign management on various ad networks and platforms\nBuild and maintain strategic relationships with key acquisition partners\nCollaborate with different teams members within the marketing department to deliver and execute successful mobile marketing campaigns\nProvide complete performance reporting and analysis on all device marketing campaigns and take relevant action on insights gained.\nEstablish, implement and measure the effectiveness of acquisition initiatives\nWhat you’ll bring:\nUniversity Graduate - Industrial Engineering or Business Management/Economics\nStrong analytical skills\nAbility to work in a fast-paced environment\nSQL capabilities\nProficiency with Excel\nAbility to manipulate and analyze large quantities of data and present it in reports\nHigh attention to detail and proven ability to manage multiple, competing for priorities simultaneously\nStrong organizational, analytical, presentation, and problem-solving skills\nFluent English - verbal and written\nSelf-motivated and meticulous, with a creative and resourceful mind, bright, proactive, works well independently and as part of a team\nWho we are:\nInvesting.com was founded in 2007 and now has over 350 employees across the world.\nWith 60 million monthly unique visitors, 4 billion page views, over 500 million sessions, and over 300,000 financial instruments covered, Investing.com is one of the top two global financial websites.\nInvesting.com offers unlimited access to cutting-edge financial market tools such as real-time quotes and charts, customized portfolios, personal live alerts, calendars, calculators, and financial insights, completely free of charge. In addition to the global stock markets, Investing.com also covers world indices, ETFs, commodities, bonds & interest rates, cryptocurrencies, futures, and options“. Investing.com strives to be a one-stop-shop for traders and investors with apps available.\nWhat we offer:\nA chance to join one of the leading financial markets platforms worldwide\nChallenging assignments in a local and international environment\nEnjoy excellent benefits and a high-energy working environment\nAs with all investing.com positions - we're looking for someone who is self-motivated and meticulous, with a creative and resourceful mind, bright, proactive, and works well independently and as part of a team.\nCheck out openings on our brand new career website: https://www.investing-careers.com/\nOur Privacy Policy: Your resume and information will be kept confidential\n\nEmployment Type:\n\nEmployeeShow more Report"}, {"company": "Agmatix", "job": "Marketing Manager", "city": "Ramat Gan", "date": "1d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fd18a877&cb=1676381415144&jobListingId=1008443326714&jrtk=3-1-1gp81spl0p6dd801-1go9ho02sjigg800-ee3cda846bbfc25f-", "description": "About Agmatix\nagmatix’s vision is to create best of class sustainable agriculture for the future by making high quality and standardized agronomic data freely available for ag professionals to translate into impact. To do that, agmatix is building a leading digital field trials technology that is revolutionizing data driven agriculture. Our technology disrupts a domain where lack of common language, connectivity and data curation methodologies are significant barriers for improvements. Implementing agmatix solutions will allow agricultural professionals around the world to increase crops yields while reducing environmental damage and improving crop quality over time.\nagmatix is built on a set of 6 core values, we are proud to say we stick to the following:\nCutting Edge- Constant state of mind to improve, grow and learn\nDaring- We strive to change the world with the best solutions, Reshaping the future of agriculture.\nData-Driven- We live and breathe data-driven decisions in everything we do.\nDetermination- We strive to change the world with the best solutions\nRooted- The fabric of our DNA is connected to the principles that matter to our clients, our people, and the planet\nTrustworthy- We are a source of confidence to our clients, our employees, partners, and colleagues\nAbout the Role\nDo you want to help us take our product marketing to the next level? Do you want to bring an innovative, data-driven approach to demand generation techniques, digital strategies, and field marketing? Do you want to elevate our brand and gain market share? If so, then we're looking for you!\nWe're looking for a Marketing Manager who will report directly to the VP of Marketing. As a Marketing Manager at agmatix, you'll be part of an exciting team that works together to drive our business forward. We encourage creativity and innovation—and we appreciate hard work!\nWe are looking for someone with experience in marketing with a focus on product marketing and sales enablement.\nYou will develop and oversee all things related to our products and coordinate with external agencies in a variety of areas such as website, digital marketing, social media, etc.\nThe ideal candidate will have worked in a SaaS company focusing on B2B enterprise customers and have experience with supporting several products/solutions.\nWhat You will do?You will work cross-functionally with the sales, product, and agronomy teams to align messaging to better position our solutions to our target personas and impact the success of inbound and outbound marketing.You will create content to educate internal and external stakeholders on product features and benefits.You will support the Sales team by preparing custom-made product marketing materials for the different segments and pipeline life cycle needs. This includes email templates, PPTs, RPF templates, etc.You will create content for assets such as blogs, power points, solution briefs, white papers, email newsletters, and website copy in coordination with our internal experts and external agency vendors. You will need a strong ability to take a concept or idea and turn it into reality.You will define, analyze, and optimize the metrics of success for paid media campaigns based on the performance of account KPIs, data-driven reporting, and managing budgetary goals. Work with your manager to bring the most effective ads to market.You will manage campaigns for mobile app advertising in key media outlets and paid channels for our market segments.You will identify key events and execute logistics and planning related to personnel, budget, and projected ROI for lead generation and brand awareness goals.You will work closely with agency partners to monitor website traffic, revise content, and optimize SEO.You will partner with a PR agency on industry-related topics and key initiatives.\nAbout YouYou are seasoned professional and have an experience in B2B marketing, ideally in a high-growth startup company.You gain strong mobile app marketing experience.You have a SaaS industry experience, with an understanding of the evolving digital marketing landscape and specific needs to market software solutions.You have strong proficiency in Google Analytics, Google Ads, and LinkedIn Ads.You gain proven record of successful budget management and management of advertising channels to meet target KPIs thresholds necessary for the business’ success.You are highly data-driven marketer with a proven track record of delivering initiatives that help achieve overall company goals.Ability to deep dive and learn new domains, technology fields, products, and solutions.You have an exceptional communication skills, both verbal and written.Have the ability to multitask, change priorities rapidly and work under pressure.You gain an experience in agency relationships and management.You are a self-starter with strong project management skills is a must.If you have agriculture or food industry experience it is preferred.Proficient in PowerPoint, WordPress, Canva, Figma, Monday, Slack, and other tools.Show more Report"}, {"company": "Imagen", "job": "Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Imagen is developing a disruptive technology for the professional photo editing market. We use edited photos from each of our users, to create personalized AI profiles and to reduce and eliminate editing efforts. Creating a personalized profile based on user data gives great value to our users and creates many challenges.With a very strong market validation, a crazy month-over-month growth, and a top-tier VC backing us, we’re looking for the first team members to join our team. It’s an opportunity to be part of something huge and be a leader in a fast-growing company.What will you do:Lead the marketing data activities in the companyAnalysis and decision-making based on data insightsVisualize data with dashboards to address key questions for the company’s in-house teams like Marketing, Growth, Product, and moreDesign and execute BI ETL flowsRequirements:BA / BSc in Industrial Engineering and Management / Information Systems / Engineering / Economics / Statistics / Mathematics / similar background.3+ years of experience as a Data Analyst / BI Analyst / similar positions2+ years of experience with B2C data-driven productsStrong SQL experience querying large, complex data setsExperience in building BI visualizations and dashboards (Tableau – an advantage)Knowledge of Python for data prep and analysis – an advantageJob Type: Full-timeShow more Report"}, {"company": "SuperCom", "job": "VP Sales & Marketing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "", "description": "DESCRIPTION\nSuperCom is seeking an experienced leader to join our executive team as VP Sales & Marketing. We are looking for someone who can thrive in a results and performance-based culture and brings an exceptional combination of strategic understanding, drive, persistence, and execution. You will report to the CEO and lead the company’s sales and marketing department across all global regions and our 3 business units– IoT, Cyber and eGov.\nAs part of this role, you will develop the company’s worldwide sales and marketing strategy, forecast sales volumes and oversee the department’s day-to-day activities.\nResponsibilities:\nLead our global sales and marketing teams with set annual quotas and goals.\nDesign and oversee marketing campaigns, including production of marketing collateral and messaging content.\nInfluence, collaborate and work with cross-functional leaders, departments, and teams to develop and execute successful strategies.\nMonitor customer, market and competitor activity and provide feedback to company leadership team and other company functions.\nCoach, grow and develop employees on a regular basis to build a dynamic sales and marketing organization.\n\nREQUIREMENTS\nAt least 15 years of sales experience with complex tech solutions and products.5 years of experience managing a sales and marketing team.5 years of experience in government sales to customers in North America and Europe.5 years of experience in direct sales with a personal quota.Proven experience leading a company’s sales and marketing organization in a global setting with focus on North America and Europe.Experience with B2G sales relying heavily on public procurement processes.Experience in selling both directly and through partners (system integrators, channel partners, agents etc.).Successful experience building a go-to-market strategy and corporate sales plan.Proven success driving consistent revenue growth year-over-year.Experience with solutions consisting of both hardware and software - an advantage.Experience with public safety solutions - an advantage.Experience with cyber security products – an advantage.Great problem-solving skills.Excellent verbal and written communication skills in English.Flexible in a dynamic environment.Show more Report"}, {"company": "Elementor", "job": "Product Marketing Manager", "city": "Ramat Gan", "date": "7d", "rating": "4.2", "link": "", "description": "Elementor is the leading website creation platform WordPress, empowering professionals and aspiring creators to create incredible websites.\nThe Product Marketing team at Elementor sits at a strategic intersection, connecting the product, the users, and the market.\nWe're looking for an enthusiastic and motivated individual who understands the power of exceptional product marketing.\nAs a Product Marketing Manager, you'll become an expert on our product, customers, the market, and the competitive landscape.\nYou'll shape our go-to-market strategy and the future of our product by working cross-functionally with our leadership, marketing, and product teams.\nRequirements:\n\nYou'll thrive as a Product Marketing Manager at Elementor if you:\nHave 3+ years of experience as a product marketing manager\nAre a storyteller with innovative and creative skills, and a strong team player\nHave a track record in crafting positioning, user segmentation, and packaging new and existing products in the market\nHave experience creating high-end marketing collateral across multiple channels\nHave experience creating high-detail wireframes and mockups for web pages, emails, product screens, etc\nPossess a high degree of design aesthetics, and can guide other stakeholders toward the best results\nHave strong proven analytical skills, are data-driven, and are familiar with A/B testing\nAble to operate independently across a set of cross-functional partners\nHave a background in SaaS, B2C, and or design software industry. Experience with targeting SMBs/mid-market is a plus.\nExcellent verbal and written communication skills in English.\nWork Environment:\n\nWhat do we do?\nElementor is the leading website building platform for WordPress professionals.\nOur vision is to empower web creators - developers, designers, and marketers, with the ability to create their futures one pixel at a time. We provide our users with everything they need to become successful web creators.\nA new website is created every 10 seconds using Elementor!\nSince we launched in Israel in 2016, we have expanded to more than 150 countries, with more than 12M websites powered by Elementor. More than 8% of all websites around the world are built using Elementor!\nHow do we do it?\nAt Elementor, we're building the future of web creation.\nWe believe in empowering both our employees and our users.\nElementor is a place where you can truly grow professionally and personally.\nCreativity, friendship, curiosity, motivation, and professionalism are the driving force behind our journey. We take great pride in Elementor's constant scaling.\nResponsibilities:\n\nPartner with our product team to develop, implement and execute a world-class product go-to-market and launch strategy\nDevelop and communicate Elementor’s value proposition through marketing materials, web pages, emails, product screens, and more, to drive feature adoption, success, and retention\nDevelop an expert understanding of Elementor’s products, use cases, and the markets in which we compete to drive unique market positioning, messaging & adoption strategies.\nConduct customer interviews/market research and redefine our view of the competitive landscape to influence decisions regarding the roadmap and go-to-market strategy\nWork cross-functionally with sales and growth teams to meet revenue and customer goalsShow more Report"}, {"company": "Cyesec", "job": "Marketing Operations Specialist", "city": "Herzliya", "date": "22d", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8d5dbbe6&cb=1676381422179&jobListingId=1008399617802&jrtk=3-1-1gp81t0grp6dd801-1go9ho02sjigg800-10b119e6f6dbacd1-", "description": "CYE is building a data-driven cybersecurity optimization SaaS platform that allows organizations to continuously improve their cyber resilience. Using our platform, organizations can assess, quantify, and mitigate their cyber risk.\nAt CYE, we understand that the best results are achieved by combining the power of AI with human expertise. That’s why we’ve built a world-class team of cybersecurity experts that augment the power of our platform.\nWe are looking for an enthusiastic, motivated, and passionate Marketing Operations Specialist to join our growing marketing team.\nResponsibilities\nBe responsible for all aspects of our marketing CRM.\nManage end-to-end automated marketing campaigns: from ideation, through set up, segmentation, monitoring & QA, and analysis & optimization.\nBuild a cross-channel experience with several touchpoints, such as emails and social, to create automated, triggered, and transactional programs.\nMonitor and analyze ongoing campaigns and end results to deliver recommendations based on insights and troubleshoot when necessary.\nPush operations and automation at CYE to the limit: explore best practices, become the MarTech SME, own your role.\nManage all data syncs between sales and marketing systems (mainly Hubspot<>Salesforce)\nMonitor and ensure first- (e.g. website, landing pages) and third-party (e.g. directories) content is accurate and up to date (e.g. take down broken links, update company information, etc.)\nOptimize the company website for search engines based on keyword research and market insights.\nBuild reports and dashboards to reflect website traffic and conversions and generate insights to improve the visitors’ experience.\nFrequently experiment: execute A/B tests on email concepts, subject lines, content, CTAs, sending times, layouts, and more.\nQualifications\n2-3 years' experience in a similar role, working for a global company – B2B experience is preferred.\nHands-on experience with marketing automation platforms (preferably HubSpot and SalesForce).\nStrong business and analytical skills to translate business objectives to MarTech.\nUnderstanding of digital marketing, including paid media, email marketing and conversion rate optimization.\nIndependent self-starter with demonstrated ability to communicate and influence internal stakeholders.\nAbility to manage multiple tasks simultaneously, shift gears, and prioritize to meet schedules.\nOrganized and detail oriented.\nService oriented.\nExcellent project management skills.\nBasic knowledge of HTML – advantage.\nEnglish – excellent spoken and written; additional languages – advantage.\nAbout us\nCYE offers a SaaS cybersecurity optimization platform that combines technology with red team activity to deliver the most comprehensive and contextual organizational security assessments. By quantifying security data, CYE delivers business insights that help businesses make the right decisions about cybersecurity.Show more Report"}, {"company": "K2view", "job": "Marketing designer", "city": "Hod HaSharon", "date": "2d", "rating": "4.1", "link": "", "description": "We are looking a Marketing designer with outstanding conceptual and visual design skills to join our growing marketing team.\nThe ideal candidate is a creative thinker, has strong UI/UX skills, is organized with a good eye for details, and can contribute and develop in a fast-paced, well-funded startup.\nResponsibilities\nDevelop visual concepts for social media and campaigns that convert\nDesign, create and maintain engaging and brand-consistent marketing assets: ebooks, customer-facing PowerPoint presentations\nExecute creative designs and upkeep of our website - design page layouts, ensuring they are pixel-perfect, inspiring, and user-friendly\nDesign and maintain converting landing pages\nA/B testing and live results focus on user experience\nWork closely with your colleagues in the marketing, product, and sales teams\nMaintain and evolve graphic and brand standards for K2View\n\nRequirements:\n\nWe’d love to hear from you if you have:\n2-4 years experience working in a professional design environment, software or technology company.\nExcellent level of Adobe Suit: Photoshop, Illustrator, Indesign, Adobe XD, Microsoft (PPT)\nStrong visual design skills, including an eye for good typography, composition, and use of color and images\nAbility to adapt easily to changes and meet deadlines in a fast-paced environment\nCreative team player that enjoys brainstorming and working in a team\nHigh level of English (written and spoken)\nSelf-learner, keeping up with design trends, and motivated self-starter\nUX design experience for web and mobile\nPortfolio of completed design projects\nAdvantage:\nExperience with video editing, animation, and motion design.\nExperience in HubSpotShow more Report"}, {"company": "אנטריפוינט", "job": "VP of Marketing", "city": "Tel Aviv-Yafo", "date": "7d", "rating": "3.0", "link": "", "description": "VP of marketing needed For a company that manage safety management system Responsibilities Analyzing existing branding and marketing strategies and improving upon them. Leading a capable marketing team and delegating tasks fairly. Preparing and reviewing monthly, quarterly, and yearly budgets, and allocating resources appropriately. Reporting to the company CEO.\n\nConducting market research and implementing new strategies based on findings. Monitoring industry trends and scheduling meetings to share new information with the team. Setting daily, weekly, monthly and yearly targets, and implementing various incentives to ensure they are achieved. Closely monitoring competitors’ successes and failures and learning from them.\n\nSupervising marketing events and launches and using these spaces to network with industry professionals. Assisting with the recruitment, training, and onboarding of new staff. VP of Marketing Requirements: BSc in marketing, branding, business, PR, or a similar field. Master’s degree may be preferable.\n\nExtensive experience in a similar role. Superb marketing and research skills. Knowledge and practical experience with SEO, digital marketing tools, and related software. Highly observant and analytical.\n\nStrong leadership skills and the ability to make difficult decisions. Excellent communication and interpersonal abilities. Willingness to travel and work long hoursShow more Report"}, {"company": "Tenengroup Ltd.", "job": "Influencer Marketing Coordinator", "city": "Tel Aviv-Yafo", "date": "15d", "rating": "3.6", "link": "", "description": "The Influencer Marketing Coordinator, will be responsible for leading the Company’s influencer outreach & brand ambassador strategy.\nThe influencer Marketing will support monthly marketing campaigns and drive brand awareness.\nThis is a full time position in our Tel Aviv Area offices.\nPlease provide the link to your Instagram page.\nRequirements:\n\nBachelor’s degree or certificate in Marketing/Communications, or related field\n1-2 years digital influencer experience - preferred\nMarketing orientation: understanding of customer psychological behavior and User Experience logic\nAffinity to jewelry and fashion\nOnline shopping addict\nGood visual eye\nStrong analytical capabilities- The ability to turn data into insights\nExcellent time management and project prioritization skill\nExcellent communication skills\nWorks well under pressure\nDetail oriented / accurate\nFast learning ability\nA passion for social media & the beauty industry and knowledge of beauty content creators across all social platforms\nStrong organization skills and a demonstrated ability to execute projects on time & work collaboratively in a fast-paced team environment\nExcellent written & verbal communication skills\nResponsibilities:\n\nIdentify, acquire and maintain new influencer contacts to join internal brand relations program thought social media platforms including Instagram, Pinterest, Facebook, Twitter and YouTube\nAssist Social Media Manager with execution of strategic plan to grow brand awareness/advocacy & drive incremental exposure for our key products while bringing brand DNA to life.\nCultivate and develop consistent and ongoing relationships with new and current influencers via off channel social moderation.\nSpearhead the entire influencer campaign management process from contract negotiation to creative briefs through live integration and technical tasks\nOversee and evolve the Company’s brand ambassador program to amplify the key messaging and story lines of the Company.\nDevelop the Influencer Marketing Annual Plan and cultivate new ideas and campaign concepts that can integrate the brand and its product lines in innovative ways.\nDivision:\n\nLine Of BusinessShow more Report"}, {"company": "Eybna Technologies", "job": "Marketing Specialist", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c031f7a9&cb=1676381429961&jobListingId=1008156930151&jrtk=3-1-1gp81t845khq4801-1go9ho02sjigg800-f20158b51df4f0b8-", "description": "Full-time\n\nResponsibilities:\n\nCollect quantitative and qualitative insight from the marketing campaign’s data\n\nLead generation – managing and monitoring workflows for inbound leads and finding solutions to create new opportunities\n\nSupport the marketing team in daily administrative tasks\n\nPerform market analysis and research on the competition\n\nAssist in marketing and advertising promotional activities and campaigns (e.g. PPC, Google Search, Social, Instagram & Facebook, Mailchimp – Newsletter, LinkedIn – Targeted Campaigns, Woo-Commerce, websites user experience QA and optimizations)\n\nPrepare promotional presentations and company’s sales decks\n\nHelp distribute marketing materials and sales assets – including knowledge in copywriting\n\nHelp organize marketing events – Booth design and marketing assets\n\nQualifications:\n\nStrong desire to learn along with a professional drives Solid understanding of different marketing techniques and strategies\n\nExcellent verbal and written communication skills – Fluent English\n\nExcellent knowledge of MS Office\n\nFamiliarity with marketing computer software and online applications (e.g. CRM tools,\n\nOnline analytics, Google Adwords) Passion for the marketing industry and its best practicesShow more Report"}, {"company": "Craft.io", "job": "Director of Content Marketing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_70d297e0&cb=1676381431361&jobListingId=1007651948249&jrtk=3-1-1gp81t9g0jm5m801-1go9ho02sjigg800-6d7365b44e3e07cc-", "description": "About Craft.io\n\nCraft.io is revolutionizing product management with an end-to-end platform for product professionals.\n\nWith Craft.io, product professionals enjoy a single source of product truth where they create their product strategy and roadmaps, collect and analyze valuable customer feedback, prioritize features and tasks, write specs, and monitor the work of the dev teams.\n\nThousands of product professionals from companies like SAP, Kimberly-Clark, Danone, Sysco, Novartis, and Marks & Spencer use Craft.io, and we are proud to provide them with everything they need to become better at what they love doing - building and shipping great digital products.\n\nAt Craft.io, we work hard but try not to take ourselves too seriously. We are highly adaptable and constantly evolving, passionate about our product, and live to bring value to our customers consistently. Our work environment is dynamic, innovative, and fun, backed by a solid product, strong leadership, and a well-funded future.\nAbout the Director of Content Marketing role\n\nWe’re looking for an experienced content writer, a veteran in creating content for B2B SaaS companies with proven success in creating great content and executing a marketing penetration strategy.\n\nOur ideal candidate is someone who can develop a content strategy, create a content plan and calendar, write great content for a wide variety of marketing materials, and manage freelance content writers.\n\nBottom line: if you’re a hard worker as well as a visionary, Craft.io may be the right place for you.\nWhat will you actually do?\n\nBecome an expert in the Product Management software space, know our competitors, and learn where we can beat them\nPlay a key role in the Craft.io branding process and positioning\nDevelop and implement a content strategy\nOwn and create all Craft.io content and marketing materials\nWrite a lot of content, both long-form and short-form, such as eBooks, guides, reports, case studies, website content, landing pages, blog posts, ad copy, emails, press releases, articles, and more\nManage content publication cycles, including graphic designers, writers, and web developers\nTake the initiative and remain flexible - this is a startup, after all :)\nNative-level English - must have\n2+ years experience as Content Marketing Manager working for B2B SaaS company - must have\nExperience with writing for enterprise software companies as a target audience - must have\n\nExperience with different types of writing: newsletters, customer stories, white papers, etc. - must have\nExtremely organized with high attention to detail and a love for being deep in the weeds - must have\nExperience communicating with freelance writers, internal stakeholders, and management - must haveShow more Report"}, {"company": "ServiceWise", "job": "Marketing Automation Junior", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "Job Description:\nThe position includes implementation and development in SSJS, AMPscript and integration as part of the marketing automation team\nQualifications:\n– Bachelor’s degree graduate and / or graduate of a full-stack or equivalent course\n\n– At least six months’ practical experience in CSS \\ HTML \\ JavaScript\n\n– High ability of self-learning and entry into new tools.\n\n– A desire to study Salesforce technologies and other integration technologies and develop in the field.\n\n– Diligence, striving for a goal, ability to promote several topics simultaneously.\n\n– Experience in writing SQL – an advantage\n\n– Experience with automatic tools (testing / sending emails) – an advantage\n\n– Knowledge in marketing cloud – an advantage\nתיאור תפקיד:\nהתפקיד כולל יישום ופיתוח בשפות SSJS , AMPscript והשתלבות כחלק מצוות ה-marketing automation\nדרישות תפקיד:\nבוגר תואר ראשון ו\\או בוגר קורס fullstack או מקביל\nניסיון מעשי של חצי שנה לפחות ב- CSS\\HTML\\JavaScript\nיכולת גבוהה של למידה עצמית וכניסה לכלים חדשים.\nרצון ללמוד טכנולוגיות Salesforce וטכנולוגיות אינטגרציה נוספות ולהתפתח בתחום.\nחריצות, חתירה למטרה, יכולת לקדם מספר נושאים במקביל.\nניסיון בכתיבת SQL– יתרון\nניסיון בכלים אוטומטיים (בדיקות \\ שליחת מיילים) – יתרון\nיתרון בmarketing cloud\nLocation:\nRamat Hachayal\nPosition:\nFull Time\nSuitable:\nInexperienced AcademicsShow more Report"}, {"company": "Marketing Envy", "job": "Digital Marketing Manager", "city": "Ramat Gan", "date": "8d", "rating": "4.7", "link": "", "description": "Digital Marketing Manager\nEnvy is looking for a Digital Marketing Manager to join our fast growing digital team.\nEnvy provides B2B tech companies and startups with the strategy, technology and operations they need to launch and scale their digital marketing and RevOpsactivities.\nWe build top notch marketing machines for our B2B clients, all the way from lead acquisition through to nurturing and qualification, to becoming business opportunities and finally, delighted customers. Our strategies and campaigns are founded on SEO, content, organic and paid social media channel promotions.\nOur years of experience in reaching targeted professionals mean we can humbly and confidently call ourselves the expert team! We’re also a HubSpot Diamond Partner :).\nWhat you will be doing\nWorking with the team to devise unique SEO-based content and social media strategies for customers\nManaging the content strategy implementation - from suggesting content to briefing writers and reviewing their work.\nEvaluating customers’ SEO posture and initiating ways to improve it\nManaging external and internal resources such as graphic designers, copywriters and web developers to get the job done\nManaging social media channels for customers, engaging potential customers and initiating discussions with influencers\nPlanning, executing and analyzing marketing campaigns using marketing automation\nRequirements:\nNative level English (written & spoken) – a must\n2-3 years experience in previous digital marketing role (agency experience is a significant advantage)\nPrevious experience with tech content or marketing for a tech company - advantage\nUniversity degree - an advantage\nUnderstanding of the Inbound methodology and best practices\nNatural born writer with strong editing skills\nStrong project management skills\nPower social media userShow more Report"}, {"company": "Balance", "job": "Director of Marketing - Tel Aviv/US", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.1", "link": "", "description": "We are seeking a creative, curious, independent Director of Marketing, with an exceptional track record of leading Marketing for a B2B product to lead our dynamic and fast-paced marketing team.\nThis role combines leadership and hands-on. You will design, implement, execute and monitor effective go-to-market strategies that align with our business goals. You will work closely with the management team\n#LI-Remote\nRequirements:\n\n5+ years of management experience in Marketing from fast growing B2B start-up companies\n2+ years of experience as Director of Marketing\nProven experience in designing, implementing, executing and measuring an effective marketing strategy\nProven experience driving a true ABM GTM motion, effectively targeting and winning specific strategic accounts\nExperience messaging and acquiring US based enterprises.\nExperience with handling large marketing performance budgets\nKnowledge of SEO, web analytics and online advertising tools\nStrong analytical and project management skills\nStrategic mindset, with the ability to make difficult decisions\nStrong written and verbal communication skills\nA self-motivated team player and ability to work in fast-paced environments with minimal oversight\nPayments / supply Chain / Fintech/ E-Commerce background is an advantage\nResponsibilities:\n\nOwn and manage awareness, acquisition and nurturing of our target audience\nDevelop and drive Balance’s products positioning, messaging, value proposition, and go-to-market strategy\nPromote and present our products in ways that will strengthen our brand and boost sales\nOversee all lead and demand generation processes – from community building to digital marketing, events and everything in between\nOwn a meaningful budget and execute a demand plan that match our growth goals\nBring a data-driven approach to all marketing efforts, modeling, and forecasting ROI, analyzing funnel metrics\nSet, monitor and report on department KPIs\nMonitor competition (acquisitions, pricing changes and new products and features)Show more Report"}, {"company": "Pulsenmore", "job": "Director of Marketing Communications", "city": "Ramat Gan", "date": "30d+", "rating": "", "link": "", "description": ""}, {"company": "Eybna Technologies", "job": "Customer Success Manager - EU & APAC", "city": "Israel", "date": "30d+", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4417f866&cb=1676381438105&jobListingId=1008156930149&jrtk=3-1-1gp81tg2ikbkq801-1go9ho02sjigg800-68ab405e45d9822e-", "description": "Full-time\n\nResponsibilities:\n\nEstablish clear client retention goals\n\nProcess milestones for the clients and employees to work toward\n\nAssist customers with setting up and navigating programs or software\n\nPromote the value of the product\n\nUpsell services and products with the brand image\n\nPromote value through customer experience\n\nAssist in creating training courses and educational materials\n\nReview customer complaints and concerns and seek to improve the customer experience\n\n\nQualifications:\nProven work experience as a Customer Success Manager or similar role\n\nExperience working with brand image and promoting value through customer experience\n\nExceptional ability to communicate and foster positive business relationships\n\nTechnical skills are required as they relate to the use of the product or service\n\nAccountability and personal organization are essential\n\nExperience in managing a diverse group and training each according to company standards\n\nA communications or marketing degree is preferredShow more Report"}, {"company": "Checkmarx", "job": "Marketing Operations Manager", "city": "Ramat Gan", "date": "22d", "rating": "3.7", "link": "", "description": ""}, {"company": "ווין ג׳ובס", "job": "Marketing Manager 162796", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": ".A Finitech company is looking for a Marketing Manager.The company is located in Tel Aviv area.Availability to a full-time work, Sunday-Thursday, 8am-5pm:Job Requirements are.Bachelor's degree in marketing, finance, business administration, or similar.Experience as a marketing manager.Kowledge of marketing strategies, channels, and branding.Full social conditions.It is mandatory to specify salary expectations, inquiries without rate expectations will not be of interestJob Type: Full-timeShow more Report"}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "Media Content Executive", "city": "Jerusalem", "date": "2d", "rating": "", "link": "", "description": ""}, {"company": "InspHire", "job": "Customer Success Manager", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "A company that is building the future of audio advertising is looking for a Customer Success Manager. It's a startup focused on creating solutions for publishers to unlock the fastest-growing segment of marketing spend, and empowering advertisers to reach mobile audiences at scale.\nAs a Customer Success Manager, you’ll oversee existing publisher accounts. Through day-to-day communication, you’ll build strong relationships and establish growth and up-sell strategies tailored to your book of business. Additionally, you’ll be responsible for onboarding new publishers, while working with counterparts internally and externally to ensure that all technical and performance issues are resolved quickly and appropriately.\nSuccess in this role is achieved through building strong relationships, up-selling, performance analysis, technical support, and optimization. The strategic partnership manager is expected to actively contribute to the ongoing success of the business while working in close partnership with the sales, product, and R&D.\nJob Description:\nCommunicate and work closely with Advertisers and Publishers worldwide to manage relationships.\nGrowing revenue from existing accounts and clients.\nPerformance and technical focal point for product integration, best practices, and overall account operations.\nManage and optimize campaigns; analyze performance and recommend/implement improvements to meet customers’ monetization objectives.\nSupporting the sales team in pre and post-sale stages.\nRequirements :\nMinimum 1-year experience within a global advertising or gaming company.\n2 years experience in client management from global operating companies.\nEnglish at a native level.\nSales-oriented, strong ability to negotiate.\nStrong interpersonal skills to interact with clients, management, and peers.\nAbility to multitask and handle various priorities.\nDetails-oriented with an ability to see the bigger picture.\nPassionate for games and knowledge of the gaming industry.\nBachelor degree.Show more Report"}, {"company": "Abbott Laboratories", "job": "Marketing & Congresses Coordinator", "city": "Tel Aviv-Yafo", "date": "24d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_12e463b9&cb=1676381445161&jobListingId=1008394745505&jrtk=3-1-1gp81tmv42a81001-1go9ho02sjigg800-c5447617c9e67da7-", "description": "Marketing & congresses Coordinator\nJOB DESCRIPTION:\nMAIN PURPOSE\nResponsible for logistical and all administrative related tasks for PN & MN marketing teams including support, collaboration, and full assistance to meet the work plan.\nCORE JOB RESPONSIBILITIES\nResponsible for logistical and all administrative related tasks for PN & MN marketing and sales teams including the production of promotional materials, engage with suppliers, coordinate meetings, manage PO’s, full support with conferences administration etc.\nCoordinate the execution and produce promotional materials – bid offer from suppliers, working with graphic needs and manage the budget.\nFollow-up promotional materials stock and actively update product managers accordingly.\nLogistic coordination of conferences as per project managers’ needs.\nBudget administrative management (Full cycle – from PO to payment). Including Sap\nSupport and coordinate “cross department / division” projects.\nCoordinate meetings upon request.\nProvide full support to PN&MN sales force in terms of promotional materials, products samples, information on conferences / events, support with price offers, etc.\nBack-Up to the front desk upon need.\nUpload Veeva materials for PN\nSupport PN social activities\nSupport Congresses and lectures – PSA, Sponsorships\nDonation processes\nGENERAL RESPONSIBILITY\nResponsible for logistical and all administrative related tasks for PN & MN marketing teams.\nACCOUNTABILITY\nEnsure delivery of tasks on time in full.\nUnderstand and adhere to Abbott policies.\nAdequate and accurate reporting and administration.\nAchieving deadlines.\nQUALIFICATIONS\nService and results oriented.\nProactive and positive approach.\nResponsible.\nWell organized.\nGood listening and communication abilities.\nConfidential and trustworthy.\nEXPERIENCE\nB.A degree (preferably economics, marketing or business).\nGreat computer skills.\nAbility to communicate in English.\nPrevious administrative experience / Previous marketing experience / Previous customer support experience.Show more Report"}, {"company": "Videocites", "job": "Marketing Lead", "city": "Israel", "date": "20d", "rating": "2.9", "link": "", "description": ""}, {"company": "Seperia", "job": "Junior PPC Campaign Manager", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0e250b56&cb=1676381448141&jobListingId=1008135374664&jrtk=3-1-1gp81tpsikhq4801-1go9ho02sjigg800-51c24ece19cec719-", "description": "Seperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high intent traffic.\n\nWe’re looking for our next Junior PPC Campaign Manager.\n\nWhat You Will Do:\nAnalysis and optimization of paid search accounts in Google Ads, Yahoo and Bing\nWork to meet numerical CPA and acquisition volume targets\nKeyword discovery and taxonomy – Create comprehensive keyword lists and assign them into classes and categories for implementation in the ad systems\nWrite ad creatives for different channels and groups\nReporting\nWhat You Need:\nUp to 1-year of hands-on experience with Google Ads\nStrong analytical skills\nMust be highly organized and sharp individual\nHigh work ethics and focus on measurable results\nSelf-starter with excellent communication & collaboration skills\nHigh level of English\nWhat We Offer:\nGROWTH – we believe in growing our own talent, through learning workshops, professional sessions, team meetings, and work experience. Our company culture celebrates employee growth and development.\nFREEDOM- we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUPSIDE – as a performance marketing company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.This position offers a highly unique work environment and excellent career prospects.Show more Report"}, {"company": "Tailor Brands", "job": "Junior Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "About Us\nWith over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone – we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nAs a Junior Product Marketing Manager, you’ll be managing Tailor Brand’s email funnels, automation, pop-ups, and user journeys: from ideation, through configuration to analysis & optimization.\nYou’ll be Tailor Brand’s go-to person with everything related to email automation - collaborating with content, paid acquisition and product, orchestrating Tailor Brands’s automated communications aligned with business and brand goals.\nWe’re looking for an individual who’s a self-starter — someone who knows how to get things done but always seeks ways to innovate and test new ideas.\nManage email automation and email funnels, including content messaging strategy\nMonitor email performance, deliverability, analyze results, and enhance campaigns accordingly. Refine email marketing strategy to increase engagement, retention, and conversions\nManagement of triggered email campaigns throughout the customer lifecycle to maximize business KPIs\nInitiating, conducting and measuring A/B tests in emails\nPrioritize and manage multiple projects at once with exceptional attention to detail\nDrive competitive analysis and market research\nProvision of creative briefs for content & design teams to create assets for emails\nWork closely with Product Managers, Designers, Developers, and CS teams\nRequirements:\n\nPassion and knowledge about the Product Marketing field, especially Email Marketing experience, managing large scale global email campaigns\nAn analytical B.A./B.Sc. from a leading academic institution\nStrong analytical and project management skills\nTime management and attention to details\nExcellent interpersonal, communication and cross-group skills\nA passion for innovating and bringing new ideas to the table, and turning your approved ideas into actionable projects while seeing them through from start to finish\nFluency in spoken/written English\nNice-to-haves\nKnowledge & experience in HTML & CSS\nProven experience in the SaaS industry\nWe are located in Tel Aviv but Hybrid mode is on!\nOur team is currently working in hybrid mode. Those who prefer to work in our office can do so in a safe environment.Show more Report"}, {"company": "CyberInt", "job": "Marketing Manager", "city": "Petah Tikva", "date": "30d+", "rating": "4.4", "link": "", "description": ""}, {"company": "InspHire", "job": "Marketing Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a data analyst for the Marketing Analytics team of an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is in charge of all the analytical aspects of the game operations and strategic planning: From game design to user acquisition, player behavior, live-ops, and game optimization (such as monetization, retention, etc).\nThe scope of responsibility of this team includes budget optimization for user acquisition for the company's games at the scope of tens of million dollars per game, analysis of game profitability and long term potential, analysis of the players' behavior, player game funnel and reaction to new game features and offers, and many more. The goal is to make sure the company brings the best and most relevant players to its games in the most efficient and effective way.\n\nResponsibilities:\nBe an analytical focal point for anything related to UA, New user performance KPIs, monthly budget planning, tests and performance monitoring\nBe a focal point for anything related to new players' performance and KPIs across our range of games, strategic planning, user segmentation, tests and growth opportunities identification\nDaily support of ongoing analytical needs of the marketing department managers & teams\nEstablish and monitor success metrics that measure and explain the impact of the marketing activities\nAbility to work across multiple data sources in order to research and capture the full activity.\nDesign and initiate new features and reports to monitor & give insights on the marketing activity, using the marketing in-house BI system (for example, LTV, ROI forecasting, automatic rules)\nCollaborate with the game analysis team and the game studios to monitor and optimize the company's players experience, maximizing their retention in the games\nRequirements:\nAt least 2 years of previous experience as a data analyst; additional experience in marketing analytics- A must\nProven experience with measuring online success and identifying optimization opportunities\nExcellent understanding of online marketing metrics (user funnel, user acquisition KPI’s)\nExperience in researching large amounts of raw data and a technical orientation.\nSQL Server and Google big Query experience\nHigh level of proficiency in SQL & Excel (Python - an advantage)\nExperience with data visualization tools such as Tableau, Qlik Sense\nExcellent English communication and presentation skills\nPassion for Gaming – an advantage\nA/BSc in an analytical field such Statistics, Industrial Engineering or similar from a leading universityShow more Report"}, {"company": "Jifiti", "job": "Product Marketing Manager", "city": "Israel", "date": "14d", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186131c0014b4f1ba86bd6b8d97&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_eb6d26b9&cb=1676381453948&jobListingId=1008416680766&jrtk=3-1-1gp81tvi3kcmo801-1go9ho02sjigg800-e0f7aca1608a1845-", "description": "About The Position\nJifiti is a cutting-edge fintech company that's driving the technology for leading banks and retailers worldwide. We’re growing quickly following an investment of over $20M by the company that owns IKEA. So we need people like you – smart, energetic, and with a passion for getting great things done for some of the most iconic brands in the world.\nWe are looking for a talented, experienced Product Marketing Manager to join our Product team. A motivated, innovative, and results-driven storyteller that combines a business perspective with a technical understanding.\nThis person will be in charge of driving our message across the company and beyond.\nResponsibilities\nProduce a variety of product content and sales collateral assets, including sales presentations, demos, product brochures, case studies, video content, white papers, webinars, and more.\nDevelop tools and training to support the sales and marketing teams, as well as materials directly facing our B2B clients - both business clients and developers/technical users.\nBuild and manage content tools and platforms to make the content easily accessible to its audience.\nWork closely with product managers, graphic designers, sales, and other stakeholders to identify needs and sharpen product offering and positioning in the market.\nBecome a subject matter expert in consumer financing with an in-depth understanding of the market and competition, in-depth knowledge of our products, value proposition, features and use cases.\nRequirements\nAt least 2 years of experience in Product Marketing/Content Writing/Sales Enablement for a B2B SaaS company.\nExperience creating materials for developers, and doing technical product marketing\nA talented storyteller with technical understanding who can build and deliver compelling company and product presentations.\nA good eye for detail, design, and UX.\nStrong writing skills with hands-on experience creating high-quality product content.\nMother tongue level English with exemplary communications skills.\nAbility to distil complex concepts into clear, concise language and business values.\nExperience in payments / Fintech domains and ecosystem - advantage.Show more Report"}, {"company": "Browzwear", "job": "Director of product", "city": "Hod HaSharon", "date": "30d", "rating": "4.1", "link": "", "description": "Browzwear’s mission is to revolutionize the fashion industry with our 3D end-to-end solutions.\nWe develop innovative, cutting-edge 3D garment simulation technology which enables digital workflow, creative design, faster time to market, less garment waste, and enriches the online shopping experience.\nThis is your chance to play a leading role at the forefront of the digital revolution in the apparel industry.\nWe are looking for a director of web products: someone who is a natural leader, manager, and people person, but who also understands the importance of quality in product development. You have the skill set to inspire your colleagues, carefully nurturing their development, while simultaneously ensuring smooth and near flawless product management leading to top quality projects being delivered on time.\nResponsibilities\nTogether with the management team, build the product strategy, communicate it throughout the company, and make sure everyone is aligned with it\nShape and lead the product group (PMs, design, UX, data) to define its structure, culture, and agenda\nHire, lead, and mentor exceptional people in your team so as to help them grow their capabilities\nWork closely with the business and marketing teams to develop growth strategies that will make an impact\nImplement product methodologies and nurture a product first culture across the company\nBuild and lead customer-centric processes, making sure that everything we do creates value to our customers and our business\nDo hands-on product work as the need arises\nBuild data-driven methods to increase utilization, drive retention, and trigger expansion\nRequirements:\n\nRequirements\nWell-rounded product management experience, preferably from several companies and different products\nProven experience in WEB/SAAS product companies\nStrong leadership abilities, proven experience in leading multi-disciplined teams (product, design, data)\nExcellent interpersonal skills, ability to manage, mentor, and motivate a team, as well as align a diverse set of stakeholders toward a common goal\nCombination of a creative mind, strategic thinking, and best practice methodologies to make the vision come to life\nA \"yes we can\" approach\nB2B/B2B2C experienceShow more Report"}, {"company": "SciPlay", "job": "Data Scientist", "city": "Ramat Gan", "date": "6d", "rating": "3.9", "link": "", "description": "SciPlay is a leading developer and publisher of digital games on mobile and webplatforms, providing highly entertaining free-to-play games that millions of people play every day.\nSciPlay are seeking a highly skilled and experienced Data Scientist to join our team. The successful candidate will be responsible for designing and implementing data science projects, analyzing and interpreting complex data sets, and creating data-driven solutions to support business decisions.\nRequirements:\n\nBachelor's or Master's degree in Statistics, Computer Science, Data Science, Economics or a related field\nStrong experience in data analysis, statistics, and machine learning – 3-5 years - MUST\nStrong programming skill in R - 3-5 years - MUST. Python – advantage\nExperience with SQL and NoSQL databases 3-5 years – MUST\nExperience with data visualization tools such as Tableau or Power BI/Excel\nStrong verbal and written communication skills\nExperience in a gaming industry is a plus\nKey Responsibilities:\n\nUnderstanding business problems, defining formal working frame for the problem and defining a proper solution\nDevelop and implement data science models end to end, algorithms, and statistical analysis\nClean, process, and analyze large and complex data sets\nCreate and maintain data pipelines, databases, and data visualization tools\nCommunicate findings and insights to stakeholders through clear and effective visualizations and presentations\nCollaborate with cross-functional teams, including product, economy, monetization, marketing and higher management, to drive the implementation of data-driven solutions\nStay up-to-date with the latest developments in data science and machine learningShow more Report"}, {"company": "Kaltura", "job": "Product Marketing Manager", "city": "Ramat Gan", "date": "8d", "rating": "4.0", "link": "", "description": "This is us\nKaltura’s (NYSE:KLTR) mission is to power any video experience for any organization – live, on-demand, or real-time. We not only want to make using video simpler, but we also want to better people’s lives through video. Founded in 2006, Kaltura is now a global leader in the video market with millions of people using our products daily to teach, learn, watch, connect, and collaborate. Among our customers, you’ll find more than 1000 global, well-known organizations.\n15+ years since starting the company, we continue to foster a diverse and collaborative work environment where everyone gets a say. Our team is currently 850+ people, and we’re still growing. We have offices in New York, London, Singapore, and Tel Aviv, but our technology is all in the cloud.\nKaltura has a fast-paced environment where initiative is always encouraged. Together with our hybrid work model and flexible state of mind, you get the right conditions for creative juices to flow freely. Thanks to our long line of products, cultivation of rich collaborative culture and care for each Kalturian, you’ll never run out of room to grow and evolve.\nIf you don't meet 100% of the requirements below - that's okay, nobody's perfect! We believe in hiring people, not just a list of skills. We encourage you to apply if you think this is a role that would make you excited about coming to work every day.\nRequirements:\n\nThe role:\nAs a Product Marketing Manager, you will shape Kaltura’s Go to Market strategy using deep product insights, industry knowledge, and market intelligence. Your deep understanding of the product features and the buying process will drive change in how we market and sell our products. You will dive deep into the data from every buying process step and optimize messaging and customer touchpoints to turn leads into life-long subscribers. You will partner with product managers, marketing, and sales to define Kaltura’s market position and further scale our business.\n﻿The day-to-day\nPlan products GTM and execute them\nCreate assets for the sales & CSM teams\nCommunicate and train customers, salespeople, and CSMs\nConduct market and competitive analysis, user research, focus groups, and surveys\nUse data to gain insights and optimize messaging, products, and marketing assets accordingly\nWork closely with product, marketing, sales, customer experience, and other departments\n﻿Ideally, we’re looking for:\nAt least one year of experience in product marketing in a Saas company\nExperience in a customer-facing role, supporting enterprise sales cycles\nAnalytical approach and willingness to dive deep into data\nExperience working cross-functionally internally to drive results\nSuperlative written, verbal, and visual communication skills in English\nThese would also be nice:\nSignificant advantage: worked with the EDU vertical (higher education)\nKnows all about video, RTC, VOD, live, etc.\nThe perks:\nHybrid, flexible work environment\nExtended private health (including mental) insurance\nPersonal and professional development programs\nOccasional Cross company long weekendsShow more Report"}]