[{"company": "Investing", "job": "Junior Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "Investing.com, the leading global financial news & data platform, is on the lookout for a Junior Marketing Analyst to join our team and create, analyze, and optimize large-scale campaigns.\nWhat you’ll be doing:\nHands-on campaign management on various ad networks and platforms\nBuild and maintain strategic relationships with key acquisition partners\nCollaborate with different teams members within the marketing department to deliver and execute successful mobile marketing campaigns\nProvide complete performance reporting and analysis on all device marketing campaigns and take relevant action on insights gained.\nEstablish, implement and measure the effectiveness of acquisition initiatives\nWhat you’ll bring:\nUniversity Graduate - Industrial Engineering or Business Management/Economics\nStrong analytical skills\nAbility to work in a fast-paced environment\nSQL capabilities\nProficiency with Excel\nAbility to manipulate and analyze large quantities of data and present it in reports\nHigh attention to detail and proven ability to manage multiple, competing for priorities simultaneously\nStrong organizational, analytical, presentation, and problem-solving skills\nFluent English - verbal and written\nSelf-motivated and meticulous, with a creative and resourceful mind, bright, proactive, works well independently and as part of a team\nWho we are:\nInvesting.com was founded in 2007 and now has over 350 employees across the world.\nWith 60 million monthly unique visitors, 4 billion page views, over 500 million sessions, and over 300,000 financial instruments covered, Investing.com is one of the top two global financial websites.\nInvesting.com offers unlimited access to cutting-edge financial market tools such as real-time quotes and charts, customized portfolios, personal live alerts, calendars, calculators, and financial insights, completely free of charge. In addition to the global stock markets, Investing.com also covers world indices, ETFs, commodities, bonds & interest rates, cryptocurrencies, futures, and options“. Investing.com strives to be a one-stop-shop for traders and investors with apps available.\nWhat we offer:\nA chance to join one of the leading financial markets platforms worldwide\nChallenging assignments in a local and international environment\nEnjoy excellent benefits and a high-energy working environment\nAs with all investing.com positions - we're looking for someone who is self-motivated and meticulous, with a creative and resourceful mind, bright, proactive, and works well independently and as part of a team.\nCheck out openings on our brand new career website: https://www.investing-careers.com/\nOur Privacy Policy: Your resume and information will be kept confidential\n\nEmployment Type:\n\nEmployeeShow more Report"}, {"company": "JobTestPrep", "job": "Junior Product Marketing Manager", "city": "Ramat Gan", "date": "22d", "rating": "3.9", "link": "", "description": ""}, {"company": "ServiceWise", "job": "Marketing Automation Junior", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6a940e76&cb=1676381594865&jobListingId=1007627781903&jrtk=3-1-1gp82295dkbnh801-1go9hrnosk622800-f3a004efd7d16558-", "description": "Job Description:\nThe position includes implementation and development in SSJS, AMPscript and integration as part of the marketing automation team\nQualifications:\n– Bachelor’s degree graduate and / or graduate of a full-stack or equivalent course\n\n– At least six months’ practical experience in CSS \\ HTML \\ JavaScript\n\n– High ability of self-learning and entry into new tools.\n\n– A desire to study Salesforce technologies and other integration technologies and develop in the field.\n\n– Diligence, striving for a goal, ability to promote several topics simultaneously.\n\n– Experience in writing SQL – an advantage\n\n– Experience with automatic tools (testing / sending emails) – an advantage\n\n– Knowledge in marketing cloud – an advantage\nתיאור תפקיד:\nהתפקיד כולל יישום ופיתוח בשפות SSJS , AMPscript והשתלבות כחלק מצוות ה-marketing automation\nדרישות תפקיד:\nבוגר תואר ראשון ו\\או בוגר קורס fullstack או מקביל\nניסיון מעשי של חצי שנה לפחות ב- CSS\\HTML\\JavaScript\nיכולת גבוהה של למידה עצמית וכניסה לכלים חדשים.\nרצון ללמוד טכנולוגיות Salesforce וטכנולוגיות אינטגרציה נוספות ולהתפתח בתחום.\nחריצות, חתירה למטרה, יכולת לקדם מספר נושאים במקביל.\nניסיון בכתיבת SQL– יתרון\nניסיון בכלים אוטומטיים (בדיקות \\ שליחת מיילים) – יתרון\nיתרון בmarketing cloud\nLocation:\nRamat Hachayal\nPosition:\nFull Time\nSuitable:\nInexperienced AcademicsShow more Report"}, {"company": "Lightricks", "job": "Junior User Acquisition Manager", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "", "description": "Lightricks is a pioneer in innovative technology that leads to breakthrough moments throughout the creation process. With a mission to push the limits of technology to reimagine the way creators express themselves, we bring a unique blend of cutting-edge academic research and design to every user experience.\n\nOur photo and video editing tools offer endless possibilities and inspiration, while our creator services provide content creators the ability to monetize their work and talents. We focus on putting creators in the center and empowering them from the moment inspiration strikes.\n\nOur Performance Marketing team is responsible for the sustainable growth of Lightricks' user base and revenue. The Performance team's core job includes strategy, budgeting, reporting, and driving strategic decisions. We plan and deploy our marketing tech systems, working closely with our BI, Tech, Creative, and Data Science teams, establishing a data-first approach to inform decisions and optimization across multiple media partners (Facebook, Instagram, Apple, Google, TikTok, Snap, etc.).\nWe are hiring for a highly analytical entry level position as a User Acquisition Manager. In this position you will be converting people into active subscribers and advocates of our apps used by hundreds of millions of content creators all over the world.\n\nWhat you will be doing:\n\nActively manage and carry out campaigns via various online advertising channels, test & optimize in real time.\nDevelop benchmarks, actively work to meet business goals, track and report performance (spend, sales, KPIs, etc.).\nIdentify and launch new marketing initiatives & tests to drive overall sales growth.\n\nYour skills and experience:\n\nHigh analytical skills and profound knowledge of Excel.\nBA/BSC university/college degree (advantage to a degree in scientific study, e.g. Industrial engineering, Economics, Business Management, Communication, etc.)\nA desire to learn and develop in the marketing industry as well as self-learning abilities.\nIndependent and quick learner with an analytical understanding of marketing.\nDiligent, proactive, highly organized team player.\nHigh-level English - written and spoken.\nCreative thinking and high attention to detail.\n\n#LI-Hybrid\n\n#LI-AG1Show more Report"}, {"company": "Seperia", "job": "Junior PPC Campaign Manager", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1196945e&cb=1676381597445&jobListingId=1008135374664&jrtk=3-1-1gp822bm9p6dd801-1go9hrnosk622800-51c24ece19cec719-", "description": "Seperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high intent traffic.\n\nWe’re looking for our next Junior PPC Campaign Manager.\n\nWhat You Will Do:\nAnalysis and optimization of paid search accounts in Google Ads, Yahoo and Bing\nWork to meet numerical CPA and acquisition volume targets\nKeyword discovery and taxonomy – Create comprehensive keyword lists and assign them into classes and categories for implementation in the ad systems\nWrite ad creatives for different channels and groups\nReporting\nWhat You Need:\nUp to 1-year of hands-on experience with Google Ads\nStrong analytical skills\nMust be highly organized and sharp individual\nHigh work ethics and focus on measurable results\nSelf-starter with excellent communication & collaboration skills\nHigh level of English\nWhat We Offer:\nGROWTH – we believe in growing our own talent, through learning workshops, professional sessions, team meetings, and work experience. Our company culture celebrates employee growth and development.\nFREEDOM- we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUPSIDE – as a performance marketing company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.This position offers a highly unique work environment and excellent career prospects.Show more Report"}, {"company": "Tailor Brands", "job": "Junior Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "About Us\nWith over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone – we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nAs a Junior Product Marketing Manager, you’ll be managing Tailor Brand’s email funnels, automation, pop-ups, and user journeys: from ideation, through configuration to analysis & optimization.\nYou’ll be Tailor Brand’s go-to person with everything related to email automation - collaborating with content, paid acquisition and product, orchestrating Tailor Brands’s automated communications aligned with business and brand goals.\nWe’re looking for an individual who’s a self-starter — someone who knows how to get things done but always seeks ways to innovate and test new ideas.\nManage email automation and email funnels, including content messaging strategy\nMonitor email performance, deliverability, analyze results, and enhance campaigns accordingly. Refine email marketing strategy to increase engagement, retention, and conversions\nManagement of triggered email campaigns throughout the customer lifecycle to maximize business KPIs\nInitiating, conducting and measuring A/B tests in emails\nPrioritize and manage multiple projects at once with exceptional attention to detail\nDrive competitive analysis and market research\nProvision of creative briefs for content & design teams to create assets for emails\nWork closely with Product Managers, Designers, Developers, and CS teams\nRequirements:\n\nPassion and knowledge about the Product Marketing field, especially Email Marketing experience, managing large scale global email campaigns\nAn analytical B.A./B.Sc. from a leading academic institution\nStrong analytical and project management skills\nTime management and attention to details\nExcellent interpersonal, communication and cross-group skills\nA passion for innovating and bringing new ideas to the table, and turning your approved ideas into actionable projects while seeing them through from start to finish\nFluency in spoken/written English\nNice-to-haves\nKnowledge & experience in HTML & CSS\nProven experience in the SaaS industry\nWe are located in Tel Aviv but Hybrid mode is on!\nOur team is currently working in hybrid mode. Those who prefer to work in our office can do so in a safe environment.Show more Report"}, {"company": "SMSEdge", "job": "Junior customer success manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_01e343d0&cb=1676381599979&jobListingId=1007230867782&jrtk=3-1-1gp822e4mjc92801-1go9hrnosk622800-a8ad1dbe770d66ea-", "description": "Job Description\nDay-to-day responsibilities include:\nCommunicating with new and existing clients, understanding their needs and onboarding them.\nWorking with telecom companies to improve and add delivery channels.\nConnecting and negotiating with communication providers.\nReviewing and understanding key performance statistics, ultimately deriving conclusions and recommendations based on campaign performance.\nEnsuring customers see maximum success with their sms marketing campaigns.\nRequirements:\nEnergetic, with a can do attitude.\nCommunicative and a team player.\nAnalytical with ability to interpret data and analytics into meaningful insights.\nCreative, self-starter, who can multitask while working under pressure.\nEnglish - High Proficiency - MUST\nSend CV to: jobs@smsedge.io\nProduct Information\nPresentation - smsedge.com/presentation\nVideo - smsedge.com/video\n\nApply via email at: jobs@smsedge.comShow more Report"}, {"company": "Artlist", "job": "Junior User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.7", "link": "", "description": "Artlist is a fast-growing creative technology company providing video creators with high-quality music, sound effects, footage and digital assets for video, as well as powerful video and image editing software. With our revolutionary license and cutting-edge creative tools, we’re on the fast track to becoming the ultimate 360 degree solution for video creators.\nToday, Artlist is the go-to licensing provider for creators in over 160 countries. Among our 16M clients are Google, Apple, Nike, Coca-Cola, Ikea, Mercedes, Samsung, Wix, Netflix, Dior and many more.\nArtlist consists of 3 products:\nArtlist.io, a royalty-free music, stock footage platform and SFX platform\nMotionArray.com, an all-in-one marketplace for creators that offers video templates, presets, music, SFX, stock footage, motion graphics and stock photos\nFXhome, a cutting-edge video, VFX and image editing software\nWe’re seeking a full-time Junior User Acquisition Manager to join our Google Marketing Team.\nWake up for this\nManage and expand performance-based marketing campaigns.\nCreate smart ad targeting & compelling ad copy.\nCollect and analyze campaign data to identify optimization steps for future campaigns and new opportunities\nIdentify and respond to changes in market trends & competition.\nWork closely with other departments to optimize performance.\nRequirements:\n\nHighly skilled self-learner, eager to master new concepts independently, naturally analytical, and curious\nA people-person with strong interpersonal skills that can work as part of a team\nAble to manage several projects and interfaces across the marketing team and the company\nOutstanding Excel & data analysis skills (pivot tables, VLOOKUP, etc.)\nHigh level of English (written and spoken)\nFamiliar with Google Analytics and Google Tag Manager - Advantage\nFamiliar with online marketing channels, FB ads and Google Ads - AdvantageShow more Report"}, {"company": "OGC Global", "job": "Junior Editor and Designer", "city": "Tel Aviv-Yafo", "date": "28d", "rating": "5.0", "link": "", "description": ""}, {"company": "Optimove", "job": "Junior Software Engineer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.5", "link": "", "description": ""}, {"company": "Moon Active", "job": "Junior User Acquisition Manager", "city": "Tel Aviv-Yafo", "date": "17d", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5fc235c3&cb=1676381605326&jobListingId=1008409913819&jrtk=3-1-1gp822jc8i393801-1go9hrnosk622800-f06bf6de7b2c2ed5-", "description": "Moon Active is one of the world's fastest-growing mobile game companies, providing entertainment to millions of active users across the universe. The company is headquartered in the heart of Tel Aviv.\nWe're looking for a Junior User Acquisition Manager to join our growing Marketing team. You’ll be responsible for promoting our amazing products via various marketing channels.\nResponsibilities\nHands-on campaign management with various mobile ad networks.\nBuild and maintain strategic relationships with key acquisition partners.\nConduct data analysis (identifying trends, opportunities & discrepancies).\nManage fast-paced and dynamic projects in a highly organized manner, under tight schedules, and within the budget.\nCollaborate with different team members within the Marketing department to deliver and execute successful marketing campaigns.\nRequirements\nBsc in Industrial Engineering, Economics, Business or similar field.\nPrevious experience in a data driven environment.\nAbility to manipulate and analyze large quantities of data and present it in reports.\nWillingness to learn and use third-party platforms.\nAbility to take on multiple projects at the same time.\nStrong organizational, analytical, presentation and problem solving skills.\nProfound knowledge of MS-Office products (Excel in particular).\nFluent English - verbal and written.\nPassion for marketing and mobile games.\n\n#LI-HybridShow more Report"}, {"company": "BNR Consulting", "job": "Junior Content Writer", "city": "Jerusalem", "date": "30d+", "rating": "4.9", "link": "", "description": "Junior Content Writer\nBNR Consulting is a niche marketing consulting firm specializing in e-Commerce.\nWe are looking to hire a talented writer to join our growing team. This is a junior position which offers growth potential and the opportunity to break into the world of digital marketing and ecommerce. Perfect for recent graduates!\nTasks and responsibilities would include:\n\nCreating informative marketing articles on a variety of topics\nCreating texts for websites, ads, emails, social media and ecommerce landing pages\nLearning about and applying best practices for SEO\nLearning about and applying best practices for keyword research\n\n\nThe right candidate has the following:\n\nNative or Native-level English speaker – must\nHigh-level English writing ability - must\nBA in Marketing, Communications, Creative Writing, or a related field - plus but not required\nMust be motivated, organized, creative and efficient\nTeam player though also able to work independently meet deadlines\n\n\nThis is an in-office position from our Jerusalem city center offices with occasional WFH opportunities.Show more Report"}, {"company": "Rewire", "job": "Data Analyst Engineering Entry-level Full-time Details", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_81ed3a19&cb=1676381609960&jobListingId=1008283064863&jrtk=3-1-1gp822ns6jopl801-1go9hrnosk622800-3a90945e160c43f3-", "description": "Rewire is a young and dynamic start-up creating an International Financial Services Platform for migrants. Rewire provides a game-changing, all-in-one, transparent, cost-effective, and simple solution. The BI team supports the firm's growth plans and enhances its position as a market leader.\nWe are looking for a business analyst who lives and breathes data to join our BI team and become our Israel business unit department analyst!\nSomeone eager to learn and with a true passion for the data industry. Can see beyond numbers, ask the right business questions and is curious to investigate and gain insights, ready to solve problems and identify trends and opportunities. As a Data Analyst, you will directly impact the company’s business performance by delivering valuable insights and analysis.\nYou will:\nWork closely with multiple departments, translate complex data into actionable insights, and identify areas of optimization and growth.\nProvide analytical support for management’s decision-making.\nDesign and create BI dashboards, reports, and ad-hoc analyses to provide insights and business performance monitoring.\nWeekly cadence of Biz readings both wide and deep dive to support our Biz decisions.\nReal time view to help us monitor our IL activity and performance.\nSupport Biz model creations and potential Biz opportunities.\nWork closely with the Marketing, Community team and CX team to process and provide insights to customer behavior and preference.\nCreating and maintaining with the Community team, Product and Marketing competitive analysis framework to monitor our position in the market, possible threats and opportunities.\nMaintain our unit economics view and management.\nREQUIREMENTS\nB.Sc. in Industry & Management, Mathematics, Statistics, Economics or equivalent\n2-3 years experience working as a data-analyst or business analyst.\nExperience working with BI visualization platforms (Looker, PBI, Tableau etc.)\nBasic sql knowledge.\nAble to model and transform data and present data in a useful business context.\nBusiness oriented view.\nAbility to translate business requirements into technical requirements.\nStrong \"storyteller\" that can leverage data and analytics in a business environment to influence decision making\nIndependent\nExcellent communication skills with fluent English - MUST\nAdvantage:\nHands-on experience with Looker.\nExperience working in the fintech industry.\nKnowledge of statistics and experience using statistical packages for analyzingShow more Report"}, {"company": "Yotpo", "job": "Junior PPC Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": ""}, {"company": "Mars Media Group", "job": "Junior Scala Developer", "city": "Herzliya", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_31931d0a&cb=1676381612606&jobListingId=1007733525292&jrtk=3-1-1gp822qesi7kt801-1go9hrnosk622800-dcdbc4a3dec800c9-", "description": "Description:\nWe're seeking a talented and innovative Junior Scala Developer. With your role on the team, you will handle a variety of products while improving performance, scalability, and reliability.\n\nIn this role, you will:\nWork as part of a team, utilizing cutting-edge technologies, and managing and analyzing vast amounts of data to deliver insights that will drive better marketing results.\nDevelop various projects in Scala and advanced technologies (e.g., Kafka, Aerospike, Akka, Aerospike, Airflow, Druid, and others).\nImplement solutions to complex problems in large amounts of data and scale.\nSupport debugging/ troubleshooting deployed software and self-engage stakeholders as required to drive projects forward.\n\nWho are we?\n\n\nFor us, it’s all about the people: Our team is the reason why we have grown and become a global leader in the AdTech industry since 2005. We encourage employee growth in-house and know how to grow talents.\n\nAs a technology-oriented company, we develop and maintain innovative proprietary tech products that enable us to offer our partners the most advanced solutions.\nAll of the above allow us to always be on the move and start new businesses & projects.\n\n\nWhat does it mean for you?\n\nIt means that you have the opportunity to join a stable company with a startup spirit. If you are ambitious and enthusiastic by nature and looking for a place to grow with and create your own success - join us.\nRequirement:\nB.Sc. in Computer Science or equivalent.\nKnowledge/experience in back-end development\nKnowledge/experience in Java/Scala.\nKnowledge/experience in SQL\nExperience working with Agile development methodology.\nGood mathematics and problem-solving and interpersonal skills\nAbility to work within a team or individually\nA can-do attitude, willingness to tackle problems or new tasks and go the extra mile\n\nAnd it will be great if you have (Advantages):\nKnowledge/experience in Kafka / Aerospike / Airflow / Druid\n\nLocation:\nHerzelia Pituach, Israel\nType:\nFull timeShow more Report"}, {"company": "", "job": "Junior Marketing and Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f27b1156&cb=1676381614048&jobListingId=1007439248297&jrtk=3-1-1gp822rt5h4dl801-1go9hrnosk622800-8de02b8347cdb082-", "description": "Want to help the world and improve the lives of millions of people?\n\nBzigo, a startup that develops autonomous devices for a pest-free life (\"Mobileye for Mosquitoes\"), is hiring at our office on Ahad Ha'am, full time in the center of Tel Aviv (physically in the office).\n\nJob Description\n\nOwn all marketing strategy, communication, web sales, social networks and conferences for a new IoT product.\n\nWrite customer support procedures and materials.\n\nOwn the website and integration with Shopify.\n\nContribute to product definition, product & application design, manuals and package design.\n\nDefine and implement new tools to improve processes.\n\nRequirements\n\nEnglish mother tongue.\n\nHands on experience and knowledge of marketing, communications, social media and online advertising.\n\nExperience in advertising (suppliers, graphic designers, videographers, and writers).\n\nResult oriented with excellent interpersonal skills.\n\nStrong project management skills.\n\nAnalytical and creative.\n\nGreat attention to detail.\n\nAvailable for occasional travel.\nContact\n\nben@bzigo.comShow more Report"}, {"company": "MOONEE", "job": "Junior Creative marketing - Video editor", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_83511978&cb=1676381615502&jobListingId=1008232767739&jrtk=3-1-1gp822t9r2dus001-1go9hrnosk622800-d0a82db60bdc54a4-", "description": "Location Tel-Aviv, Israel\nDate posted July 23, 2022\nEmployment Type Full-time\n‍\n‍\n\nAt Moonee, we’re working hard to redesign the way mobile games are published today.\n‍\nResponsibilities\nCreating ads (creatives) for our media campaigns in different verticals\nRunning A/B tests on ads to determine which are most engaging\nResearching to find trending topics relevant to our content\nCollaborating with the UA team to maximize campaign results\nPlaying cool Hyper Casual mobile games!\n\nQualifications\nPassion for pop culture and content across various niches- Must\nVisual communication, cinema editing, or any design studies\nStrong Adobe creative suite skills: Premiere + After effects, bonus for background in\nFluent English speaker\nGoal-oriented attitude\nStrong communication skills and ability to work independently\nGraphic design & typographyShow more Report"}, {"company": "", "job": "PPC Analyst (Entry-Level)", "city": "Israel", "date": "10d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e33a065c&cb=1676381616758&jobListingId=1008422040554&jrtk=3-1-1gp822uhbm6rt801-1go9hrnosk622800-42a1a759560b31c7-", "description": "Who We Are\n\nMarketily is the online marketing branch of a large US web-based retailer located in Israel. Established over 15 years ago, we specialize in natural, vegan-friendly products focused on the health, nutrition, and nootropic supplement niche.\nJob Description\n\nWe are looking for a detail-oriented, analytical, and intelligent marketer to fill an entry-level PPC position. Do any of these apply to you: Are you good with Excel? Can you diagnose and analyze large amounts of data? Are you a fast learner? This is an amazing opportunity for a proactive, detail-oriented superstar to shine and grow in a fun and dynamic environment.\n\nResponsibilities\nPerform daily account management of pay per click accounts.\nAnalyze campaign statistics and user flow data.\nSupport initiatives that will contribute to the goals and success of multiple marketing campaigns.\nMonitor search engine and PPC industry trends.\nCommunicate effectively with the PPC team and management on project developments.\nOptimize PPC campaigns for high performance and profitability.\nManage, analyze, and optimize campaign landing pages and websites.\nAnalyze and optimize the user flow from ad to purchase.\nRequirements\nExcellent analytical, organizational, project management and time management skills.\nIndependent problem-solving abilities.\nHigh proficiency in Excel and with computers overall.\nEnglish mother-tongue or extremely high proficiency (including grammar, spelling, and colloquial expressions).\nMust be able to work full-time from the office in Modiin.\nIdeally, you should also\nEnjoy working in a creative, cross-functional team environment.\nBe proactive and move/pivot fast between projects.\nBe passionate about the PPC and online marketing industry and be motivated to learn more.\nBe organized, diligent, creative, and self-driven.\nHave exceptional communication skills (both written and verbally).\nBe analytical and able to gather data and understand metrics.\nBe able to maintain the company’s brand identity.\nPossess knowledge of PPC/Online Marketing (not a must).\nPlease send your CV to jobs@marketily.com with 'PPC' in the subject line. Please also let us know where you saw this job opportunity.Show more Report"}, {"company": "", "job": "SEO Manager - Junior", "city": "Herzliya", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_936c7dc8&cb=1676381618262&jobListingId=1008120458144&jrtk=3-1-1gp82300tkbns801-1go9hrnosk622800-14371ccff59be5c0-", "description": "Leading global sports gaming and digital marketing company, looking for a few positions of SEO junior. The SEO Junior will be part of the SEO team, Providing SEO support to a variety of Markets and will be involved in all SEO aspects within the team.\n\nThe day-to-day work includes:\nWorking closely with SEO Project Managers to support SEO activity\nManaging freelancers\nKeyword research\nMarket research\nPlanning new sites and executing the plans\nMaking content and link plans\nFollowing up on active projects to maximize results\n\nKnowledge and Abilities:\nExperience and knowledge in SEO of at least 1 year\nFluent English\nExperience in tracking and analyzing using GA or similar\nExcellent organizational skills and being self-reliant\nCollaborative approach to work\nKeen to learn\nMultitask abilities\n\nAdvantages:\nKnowledge and experience at WordPress / HTML / CSS\nExperience in international markets’ SEO\nExperience in the gaming sector\nFun and supportive work environment.\n\nHybrid position - 3 days in the office.Show more Report"}, {"company": "Team8", "job": "Talon-Junior Technical Support Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "About Us\nOur mission at Talon is to enable and protect the distributed workforce, impacting how hundreds of millions of employees around the globe work. We empower organizations to adopt hybrid, flexible and productive work models while gaining a robust cyber security posture regardless of the device and location. At Talon, we are delivering the first secure enterprise browser designed to secure the distributed workforce, solving a major technical challenge, and seizing a unique business opportunity.\nAs Talonists, we value kindness, excellence, creativity, problem-solving, ownership, personal integrity, teamwork, and professionalism while maintaining a super fun and friendly environment.\nWinner of the Innovation Sandbox Contest at RSA Conference 2022, Talon is partnering with the two leading vendors in endpoint security: CrowdStrike and Microsoft. Talon has raised $126M in funding from top cybersecurity VCs, including Ballistic Ventures, CrowdStrike’s Falcon Fund, Evolution Equity Partners, Lightspeed Venture Partners, Merlin Ventures, Sorenson Ventures, SYN Ventures, and Team8.\nKey responsibilities:\nSolve complicated scenarios by building relevant environments and investigating the issues.\nProvide technical support to customers and partners.\nWork with our Engineering team and influence the operability of the product.\nReview of technical documentation for training materials, technical marketing collateral, manuals, troubleshooting guides, etc.\nRequirements:\n\nTeam player, positive attitude, problem-solver, Hands-on.\nAt least 2 years of experience with technical support or networking.\nProven experience working in the cyber security industry.\nStrong experience with Windows OS, Linux OS, and Mac OS-based applications (Installation, troubleshooting, Debugging).\nHighly proficient with Cloud infrastructure, understanding malware, exploits & operating system structure.\nExperience with Endpoint security software (Antivirus, DLP, IPS, NAC), Knowledge of SIEM, vulnerability management tools, Identity providers, and firewalls.\nAble to effectively communicate to all levels and stakeholders - internally and externally on complex technical issues.\nExcellent verbal and written communication skills in English.\nAdvantages:\nExperience with scripting languages like Python or Bash.\nKnowledge of VDI (VMWare Horizon, Citrix XenApp, and XenDesktop).\nPrevious experience with Datadog.\nFamiliarity with customer care tools like Freshdesk or Zendesk.\nTeam8:\n\nTalonShow more Report"}, {"company": "HCSC", "job": "Customer Advocate I", "city": "Central", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_29627fe6&cb=1676381621693&jobListingId=1008152970441&jrtk=3-1-1gp8233bdjorf801-1go9hrnosk622800-d477c34c32022262-", "description": "At HCSC, we consider our employees the cornerstone of our business and the foundation to our success. We enable employees to craft their career with curated development plans that set their learning path to a rewarding and fulfilling career.\nCome join us and be part of a purpose driven company who is invested in your future!\nJob Summary\nUnder supervision, this position is responsible for working on the phone all day in a call center to assist members and physicians by responding to telephone and written inquiries in a prompt, accurate and objective manner. Duties include: conducting research; spends approximately 90% of the scheduled time on the phone according to business need.\nResponsibilities\n1. Responsible for responding to telephone and/or written inquiries, working independently and consistently meeting customer needs. Receive, research, and process information from member or provider to determine needs/wants and ensure customer questions have been addressed. Determine appropriate action to be taken. Spend approximately 90% of the scheduled time on the phone according to business need. 2. Read and interpret contract language, gather appropriate documents, i.e. claim copies, claim history data, cancelled checks, on-line status, Explanation of Benefits (EOBs), and utilize applicable terminal screens including on-line documentation, intranet and internet navigation. 3. Initiate and code adjustment transactions to correct and resolve inquiries. 4. Analyze inquiries to anticipate and determine inquirer’s needs and next action to be taken to respond in a prompt and accurate manner. 5. Deliver agreed upon actions at stated time. 6. Collaborate with providers, families, and patients by ensuring communication is open and information appropriately shared (in compliance with HIPAA) to ensure member’s and provider’s needs are met. 7. Obtain required or missing information via correspondence or telephone. 8. Provide guidance to members when determining what products best suit their needs. 9. Assist members in assessing tools and decision-making around complex health issues, e.g. coordinate effective medical management. 10. Provide appropriate amount of information in a timely manner and confirm customer understands information. 11. Provide information and assistance to members with filing and pursuing a grievance or appeal. 12. Flexible in dealing with customer needs, including deviations of normal practices, procedures or benefit structures. 13. Recognize member as not only a customer but an individual whose health status/preferences are unique. 14. Recommend improvements in processing and procedures by informing appropriate personnel of revisions. 15. Adhere to production standards and goals. 16. Maintain liaison with various in-house areas regarding groups’ concerns, e.g. Marketing, Provider Affairs, and SSD. 17. Adhere to system generated schedule by Workforce Management to maximize customer service availability based on business needs. 18. Communicate and interact effectively and professionally with co-workers, management, customers, etc. 19. Comply with HIPAA, Diversity Principles, Corporate Integrity, Compliance Program policies and other applicable corporate and departmental policies. 20. Maintain complete confidentiality of company business. 21. Maintain communication with management regarding development within areas of assigned responsibilities and perform special projects as required or requested.\nJOB REQUIREMENTS: * High school diploma OR GED. * 6 months customer service experience OR 6 months experience in an office environment. * Data entry and/or typing experience. * Interpersonal, verbal and written communication skills. * Analytical and organizational skills and independent decision making skills. * Ability to spend approximately 90% of the scheduled time on the phone according to business needs and sit for long periods of time with scheduled breaks. PREFERRED JOB REQUIREMENTS: * 9 months customer service experience. * Experience working with various lines of business, i.e. CDHP, Medicare, Wellness, and Disease Management. * Knowledge of medical terminology and anatomy. * Proven ability to learn quickly and adapt to change. * Referral preference given to applicants able to take and meet testing criteria.\nAre you being referred to one of our roles? If so, ask your connection at HCSC about our Employee Referral process!\nHCSC Employment Statement:\nHCSC is committed to diversity in the workplace and to providing equal opportunity and affirmative action to employees and applicants. We are an Equal Opportunity Employment / Affirmative Action employer dedicated to workforce diversity and a drug-free and smoke-free workplace. Drug screening and background investigation are required, as allowed by law. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.Show more Report"}, {"company": "", "job": "Junior Marketing Project Manager", "city": "Rishon LeẔiyyon", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_96e79757&cb=1676381623014&jobListingId=1007070007198&jrtk=3-1-1gp8234klis1r801-1go9hrnosk622800-2e34d7cc5d94f25b-", "description": "Tasks & Responsibilities\n Creating deal sheets for promos and product launches for use by the Sales department, in collaboration with the Copy and Design teams.\n Reaching out to relevant persons/departments for clarification of project needs and any issues or questions relating to requested projects.\n Communicate & coordinate daily with all departments (Logistics, Purchasing, PD, Sales, Regulation and Legal).\n Daily communication with Logistics department – gather information about SKUs, BOM and marketing materials for launches and promos.\n Gather all the necessary information about the project to build a timeline that combines all of that information. Manage timeline and deadlines for all projects.\n Keeping track of any updates from all departments in case anything changes and updating the timeline.\n Shooting videos once new promo boxes are available and demonstrating the folding process and packing routine needed.\n Communicate all info in regards to marketing materials, boxes and other items that were produced.\n Maintaining images for marketing materials per SKU on the ERP system.\n Upload the approval artwork of marketing materials / Boxes / Labels on Sap for the purchasing department.\n Work with all markets on customizing and producing specific promotions to match the market needs.\n Work with outsourced vendors on developing new boxes and blisters for customized promos.\n Collecting quantities of marketing materials/ Boxes and blisters from all markets before any print with regards to marketing materials.\n Once prints are ready, making sure they arrive at the factory on time and the goods are available for allocation to orders.\n MRP report – give status of marketing materials needed for production and stock.\n Labels – verify artwork is being done and approved by checklist.\n\nSkills & Abilities:\n 2-3 years of similar experience as project manager or marketing manager\n Bachelor degree in communications, marketing, advertising, media studies and/or related fields.\n Fluent in English, written and verbal & Strong Hebrew.\n Experience working on an International large scope project/event – Advantage\n\nCharacteristics:\n Attention to detail, excellent follow-through skills and time-management skills.\n Ability to multitask, prioritize and problem solve in a deadline-driven environment.\n Open to being edited and working on multiple revisions in varying time frames\n Reliable and able to initiate and see a project through from start to finish with minimal directionShow more Report"}, {"company": "", "job": "Junior Marketing Associate", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6942a314&cb=1676381624110&jobListingId=1007076252231&jrtk=3-1-1gp8235o2jm6k801-1go9hrnosk622800-82fa702ce5a4fde0-", "description": "Junior Marketing Associate\nAbout Us:\n\nNFTrade is the first multi-chain NFT platform servicing the entire NFT lifecycle, allowing anyone to seamlessly create, buy, sell, trade, and leverage their NFTs across different blockchains.\n\nSummary:\n\nWe are looking for a qualified and highly motivated Junior Marketing Associate to supplement our marketing efforts and bring the NFTrade team to the next level. You will be working directly with the CEO and Head of Communications, handling a variety of marketing, partnership, and community engagement oriented tasks.\n\nOur office is located in Florentin and we are looking for someone to start immediately. Having experience in cryptocurrency is a nice addition, but we are looking for people who have successfully created and managed marketing campaigns in the past and are looking for a new opportunity to use your skills. Even if you do not have vast blockchain experience, we can introduce you to what you need to learn.\n\nJob Duties:\n\nDevelop and execute marketing campaigns\nTrack and analyze ROI on marketing campaigns\nDeal with crypto marketing channels and mainstream marketing mediums\nHelp to highlight and foster NFTrade’s growing community\nMarketing outreach and calls with partners\nResearch into technical, community, and general market trends, and how they can be implemented\nDevelop brand awareness\nTrack and analyze behavior of customers acquired via marketing campaigns\n\nSchedule:\n\nFull-time position\n\nCompensation:\n\nVaries depending on experience.\n\nPlease send all CVs and applications to harrison@nftrade.comShow more Report"}, {"company": "", "job": "Junior Sales and Marketing position for the Remini startup", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_63a6a800&cb=1676381625371&jobListingId=1007137818120&jrtk=3-1-1gp8236tm2gpu001-1go9hrnosk622800-e057a697f8800c41-", "description": "An exciting young startup, with tens of thousands of customers in Israel and in the US, called Remini - fostering preschool and family communication, is looking for a Sales Representative to be responsible for generating leads and meeting sales goals in the U.S. market.\n\nDuties will include sales presentations and product demonstrations, as well as negotiating contracts with potential clients. If you are looking for a challenging position, have a big impact, and move ahead quickly- you are welcome to send your resume.\n\nThe office is located in Tel-Aviv.\n\nWorking hours starts at 2:00 pm.\n\nResponsibilities:\nGenerating leads.\nMeeting or exceeding sales goals.\nPreparing weekly and monthly reports.\nGiving sales presentations to a range of prospective clients.\nCommunicating with clients and potential clients to evaluate needs or promote products and services.\nEstablish, develop and maintain positive business and customer relationships.\nReach out to customer leads through cold calling.\n\nRequirements:\nHighly motivated and target driven\nExcellent selling, communication and negotiation skills\nExcellent written and verbal communication skills.\nCompetency in Microsoft applications including Word, Excel, and Outlook.Show more Report"}, {"company": "SeaLights", "job": "Junior Sales Development Representative", "city": "Raanana", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ac0387ec&cb=1676381626714&jobListingId=1008358372821&jrtk=3-1-1gp82387ukuha801-1go9hrnosk622800-0d3ba982146d70ca-", "description": "About The Position\nSeaLights revolutionizes enterprise software quality at scale. SeaLights’ Platform enables automated identification and control of every Quality Risk across the entire delivery pipeline, for every single software change.\nWe are looking for a motivated Junior Sales Development Representative to join our sales and marketing team. You will identify and qualify enterprise account sales leads and opportunities through phone, social, and email contact. You will be generating outbound qualified leads for the US Sales team and play a significant role in growing the business by starting the sales process and helping set up the sales teams for success with inbound and outbound leads.\nIf you are also data-driven and goal-oriented with excellent communication skills, we would like to meet you.\nWhat you’ll do\nIdentifying, prospecting, and penetrating US sales accounts to achieve pipeline and forecast goals\nUpdating lead and prospect activity in salesforce to ensure KPI attainment\nSetting qualified introductory meetings for the sales team and nurturing top of funnel pipeline to facilitate sales opportunities\nUse Phone LinkedIn, email, video, and other sales & marketing tools for prospecting, qualifying, and creating sales opportunities for SeaLights’ US sales teams\nWork closely and coordinate with the sales and marketing teams to accelerate the sales cycle and extend reach into target accounts\nWorking US hours: 13:00 - 22:00 / 14:00 - 23:00, Sunday / Friday occasionally\nWhat you have\nA positive, independent, creative, and self-starter attitude and desire to exceed expectations at every opportunity\nDemonstrate experience in selling within the sales cycle\nHave experience identifying business needs through information-gathering to pre-qualify opportunities\nBe comfortable speaking with decision-makers via various mediums (social, email, phone, and video)\nAbility to manage time and priorities\nStrong interpersonal skills\nA team player\nAmbitious and comfortable taking initiatives\nTech-Savvy\nNative English level\nPlease note, this is a full-time position, with no shifts.Show more Report"}, {"company": "RYB Technologies", "job": "Marketing Assistant", "city": "Israel", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b5ed46c0&cb=1676381627852&jobListingId=1006986489910&jrtk=3-1-1gp8239blp6ci801-1go9hrnosk622800-68280e14b2b59d31-", "description": "Well funded conglomerate of Start Ups seeking a Marketing Assistant to further advance company’s marketing goals and directions.\n\nRequirements\n\nExperienced in SEO – content marketing, link building / outreach\nPPC – Adwords – Bing / facebook pay per click management\nSMM – Social Media Marketing – Organic social and buzz marketing\n3 years minimum experience\nNative Level English\nSend CV to jobs@rybtech.com\n\nThis position is closed.Show more Report"}, {"company": "", "job": "Junior Digital Marketer", "city": "Holon", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f637875b&cb=1676381629053&jobListingId=1007213137672&jrtk=3-1-1gp823ahojool801-1go9hrnosk622800-62c3c9abbb6801a4-", "description": "Want to work for the Israeli company that supplies the US Navy SEALS?\nAgilite is looking for an extremely driven Junior Digital Marketer to join its thriving marketing team. As one of the fastest-growing brands in its industry, Agilite is looking for a talented and creative individual with a wide variety of digital marketing skills who knows how to perform on a very high level in the dynamic and fast-paced digital marketing space.\nResponsibilities include:\n\nPPC\n\nWorking closely with the marketing team to develop, execute, and optimize cutting-edge digital Ad campaigns from conception to launch across multiple platforms to drive relevant traffic to ecommerce websites and social media channels.\nContinually optimizing PPC & Paid Social campaign components including keyword strategy, ad copy, bid prices, cost per conversion, cost per click, audience optimization, etc.\nProviding ongoing actionable insights and suggestions to improve campaign performance.\nConstantly self-learning industry best practices and new technologies\n\nSEO\nOngoing review and analysis of companies' ecommerce websites for areas that can be improved and optimized.\nIdentify SEO competitors, research links, keywords, content and revise strategy to capitalize on opportunities.\nPerform keyword research in coordination with objectives to optimize existing content and uncover new opportunities\nProvide recommendations and execute strategies for content development in coordination with SEO goals – general and keyword specific\nKeep pace with SEO, search engine, social media and internet marketing industry trends and developments in order to optimize performance\nResearch and administer social media tools in support of social media strategy\n\nMarketing\nWork in a small marketing team to plan and execute ambitious marketing strategies\nConstantly being creative and generate methodology to meet marketing goals and KPI’s eg increasing brand and product exposure and social media reach.\nWorking with the content creation team to optimize content for digital marketing strategy\nRequirements\n\nMother Tongue English a must (non-native level English-Speakers will not be considered). - Required\nAbility to learn, self-teach and adapt to a fast-paced environment - Required\nTech Savvy - Required\nNatural problem-Solver-Required\nPragmatic “Go-To” Attitude-Required\nSelf-management Skills - Required\n1-2yrs experience with Facebook & Instagram Ads - Required\n1-2 yrs experience with SEO - Required\nAbility to perform a wide variety of digital and other marketing tasks to support strategy and performance as a whole-Required\nGoogle Ads Certified - Advantage\nExperience with HTML, CSS - Advantage\nExperience with Ecommerce platforms eg. Shopify- Advantage\nServed in an SF or Combat Roll in the IDF - Advantage\nTactical Gear enthusiast - AdvantageShow more Report"}, {"company": "", "job": "Junior Ecommerce Amazon Manager", "city": "Rishon LeẔiyyon", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0567f47c&cb=1676381630297&jobListingId=1008197464906&jrtk=3-1-1gp823bonp6dd801-1go9hrnosk622800-e7fd18feaf58c69e-", "description": "Tasks & Responsibilities:\n\nSupport European and Asian Amazon Vendor accounts.\nMaintain/develop a strong working relationship with Amazon account stakeholders.\nImplement action plans to grow sales, meet/exceed sales and profitability targets on Amazon.\nManage European Amazon Brand Store/Product Pages/ARA Premium/AMZ Compliance while working closely with cross-functional teams.\nDefine and execute content plan to support Brand Store, product pages and advertising content\nWork closely with operations team to ensure inventory fill rate and shipping procedures are meeting expectations.\nConduct ongoing audits to insure all content is up to date and meeting brand standards.\nMonitor Seller Rating, Reviews, Brand performance VS KPIs and report red flags/opportunities.\nSupport Amazon campaign management- optimization and monitoring to meet KPIs\n\nDesired Skills & Abilities\n\nBachelor degree in communications, marketing and/or related fields\n2-3 years of experience in Ecommerce and Digital Marketing , Beauty experience preferred\nExperience working with Amazon- Advantage\nFluent in English, written and verbal\nStrong analytical and quantitative thinker with attention to detail and accuracy\nData-driven planner\n\nCharacteristics:\n\nHighly independent, organized and detail-oriented; able to efficiently organize projects\nExtremely focused while able to multi-task and adapt to changing priority levels for ongoing projects\nWorks well under pressure; good people skills; project management experience a plus\nPassionate self-starter able to work in a fast-paced environment and take initiative\nExcellent communicator/collaborator.\n\nRecruitment Process:\n\nCandidate’s CV screening – HR Coordinator + Director, Ecommerce (IL)\nPhone interview – HR Coordinator\nIn-person interview – HR Coordinator + Amazon Manager (IL)\nIn-person 2 interview – HR Director + Director, Ecommerce (IL)\nSkype Interview – Ecommerce Manager (NY)\nReferences Interview – HR Coordinator.Show more Report"}, {"company": "", "job": "Junior PPC Search Specialist", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "", "description": "Junior PPC Search Specialist\nBNR Consulting is a Digital Marketing Agency specializing in the field of ecommerce.\nWe are looking for a motivated and talented individual to fill the position of Junior PPC Search Specialist. In this role you will work together with the Digital Advertising Manager to oversee and optimize digital advertising campaigns for multiple clients including the development of overall strategy, optimization and ROI analysis. This is a junior position and does not require prior knowledge or experience as we will provide the necessary training. Perfect for recent graduates or anyone looking to enter the field of digital marketing! The environment is fast-paced and extremely dynamic.\n\n\nAdvertising Platforms:\n\nMaintaining, developing and building advertisement strategies on the following platforms:\n\nAmazon - Sponsored Products, Sponsored Brands, Sponsored Display\nAmazon DSP\nAmazon to Google Attribution\nGoogle - Shopping, Paid Search, Display\nSocial Media - Facebook, Instagram, Tiktok\nWalmart Advertising\nResponsibilities\n\nManage large-scale PPC campaigns focusing on Amazon, Google, Social Media\nAnalyze and optimize campaigns constantly to maximize revenue through Bid adjustments, keyword & competitor targeting optimization.\nInitiate and implement improvements and creative solutions to increase campaign activity\nRespond quickly to changes in online marketing and adapt to capitalize on new opportunities\nRequirements\n\nNative Level English - Verbal and written A MUST.\nNumber oriented with analytical skills, comfortable with large sets of data and numbers.\nFast learner, innovative and creative thinker with attention to detail.\nAbility to work independently and in a team environment.\nOrganized and able to efficiently manage multiple projects.\nMaster in Microsoft Excel and large data analysis.\nNo previous experience in digital marketing/advertising is required\n\nThis is a full time job in our offices in the center of Jerusalem with WFH opportunities. Please apply here: https://bnrconsulting.bamboohr.com/jobs/Show more Report"}, {"company": "", "job": "Seeking Junior Marketing Team Member", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186131dde8fbeb2966d7c2e953f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_837f34da&cb=1676381633338&jobListingId=1006761564533&jrtk=3-1-1gp823eo1mfre801-1go9hrnosk622800-d8d542fdd9fadeb4-", "description": "BNR Consulting is looking to hire a Junior Marketing Team Member.\nThe position involves both marketing copywriting and business development tasks. Ideal candidate will be computer-savvy with some marketing experience or background. Growth potential and competitive salary offered in an exciting and friendly anglo office environment!\n\nDesired Skills:\nHigh-level writing ability and marketing writing skills.\nExcellent written and verbal English language communication skills.\nTech-savvy, experience with Microsoft Office/Google Suite.\nBachelor's degree in a relevant field a plus.\nExperience working in e-commerce a plus.\nThis is an in-office position from our Jerusalem City Center offices.\n\nTo apply, please visit https://forms.gle/buihXqD7yUDh...Show more Report"}]